; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/nsgrid.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_grid = type { i32, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32* }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [17 x i8] c"grid->cell_index\00", align 1
@.str1 = private unnamed_addr constant [66 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/nsgrid.c\00", align 1
@.str2 = private unnamed_addr constant [8 x i8] c"grid->a\00", align 1
@.str3 = private unnamed_addr constant [12 x i8] c"grid->index\00", align 1
@.str4 = private unnamed_addr constant [10 x i8] c"grid->nra\00", align 1
@.str5 = private unnamed_addr constant [26 x i8] c"Grid: %d x %d x %d cells\0A\00", align 1
@debug = external global %struct.__sFILE*
@.str6 = private unnamed_addr constant [48 x i8] c"Succesfully allocated memory for grid pointers.\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/nsgrid.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{!7, !75, !81, !88, !94, !100, !103, !106, !109, !112, !115, !118, !127, !136, !149, !152, !155, !158, !172, !186, !192, !198, !234, !239, !248, !258, !271, !293, !306, !326, !354, !366, !381, !406, !415, !429}
!7 = !DISubprogram(name: "__sputc", scope: !8, file: !8, line: 348, type: !9, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DISubroutineType(types: !10)
!10 = !{!5, !5, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !8, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !8, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !8, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !8, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !8, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !8, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !8, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !8, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !8, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !8, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !8, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !8, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !8, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!5, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !8, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!5, !30, !39, !5}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !8, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !5}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !8, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !8, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!5, !30, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !8, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !8, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !8, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !8, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !8, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !8, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !8, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !8, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !8, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !7, file: !8, line: 348, type: !5)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !7, file: !8, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!5, !5}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !5)
!81 = !DISubprogram(name: "__inline_isfinitef", scope: !82, file: !82, line: 204, type: !83, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !86)
!82 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DISubroutineType(types: !84)
!84 = !{!5, !85}
!85 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !81, file: !82, line: 204, type: !85)
!88 = !DISubprogram(name: "__inline_isfinited", scope: !82, file: !82, line: 207, type: !89, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !92)
!89 = !DISubroutineType(types: !90)
!90 = !{!5, !91}
!91 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !88, file: !82, line: 207, type: !91)
!94 = !DISubprogram(name: "__inline_isfinitel", scope: !82, file: !82, line: 210, type: !95, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!5, !97}
!97 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!98 = !{!99}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !94, file: !82, line: 210, type: !97)
!100 = !DISubprogram(name: "__inline_isinff", scope: !82, file: !82, line: 213, type: !83, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !101)
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !100, file: !82, line: 213, type: !85)
!103 = !DISubprogram(name: "__inline_isinfd", scope: !82, file: !82, line: 216, type: !89, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !104)
!104 = !{!105}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !103, file: !82, line: 216, type: !91)
!106 = !DISubprogram(name: "__inline_isinfl", scope: !82, file: !82, line: 219, type: !95, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !106, file: !82, line: 219, type: !97)
!109 = !DISubprogram(name: "__inline_isnanf", scope: !82, file: !82, line: 222, type: !83, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !110)
!110 = !{!111}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !109, file: !82, line: 222, type: !85)
!112 = !DISubprogram(name: "__inline_isnand", scope: !82, file: !82, line: 225, type: !89, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !113)
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !112, file: !82, line: 225, type: !91)
!115 = !DISubprogram(name: "__inline_isnanl", scope: !82, file: !82, line: 228, type: !95, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !116)
!116 = !{!117}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !115, file: !82, line: 228, type: !97)
!118 = !DISubprogram(name: "__inline_signbitf", scope: !82, file: !82, line: 231, type: !83, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !119)
!119 = !{!120, !121}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !118, file: !82, line: 231, type: !85)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !118, file: !82, line: 232, type: !122)
!122 = !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !82, line: 232, size: 32, align: 32, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !122, file: !82, line: 232, baseType: !85, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !122, file: !82, line: 232, baseType: !126, size: 32, align: 32)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DISubprogram(name: "__inline_signbitd", scope: !82, file: !82, line: 236, type: !89, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !128)
!128 = !{!129, !130}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !127, file: !82, line: 236, type: !91)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !127, file: !82, line: 237, type: !131)
!131 = !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !82, line: 237, size: 64, align: 64, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !131, file: !82, line: 237, baseType: !91, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !131, file: !82, line: 237, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DISubprogram(name: "__inline_signbitl", scope: !82, file: !82, line: 242, type: !95, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !137)
!137 = !{!138, !139}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !136, file: !82, line: 242, type: !97)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !136, file: !82, line: 246, type: !140)
!140 = !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !82, line: 243, size: 128, align: 128, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !140, file: !82, line: 244, baseType: !97, size: 128, align: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !140, file: !82, line: 245, baseType: !144, size: 128, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !82, line: 245, size: 128, align: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !144, file: !82, line: 245, baseType: !135, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !144, file: !82, line: 245, baseType: !148, size: 16, align: 16, offset: 64)
!148 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!149 = !DISubprogram(name: "__inline_isnormalf", scope: !82, file: !82, line: 257, type: !83, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !150)
!150 = !{!151}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !149, file: !82, line: 257, type: !85)
!152 = !DISubprogram(name: "__inline_isnormald", scope: !82, file: !82, line: 260, type: !89, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !153)
!153 = !{!154}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !152, file: !82, line: 260, type: !91)
!155 = !DISubprogram(name: "__inline_isnormall", scope: !82, file: !82, line: 263, type: !95, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !156)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !155, file: !82, line: 263, type: !97)
!158 = !DISubprogram(name: "__sincosf", scope: !82, file: !82, line: 642, type: !159, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !162)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !85, !161, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !158, file: !82, line: 642, type: !85)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !158, file: !82, line: 642, type: !161)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !158, file: !82, line: 642, type: !161)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !158, file: !82, line: 643, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !82, line: 634, size: 64, align: 32, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32, offset: 32)
!172 = !DISubprogram(name: "__sincos", scope: !82, file: !82, line: 647, type: !173, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !91, !175, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !82, line: 647, type: !91)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !172, file: !82, line: 647, type: !175)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !172, file: !82, line: 647, type: !175)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !172, file: !82, line: 648, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !82, line: 635, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64, offset: 64)
!186 = !DISubprogram(name: "__sincospif", scope: !82, file: !82, line: 652, type: !159, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !82, line: 652, type: !85)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !186, file: !82, line: 652, type: !161)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !186, file: !82, line: 652, type: !161)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !186, file: !82, line: 653, type: !167)
!192 = !DISubprogram(name: "__sincospi", scope: !82, file: !82, line: 657, type: !173, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !192, file: !82, line: 657, type: !91)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !192, file: !82, line: 657, type: !175)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !192, file: !82, line: 657, type: !175)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !192, file: !82, line: 658, type: !181)
!198 = !DISubprogram(name: "init_grid", scope: !1, file: !1, line: 57, type: !199, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_grid*, i32, [3 x float]*, float, i32)* @init_grid, variables: !223)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !11, !201, !5, !219, !221, !5}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grid", file: !203, line: 49, baseType: !204)
!203 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsgrid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 36, size: 512, align: 64, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !216, !217, !218}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !204, file: !203, line: 37, baseType: !5, size: 32, align: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nrx", scope: !204, file: !203, line: 38, baseType: !5, size: 32, align: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nry", scope: !204, file: !203, line: 38, baseType: !5, size: 32, align: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nrz", scope: !204, file: !203, line: 38, baseType: !5, size: 32, align: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ncells", scope: !204, file: !203, line: 39, baseType: !5, size: 32, align: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "maxcells", scope: !204, file: !203, line: 40, baseType: !5, size: 32, align: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !204, file: !203, line: 41, baseType: !5, size: 32, align: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "gmax", scope: !204, file: !203, line: 42, baseType: !5, size: 32, align: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cell_index", scope: !204, file: !203, line: 43, baseType: !215, size: 64, align: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !204, file: !203, line: 44, baseType: !215, size: 64, align: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !204, file: !203, line: 47, baseType: !215, size: 64, align: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !204, file: !203, line: 48, baseType: !215, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 96, align: 32, elements: !63)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !222, line: 87, baseType: !85)
!222 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231}
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !198, file: !1, line: 57, type: !11)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 2, scope: !198, file: !1, line: 57, type: !201)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delta", arg: 3, scope: !198, file: !1, line: 57, type: !5)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !198, file: !1, line: 57, type: !219)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rlistlong", arg: 5, scope: !198, file: !1, line: 58, type: !221)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncg", arg: 6, scope: !198, file: !1, line: 58, type: !5)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !198, file: !1, line: 60, type: !5)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cx", scope: !198, file: !1, line: 61, type: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !222, line: 107, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, align: 32, elements: !63)
!234 = !DISubprogram(name: "done_grid", scope: !1, file: !1, line: 87, type: !235, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_grid*)* @done_grid, variables: !237)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !201}
!237 = !{!238}
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !234, file: !1, line: 87, type: !201)
!239 = !DISubprogram(name: "xyz2ci_", scope: !1, file: !1, line: 106, type: !240, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32, i32)* @xyz2ci_, variables: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{!5, !5, !5, !5, !5, !5}
!242 = !{!243, !244, !245, !246, !247}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nry", arg: 1, scope: !239, file: !1, line: 106, type: !5)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrz", arg: 2, scope: !239, file: !1, line: 106, type: !5)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !239, file: !1, line: 106, type: !5)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 4, scope: !239, file: !1, line: 106, type: !5)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 5, scope: !239, file: !1, line: 106, type: !5)
!248 = !DISubprogram(name: "ci2xyz", scope: !1, file: !1, line: 112, type: !249, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_grid*, i32, i32*, i32*, i32*)* @ci2xyz, variables: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !201, !5, !215, !215, !215}
!251 = !{!252, !253, !254, !255, !256, !257}
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !248, file: !1, line: 112, type: !201)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !248, file: !1, line: 112, type: !5)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !248, file: !1, line: 112, type: !215)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 4, scope: !248, file: !1, line: 112, type: !215)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 5, scope: !248, file: !1, line: 112, type: !215)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !248, file: !1, line: 115, type: !5)
!258 = !DISubprogram(name: "grid_first", scope: !1, file: !1, line: 129, type: !259, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_grid*, [3 x float]*, float)* @grid_first, variables: !261)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !11, !201, !219, !221}
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270}
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !258, file: !1, line: 129, type: !11)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 2, scope: !258, file: !1, line: 129, type: !201)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 3, scope: !258, file: !1, line: 129, type: !219)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rlistlong", arg: 4, scope: !258, file: !1, line: 129, type: !221)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !258, file: !1, line: 131, type: !215)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !258, file: !1, line: 132, type: !5)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !258, file: !1, line: 132, type: !5)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !258, file: !1, line: 132, type: !5)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cx", scope: !258, file: !1, line: 133, type: !232)
!271 = !DISubprogram(name: "calc_elemnr", scope: !1, file: !1, line: 203, type: !272, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32*, %struct.t_grid*, i32, i32, i32)* @calc_elemnr, variables: !274)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !11, !5, !215, !201, !5, !5, !5}
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !286, !287, !288, !289, !290, !291, !292}
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !271, file: !1, line: 203, type: !11)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDD", arg: 2, scope: !271, file: !1, line: 203, type: !5)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_index", arg: 3, scope: !271, file: !1, line: 203, type: !215)
!278 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 4, scope: !271, file: !1, line: 204, type: !201)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg0", arg: 5, scope: !271, file: !1, line: 204, type: !5)
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg1", arg: 6, scope: !271, file: !1, line: 204, type: !5)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncg", arg: 7, scope: !271, file: !1, line: 204, type: !5)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CG0", scope: !271, file: !1, line: 206, type: !283)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 32, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 2)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CG1", scope: !271, file: !1, line: 206, type: !283)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cell_index", scope: !271, file: !1, line: 207, type: !215)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !271, file: !1, line: 208, type: !215)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !271, file: !1, line: 209, type: !5)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !271, file: !1, line: 209, type: !5)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !271, file: !1, line: 209, type: !5)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !271, file: !1, line: 210, type: !5)
!293 = !DISubprogram(name: "calc_ptrs", scope: !1, file: !1, line: 222, type: !235, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_grid*)* @calc_ptrs, variables: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !293, file: !1, line: 222, type: !201)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !293, file: !1, line: 224, type: !215)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !293, file: !1, line: 225, type: !215)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !293, file: !1, line: 226, type: !5)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !293, file: !1, line: 226, type: !5)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !293, file: !1, line: 226, type: !5)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !293, file: !1, line: 226, type: !5)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !293, file: !1, line: 226, type: !5)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nnra", scope: !293, file: !1, line: 227, type: !5)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !293, file: !1, line: 227, type: !5)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gmax", scope: !293, file: !1, line: 228, type: !5)
!306 = !DISubprogram(name: "grid_last", scope: !1, file: !1, line: 245, type: !272, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32*, %struct.t_grid*, i32, i32, i32)* @grid_last, variables: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !306, file: !1, line: 245, type: !11)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDD", arg: 2, scope: !306, file: !1, line: 245, type: !5)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_index", arg: 3, scope: !306, file: !1, line: 245, type: !215)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 4, scope: !306, file: !1, line: 246, type: !201)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg0", arg: 5, scope: !306, file: !1, line: 246, type: !5)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg1", arg: 6, scope: !306, file: !1, line: 246, type: !5)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncg", arg: 7, scope: !306, file: !1, line: 246, type: !5)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CG0", scope: !306, file: !1, line: 248, type: !283)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CG1", scope: !306, file: !1, line: 248, type: !283)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !306, file: !1, line: 249, type: !5)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !306, file: !1, line: 249, type: !5)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !306, file: !1, line: 250, type: !5)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ind", scope: !306, file: !1, line: 250, type: !5)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !306, file: !1, line: 250, type: !5)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cell_index", scope: !306, file: !1, line: 251, type: !215)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !306, file: !1, line: 252, type: !215)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !306, file: !1, line: 253, type: !215)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !306, file: !1, line: 254, type: !215)
!326 = !DISubprogram(name: "fill_grid", scope: !1, file: !1, line: 268, type: !327, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32*, %struct.t_grid*, [3 x float]*, i32, i32, i32, [3 x float]*)* @fill_grid, variables: !331)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !11, !5, !215, !201, !219, !5, !5, !5, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !222, line: 101, baseType: !220)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !326, file: !1, line: 268, type: !11)
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDD", arg: 2, scope: !326, file: !1, line: 268, type: !5)
!334 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_index", arg: 3, scope: !326, file: !1, line: 268, type: !215)
!335 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 4, scope: !326, file: !1, line: 269, type: !201)
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !326, file: !1, line: 269, type: !219)
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncg", arg: 6, scope: !326, file: !1, line: 270, type: !5)
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg0", arg: 7, scope: !326, file: !1, line: 270, type: !5)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg1", arg: 8, scope: !326, file: !1, line: 270, type: !5)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_cm", arg: 9, scope: !326, file: !1, line: 270, type: !329)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cell_index", scope: !326, file: !1, line: 272, type: !215)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrx", scope: !326, file: !1, line: 273, type: !5)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nry", scope: !326, file: !1, line: 273, type: !5)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrz", scope: !326, file: !1, line: 273, type: !5)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !326, file: !1, line: 274, type: !221)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !326, file: !1, line: 274, type: !221)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dz", scope: !326, file: !1, line: 274, type: !221)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !326, file: !1, line: 275, type: !5)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !326, file: !1, line: 275, type: !5)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !326, file: !1, line: 275, type: !5)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !326, file: !1, line: 275, type: !5)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !326, file: !1, line: 275, type: !5)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !326, file: !1, line: 276, type: !5)
!354 = !DISubprogram(name: "check_grid", scope: !1, file: !1, line: 324, type: !355, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_grid*)* @check_grid, variables: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !11, !201}
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365}
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !354, file: !1, line: 324, type: !11)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 2, scope: !354, file: !1, line: 324, type: !201)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !354, file: !1, line: 326, type: !5)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !354, file: !1, line: 326, type: !5)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !354, file: !1, line: 326, type: !5)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !354, file: !1, line: 326, type: !5)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cci", scope: !354, file: !1, line: 326, type: !5)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !354, file: !1, line: 326, type: !5)
!366 = !DISubprogram(name: "print_grid", scope: !1, file: !1, line: 347, type: !367, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_grid*, i32, i32*)* @print_grid, variables: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !11, !201, !5, !215}
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !366, file: !1, line: 347, type: !11)
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 2, scope: !366, file: !1, line: 347, type: !201)
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDD", arg: 3, scope: !366, file: !1, line: 347, type: !5)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_index", arg: 4, scope: !366, file: !1, line: 347, type: !215)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !366, file: !1, line: 349, type: !5)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !366, file: !1, line: 349, type: !5)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !366, file: !1, line: 349, type: !5)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !366, file: !1, line: 350, type: !5)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !366, file: !1, line: 350, type: !5)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !366, file: !1, line: 350, type: !5)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !366, file: !1, line: 350, type: !5)
!381 = !DISubprogram(name: "mv_grid", scope: !1, file: !1, line: 385, type: !382, isLocal: false, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_commrec*, i32, i32*, %struct.t_grid*, i32*)* @mv_grid, variables: !395)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !384, !5, !215, !201, !215}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !386, line: 40, baseType: !387)
!386 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 36, size: 192, align: 32, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !387, file: !386, line: 37, baseType: !5, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !387, file: !386, line: 37, baseType: !5, size: 32, align: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !387, file: !386, line: 38, baseType: !5, size: 32, align: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !387, file: !386, line: 38, baseType: !5, size: 32, align: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !387, file: !386, line: 39, baseType: !5, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !387, file: !386, line: 39, baseType: !5, size: 32, align: 32, offset: 160)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 1, scope: !381, file: !1, line: 385, type: !384)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDD", arg: 2, scope: !381, file: !1, line: 385, type: !5)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_index", arg: 3, scope: !381, file: !1, line: 385, type: !215)
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 4, scope: !381, file: !1, line: 386, type: !201)
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cgload", arg: 5, scope: !381, file: !1, line: 386, type: !215)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !381, file: !1, line: 388, type: !5)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !381, file: !1, line: 388, type: !5)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !381, file: !1, line: 388, type: !5)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !381, file: !1, line: 389, type: !5)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !381, file: !1, line: 390, type: !215)
!406 = !DISubprogram(name: "_range_check", scope: !1, file: !1, line: 49, type: !407, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, variables: !409)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !39, !5, !5, !39, !5}
!409 = !{!410, !411, !412, !413, !414}
!410 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !406, file: !1, line: 49, type: !39)
!411 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !406, file: !1, line: 49, type: !5)
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 3, scope: !406, file: !1, line: 49, type: !5)
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 4, scope: !406, file: !1, line: 49, type: !39)
!414 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 5, scope: !406, file: !1, line: 49, type: !5)
!415 = !DISubprogram(name: "calc_bor", scope: !1, file: !1, line: 167, type: !416, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, i32, i32, i32*, i32*)* @calc_bor, variables: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !11, !5, !5, !5, !5, !215, !215}
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426}
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !415, file: !1, line: 167, type: !11)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDD", arg: 2, scope: !415, file: !1, line: 167, type: !5)
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg0", arg: 3, scope: !415, file: !1, line: 168, type: !5)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg1", arg: 4, scope: !415, file: !1, line: 168, type: !5)
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncg", arg: 5, scope: !415, file: !1, line: 168, type: !5)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "CG0", arg: 6, scope: !415, file: !1, line: 168, type: !215)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "CG1", arg: 7, scope: !415, file: !1, line: 168, type: !215)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !427, file: !1, line: 191, type: !5)
!427 = distinct !DILexicalBlock(scope: !428, file: !1, line: 190, column: 14)
!428 = distinct !DILexicalBlock(scope: !415, file: !1, line: 190, column: 7)
!429 = !DISubprogram(name: "_divide", scope: !430, file: !430, line: 580, type: !431, isLocal: true, isDefinition: true, scopeLine: 581, flags: DIFlagPrototyped, isOptimized: true, variables: !433)
