; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/orires.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_mdatoms = type { float, i32, float*, float*, float*, float*, float*, float*, float*, i32*, i32*, i32*, i32*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !867, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/orires.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !{!8, !75, !81, !88, !94, !100, !103, !106, !109, !112, !115, !118, !127, !136, !149, !152, !155, !158, !172, !186, !192, !198, !556, !570, !615, !769, !775, !783, !790, !799, !806, !811, !816, !822, !832, !839, !844, !849, !855}
!8 = !DISubprogram(name: "__sputc", scope: !9, file: !9, line: 348, type: !10, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!9 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DISubroutineType(types: !11)
!11 = !{!5, !5, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !9, line: 153, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !9, line: 122, size: 1216, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21, !23, !24, !29, !30, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !14, file: !9, line: 123, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !14, file: !9, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !14, file: !9, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !9, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !14, file: !9, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !14, file: !9, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !9, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !9, line: 89, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !9, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !14, file: !9, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !14, file: !9, line: 132, baseType: !6, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !14, file: !9, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!5, !6}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !14, file: !9, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!5, !6, !39, !5}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !14, file: !9, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !6, !44, !5}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !9, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !14, file: !9, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!5, !6, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !14, file: !9, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !14, file: !9, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !9, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !14, file: !9, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !14, file: !9, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !14, file: !9, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !14, file: !9, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !14, file: !9, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !9, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !8, file: !9, line: 348, type: !5)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !8, file: !9, line: 348, type: !12)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!5, !5}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !5)
!81 = !DISubprogram(name: "__inline_isfinitef", scope: !82, file: !82, line: 204, type: !83, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !86)
!82 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DISubroutineType(types: !84)
!84 = !{!5, !85}
!85 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !81, file: !82, line: 204, type: !85)
!88 = !DISubprogram(name: "__inline_isfinited", scope: !82, file: !82, line: 207, type: !89, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !92)
!89 = !DISubroutineType(types: !90)
!90 = !{!5, !91}
!91 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !88, file: !82, line: 207, type: !91)
!94 = !DISubprogram(name: "__inline_isfinitel", scope: !82, file: !82, line: 210, type: !95, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!5, !97}
!97 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!98 = !{!99}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !94, file: !82, line: 210, type: !97)
!100 = !DISubprogram(name: "__inline_isinff", scope: !82, file: !82, line: 213, type: !83, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !101)
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !100, file: !82, line: 213, type: !85)
!103 = !DISubprogram(name: "__inline_isinfd", scope: !82, file: !82, line: 216, type: !89, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !104)
!104 = !{!105}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !103, file: !82, line: 216, type: !91)
!106 = !DISubprogram(name: "__inline_isinfl", scope: !82, file: !82, line: 219, type: !95, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !106, file: !82, line: 219, type: !97)
!109 = !DISubprogram(name: "__inline_isnanf", scope: !82, file: !82, line: 222, type: !83, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !110)
!110 = !{!111}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !109, file: !82, line: 222, type: !85)
!112 = !DISubprogram(name: "__inline_isnand", scope: !82, file: !82, line: 225, type: !89, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !113)
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !112, file: !82, line: 225, type: !91)
!115 = !DISubprogram(name: "__inline_isnanl", scope: !82, file: !82, line: 228, type: !95, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !116)
!116 = !{!117}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !115, file: !82, line: 228, type: !97)
!118 = !DISubprogram(name: "__inline_signbitf", scope: !82, file: !82, line: 231, type: !83, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !119)
!119 = !{!120, !121}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !118, file: !82, line: 231, type: !85)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !118, file: !82, line: 232, type: !122)
!122 = !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !82, line: 232, size: 32, align: 32, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !122, file: !82, line: 232, baseType: !85, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !122, file: !82, line: 232, baseType: !126, size: 32, align: 32)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DISubprogram(name: "__inline_signbitd", scope: !82, file: !82, line: 236, type: !89, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !128)
!128 = !{!129, !130}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !127, file: !82, line: 236, type: !91)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !127, file: !82, line: 237, type: !131)
!131 = !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !82, line: 237, size: 64, align: 64, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !131, file: !82, line: 237, baseType: !91, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !131, file: !82, line: 237, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DISubprogram(name: "__inline_signbitl", scope: !82, file: !82, line: 242, type: !95, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !137)
!137 = !{!138, !139}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !136, file: !82, line: 242, type: !97)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !136, file: !82, line: 246, type: !140)
!140 = !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !82, line: 243, size: 128, align: 128, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !140, file: !82, line: 244, baseType: !97, size: 128, align: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !140, file: !82, line: 245, baseType: !144, size: 128, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !82, line: 245, size: 128, align: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !144, file: !82, line: 245, baseType: !135, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !144, file: !82, line: 245, baseType: !148, size: 16, align: 16, offset: 64)
!148 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!149 = !DISubprogram(name: "__inline_isnormalf", scope: !82, file: !82, line: 257, type: !83, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !150)
!150 = !{!151}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !149, file: !82, line: 257, type: !85)
!152 = !DISubprogram(name: "__inline_isnormald", scope: !82, file: !82, line: 260, type: !89, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !153)
!153 = !{!154}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !152, file: !82, line: 260, type: !91)
!155 = !DISubprogram(name: "__inline_isnormall", scope: !82, file: !82, line: 263, type: !95, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !156)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !155, file: !82, line: 263, type: !97)
!158 = !DISubprogram(name: "__sincosf", scope: !82, file: !82, line: 642, type: !159, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !162)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !85, !161, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !158, file: !82, line: 642, type: !85)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !158, file: !82, line: 642, type: !161)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !158, file: !82, line: 642, type: !161)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !158, file: !82, line: 643, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !82, line: 634, size: 64, align: 32, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32, offset: 32)
!172 = !DISubprogram(name: "__sincos", scope: !82, file: !82, line: 647, type: !173, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !91, !175, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !82, line: 647, type: !91)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !172, file: !82, line: 647, type: !175)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !172, file: !82, line: 647, type: !175)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !172, file: !82, line: 648, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !82, line: 635, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64, offset: 64)
!186 = !DISubprogram(name: "__sincospif", scope: !82, file: !82, line: 652, type: !159, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !82, line: 652, type: !85)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !186, file: !82, line: 652, type: !161)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !186, file: !82, line: 652, type: !161)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !186, file: !82, line: 653, type: !167)
!192 = !DISubprogram(name: "__sincospi", scope: !82, file: !82, line: 657, type: !173, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !192, file: !82, line: 657, type: !91)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !192, file: !82, line: 657, type: !175)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !192, file: !82, line: 657, type: !175)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !192, file: !82, line: 658, type: !181)
!198 = !DISubprogram(name: "init_orires", scope: !1, file: !1, line: 42, type: !199, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32*, %union.t_iparams*, [3 x float]*, %struct.t_mdatoms*, %struct.t_inputrec*, %struct.t_commrec*, %struct.t_fcdata*)* @init_orires, variables: !536)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !12, !5, !201, !206, !319, !321, !352, !466, !477}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !203, line: 45, baseType: !204)
!203 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !205, line: 73, baseType: !5)
!205 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !203, line: 131, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_union_type, file: !203, line: 97, size: 192, align: 32, elements: !209)
!209 = !{!210, !217, !224, !230, !239, !244, !251, !259, !264, !269, !275, !281, !288, !297, !306, !315}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !208, file: !203, line: 105, baseType: !211, size: 96, align: 32)
!211 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 105, size: 96, align: 32, elements: !212)
!212 = !{!213, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !211, file: !203, line: 105, baseType: !214, size: 32, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !205, line: 87, baseType: !85)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !211, file: !203, line: 105, baseType: !214, size: 32, align: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !211, file: !203, line: 105, baseType: !214, size: 32, align: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !208, file: !203, line: 106, baseType: !218, size: 128, align: 32)
!218 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 106, size: 128, align: 32, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !218, file: !203, line: 106, baseType: !214, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !218, file: !203, line: 106, baseType: !214, size: 32, align: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !218, file: !203, line: 106, baseType: !214, size: 32, align: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !218, file: !203, line: 106, baseType: !214, size: 32, align: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !208, file: !203, line: 108, baseType: !225, size: 96, align: 32)
!225 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 108, size: 96, align: 32, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !225, file: !203, line: 108, baseType: !214, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !225, file: !203, line: 108, baseType: !214, size: 32, align: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !225, file: !203, line: 108, baseType: !214, size: 32, align: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !208, file: !203, line: 110, baseType: !231, size: 192, align: 32)
!231 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 110, size: 192, align: 32, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !231, file: !203, line: 110, baseType: !214, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !231, file: !203, line: 110, baseType: !214, size: 32, align: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !231, file: !203, line: 110, baseType: !214, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !231, file: !203, line: 110, baseType: !214, size: 32, align: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !231, file: !203, line: 110, baseType: !214, size: 32, align: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !231, file: !203, line: 110, baseType: !214, size: 32, align: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !208, file: !203, line: 111, baseType: !240, size: 64, align: 32)
!240 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 111, size: 64, align: 32, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !240, file: !203, line: 111, baseType: !214, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !240, file: !203, line: 111, baseType: !214, size: 32, align: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !208, file: !203, line: 112, baseType: !245, size: 128, align: 32)
!245 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 112, size: 128, align: 32, elements: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !245, file: !203, line: 112, baseType: !214, size: 32, align: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !245, file: !203, line: 112, baseType: !214, size: 32, align: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !245, file: !203, line: 112, baseType: !214, size: 32, align: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !245, file: !203, line: 112, baseType: !214, size: 32, align: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !208, file: !203, line: 117, baseType: !252, size: 160, align: 32)
!252 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 117, size: 160, align: 32, elements: !253)
!253 = !{!254, !255, !256, !257, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !252, file: !203, line: 117, baseType: !214, size: 32, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !252, file: !203, line: 117, baseType: !214, size: 32, align: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !252, file: !203, line: 117, baseType: !5, size: 32, align: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !252, file: !203, line: 117, baseType: !214, size: 32, align: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !252, file: !203, line: 117, baseType: !214, size: 32, align: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !208, file: !203, line: 118, baseType: !260, size: 64, align: 32)
!260 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 118, size: 64, align: 32, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !260, file: !203, line: 118, baseType: !214, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !260, file: !203, line: 118, baseType: !214, size: 32, align: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !208, file: !203, line: 123, baseType: !265, size: 64, align: 32)
!265 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 123, size: 64, align: 32, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !265, file: !203, line: 123, baseType: !214, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !265, file: !203, line: 123, baseType: !214, size: 32, align: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !208, file: !203, line: 124, baseType: !270, size: 96, align: 32)
!270 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 124, size: 96, align: 32, elements: !271)
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !270, file: !203, line: 124, baseType: !214, size: 32, align: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !270, file: !203, line: 124, baseType: !214, size: 32, align: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !270, file: !203, line: 124, baseType: !214, size: 32, align: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !208, file: !203, line: 125, baseType: !276, size: 192, align: 32)
!276 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 125, size: 192, align: 32, elements: !277)
!277 = !{!278, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !276, file: !203, line: 125, baseType: !279, size: 96, align: 32)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 96, align: 32, elements: !63)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !276, file: !203, line: 125, baseType: !279, size: 96, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !208, file: !203, line: 126, baseType: !282, size: 192, align: 32)
!282 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 126, size: 192, align: 32, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !282, file: !203, line: 126, baseType: !285, size: 192, align: 32)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 192, align: 32, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 6)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !208, file: !203, line: 127, baseType: !289, size: 192, align: 32)
!289 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 127, size: 192, align: 32, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !289, file: !203, line: 127, baseType: !214, size: 32, align: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !289, file: !203, line: 127, baseType: !214, size: 32, align: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !289, file: !203, line: 127, baseType: !214, size: 32, align: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !289, file: !203, line: 127, baseType: !214, size: 32, align: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !289, file: !203, line: 127, baseType: !214, size: 32, align: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !289, file: !203, line: 127, baseType: !214, size: 32, align: 32, offset: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !208, file: !203, line: 128, baseType: !298, size: 192, align: 32)
!298 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 128, size: 192, align: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !298, file: !203, line: 128, baseType: !214, size: 32, align: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !298, file: !203, line: 128, baseType: !214, size: 32, align: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !298, file: !203, line: 128, baseType: !214, size: 32, align: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !298, file: !203, line: 128, baseType: !214, size: 32, align: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !203, line: 128, baseType: !5, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !298, file: !203, line: 128, baseType: !5, size: 32, align: 32, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !208, file: !203, line: 129, baseType: !307, size: 192, align: 32)
!307 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 129, size: 192, align: 32, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !307, file: !203, line: 129, baseType: !5, size: 32, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !307, file: !203, line: 129, baseType: !5, size: 32, align: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !307, file: !203, line: 129, baseType: !5, size: 32, align: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !307, file: !203, line: 129, baseType: !214, size: 32, align: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !307, file: !203, line: 129, baseType: !214, size: 32, align: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !307, file: !203, line: 129, baseType: !214, size: 32, align: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !208, file: !203, line: 130, baseType: !316, size: 192, align: 32)
!316 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 130, size: 192, align: 32, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !316, file: !203, line: 130, baseType: !285, size: 192, align: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !205, line: 101, baseType: !279)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !323, line: 51, baseType: !324)
!323 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!324 = !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 40, size: 1408, align: 64, elements: !325)
!325 = !{!326, !327, !328, !330, !331, !332, !333, !334, !335, !336, !338, !339, !340, !341, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !324, file: !323, line: 41, baseType: !214, size: 32, align: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !324, file: !323, line: 42, baseType: !5, size: 32, align: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !324, file: !323, line: 43, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !324, file: !323, line: 43, baseType: !329, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !324, file: !323, line: 43, baseType: !329, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !324, file: !323, line: 43, baseType: !329, size: 64, align: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !324, file: !323, line: 44, baseType: !329, size: 64, align: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !324, file: !323, line: 44, baseType: !329, size: 64, align: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !324, file: !323, line: 44, baseType: !329, size: 64, align: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !324, file: !323, line: 45, baseType: !337, size: 64, align: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !324, file: !323, line: 46, baseType: !337, size: 64, align: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !324, file: !323, line: 47, baseType: !337, size: 64, align: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !324, file: !323, line: 47, baseType: !337, size: 64, align: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !324, file: !323, line: 48, baseType: !342, size: 64, align: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !324, file: !323, line: 49, baseType: !342, size: 64, align: 64, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !324, file: !323, line: 49, baseType: !342, size: 64, align: 64, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !324, file: !323, line: 49, baseType: !342, size: 64, align: 64, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !324, file: !323, line: 49, baseType: !342, size: 64, align: 64, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !324, file: !323, line: 49, baseType: !342, size: 64, align: 64, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !324, file: !323, line: 49, baseType: !342, size: 64, align: 64, offset: 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !324, file: !323, line: 50, baseType: !342, size: 64, align: 64, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !324, file: !323, line: 50, baseType: !342, size: 64, align: 64, offset: 1280)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !324, file: !323, line: 50, baseType: !342, size: 64, align: 64, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !354, line: 143, baseType: !355)
!354 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!355 = !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 55, size: 4736, align: 64, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !457, !465}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !355, file: !354, line: 56, baseType: !5, size: 32, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !355, file: !354, line: 57, baseType: !5, size: 32, align: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !355, file: !354, line: 58, baseType: !5, size: 32, align: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !355, file: !354, line: 59, baseType: !5, size: 32, align: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !355, file: !354, line: 60, baseType: !5, size: 32, align: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !355, file: !354, line: 61, baseType: !5, size: 32, align: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !355, file: !354, line: 62, baseType: !5, size: 32, align: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !355, file: !354, line: 63, baseType: !5, size: 32, align: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !355, file: !354, line: 65, baseType: !5, size: 32, align: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !355, file: !354, line: 66, baseType: !5, size: 32, align: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !355, file: !354, line: 67, baseType: !5, size: 32, align: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !355, file: !354, line: 68, baseType: !5, size: 32, align: 32, offset: 352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !355, file: !354, line: 69, baseType: !5, size: 32, align: 32, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !355, file: !354, line: 70, baseType: !5, size: 32, align: 32, offset: 416)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !355, file: !354, line: 71, baseType: !214, size: 32, align: 32, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !355, file: !354, line: 72, baseType: !214, size: 32, align: 32, offset: 480)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !355, file: !354, line: 73, baseType: !214, size: 32, align: 32, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !355, file: !354, line: 74, baseType: !5, size: 32, align: 32, offset: 544)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !355, file: !354, line: 74, baseType: !5, size: 32, align: 32, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !355, file: !354, line: 74, baseType: !5, size: 32, align: 32, offset: 608)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !355, file: !354, line: 76, baseType: !5, size: 32, align: 32, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !355, file: !354, line: 77, baseType: !214, size: 32, align: 32, offset: 672)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !355, file: !354, line: 79, baseType: !5, size: 32, align: 32, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !355, file: !354, line: 80, baseType: !5, size: 32, align: 32, offset: 736)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !355, file: !354, line: 81, baseType: !5, size: 32, align: 32, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !355, file: !354, line: 82, baseType: !5, size: 32, align: 32, offset: 800)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !355, file: !354, line: 83, baseType: !5, size: 32, align: 32, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !355, file: !354, line: 84, baseType: !5, size: 32, align: 32, offset: 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !355, file: !354, line: 85, baseType: !5, size: 32, align: 32, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !355, file: !354, line: 86, baseType: !5, size: 32, align: 32, offset: 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !355, file: !354, line: 87, baseType: !214, size: 32, align: 32, offset: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !355, file: !354, line: 88, baseType: !389, size: 288, align: 32, offset: 992)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !205, line: 105, baseType: !390)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 288, align: 32, elements: !391)
!391 = !{!64, !64}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !355, file: !354, line: 89, baseType: !389, size: 288, align: 32, offset: 1280)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !355, file: !354, line: 90, baseType: !5, size: 32, align: 32, offset: 1568)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !355, file: !354, line: 91, baseType: !214, size: 32, align: 32, offset: 1600)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !355, file: !354, line: 92, baseType: !214, size: 32, align: 32, offset: 1632)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !355, file: !354, line: 93, baseType: !5, size: 32, align: 32, offset: 1664)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !355, file: !354, line: 94, baseType: !214, size: 32, align: 32, offset: 1696)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !355, file: !354, line: 95, baseType: !214, size: 32, align: 32, offset: 1728)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !355, file: !354, line: 96, baseType: !5, size: 32, align: 32, offset: 1760)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !355, file: !354, line: 97, baseType: !214, size: 32, align: 32, offset: 1792)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !355, file: !354, line: 98, baseType: !214, size: 32, align: 32, offset: 1824)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !355, file: !354, line: 99, baseType: !214, size: 32, align: 32, offset: 1856)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !355, file: !354, line: 100, baseType: !5, size: 32, align: 32, offset: 1888)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !355, file: !354, line: 101, baseType: !214, size: 32, align: 32, offset: 1920)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !355, file: !354, line: 102, baseType: !214, size: 32, align: 32, offset: 1952)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !355, file: !354, line: 103, baseType: !5, size: 32, align: 32, offset: 1984)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !355, file: !354, line: 104, baseType: !214, size: 32, align: 32, offset: 2016)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !355, file: !354, line: 105, baseType: !214, size: 32, align: 32, offset: 2048)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !355, file: !354, line: 106, baseType: !214, size: 32, align: 32, offset: 2080)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !355, file: !354, line: 107, baseType: !214, size: 32, align: 32, offset: 2112)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !355, file: !354, line: 108, baseType: !214, size: 32, align: 32, offset: 2144)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !355, file: !354, line: 109, baseType: !5, size: 32, align: 32, offset: 2176)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !355, file: !354, line: 110, baseType: !5, size: 32, align: 32, offset: 2208)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !355, file: !354, line: 111, baseType: !5, size: 32, align: 32, offset: 2240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !355, file: !354, line: 112, baseType: !214, size: 32, align: 32, offset: 2272)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !355, file: !354, line: 113, baseType: !214, size: 32, align: 32, offset: 2304)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !355, file: !354, line: 114, baseType: !214, size: 32, align: 32, offset: 2336)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !355, file: !354, line: 115, baseType: !5, size: 32, align: 32, offset: 2368)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !355, file: !354, line: 116, baseType: !214, size: 32, align: 32, offset: 2400)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !355, file: !354, line: 117, baseType: !214, size: 32, align: 32, offset: 2432)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !355, file: !354, line: 118, baseType: !5, size: 32, align: 32, offset: 2464)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !355, file: !354, line: 120, baseType: !5, size: 32, align: 32, offset: 2496)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !355, file: !354, line: 122, baseType: !5, size: 32, align: 32, offset: 2528)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !355, file: !354, line: 124, baseType: !5, size: 32, align: 32, offset: 2560)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !355, file: !354, line: 125, baseType: !5, size: 32, align: 32, offset: 2592)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !355, file: !354, line: 126, baseType: !214, size: 32, align: 32, offset: 2624)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !355, file: !354, line: 127, baseType: !5, size: 32, align: 32, offset: 2656)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !355, file: !354, line: 128, baseType: !214, size: 32, align: 32, offset: 2688)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !355, file: !354, line: 129, baseType: !214, size: 32, align: 32, offset: 2720)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !355, file: !354, line: 130, baseType: !5, size: 32, align: 32, offset: 2752)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !355, file: !354, line: 131, baseType: !214, size: 32, align: 32, offset: 2784)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !355, file: !354, line: 132, baseType: !5, size: 32, align: 32, offset: 2816)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !355, file: !354, line: 133, baseType: !5, size: 32, align: 32, offset: 2848)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !355, file: !354, line: 134, baseType: !5, size: 32, align: 32, offset: 2880)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !355, file: !354, line: 135, baseType: !5, size: 32, align: 32, offset: 2912)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !355, file: !354, line: 136, baseType: !214, size: 32, align: 32, offset: 2944)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !355, file: !354, line: 137, baseType: !214, size: 32, align: 32, offset: 2976)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !355, file: !354, line: 138, baseType: !214, size: 32, align: 32, offset: 3008)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !355, file: !354, line: 139, baseType: !214, size: 32, align: 32, offset: 3040)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !355, file: !354, line: 140, baseType: !441, size: 512, align: 64, offset: 3072)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !354, line: 53, baseType: !442)
!442 = !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 42, size: 512, align: 64, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !456}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !442, file: !354, line: 43, baseType: !5, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !442, file: !354, line: 44, baseType: !5, size: 32, align: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !442, file: !354, line: 45, baseType: !5, size: 32, align: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !442, file: !354, line: 46, baseType: !5, size: 32, align: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !442, file: !354, line: 47, baseType: !329, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !442, file: !354, line: 48, baseType: !329, size: 64, align: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !442, file: !354, line: 49, baseType: !329, size: 64, align: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !442, file: !354, line: 50, baseType: !319, size: 64, align: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !442, file: !354, line: 51, baseType: !453, size: 64, align: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !205, line: 107, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, align: 32, elements: !63)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !442, file: !354, line: 52, baseType: !337, size: 64, align: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !355, file: !354, line: 141, baseType: !458, size: 576, align: 64, offset: 3584)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 576, align: 64, elements: !63)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !354, line: 40, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 36, size: 192, align: 64, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !460, file: !354, line: 37, baseType: !5, size: 32, align: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !460, file: !354, line: 38, baseType: !329, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !460, file: !354, line: 39, baseType: !329, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !355, file: !354, line: 142, baseType: !458, size: 576, align: 64, offset: 4160)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !468, line: 40, baseType: !469)
!468 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!469 = !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 36, size: 192, align: 32, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !469, file: !468, line: 37, baseType: !5, size: 32, align: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !469, file: !468, line: 37, baseType: !5, size: 32, align: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !469, file: !468, line: 38, baseType: !5, size: 32, align: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !469, file: !468, line: 38, baseType: !5, size: 32, align: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !469, file: !468, line: 39, baseType: !5, size: 32, align: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !469, file: !468, line: 39, baseType: !5, size: 32, align: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fcdata", file: !479, line: 95, baseType: !480)
!479 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/fcdata.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!480 = !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 92, size: 2048, align: 64, elements: !481)
!481 = !{!482, !501}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !480, file: !479, line: 93, baseType: !483, size: 640, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_disresdata", file: !479, line: 58, baseType: !484)
!484 = !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 39, size: 640, align: 64, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dr_weighting", scope: !484, file: !479, line: 40, baseType: !5, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dr_bMixed", scope: !484, file: !479, line: 41, baseType: !5, size: 32, align: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !484, file: !479, line: 43, baseType: !214, size: 32, align: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !484, file: !479, line: 46, baseType: !214, size: 32, align: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ETerm", scope: !484, file: !479, line: 47, baseType: !214, size: 32, align: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ETerm1", scope: !484, file: !479, line: 48, baseType: !214, size: 32, align: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "exp_min_t_tau", scope: !484, file: !479, line: 49, baseType: !214, size: 32, align: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !484, file: !479, line: 50, baseType: !5, size: 32, align: 32, offset: 224)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "npr", scope: !484, file: !479, line: 51, baseType: !5, size: 32, align: 32, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sumviol", scope: !484, file: !479, line: 52, baseType: !214, size: 32, align: 32, offset: 288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !484, file: !479, line: 53, baseType: !329, size: 64, align: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rav", scope: !484, file: !479, line: 54, baseType: !329, size: 64, align: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Rtl_6", scope: !484, file: !479, line: 55, baseType: !329, size: 64, align: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Rt_6", scope: !484, file: !479, line: 56, baseType: !329, size: 64, align: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Rav_6", scope: !484, file: !479, line: 57, baseType: !329, size: 64, align: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !480, file: !479, line: 94, baseType: !502, size: 1408, align: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_oriresdata", file: !479, line: 84, baseType: !503)
!503 = !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 61, size: 1408, align: 64, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !518, !520, !526, !527, !528, !529, !530, !531, !532, !533}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !503, file: !479, line: 62, baseType: !214, size: 32, align: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "edt", scope: !503, file: !479, line: 63, baseType: !214, size: 32, align: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "edt1", scope: !503, file: !479, line: 64, baseType: !214, size: 32, align: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "exp_min_t_tau", scope: !503, file: !479, line: 65, baseType: !214, size: 32, align: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !503, file: !479, line: 66, baseType: !5, size: 32, align: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nex", scope: !503, file: !479, line: 67, baseType: !5, size: 32, align: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nref", scope: !503, file: !479, line: 68, baseType: !5, size: 32, align: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "invmref", scope: !503, file: !479, line: 69, baseType: !214, size: 32, align: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mref", scope: !503, file: !479, line: 70, baseType: !329, size: 64, align: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "xref", scope: !503, file: !479, line: 71, baseType: !319, size: 64, align: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "xtmp", scope: !503, file: !479, line: 72, baseType: !319, size: 64, align: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !503, file: !479, line: 73, baseType: !517, size: 288, align: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !205, line: 103, baseType: !390)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "S", scope: !503, file: !479, line: 74, baseType: !519, size: 64, align: 64, offset: 768)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Dinsl", scope: !503, file: !479, line: 75, baseType: !521, size: 64, align: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec5", file: !479, line: 36, baseType: !523)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 160, align: 32, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 5)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Dins", scope: !503, file: !479, line: 76, baseType: !521, size: 64, align: 64, offset: 896)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Dtav", scope: !503, file: !479, line: 77, baseType: !521, size: 64, align: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "oinsl", scope: !503, file: !479, line: 78, baseType: !329, size: 64, align: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "oins", scope: !503, file: !479, line: 79, baseType: !329, size: 64, align: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "otav", scope: !503, file: !479, line: 80, baseType: !329, size: 64, align: 64, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rmsdev", scope: !503, file: !479, line: 81, baseType: !214, size: 32, align: 32, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !503, file: !479, line: 82, baseType: !521, size: 64, align: 64, offset: 1280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "TMP", scope: !503, file: !479, line: 83, baseType: !534, size: 64, align: 64, offset: 1344)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !198, file: !1, line: 42, type: !12)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfa", arg: 2, scope: !198, file: !1, line: 42, type: !5)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "forceatoms", arg: 3, scope: !198, file: !1, line: 42, type: !201)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 4, scope: !198, file: !1, line: 42, type: !206)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xref", arg: 5, scope: !198, file: !1, line: 43, type: !319)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 6, scope: !198, file: !1, line: 43, type: !321)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 7, scope: !198, file: !1, line: 43, type: !352)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mcr", arg: 8, scope: !198, file: !1, line: 44, type: !466)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fcd", arg: 9, scope: !198, file: !1, line: 44, type: !477)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !198, file: !1, line: 46, type: !5)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !198, file: !1, line: 46, type: !5)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !198, file: !1, line: 46, type: !5)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ex", scope: !198, file: !1, line: 46, type: !5)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !198, file: !1, line: 46, type: !5)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr_ex", scope: !198, file: !1, line: 46, type: !337)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtot", scope: !198, file: !1, line: 47, type: !214)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "com", scope: !198, file: !1, line: 48, type: !320)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "od", scope: !198, file: !1, line: 49, type: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!556 = !DISubprogram(name: "print_orires_log", scope: !1, file: !1, line: 163, type: !557, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_fcdata*)* @print_orires_log, variables: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !12, !477}
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !556, file: !1, line: 163, type: !12)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fcd", arg: 2, scope: !556, file: !1, line: 163, type: !477)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ex", scope: !556, file: !1, line: 165, type: !5)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !556, file: !1, line: 165, type: !5)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !556, file: !1, line: 165, type: !5)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrot", scope: !556, file: !1, line: 165, type: !5)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bZero", scope: !556, file: !1, line: 166, type: !5)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "S", scope: !556, file: !1, line: 167, type: !517)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "TMP", scope: !556, file: !1, line: 167, type: !517)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "od", scope: !556, file: !1, line: 168, type: !555)
!570 = !DISubprogram(name: "calc_orires_dev", scope: !1, file: !1, line: 207, type: !571, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.t_commrec*, i32, i32*, %union.t_iparams*, %struct.t_mdatoms*, [3 x float]*, %struct.t_fcdata*)* @calc_orires_dev, variables: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{!214, !466, !5, !201, !206, !321, !319, !477}
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mcr", arg: 1, scope: !570, file: !1, line: 207, type: !466)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfa", arg: 2, scope: !570, file: !1, line: 208, type: !5)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "forceatoms", arg: 3, scope: !570, file: !1, line: 208, type: !201)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 4, scope: !570, file: !1, line: 208, type: !206)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 5, scope: !570, file: !1, line: 209, type: !321)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !570, file: !1, line: 209, type: !319)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fcd", arg: 7, scope: !570, file: !1, line: 209, type: !477)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fa", scope: !570, file: !1, line: 211, type: !5)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !570, file: !1, line: 211, type: !5)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !570, file: !1, line: 211, type: !5)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !570, file: !1, line: 211, type: !5)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !570, file: !1, line: 211, type: !5)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ex", scope: !570, file: !1, line: 211, type: !5)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nref", scope: !570, file: !1, line: 211, type: !5)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "edt", scope: !570, file: !1, line: 212, type: !214)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "edt1", scope: !570, file: !1, line: 212, type: !214)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invn", scope: !570, file: !1, line: 212, type: !214)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pfac", scope: !570, file: !1, line: 212, type: !214)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r2", scope: !570, file: !1, line: 212, type: !214)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invr", scope: !570, file: !1, line: 212, type: !214)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "corrfac", scope: !570, file: !1, line: 212, type: !214)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !570, file: !1, line: 212, type: !214)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wsv2", scope: !570, file: !1, line: 212, type: !214)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sw", scope: !570, file: !1, line: 212, type: !214)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dev", scope: !570, file: !1, line: 212, type: !214)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "S", scope: !570, file: !1, line: 213, type: !519)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R", scope: !570, file: !1, line: 213, type: !389)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "TMP", scope: !570, file: !1, line: 213, type: !389)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Dinsl", scope: !570, file: !1, line: 214, type: !521)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Dins", scope: !570, file: !1, line: 214, type: !521)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Dtav", scope: !570, file: !1, line: 214, type: !521)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rhs", scope: !570, file: !1, line: 214, type: !521)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mref", scope: !570, file: !1, line: 215, type: !329)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !570, file: !1, line: 215, type: !534)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xref", scope: !570, file: !1, line: 216, type: !319)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xtmp", scope: !570, file: !1, line: 216, type: !319)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "com", scope: !570, file: !1, line: 216, type: !320)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r_unrot", scope: !570, file: !1, line: 216, type: !320)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !570, file: !1, line: 216, type: !320)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "od", scope: !570, file: !1, line: 217, type: !555)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bTAV", scope: !570, file: !1, line: 218, type: !5)
!615 = !DISubprogram(name: "orires", scope: !1, file: !1, line: 389, type: !616, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: true, function: float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* @orires, variables: !729)
!616 = !DISubroutineType(types: !617)
!617 = !{!214, !5, !201, !206, !319, !319, !618, !714, !728, !214, !329, !321, !5, !329, !329, !477}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_forcerec", file: !620, line: 149, baseType: !621)
!620 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/forcerec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!621 = !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 43, size: 22784, align: 64, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !621, file: !620, line: 45, baseType: !5, size: 32, align: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !621, file: !620, line: 46, baseType: !214, size: 32, align: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rlistlong", scope: !621, file: !620, line: 46, baseType: !214, size: 32, align: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "zsquare", scope: !621, file: !620, line: 49, baseType: !214, size: 32, align: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !621, file: !620, line: 49, baseType: !214, size: 32, align: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !621, file: !620, line: 50, baseType: !214, size: 32, align: 32, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "epsfac", scope: !621, file: !620, line: 50, baseType: !214, size: 32, align: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bRF", scope: !621, file: !620, line: 53, baseType: !5, size: 32, align: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "kappa", scope: !621, file: !620, line: 54, baseType: !214, size: 32, align: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "k_rf", scope: !621, file: !620, line: 54, baseType: !214, size: 32, align: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "c_rf", scope: !621, file: !620, line: 54, baseType: !214, size: 32, align: 32, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "avcsix", scope: !621, file: !620, line: 57, baseType: !214, size: 32, align: 32, offset: 352)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !621, file: !620, line: 60, baseType: !214, size: 32, align: 32, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bcoultab", scope: !621, file: !620, line: 63, baseType: !5, size: 32, align: 32, offset: 416)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bvdwtab", scope: !621, file: !620, line: 64, baseType: !5, size: 32, align: 32, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rtab", scope: !621, file: !620, line: 65, baseType: !214, size: 32, align: 32, offset: 480)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ntab", scope: !621, file: !620, line: 66, baseType: !5, size: 32, align: 32, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !621, file: !620, line: 67, baseType: !214, size: 32, align: 32, offset: 544)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "coultab", scope: !621, file: !620, line: 69, baseType: !329, size: 64, align: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtab", scope: !621, file: !620, line: 70, baseType: !329, size: 64, align: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdwtab", scope: !621, file: !620, line: 71, baseType: !329, size: 64, align: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdw14tab", scope: !621, file: !620, line: 72, baseType: !329, size: 64, align: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !621, file: !620, line: 75, baseType: !214, size: 32, align: 32, offset: 832)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !621, file: !620, line: 75, baseType: !214, size: 32, align: 32, offset: 864)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !621, file: !620, line: 76, baseType: !329, size: 64, align: 64, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !621, file: !620, line: 79, baseType: !214, size: 32, align: 32, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !621, file: !620, line: 79, baseType: !214, size: 32, align: 32, offset: 992)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bham_b_max", scope: !621, file: !620, line: 80, baseType: !214, size: 32, align: 32, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale_exp", scope: !621, file: !620, line: 81, baseType: !214, size: 32, align: 32, offset: 1056)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !621, file: !620, line: 84, baseType: !5, size: 32, align: 32, offset: 1088)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !621, file: !620, line: 85, baseType: !214, size: 32, align: 32, offset: 1120)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma6", scope: !621, file: !620, line: 86, baseType: !214, size: 32, align: 32, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bSepDVDL", scope: !621, file: !620, line: 87, baseType: !5, size: 32, align: 32, offset: 1184)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "eeltype", scope: !621, file: !620, line: 90, baseType: !5, size: 32, align: 32, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !621, file: !620, line: 91, baseType: !5, size: 32, align: 32, offset: 1248)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cg0", scope: !621, file: !620, line: 92, baseType: !5, size: 32, align: 32, offset: 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "hcg", scope: !621, file: !620, line: 92, baseType: !5, size: 32, align: 32, offset: 1312)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !621, file: !620, line: 93, baseType: !5, size: 32, align: 32, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bSolvOpt", scope: !621, file: !620, line: 94, baseType: !5, size: 32, align: 32, offset: 1376)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOMol", scope: !621, file: !620, line: 95, baseType: !5, size: 32, align: 32, offset: 1408)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOav", scope: !621, file: !620, line: 96, baseType: !279, size: 96, align: 32, offset: 1440)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nWatMol", scope: !621, file: !620, line: 97, baseType: !5, size: 32, align: 32, offset: 1536)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Dimension", scope: !621, file: !620, line: 98, baseType: !5, size: 32, align: 32, offset: 1568)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bGrid", scope: !621, file: !620, line: 99, baseType: !5, size: 32, align: 32, offset: 1600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !621, file: !620, line: 99, baseType: !5, size: 32, align: 32, offset: 1632)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "solvent_type", scope: !621, file: !620, line: 100, baseType: !337, size: 64, align: 64, offset: 1664)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mno_index", scope: !621, file: !620, line: 101, baseType: !337, size: 64, align: 64, offset: 1728)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cg_cm", scope: !621, file: !620, line: 102, baseType: !319, size: 64, align: 64, offset: 1792)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "shift_vec", scope: !621, file: !620, line: 103, baseType: !319, size: 64, align: 64, offset: 1856)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_sr", scope: !621, file: !620, line: 108, baseType: !673, size: 9984, align: 64, offset: 1920)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 9984, align: 64, elements: !694)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nblist", file: !675, line: 60, baseType: !676)
!675 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nblist.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!676 = !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 36, size: 768, align: 64, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !687, !688, !689, !690, !691, !692, !693}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "il_code", scope: !676, file: !675, line: 37, baseType: !5, size: 32, align: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nri", scope: !676, file: !675, line: 39, baseType: !5, size: 32, align: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "maxnri", scope: !676, file: !675, line: 39, baseType: !5, size: 32, align: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nrj", scope: !676, file: !675, line: 40, baseType: !5, size: 32, align: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "maxnrj", scope: !676, file: !675, line: 40, baseType: !5, size: 32, align: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !676, file: !675, line: 41, baseType: !5, size: 32, align: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "solvent", scope: !676, file: !675, line: 42, baseType: !5, size: 32, align: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "iinr", scope: !676, file: !675, line: 43, baseType: !686, size: 64, align: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !676, file: !675, line: 44, baseType: !337, size: 64, align: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !676, file: !675, line: 45, baseType: !337, size: 64, align: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "jindex", scope: !676, file: !675, line: 46, baseType: !337, size: 64, align: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "jjnr", scope: !676, file: !675, line: 47, baseType: !686, size: 64, align: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "nsatoms", scope: !676, file: !675, line: 48, baseType: !337, size: 64, align: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !676, file: !675, line: 58, baseType: !5, size: 32, align: 32, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !676, file: !675, line: 58, baseType: !337, size: 64, align: 64, offset: 704)
!694 = !{!695}
!695 = !DISubrange(count: 13)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_lr", scope: !621, file: !620, line: 109, baseType: !673, size: 9984, align: 64, offset: 11904)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bTwinRange", scope: !621, file: !620, line: 120, baseType: !5, size: 32, align: 32, offset: 21888)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nlr", scope: !621, file: !620, line: 121, baseType: !5, size: 32, align: 32, offset: 21920)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "f_twin", scope: !621, file: !620, line: 122, baseType: !319, size: 64, align: 64, offset: 21952)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fshift_twin", scope: !621, file: !620, line: 123, baseType: !319, size: 64, align: 64, offset: 22016)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "f_pme", scope: !621, file: !620, line: 126, baseType: !319, size: 64, align: 64, offset: 22080)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bEwald", scope: !621, file: !620, line: 127, baseType: !5, size: 32, align: 32, offset: 22144)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcoeff", scope: !621, file: !620, line: 128, baseType: !214, size: 32, align: 32, offset: 22176)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !621, file: !620, line: 131, baseType: !319, size: 64, align: 64, offset: 22208)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nmol", scope: !621, file: !620, line: 134, baseType: !5, size: 32, align: 32, offset: 22272)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mol_nr", scope: !621, file: !620, line: 135, baseType: !686, size: 64, align: 64, offset: 22336)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mol_epot", scope: !621, file: !620, line: 136, baseType: !329, size: 64, align: 64, offset: 22400)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nstcalc", scope: !621, file: !620, line: 137, baseType: !5, size: 32, align: 32, offset: 22464)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ntype", scope: !621, file: !620, line: 140, baseType: !5, size: 32, align: 32, offset: 22496)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bBHAM", scope: !621, file: !620, line: 141, baseType: !5, size: 32, align: 32, offset: 22528)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nbfp", scope: !621, file: !620, line: 142, baseType: !329, size: 64, align: 64, offset: 22592)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !621, file: !620, line: 145, baseType: !337, size: 64, align: 64, offset: 22656)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !621, file: !620, line: 148, baseType: !214, size: 32, align: 32, offset: 22720)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_graph", file: !716, line: 47, baseType: !717)
!716 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!717 = !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 38, size: 384, align: 64, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !727}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "maxbond", scope: !717, file: !716, line: 39, baseType: !5, size: 32, align: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !717, file: !716, line: 40, baseType: !5, size: 32, align: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nbound", scope: !717, file: !716, line: 41, baseType: !5, size: 32, align: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !717, file: !716, line: 42, baseType: !5, size: 32, align: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !717, file: !716, line: 43, baseType: !5, size: 32, align: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nedge", scope: !717, file: !716, line: 44, baseType: !337, size: 64, align: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "edge", scope: !717, file: !716, line: 45, baseType: !726, size: 64, align: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ishift", scope: !717, file: !716, line: 46, baseType: !453, size: 64, align: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfa", arg: 1, scope: !615, file: !1, line: 389, type: !5)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "forceatoms", arg: 2, scope: !615, file: !1, line: 389, type: !201)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 3, scope: !615, file: !1, line: 389, type: !206)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !615, file: !1, line: 390, type: !319)
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !615, file: !1, line: 390, type: !319)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 6, scope: !615, file: !1, line: 390, type: !618)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 7, scope: !615, file: !1, line: 390, type: !714)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 8, scope: !615, file: !1, line: 391, type: !728)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 9, scope: !615, file: !1, line: 391, type: !214)
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvdlambda", arg: 10, scope: !615, file: !1, line: 391, type: !329)
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 11, scope: !615, file: !1, line: 392, type: !321)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngrp", arg: 12, scope: !615, file: !1, line: 392, type: !5)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "egnb", arg: 13, scope: !615, file: !1, line: 392, type: !329)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "egcoul", arg: 14, scope: !615, file: !1, line: 392, type: !329)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fcd", arg: 15, scope: !615, file: !1, line: 393, type: !477)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !615, file: !1, line: 395, type: !204)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aj", scope: !615, file: !1, line: 395, type: !204)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fa", scope: !615, file: !1, line: 396, type: !5)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !615, file: !1, line: 396, type: !5)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !615, file: !1, line: 396, type: !5)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !615, file: !1, line: 396, type: !5)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ex", scope: !615, file: !1, line: 396, type: !5)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "power", scope: !615, file: !1, line: 396, type: !5)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ki", scope: !615, file: !1, line: 396, type: !5)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dt", scope: !615, file: !1, line: 397, type: !454)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r2", scope: !615, file: !1, line: 398, type: !214)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invr", scope: !615, file: !1, line: 398, type: !214)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invr2", scope: !615, file: !1, line: 398, type: !214)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fc", scope: !615, file: !1, line: 398, type: !214)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "smooth_fc", scope: !615, file: !1, line: 398, type: !214)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dev", scope: !615, file: !1, line: 398, type: !214)
