; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pargs.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_pargs = type { i8*, i32, i32, %union.anon.2, i8* }
%union.anon.2 = type { i8* }

@.str = private unnamed_addr constant [7 x i8] c"HIDDEN\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"[hidden]\00", align 1
@.str2 = private unnamed_addr constant [6 x i8] c"bKeep\00", align 1
@.str3 = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pargs.c\00", align 1
@.str4 = private unnamed_addr constant [6 x i8] c"-no%s\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str5 = private unnamed_addr constant [35 x i8] c"Setting option %s more than once!\0A\00", align 1
@.str6 = private unnamed_addr constant [34 x i8] c"Invalid argument %s for option %s\00", align 1

!34 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!35 = !{!36}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !31, file: !25, line: 207, type: !34)
!37 = !DISubprogram(name: "__inline_isfinitel", scope: !25, file: !25, line: 210, type: !38, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !41)
!38 = !DISubroutineType(types: !39)
!39 = !{!15, !40}
!40 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!41 = !{!42}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !37, file: !25, line: 210, type: !40)
!43 = !DISubprogram(name: "__inline_isinff", scope: !25, file: !25, line: 213, type: !26, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !44)
!44 = !{!45}
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !43, file: !25, line: 213, type: !28)
!46 = !DISubprogram(name: "__inline_isinfd", scope: !25, file: !25, line: 216, type: !32, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !47)
!47 = !{!48}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !46, file: !25, line: 216, type: !34)
!49 = !DISubprogram(name: "__inline_isinfl", scope: !25, file: !25, line: 219, type: !38, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !50)
!50 = !{!51}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !49, file: !25, line: 219, type: !40)
!52 = !DISubprogram(name: "__inline_isnanf", scope: !25, file: !25, line: 222, type: !26, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !53)
!53 = !{!54}
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !52, file: !25, line: 222, type: !28)
!55 = !DISubprogram(name: "__inline_isnand", scope: !25, file: !25, line: 225, type: !32, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !56)
!56 = !{!57}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !55, file: !25, line: 225, type: !34)
!58 = !DISubprogram(name: "__inline_isnanl", scope: !25, file: !25, line: 228, type: !38, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !59)
!59 = !{!60}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !58, file: !25, line: 228, type: !40)
!61 = !DISubprogram(name: "__inline_signbitf", scope: !25, file: !25, line: 231, type: !26, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !62)
!62 = !{!63, !64}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !61, file: !25, line: 231, type: !28)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !61, file: !25, line: 232, type: !65)
!65 = !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !25, line: 232, size: 32, align: 32, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !65, file: !25, line: 232, baseType: !28, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !65, file: !25, line: 232, baseType: !69, size: 32, align: 32)
!69 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!70 = !DISubprogram(name: "__inline_signbitd", scope: !25, file: !25, line: 236, type: !32, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !71)
!71 = !{!72, !73}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !70, file: !25, line: 236, type: !34)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !70, file: !25, line: 237, type: !74)
!74 = !DICompositeType(tag: DW_TAG_union_type, scope: !70, file: !25, line: 237, size: 64, align: 64, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !74, file: !25, line: 237, baseType: !34, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !74, file: !25, line: 237, baseType: !78, size: 64, align: 64)
!78 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !DISubprogram(name: "__inline_signbitl", scope: !25, file: !25, line: 242, type: !38, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !80)
!80 = !{!81, !82}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !79, file: !25, line: 242, type: !40)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !79, file: !25, line: 246, type: !83)
!83 = !DICompositeType(tag: DW_TAG_union_type, scope: !79, file: !25, line: 243, size: 128, align: 128, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !83, file: !25, line: 244, baseType: !40, size: 128, align: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !83, file: !25, line: 245, baseType: !87, size: 128, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !25, line: 245, size: 128, align: 64, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !87, file: !25, line: 245, baseType: !78, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !87, file: !25, line: 245, baseType: !91, size: 16, align: 16, offset: 64)
!91 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!92 = !DISubprogram(name: "__inline_isnormalf", scope: !25, file: !25, line: 257, type: !26, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !93)
!93 = !{!94}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !92, file: !25, line: 257, type: !28)
!95 = !DISubprogram(name: "__inline_isnormald", scope: !25, file: !25, line: 260, type: !32, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !96)
!96 = !{!97}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !95, file: !25, line: 260, type: !34)
!98 = !DISubprogram(name: "__inline_isnormall", scope: !25, file: !25, line: 263, type: !38, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !99)
!99 = !{!100}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !98, file: !25, line: 263, type: !40)
!101 = !DISubprogram(name: "__sincosf", scope: !25, file: !25, line: 642, type: !102, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !105)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !28, !104, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!105 = !{!106, !107, !108, !109}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !101, file: !25, line: 642, type: !28)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !101, file: !25, line: 642, type: !104)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !101, file: !25, line: 642, type: !104)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !101, file: !25, line: 643, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !25, line: 634, size: 64, align: 32, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !111, file: !25, line: 634, baseType: !28, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !111, file: !25, line: 634, baseType: !28, size: 32, align: 32, offset: 32)
!115 = !DISubprogram(name: "__sincos", scope: !25, file: !25, line: 647, type: !116, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !119)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !34, !118, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!119 = !{!120, !121, !122, !123}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !115, file: !25, line: 647, type: !34)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !115, file: !25, line: 647, type: !118)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !115, file: !25, line: 647, type: !118)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !115, file: !25, line: 648, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !25, line: 635, size: 128, align: 64, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !125, file: !25, line: 635, baseType: !34, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !125, file: !25, line: 635, baseType: !34, size: 64, align: 64, offset: 64)
!129 = !DISubprogram(name: "__sincospif", scope: !25, file: !25, line: 652, type: !102, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !130)
!130 = !{!131, !132, !133, !134}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !129, file: !25, line: 652, type: !28)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !129, file: !25, line: 652, type: !104)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !129, file: !25, line: 652, type: !104)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !129, file: !25, line: 653, type: !110)
!135 = !DISubprogram(name: "__sincospi", scope: !25, file: !25, line: 657, type: !116, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !136)
!136 = !{!137, !138, !139, !140}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !135, file: !25, line: 657, type: !34)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !135, file: !25, line: 657, type: !118)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !135, file: !25, line: 657, type: !118)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !135, file: !25, line: 658, type: !124)
!141 = !DISubprogram(name: "is_hidden", scope: !1, file: !1, line: 45, type: !142, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_pargs*)* @is_hidden, variables: !173)
!142 = !DISubroutineType(types: !143)
!143 = !{!15, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pargs", file: !4, line: 105, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 91, size: 256, align: 64, elements: !147)
!147 = !{!148, !151, !152, !153, !172}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !146, file: !4, line: 92, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bSet", scope: !146, file: !4, line: 93, baseType: !15, size: 32, align: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !4, line: 94, baseType: !15, size: 32, align: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !146, file: !4, line: 103, baseType: !154, size: 64, align: 64, offset: 128)
!154 = !DICompositeType(tag: DW_TAG_union_type, scope: !146, file: !4, line: 95, size: 64, align: 64, elements: !155)
!155 = !{!156, !157, !159, !163, !165, !166}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !154, file: !4, line: 96, baseType: !16, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !154, file: !4, line: 97, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !154, file: !4, line: 98, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !162, line: 87, baseType: !28)
!162 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !154, file: !4, line: 99, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !154, file: !4, line: 101, baseType: !158, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !154, file: !4, line: 102, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !162, line: 101, baseType: !169)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, align: 32, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 3)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !146, file: !4, line: 104, baseType: !149, size: 64, align: 64, offset: 192)
!173 = !{!174}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 1, scope: !141, file: !1, line: 45, type: !144)
!175 = !DISubprogram(name: "get_pargs", scope: !1, file: !1, line: 51, type: !176, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8**, i32, %struct.t_pargs*, i32)* @get_pargs, variables: !178)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !158, !164, !15, !144, !15}
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !193}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !175, file: !1, line: 51, type: !158)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !175, file: !1, line: 51, type: !164)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nparg", arg: 3, scope: !175, file: !1, line: 51, type: !15)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 4, scope: !175, file: !1, line: 51, type: !144)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bKeepArgs", arg: 5, scope: !175, file: !1, line: 51, type: !15)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !175, file: !1, line: 53, type: !15)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !175, file: !1, line: 53, type: !15)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !175, file: !1, line: 53, type: !15)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "match", scope: !175, file: !1, line: 53, type: !15)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bKeep", scope: !175, file: !1, line: 54, type: !158)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !175, file: !1, line: 55, type: !190)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, align: 8, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 32)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !175, file: !1, line: 56, type: !149)
!194 = !DISubprogram(name: "opt2parg_int", scope: !1, file: !1, line: 143, type: !195, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, %struct.t_pargs*)* @opt2parg_int, variables: !197)
!195 = !DISubroutineType(types: !196)
!196 = !{!15, !149, !15, !144}
!197 = !{!198, !199, !200, !201}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "option", arg: 1, scope: !194, file: !1, line: 143, type: !149)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nparg", arg: 2, scope: !194, file: !1, line: 143, type: !15)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !194, file: !1, line: 143, type: !144)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !194, file: !1, line: 145, type: !15)
!202 = !DISubprogram(name: "opt2parg_bool", scope: !1, file: !1, line: 156, type: !195, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, %struct.t_pargs*)* @opt2parg_bool, variables: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "option", arg: 1, scope: !202, file: !1, line: 156, type: !149)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nparg", arg: 2, scope: !202, file: !1, line: 156, type: !15)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !202, file: !1, line: 156, type: !144)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !202, file: !1, line: 158, type: !15)
!208 = !DISubprogram(name: "opt2parg_real", scope: !1, file: !1, line: 169, type: !209, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.t_pargs*)* @opt2parg_real, variables: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{!161, !149, !15, !144}
!211 = !{!212, !213, !214, !215}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "option", arg: 1, scope: !208, file: !1, line: 169, type: !149)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nparg", arg: 2, scope: !208, file: !1, line: 169, type: !15)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !208, file: !1, line: 169, type: !144)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !208, file: !1, line: 171, type: !15)
!216 = !DISubprogram(name: "opt2parg_str", scope: !1, file: !1, line: 182, type: !217, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, %struct.t_pargs*)* @opt2parg_str, variables: !219)
!217 = !DISubroutineType(types: !218)
!218 = !{!149, !149, !15, !144}
!219 = !{!220, !221, !222, !223}
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "option", arg: 1, scope: !216, file: !1, line: 182, type: !149)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nparg", arg: 2, scope: !216, file: !1, line: 182, type: !15)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !216, file: !1, line: 182, type: !144)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !216, file: !1, line: 184, type: !15)
!224 = !DISubprogram(name: "opt2parg_bSet", scope: !1, file: !1, line: 195, type: !195, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, %struct.t_pargs*)* @opt2parg_bSet, variables: !225)
!225 = !{!226, !227, !228, !229}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "option", arg: 1, scope: !224, file: !1, line: 195, type: !149)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nparg", arg: 2, scope: !224, file: !1, line: 195, type: !15)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !224, file: !1, line: 195, type: !144)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !224, file: !1, line: 197, type: !15)
!230 = !DISubprogram(name: "opt2parg_enum", scope: !1, file: !1, line: 208, type: !217, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, %struct.t_pargs*)* @opt2parg_enum, variables: !231)
!231 = !{!232, !233, !234, !235}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "option", arg: 1, scope: !230, file: !1, line: 208, type: !149)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nparg", arg: 2, scope: !230, file: !1, line: 208, type: !15)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !230, file: !1, line: 208, type: !144)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !230, file: !1, line: 210, type: !15)
!236 = !DISubprogram(name: "pa_val", scope: !1, file: !1, line: 221, type: !237, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.t_pargs*)* @pa_val, variables: !239)
!237 = !DISubroutineType(types: !238)
!238 = !{!149, !144}
!239 = !{!240}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 1, scope: !236, file: !1, line: 221, type: !144)
!241 = !DISubprogram(name: "print_pargs", scope: !1, file: !1, line: 255, type: !242, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_pargs*)* @print_pargs, variables: !301)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244, !15, !144}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !246, line: 153, baseType: !247)
!246 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !246, line: 122, size: 1216, align: 64, elements: !248)
!248 = !{!249, !252, !253, !254, !256, !257, !262, !263, !264, !267, !271, !281, !287, !288, !291, !292, !294, !298, !299, !300}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !247, file: !246, line: 123, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !247, file: !246, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !247, file: !246, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !247, file: !246, line: 126, baseType: !255, size: 16, align: 16, offset: 128)
!255 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !247, file: !246, line: 127, baseType: !255, size: 16, align: 16, offset: 144)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !247, file: !246, line: 128, baseType: !258, size: 128, align: 64, offset: 192)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !246, line: 88, size: 128, align: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !258, file: !246, line: 89, baseType: !250, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !258, file: !246, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !247, file: !246, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !247, file: !246, line: 132, baseType: !16, size: 64, align: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !247, file: !246, line: 133, baseType: !265, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !14)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !247, file: !246, line: 134, baseType: !268, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!15, !16, !149, !15}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !247, file: !246, line: 135, baseType: !272, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !16, !275, !15}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !246, line: 77, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !277, line: 71, baseType: !278)
!277 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !279, line: 46, baseType: !280)
!279 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!280 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !247, file: !246, line: 136, baseType: !282, size: 64, align: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!15, !16, !285, !15}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !247, file: !246, line: 139, baseType: !258, size: 128, align: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !247, file: !246, line: 140, baseType: !289, size: 64, align: 64, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !246, line: 94, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !247, file: !246, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !247, file: !246, line: 144, baseType: !293, size: 24, align: 8, offset: 928)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 24, align: 8, elements: !170)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !247, file: !246, line: 145, baseType: !295, size: 8, align: 8, offset: 952)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 8, align: 8, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 1)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !247, file: !246, line: 148, baseType: !258, size: 128, align: 64, offset: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !247, file: !246, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !247, file: !246, line: 152, baseType: !275, size: 64, align: 64, offset: 1152)
!301 = !{!302, !303, !304, !305, !306, !307, !311, !312}
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !241, file: !1, line: 255, type: !244)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 2, scope: !241, file: !1, line: 255, type: !15)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !241, file: !1, line: 255, type: !144)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bShowHidden", scope: !241, file: !1, line: 257, type: !15)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !241, file: !1, line: 258, type: !190)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf2", scope: !241, file: !1, line: 258, type: !308)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 2048, align: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 256)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wdesc", scope: !241, file: !1, line: 259, type: !149)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !241, file: !1, line: 260, type: !15)
!313 = !DISubprogram(name: "pr_enums", scope: !1, file: !1, line: 301, type: !314, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_pargs*, i32)* @pr_enums, variables: !316)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !244, !15, !144, !15}
!316 = !{!317, !318, !319, !320, !321, !322}
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !313, file: !1, line: 301, type: !244)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 2, scope: !313, file: !1, line: 301, type: !15)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !313, file: !1, line: 301, type: !144)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shell", arg: 4, scope: !313, file: !1, line: 301, type: !15)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !313, file: !1, line: 303, type: !15)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !313, file: !1, line: 303, type: !15)
!323 = !DISubprogram(name: "isdigit", scope: !324, file: !324, line: 237, type: !20, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !325)
!324 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!325 = !{!326}
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !323, file: !324, line: 237, type: !15)
!327 = !DISubprogram(name: "__isctype", scope: !324, file: !324, line: 164, type: !328, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, variables: !332)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !330, !331}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !279, line: 70, baseType: !15)
!331 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!332 = !{!333, !334}
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !327, file: !324, line: 164, type: !330)
!334 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !327, file: !324, line: 164, type: !331)
!335 = !{!336, !337}
!336 = !DIGlobalVariable(name: "buf", scope: !236, file: !1, line: 223, type: !308, isLocal: true, isDefinition: true, variable: [256 x i8]* @pa_val.buf)
!337 = !DIGlobalVariable(name: "argtp", scope: !0, file: !4, line: 87, type: !338, isLocal: true, isDefinition: true, variable: [7 x i8*]* @argtp)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 448, align: 64, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 7)
!341 = !{}
