; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pbc.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }

@.str = private unnamed_addr constant [119 x i8] c"Only triclinic boxes with the first vector parallel to the x-axis and the second vector in the xy-plane are supported.\00", align 1
@.str1 = private unnamed_addr constant [29 x i8] c"Triclinic box is too skewed.\00", align 1
@init_pbc.nalloc = internal unnamed_addr global i32 0, align 4
@__stderrp = external global %struct.__sFILE*
@.str2 = private unnamed_addr constant [13 x i8] c"Warning: %s\0A\00", align 1
@.str3 = private unnamed_addr constant [13 x i8] c"         Box\00", align 1
@.str4 = private unnamed_addr constant [27 x i8] c"         Can not fix pbc.\0A\00", align 1
@bSupported = internal unnamed_addr global i1 false
@gl_fbox = internal global [3 x float] zeroinitializer, align 4
@gl_hbox = internal unnamed_addr global [3 x float] zeroinitializer, align 4
@gl_mhbox = internal unnamed_addr global [3 x float] zeroinitializer, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !351, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pbc.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !{!6, !75, !81, !92, !105, !121, !139, !154, !168, !204, !229, !236, !243, !260, !268, !278, !292, !300, !307, !312, !317, !323, !331, !339, !344}
!6 = !DISubprogram(name: "__sputc", scope: !7, file: !7, line: 348, type: !8, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !7, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !7, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !7, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !7, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !7, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !7, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !7, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !7, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !7, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !7, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !7, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !7, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !7, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !7, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!10, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !7, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!10, !30, !39, !10}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !7, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !10}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !7, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !7, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!10, !30, !54, !10}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !7, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !7, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !7, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !7, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !7, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !7, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !7, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !7, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !7, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !6, file: !7, line: 348, type: !10)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !6, file: !7, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!10, !10}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !10)
!81 = !DISubprogram(name: "check_box", scope: !1, file: !1, line: 56, type: !82, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: i8* ([3 x float]*)* @check_box, variables: !89)
!82 = !DISubroutineType(types: !83)
!83 = !{!39, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 96, align: 32, elements: !63)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !87, line: 87, baseType: !88)
!87 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!88 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!89 = !{!90, !91}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !81, file: !1, line: 56, type: !84)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !81, file: !1, line: 58, type: !39)
!92 = !DISubprogram(name: "init_pbc", scope: !1, file: !1, line: 77, type: !93, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*)* @init_pbc, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !84}
!95 = !{!96, !97, !98, !99, !100, !101, !102, !104}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !92, file: !1, line: 77, type: !84)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !92, file: !1, line: 80, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !92, file: !1, line: 80, type: !10)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !92, file: !1, line: 80, type: !10)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !92, file: !1, line: 80, type: !10)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diagonal2", scope: !92, file: !1, line: 81, type: !86)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "try", scope: !92, file: !1, line: 82, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !87, line: 101, baseType: !85)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !92, file: !1, line: 83, type: !39)
!105 = !DISubprogram(name: "pbc_dx", scope: !1, file: !1, line: 130, type: !106, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, float*, float*)* @pbc_dx, variables: !111)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108, !108, !110}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x1", arg: 1, scope: !105, file: !1, line: 130, type: !108)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x2", arg: 2, scope: !105, file: !1, line: 130, type: !108)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dx", arg: 3, scope: !105, file: !1, line: 130, type: !110)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !105, file: !1, line: 132, type: !10)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !105, file: !1, line: 132, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx_start", scope: !105, file: !1, line: 133, type: !103)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "try", scope: !105, file: !1, line: 133, type: !103)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d2min", scope: !105, file: !1, line: 134, type: !86)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d2try", scope: !105, file: !1, line: 134, type: !86)
!121 = !DISubprogram(name: "image_rect", scope: !1, file: !1, line: 172, type: !122, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32*, i32*, float, i32*, float*)* @image_rect, variables: !125)
!122 = !DISubroutineType(types: !123)
!123 = !{!10, !124, !124, !124, !86, !124, !110}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xi", arg: 1, scope: !121, file: !1, line: 172, type: !124)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xj", arg: 2, scope: !121, file: !1, line: 172, type: !124)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box_size", arg: 3, scope: !121, file: !1, line: 172, type: !124)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rlong2", arg: 4, scope: !121, file: !1, line: 172, type: !86)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shift", arg: 5, scope: !121, file: !1, line: 172, type: !124)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r2", arg: 6, scope: !121, file: !1, line: 172, type: !110)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !121, file: !1, line: 174, type: !10)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !121, file: !1, line: 174, type: !10)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !121, file: !1, line: 175, type: !10)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !121, file: !1, line: 175, type: !10)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b_2", scope: !121, file: !1, line: 175, type: !10)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dxr", scope: !121, file: !1, line: 176, type: !86)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rij2", scope: !121, file: !1, line: 176, type: !86)
!139 = !DISubprogram(name: "image_cylindric", scope: !1, file: !1, line: 204, type: !122, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32*, i32*, float, i32*, float*)* @image_cylindric, variables: !140)
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xi", arg: 1, scope: !139, file: !1, line: 204, type: !124)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xj", arg: 2, scope: !139, file: !1, line: 204, type: !124)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box_size", arg: 3, scope: !139, file: !1, line: 204, type: !124)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rlong2", arg: 4, scope: !139, file: !1, line: 204, type: !86)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shift", arg: 5, scope: !139, file: !1, line: 205, type: !124)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r2", arg: 6, scope: !139, file: !1, line: 205, type: !110)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !139, file: !1, line: 207, type: !10)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !139, file: !1, line: 207, type: !10)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !139, file: !1, line: 208, type: !10)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !139, file: !1, line: 208, type: !10)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b_2", scope: !139, file: !1, line: 208, type: !10)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dxr", scope: !139, file: !1, line: 209, type: !86)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rij2", scope: !139, file: !1, line: 209, type: !86)
!154 = !DISubprogram(name: "calc_shifts", scope: !1, file: !1, line: 240, type: !155, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*, float*, [3 x float]*)* @calc_shifts, variables: !158)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !84, !110, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !154, file: !1, line: 240, type: !84)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box_size", arg: 2, scope: !154, file: !1, line: 240, type: !110)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shift_vec", arg: 3, scope: !154, file: !1, line: 240, type: !157)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !154, file: !1, line: 242, type: !10)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !154, file: !1, line: 242, type: !10)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !154, file: !1, line: 242, type: !10)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !154, file: !1, line: 242, type: !10)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !154, file: !1, line: 242, type: !10)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "test", scope: !154, file: !1, line: 242, type: !10)
!168 = !DISubprogram(name: "calc_cgcm", scope: !1, file: !1, line: 261, type: !169, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, %struct.t_block*, [3 x float]*, [3 x float]*)* @calc_cgcm, variables: !186)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !11, !10, !10, !171, !157, !157}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !173, line: 52, baseType: !174)
!173 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!174 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 36, size: 8448, align: 64, elements: !175)
!175 = !{!176, !180, !181, !184, !185}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !174, file: !173, line: 37, baseType: !177, size: 8192, align: 32)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !174, file: !173, line: 43, baseType: !10, size: 32, align: 32, offset: 8192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !174, file: !173, line: 44, baseType: !182, size: 64, align: 64, offset: 8256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !87, line: 73, baseType: !10)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !174, file: !173, line: 45, baseType: !10, size: 32, align: 32, offset: 8320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !174, file: !173, line: 46, baseType: !182, size: 64, align: 64, offset: 8384)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !168, file: !1, line: 261, type: !11)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg0", arg: 2, scope: !168, file: !1, line: 261, type: !10)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg1", arg: 3, scope: !168, file: !1, line: 261, type: !10)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cgs", arg: 4, scope: !168, file: !1, line: 261, type: !171)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 5, scope: !168, file: !1, line: 262, type: !157)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_cm", arg: 6, scope: !168, file: !1, line: 262, type: !157)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icg", scope: !168, file: !1, line: 264, type: !10)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !168, file: !1, line: 264, type: !10)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !168, file: !1, line: 264, type: !10)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k0", scope: !168, file: !1, line: 264, type: !10)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k1", scope: !168, file: !1, line: 264, type: !10)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !168, file: !1, line: 264, type: !10)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrcg", scope: !168, file: !1, line: 264, type: !10)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cg", scope: !168, file: !1, line: 265, type: !103)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inv_ncg", scope: !168, file: !1, line: 266, type: !86)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cga", scope: !168, file: !1, line: 267, type: !182)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cgindex", scope: !168, file: !1, line: 267, type: !182)
!204 = !DISubprogram(name: "put_charge_groups_in_box", scope: !1, file: !1, line: 300, type: !205, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, [3 x float]*, float*, %struct.t_block*, [3 x float]*, [3 x float]*)* @put_charge_groups_in_box, variables: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !11, !10, !10, !84, !110, !171, !157, !157}
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !204, file: !1, line: 300, type: !11)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg0", arg: 2, scope: !204, file: !1, line: 300, type: !10)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg1", arg: 3, scope: !204, file: !1, line: 300, type: !10)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !204, file: !1, line: 301, type: !84)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box_size", arg: 5, scope: !204, file: !1, line: 301, type: !110)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cgs", arg: 6, scope: !204, file: !1, line: 301, type: !171)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 7, scope: !204, file: !1, line: 302, type: !157)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_cm", arg: 8, scope: !204, file: !1, line: 302, type: !157)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icg", scope: !204, file: !1, line: 305, type: !10)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !204, file: !1, line: 305, type: !10)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !204, file: !1, line: 305, type: !10)
