; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pdbio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_symtab = type { i32, %struct.symbuf* }
%struct.symbuf = type { i32, i8**, %struct.symbuf* }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }

@bWideFormat = internal unnamed_addr global i32 0, align 4
@bTER = internal unnamed_addr global i32 0, align 4
@.str = private unnamed_addr constant [14 x i8] c"HEADER    %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !26, subprograms: !30, globals: !533, imports: !546)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pdbio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 52, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pdbio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "epdbATOM", value: 0)
!7 = !DIEnumerator(name: "epdbHETATM", value: 1)
!8 = !DIEnumerator(name: "epdbANISOU", value: 2)
!9 = !DIEnumerator(name: "epdbCRYST1", value: 3)
!10 = !DIEnumerator(name: "epdbCOMPND", value: 4)
!11 = !DIEnumerator(name: "epdbMODEL", value: 5)
!12 = !DIEnumerator(name: "epdbENDMDL", value: 6)
!13 = !DIEnumerator(name: "epdbTER", value: 7)
!14 = !DIEnumerator(name: "epdbHEADER", value: 8)
!15 = !DIEnumerator(name: "epdbTITLE", value: 9)
!16 = !DIEnumerator(name: "epdbREMARK", value: 10)
!17 = !DIEnumerator(name: "epdbNR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25}
!20 = !DIEnumerator(name: "U11", value: 0)
!21 = !DIEnumerator(name: "U22", value: 1)
!22 = !DIEnumerator(name: "U33", value: 2)
!23 = !DIEnumerator(name: "U12", value: 3)
!24 = !DIEnumerator(name: "U13", value: 4)
!25 = !DIEnumerator(name: "U23", value: 5)
!26 = !{!27, !28, !29}
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !{!31, !98, !104, !111, !117, !123, !126, !129, !132, !135, !138, !141, !150, !159, !172, !175, !178, !181, !195, !209, !215, !221, !226, !229, !338, !351, !361, !368, !372, !405, !415, !426, !433, !446, !449, !453, !461, !468, !511, !519}
!31 = !DISubprogram(name: "__sputc", scope: !32, file: !32, line: 348, type: !33, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !95)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DISubroutineType(types: !34)
!34 = !{!28, !28, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 153, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !32, line: 122, size: 1216, align: 64, elements: !38)
!38 = !{!39, !42, !43, !44, !46, !47, !52, !53, !54, !58, !63, !73, !79, !80, !83, !84, !88, !92, !93, !94}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !37, file: !32, line: 123, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !37, file: !32, line: 124, baseType: !28, size: 32, align: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !37, file: !32, line: 125, baseType: !28, size: 32, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !32, line: 126, baseType: !45, size: 16, align: 16, offset: 128)
!45 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !37, file: !32, line: 127, baseType: !45, size: 16, align: 16, offset: 144)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !37, file: !32, line: 128, baseType: !48, size: 128, align: 64, offset: 192)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !32, line: 88, size: 128, align: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !48, file: !32, line: 89, baseType: !40, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !48, file: !32, line: 90, baseType: !28, size: 32, align: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !37, file: !32, line: 129, baseType: !28, size: 32, align: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !37, file: !32, line: 132, baseType: !29, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !37, file: !32, line: 133, baseType: !55, size: 64, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!28, !29}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !37, file: !32, line: 134, baseType: !59, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!28, !29, !62, !28}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !37, file: !32, line: 135, baseType: !64, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !29, !67, !28}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !32, line: 77, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !69, line: 71, baseType: !70)
!69 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!72 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !37, file: !32, line: 136, baseType: !74, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!28, !29, !77, !28}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !37, file: !32, line: 139, baseType: !48, size: 128, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !37, file: !32, line: 140, baseType: !81, size: 64, align: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !32, line: 94, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !37, file: !32, line: 141, baseType: !28, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !37, file: !32, line: 144, baseType: !85, size: 24, align: 8, offset: 928)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 24, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 3)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !37, file: !32, line: 145, baseType: !89, size: 8, align: 8, offset: 952)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !37, file: !32, line: 148, baseType: !48, size: 128, align: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !37, file: !32, line: 151, baseType: !28, size: 32, align: 32, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !32, line: 152, baseType: !67, size: 64, align: 64, offset: 1152)
!95 = !{!96, !97}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !31, file: !32, line: 348, type: !28)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !31, file: !32, line: 348, type: !35)
!98 = !DISubprogram(name: "__sigbits", scope: !99, file: !99, line: 114, type: !100, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !102)
!99 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!100 = !DISubroutineType(types: !101)
!101 = !{!28, !28}
!102 = !{!103}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !98, file: !99, line: 114, type: !28)
!104 = !DISubprogram(name: "__inline_isfinitef", scope: !105, file: !105, line: 204, type: !106, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !109)
!105 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DISubroutineType(types: !107)
!107 = !{!28, !108}
!108 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!109 = !{!110}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !104, file: !105, line: 204, type: !108)
!111 = !DISubprogram(name: "__inline_isfinited", scope: !105, file: !105, line: 207, type: !112, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !115)
!112 = !DISubroutineType(types: !113)
!113 = !{!28, !114}
!114 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!115 = !{!116}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !111, file: !105, line: 207, type: !114)
!117 = !DISubprogram(name: "__inline_isfinitel", scope: !105, file: !105, line: 210, type: !118, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !121)
!118 = !DISubroutineType(types: !119)
!119 = !{!28, !120}
!120 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!121 = !{!122}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !117, file: !105, line: 210, type: !120)
!123 = !DISubprogram(name: "__inline_isinff", scope: !105, file: !105, line: 213, type: !106, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !124)
!124 = !{!125}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !123, file: !105, line: 213, type: !108)
!126 = !DISubprogram(name: "__inline_isinfd", scope: !105, file: !105, line: 216, type: !112, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !127)
!127 = !{!128}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !126, file: !105, line: 216, type: !114)
!129 = !DISubprogram(name: "__inline_isinfl", scope: !105, file: !105, line: 219, type: !118, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !130)
!130 = !{!131}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !129, file: !105, line: 219, type: !120)
!132 = !DISubprogram(name: "__inline_isnanf", scope: !105, file: !105, line: 222, type: !106, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !133)
!133 = !{!134}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !132, file: !105, line: 222, type: !108)
!135 = !DISubprogram(name: "__inline_isnand", scope: !105, file: !105, line: 225, type: !112, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !136)
!136 = !{!137}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !135, file: !105, line: 225, type: !114)
!138 = !DISubprogram(name: "__inline_isnanl", scope: !105, file: !105, line: 228, type: !118, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !139)
!139 = !{!140}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !138, file: !105, line: 228, type: !120)
!141 = !DISubprogram(name: "__inline_signbitf", scope: !105, file: !105, line: 231, type: !106, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !142)
!142 = !{!143, !144}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !141, file: !105, line: 231, type: !108)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !141, file: !105, line: 232, type: !145)
!145 = !DICompositeType(tag: DW_TAG_union_type, scope: !141, file: !105, line: 232, size: 32, align: 32, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !145, file: !105, line: 232, baseType: !108, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !145, file: !105, line: 232, baseType: !149, size: 32, align: 32)
!149 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!150 = !DISubprogram(name: "__inline_signbitd", scope: !105, file: !105, line: 236, type: !112, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !151)
!151 = !{!152, !153}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !150, file: !105, line: 236, type: !114)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !150, file: !105, line: 237, type: !154)
!154 = !DICompositeType(tag: DW_TAG_union_type, scope: !150, file: !105, line: 237, size: 64, align: 64, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !154, file: !105, line: 237, baseType: !114, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !154, file: !105, line: 237, baseType: !158, size: 64, align: 64)
!158 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!159 = !DISubprogram(name: "__inline_signbitl", scope: !105, file: !105, line: 242, type: !118, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !160)
!160 = !{!161, !162}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !159, file: !105, line: 242, type: !120)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !159, file: !105, line: 246, type: !163)
!163 = !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !105, line: 243, size: 128, align: 128, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !163, file: !105, line: 244, baseType: !120, size: 128, align: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !163, file: !105, line: 245, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, scope: !163, file: !105, line: 245, size: 128, align: 64, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !167, file: !105, line: 245, baseType: !158, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !167, file: !105, line: 245, baseType: !171, size: 16, align: 16, offset: 64)
!171 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!172 = !DISubprogram(name: "__inline_isnormalf", scope: !105, file: !105, line: 257, type: !106, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !173)
!173 = !{!174}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !105, line: 257, type: !108)
!175 = !DISubprogram(name: "__inline_isnormald", scope: !105, file: !105, line: 260, type: !112, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !176)
!176 = !{!177}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !175, file: !105, line: 260, type: !114)
!178 = !DISubprogram(name: "__inline_isnormall", scope: !105, file: !105, line: 263, type: !118, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !179)
!179 = !{!180}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !178, file: !105, line: 263, type: !120)
!181 = !DISubprogram(name: "__sincosf", scope: !105, file: !105, line: 642, type: !182, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !185)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !108, !184, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!185 = !{!186, !187, !188, !189}
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !181, file: !105, line: 642, type: !108)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !181, file: !105, line: 642, type: !184)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !181, file: !105, line: 642, type: !184)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !181, file: !105, line: 643, type: !190)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !105, line: 634, size: 64, align: 32, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !191, file: !105, line: 634, baseType: !108, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !191, file: !105, line: 634, baseType: !108, size: 32, align: 32, offset: 32)
!195 = !DISubprogram(name: "__sincos", scope: !105, file: !105, line: 647, type: !196, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !199)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !114, !198, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!199 = !{!200, !201, !202, !203}
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !195, file: !105, line: 647, type: !114)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !195, file: !105, line: 647, type: !198)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !195, file: !105, line: 647, type: !198)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !195, file: !105, line: 648, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !105, line: 635, size: 128, align: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !205, file: !105, line: 635, baseType: !114, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !205, file: !105, line: 635, baseType: !114, size: 64, align: 64, offset: 64)
!209 = !DISubprogram(name: "__sincospif", scope: !105, file: !105, line: 652, type: !182, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !209, file: !105, line: 652, type: !108)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !209, file: !105, line: 652, type: !184)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !209, file: !105, line: 652, type: !184)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !209, file: !105, line: 653, type: !190)
!215 = !DISubprogram(name: "__sincospi", scope: !105, file: !105, line: 657, type: !196, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !215, file: !105, line: 657, type: !114)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !215, file: !105, line: 657, type: !198)
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !215, file: !105, line: 657, type: !198)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !215, file: !105, line: 658, type: !204)
!221 = !DISubprogram(name: "set_pdb_wide_format", scope: !1, file: !1, line: 58, type: !222, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @set_pdb_wide_format, variables: !224)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !28}
!224 = !{!225}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bSet", arg: 1, scope: !221, file: !1, line: 58, type: !28)
!226 = !DISubprogram(name: "pdb_use_ter", scope: !1, file: !1, line: 63, type: !222, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @pdb_use_ter, variables: !227)
!227 = !{!228}
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bSet", arg: 1, scope: !226, file: !1, line: 63, type: !28)
!229 = !DISubprogram(name: "write_pdbfile_indexed", scope: !1, file: !1, line: 84, type: !230, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, %struct.t_atoms*, [3 x float]*, [3 x float]*, i8, i32, i32, i32*)* @write_pdbfile_indexed, variables: !311)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !35, !62, !232, !307, !310, !27, !28, !279, !278}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !234, line: 94, baseType: !235)
!234 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 75, size: 10240, align: 64, elements: !236)
!236 = !{!237, !238, !258, !261, !262, !263, !264, !265, !266, !267, !282, !290}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !235, file: !234, line: 76, baseType: !28, size: 32, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !235, file: !234, line: 77, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !234, line: 57, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 48, size: 320, align: 32, elements: !242)
!242 = !{!243, !246, !247, !248, !249, !250, !251, !252, !253, !257}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !241, file: !234, line: 49, baseType: !244, size: 32, align: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !245, line: 87, baseType: !108)
!245 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!246 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !241, file: !234, line: 49, baseType: !244, size: 32, align: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !241, file: !234, line: 50, baseType: !244, size: 32, align: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !241, file: !234, line: 50, baseType: !244, size: 32, align: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !234, line: 51, baseType: !171, size: 16, align: 16, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !241, file: !234, line: 52, baseType: !171, size: 16, align: 16, offset: 144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !241, file: !234, line: 53, baseType: !28, size: 32, align: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !241, file: !234, line: 54, baseType: !28, size: 32, align: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !241, file: !234, line: 55, baseType: !254, size: 72, align: 8, offset: 224)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 72, align: 8, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 9)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !241, file: !234, line: 56, baseType: !41, size: 8, align: 8, offset: 296)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !235, file: !234, line: 80, baseType: !259, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !235, file: !234, line: 82, baseType: !259, size: 64, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !235, file: !234, line: 84, baseType: !259, size: 64, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !235, file: !234, line: 86, baseType: !28, size: 32, align: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !235, file: !234, line: 87, baseType: !259, size: 64, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !235, file: !234, line: 89, baseType: !28, size: 32, align: 32, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !235, file: !234, line: 90, baseType: !259, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !235, file: !234, line: 91, baseType: !268, size: 8448, align: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !269, line: 52, baseType: !270)
!269 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!270 = !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 36, size: 8448, align: 64, elements: !271)
!271 = !{!272, !276, !277, !280, !281}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !270, file: !269, line: 37, baseType: !273, size: 8192, align: 32)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 32, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !270, file: !269, line: 43, baseType: !28, size: 32, align: 32, offset: 8192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !270, file: !269, line: 44, baseType: !278, size: 64, align: 64, offset: 8256)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !245, line: 73, baseType: !28)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !270, file: !269, line: 45, baseType: !28, size: 32, align: 32, offset: 8320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !270, file: !269, line: 46, baseType: !278, size: 64, align: 64, offset: 8384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !235, file: !234, line: 92, baseType: !283, size: 1152, align: 64, offset: 9024)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 1152, align: 64, elements: !255)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !234, line: 73, baseType: !285)
!285 = !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 70, size: 128, align: 64, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !285, file: !234, line: 71, baseType: !28, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !285, file: !234, line: 72, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !235, file: !234, line: 93, baseType: !291, size: 64, align: 64, offset: 10176)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !234, line: 68, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 59, size: 416, align: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !302, !303, !304, !305}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !293, file: !234, line: 60, baseType: !28, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !293, file: !234, line: 61, baseType: !28, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !293, file: !234, line: 62, baseType: !27, size: 8, align: 8, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !293, file: !234, line: 63, baseType: !299, size: 48, align: 8, offset: 72)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 48, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 6)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !293, file: !234, line: 64, baseType: !244, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !293, file: !234, line: 65, baseType: !244, size: 32, align: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !293, file: !234, line: 66, baseType: !28, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !293, file: !234, line: 67, baseType: !306, size: 192, align: 32, offset: 224)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, align: 32, elements: !300)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !245, line: 101, baseType: !309)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 96, align: 32, elements: !86)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !229, file: !1, line: 84, type: !35)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !229, file: !1, line: 84, type: !62)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !229, file: !1, line: 85, type: !232)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !229, file: !1, line: 85, type: !307)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !229, file: !1, line: 85, type: !310)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chain", arg: 6, scope: !229, file: !1, line: 85, type: !27)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "model_nr", arg: 7, scope: !229, file: !1, line: 86, type: !28)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nindex", arg: 8, scope: !229, file: !1, line: 86, type: !279)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 9, scope: !229, file: !1, line: 86, type: !278)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnm", scope: !229, file: !1, line: 88, type: !299)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nm", scope: !229, file: !1, line: 88, type: !299)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !229, file: !1, line: 88, type: !27)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdbform", scope: !229, file: !1, line: 88, type: !325)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, align: 8, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 128)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !229, file: !1, line: 89, type: !279)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !229, file: !1, line: 89, type: !279)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnr", scope: !229, file: !1, line: 90, type: !28)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !229, file: !1, line: 90, type: !28)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "occup", scope: !229, file: !1, line: 91, type: !244)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bfac", scope: !229, file: !1, line: 91, type: !244)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alpha", scope: !229, file: !1, line: 92, type: !244)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "beta", scope: !229, file: !1, line: 92, type: !244)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gamma", scope: !229, file: !1, line: 92, type: !244)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bOccup", scope: !229, file: !1, line: 93, type: !28)
!338 = !DISubprogram(name: "write_pdbfile", scope: !1, file: !1, line: 186, type: !339, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, %struct.t_atoms*, [3 x float]*, [3 x float]*, i8, i32)* @write_pdbfile, variables: !341)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !35, !62, !232, !307, !310, !27, !28}
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350}
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !338, file: !1, line: 186, type: !35)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !338, file: !1, line: 186, type: !62)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !338, file: !1, line: 186, type: !232)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !338, file: !1, line: 186, type: !307)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !338, file: !1, line: 187, type: !310)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chain", arg: 6, scope: !338, file: !1, line: 187, type: !27)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "model_nr", arg: 7, scope: !338, file: !1, line: 187, type: !28)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !338, file: !1, line: 189, type: !279)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !338, file: !1, line: 189, type: !278)
!351 = !DISubprogram(name: "line2type", scope: !1, file: !1, line: 198, type: !352, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @line2type, variables: !354)
!352 = !DISubroutineType(types: !353)
!353 = !{!28, !62}
!354 = !{!355, !356, !357}
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 1, scope: !351, file: !1, line: 198, type: !62)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !351, file: !1, line: 200, type: !28)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !351, file: !1, line: 201, type: !358)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, align: 8, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 8)
!361 = !DISubprogram(name: "is_hydrogen", scope: !1, file: !1, line: 357, type: !352, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @is_hydrogen, variables: !362)
!362 = !{!363, !364}
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nm", arg: 1, scope: !361, file: !1, line: 357, type: !62)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !361, file: !1, line: 359, type: !365)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 240, align: 8, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 30)
!368 = !DISubprogram(name: "is_dummymass", scope: !1, file: !1, line: 371, type: !352, isLocal: false, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @is_dummymass, variables: !369)
!369 = !{!370, !371}
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nm", arg: 1, scope: !368, file: !1, line: 371, type: !62)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !368, file: !1, line: 373, type: !365)
!372 = !DISubprogram(name: "read_pdbfile", scope: !1, file: !1, line: 384, type: !373, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i8*, i32*, %struct.t_atoms*, [3 x float]*, [3 x float]*, i32)* @read_pdbfile, variables: !375)
!373 = !DISubroutineType(types: !374)
!374 = !{!28, !35, !62, !289, !232, !307, !310, !28}
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !388, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !372, file: !1, line: 384, type: !35)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !372, file: !1, line: 384, type: !62)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "model_nr", arg: 3, scope: !372, file: !1, line: 384, type: !289)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 4, scope: !372, file: !1, line: 385, type: !232)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !372, file: !1, line: 385, type: !307)
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !372, file: !1, line: 385, type: !310)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bChange", arg: 7, scope: !372, file: !1, line: 385, type: !28)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bCOMPND", scope: !372, file: !1, line: 389, type: !28)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !372, file: !1, line: 390, type: !385)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32776, align: 8, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 4097)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sa", scope: !372, file: !1, line: 391, type: !389)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, align: 8, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 12)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sb", scope: !372, file: !1, line: 391, type: !389)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !372, file: !1, line: 391, type: !389)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fa", scope: !372, file: !1, line: 392, type: !114)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fb", scope: !372, file: !1, line: 392, type: !114)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fc", scope: !372, file: !1, line: 392, type: !114)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alpha", scope: !372, file: !1, line: 392, type: !114)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "beta", scope: !372, file: !1, line: 392, type: !114)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gamma", scope: !372, file: !1, line: 392, type: !114)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_type", scope: !372, file: !1, line: 393, type: !28)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !372, file: !1, line: 394, type: !62)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !372, file: !1, line: 394, type: !62)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "natom", scope: !372, file: !1, line: 395, type: !28)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bStop", scope: !372, file: !1, line: 396, type: !28)
!405 = !DISubprogram(name: "get_pdb_coordnum", scope: !1, file: !1, line: 508, type: !406, isLocal: false, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32*)* @get_pdb_coordnum, variables: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !35, !289}
!408 = !{!409, !410, !411}
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !405, file: !1, line: 508, type: !35)
!410 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !405, file: !1, line: 508, type: !289)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !405, file: !1, line: 510, type: !412)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32768, align: 8, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 4096)
!415 = !DISubprogram(name: "read_pdb_conf", scope: !1, file: !1, line: 522, type: !416, isLocal: false, isDefinition: true, scopeLine: 524, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, %struct.t_atoms*, [3 x float]*, [3 x float]*, i32)* @read_pdb_conf, variables: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !62, !62, !232, !307, !310, !28}
!418 = !{!419, !420, !421, !422, !423, !424, !425}
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 1, scope: !415, file: !1, line: 522, type: !62)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !415, file: !1, line: 522, type: !62)
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !415, file: !1, line: 523, type: !232)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !415, file: !1, line: 523, type: !307)
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !415, file: !1, line: 523, type: !310)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bChange", arg: 6, scope: !415, file: !1, line: 523, type: !28)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !415, file: !1, line: 525, type: !35)
!426 = !DISubprogram(name: "norm2", scope: !427, file: !427, line: 353, type: !428, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: true, variables: !431)
!427 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!428 = !DISubroutineType(types: !429)
!429 = !{!244, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!431 = !{!432}
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !426, file: !427, line: 353, type: !430)
!433 = !DISubprogram(name: "cos_angle_no_table", scope: !427, file: !427, line: 392, type: !434, isLocal: true, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: float (float*, float*)* @cos_angle_no_table, variables: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!244, !430, !430}
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445}
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !433, file: !427, line: 392, type: !430)
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !433, file: !427, line: 392, type: !430)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cos", scope: !433, file: !427, line: 395, type: !244)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !433, file: !427, line: 396, type: !28)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aa", scope: !433, file: !427, line: 397, type: !114)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb", scope: !433, file: !427, line: 397, type: !114)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !433, file: !427, line: 397, type: !114)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipa", scope: !433, file: !427, line: 397, type: !114)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipb", scope: !433, file: !427, line: 397, type: !114)
!446 = !DISubprogram(name: "norm", scope: !427, file: !427, line: 358, type: !428, isLocal: true, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: true, variables: !447)
!447 = !{!448}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !446, file: !427, line: 358, type: !430)
!449 = !DISubprogram(name: "isdigit", scope: !450, file: !450, line: 237, type: !100, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !451)
!450 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!451 = !{!452}
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !449, file: !450, line: 237, type: !28)
!453 = !DISubprogram(name: "__isctype", scope: !450, file: !450, line: 164, type: !454, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, variables: !458)
!454 = !DISubroutineType(types: !455)
!455 = !{!456, !456, !457}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !71, line: 70, baseType: !28)
!457 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!458 = !{!459, !460}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !453, file: !450, line: 164, type: !456)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !453, file: !450, line: 164, type: !457)
!461 = !DISubprogram(name: "clear_mat", scope: !427, file: !427, line: 334, type: !462, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, variables: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !310}
!464 = !{!465, !466}
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !461, file: !427, line: 334, type: !310)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nul", scope: !461, file: !427, line: 336, type: !467)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!468 = !DISubprogram(name: "read_atom", scope: !1, file: !1, line: 256, type: !469, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, variables: !486)
!469 = !DISubroutineType(types: !470)
!470 = !{!28, !471, !62, !28, !28, !232, !307, !28}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !473, line: 46, baseType: !474)
!473 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!474 = !DICompositeType(tag: DW_TAG_structure_type, file: !473, line: 42, size: 128, align: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !474, file: !473, line: 44, baseType: !28, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !474, file: !473, line: 45, baseType: !478, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !473, line: 40, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !473, line: 36, size: 192, align: 64, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !480, file: !473, line: 37, baseType: !28, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !480, file: !473, line: 38, baseType: !260, size: 64, align: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !473, line: 39, baseType: !485, size: 64, align: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !468, file: !1, line: 256, type: !471)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !468, file: !1, line: 256, type: !62)
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !468, file: !1, line: 256, type: !28)
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natom", arg: 4, scope: !468, file: !1, line: 256, type: !28)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 5, scope: !468, file: !1, line: 257, type: !232)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !468, file: !1, line: 257, type: !307)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bChange", arg: 7, scope: !468, file: !1, line: 257, type: !28)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomn", scope: !468, file: !1, line: 259, type: !239)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !468, file: !1, line: 260, type: !28)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !468, file: !1, line: 260, type: !28)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nc", scope: !468, file: !1, line: 261, type: !27)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "anr", scope: !468, file: !1, line: 262, type: !389)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "anm", scope: !468, file: !1, line: 262, type: !389)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "altloc", scope: !468, file: !1, line: 262, type: !27)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnm", scope: !468, file: !1, line: 262, type: !389)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chain", scope: !468, file: !1, line: 262, type: !389)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnr", scope: !468, file: !1, line: 262, type: !389)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xc", scope: !468, file: !1, line: 263, type: !389)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yc", scope: !468, file: !1, line: 263, type: !389)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zc", scope: !468, file: !1, line: 263, type: !389)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "occup", scope: !468, file: !1, line: 263, type: !389)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bfac", scope: !468, file: !1, line: 263, type: !389)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdbresnr", scope: !468, file: !1, line: 263, type: !389)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newres", scope: !468, file: !1, line: 265, type: !28)
!511 = !DISubprogram(name: "gromacs_name", scope: !1, file: !1, line: 68, type: !512, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, variables: !514)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !62}
!514 = !{!515, !516, !517, !518}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !511, file: !1, line: 68, type: !62)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !511, file: !1, line: 70, type: !28)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !511, file: !1, line: 70, type: !28)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !511, file: !1, line: 71, type: !27)
!519 = !DISubprogram(name: "read_anisou", scope: !1, file: !1, line: 214, type: !520, isLocal: true, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, variables: !522)
