; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pme.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_fftgrid = type { float*, float*, float*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_nsborder = type { i32, i32, i32, i32, i32, i32, i32, [256 x i32], [256 x i32], [256 x i32], [256 x i32] }
%struct.t_fft_c = type { float, float }
%struct.t_inputrec = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, float, [3 x [3 x float]], [3 x [3 x float]], i32, float, float, i32, float, float, i32, float, float, float, i32, float, float, i32, float, float, float, float, float, i32, i32, i32, float, float, float, i32, float, float, i32, i32, i32, i32, i32, float, i32, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, %struct.t_grpopts, [3 x %struct.t_cosines], [3 x %struct.t_cosines] }
%struct.t_grpopts = type { i32, i32, i32, i32, float*, float*, float*, [3 x float]*, [3 x i32]*, i32* }

!175 = !DISubprogram(name: "calc_recipbox", scope: !1, file: !1, line: 88, type: !176, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*, [3 x float]*)* @calc_recipbox, variables: !182)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 96, align: 32, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 3)
!182 = !{!183, !184, !185}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !175, file: !1, line: 88, type: !178)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "recipbox", arg: 2, scope: !175, file: !1, line: 88, type: !178)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !175, file: !1, line: 92, type: !153)
!186 = !DISubprogram(name: "calc_idx", scope: !1, file: !1, line: 106, type: !187, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x i32]*, i32, i32, i32, i32*, i32*, i32*)* @calc_idx, variables: !195)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !149, !178, !189, !189, !191, !149, !149, !149, !194, !194, !194}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !154, line: 101, baseType: !179)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !154, line: 107, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 96, align: 32, elements: !180)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 1, scope: !186, file: !1, line: 106, type: !149)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "recipbox", arg: 2, scope: !186, file: !1, line: 106, type: !178)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !186, file: !1, line: 107, type: !189)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fractx", arg: 4, scope: !186, file: !1, line: 107, type: !189)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 5, scope: !186, file: !1, line: 107, type: !191)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 6, scope: !186, file: !1, line: 107, type: !149)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 7, scope: !186, file: !1, line: 107, type: !149)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 8, scope: !186, file: !1, line: 107, type: !149)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnx", arg: 9, scope: !186, file: !1, line: 108, type: !194)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nny", arg: 10, scope: !186, file: !1, line: 108, type: !194)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnz", arg: 11, scope: !186, file: !1, line: 108, type: !194)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !186, file: !1, line: 110, type: !149)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idxptr", scope: !186, file: !1, line: 111, type: !194)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tix", scope: !186, file: !1, line: 111, type: !149)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tiy", scope: !186, file: !1, line: 111, type: !149)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tiz", scope: !186, file: !1, line: 111, type: !149)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xptr", scope: !186, file: !1, line: 112, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tx", scope: !186, file: !1, line: 112, type: !153)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ty", scope: !186, file: !1, line: 112, type: !153)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tz", scope: !186, file: !1, line: 112, type: !153)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rxx", scope: !186, file: !1, line: 113, type: !153)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ryx", scope: !186, file: !1, line: 113, type: !153)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ryy", scope: !186, file: !1, line: 113, type: !153)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzx", scope: !186, file: !1, line: 113, type: !153)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzy", scope: !186, file: !1, line: 113, type: !153)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzz", scope: !186, file: !1, line: 113, type: !153)
!223 = !DISubprogram(name: "sum_qgrid", scope: !1, file: !1, line: 168, type: !224, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_commrec*, %struct.t_nsborder*, %struct.t_fftgrid*, i32)* @sum_qgrid, variables: !272)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226, !237, !256, !149}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !228, line: 40, baseType: !229)
!228 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 36, size: 192, align: 32, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !229, file: !228, line: 37, baseType: !149, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !229, file: !228, line: 37, baseType: !149, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !229, file: !228, line: 38, baseType: !149, size: 32, align: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !229, file: !228, line: 38, baseType: !149, size: 32, align: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !229, file: !228, line: 39, baseType: !149, size: 32, align: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !229, file: !228, line: 39, baseType: !149, size: 32, align: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !239, line: 59, baseType: !240)
!239 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!240 = !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 36, size: 32992, align: 32, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !253, !254, !255}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !240, file: !239, line: 37, baseType: !149, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !240, file: !239, line: 38, baseType: !149, size: 32, align: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !240, file: !239, line: 39, baseType: !149, size: 32, align: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !240, file: !239, line: 40, baseType: !149, size: 32, align: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !240, file: !239, line: 41, baseType: !149, size: 32, align: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !240, file: !239, line: 43, baseType: !149, size: 32, align: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !240, file: !239, line: 43, baseType: !149, size: 32, align: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !240, file: !239, line: 50, baseType: !250, size: 8192, align: 32, offset: 224)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 8192, align: 32, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !240, file: !239, line: 51, baseType: !250, size: 8192, align: 32, offset: 8416)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !240, file: !239, line: 52, baseType: !250, size: 8192, align: 32, offset: 16608)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !240, file: !239, line: 55, baseType: !250, size: 8192, align: 32, offset: 24800)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fftgrid", file: !144, line: 86, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 71, size: 512, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !258, file: !144, line: 72, baseType: !151, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "localptr", scope: !258, file: !144, line: 73, baseType: !151, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "workspace", scope: !258, file: !144, line: 74, baseType: !151, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !258, file: !144, line: 75, baseType: !149, size: 32, align: 32, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !258, file: !144, line: 75, baseType: !149, size: 32, align: 32, offset: 224)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !258, file: !144, line: 75, baseType: !149, size: 32, align: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "la2r", scope: !258, file: !144, line: 75, baseType: !149, size: 32, align: 32, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "la2c", scope: !258, file: !144, line: 75, baseType: !149, size: 32, align: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "la12r", scope: !258, file: !144, line: 75, baseType: !149, size: 32, align: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "la12c", scope: !258, file: !144, line: 75, baseType: !149, size: 32, align: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nptr", scope: !258, file: !144, line: 76, baseType: !149, size: 32, align: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nxyz", scope: !258, file: !144, line: 76, baseType: !149, size: 32, align: 32, offset: 448)
!272 = !{!273, !274, !275, !276, !277}
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 1, scope: !223, file: !1, line: 168, type: !226)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 2, scope: !223, file: !1, line: 168, type: !237)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 3, scope: !223, file: !1, line: 168, type: !256)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bForward", arg: 4, scope: !223, file: !1, line: 168, type: !149)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !223, file: !1, line: 172, type: !149)
!278 = !DISubprogram(name: "spread_q_bsplines", scope: !1, file: !1, line: 211, type: !279, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_fftgrid*, [3 x i32]*, float*, float**, i32, i32, i32*, i32*, i32*)* @spread_q_bsplines, variables: !282)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !256, !191, !213, !281, !149, !149, !194, !194, !194}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !278, file: !1, line: 211, type: !256)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 2, scope: !278, file: !1, line: 211, type: !191)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 3, scope: !278, file: !1, line: 211, type: !213)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "theta", arg: 4, scope: !278, file: !1, line: 212, type: !281)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 5, scope: !278, file: !1, line: 212, type: !149)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 6, scope: !278, file: !1, line: 212, type: !149)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnx", arg: 7, scope: !278, file: !1, line: 213, type: !194)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nny", arg: 8, scope: !278, file: !1, line: 213, type: !194)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnz", arg: 9, scope: !278, file: !1, line: 213, type: !194)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !278, file: !1, line: 216, type: !151)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !278, file: !1, line: 217, type: !149)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !278, file: !1, line: 217, type: !149)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !278, file: !1, line: 217, type: !149)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !278, file: !1, line: 217, type: !149)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !278, file: !1, line: 217, type: !194)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !278, file: !1, line: 217, type: !194)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k0", scope: !278, file: !1, line: 217, type: !194)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii0", scope: !278, file: !1, line: 217, type: !194)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj0", scope: !278, file: !1, line: 217, type: !194)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk0", scope: !278, file: !1, line: 217, type: !194)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ithx", scope: !278, file: !1, line: 217, type: !149)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ithy", scope: !278, file: !1, line: 217, type: !149)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ithz", scope: !278, file: !1, line: 217, type: !149)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !278, file: !1, line: 218, type: !149)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !278, file: !1, line: 218, type: !149)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !278, file: !1, line: 218, type: !149)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la2", scope: !278, file: !1, line: 218, type: !149)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la12", scope: !278, file: !1, line: 218, type: !149)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xidx", scope: !278, file: !1, line: 218, type: !149)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yidx", scope: !278, file: !1, line: 218, type: !149)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zidx", scope: !278, file: !1, line: 218, type: !149)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norder", scope: !278, file: !1, line: 219, type: !149)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norder1", scope: !278, file: !1, line: 219, type: !149)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idxptr", scope: !278, file: !1, line: 219, type: !194)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ind0", scope: !278, file: !1, line: 219, type: !149)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valx", scope: !278, file: !1, line: 220, type: !153)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valxy", scope: !278, file: !1, line: 220, type: !153)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qn", scope: !278, file: !1, line: 220, type: !153)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thx", scope: !278, file: !1, line: 221, type: !213)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thy", scope: !278, file: !1, line: 221, type: !213)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thz", scope: !278, file: !1, line: 221, type: !213)
!324 = !DISubprogram(name: "solve_pme", scope: !1, file: !1, line: 276, type: !325, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.t_fftgrid*, float, float, float**, [3 x float]*, [3 x float]*, %struct.t_commrec*)* @solve_pme, variables: !327)
!325 = !DISubroutineType(types: !326)
!326 = !{!153, !256, !153, !153, !281, !178, !178, !226}
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !324, file: !1, line: 276, type: !256)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ewaldcoeff", arg: 2, scope: !324, file: !1, line: 276, type: !153)
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vol", arg: 3, scope: !324, file: !1, line: 276, type: !153)
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bsp_mod", arg: 4, scope: !324, file: !1, line: 277, type: !281)
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "recipbox", arg: 5, scope: !324, file: !1, line: 277, type: !178)
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vir", arg: 6, scope: !324, file: !1, line: 278, type: !178)
!334 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 7, scope: !324, file: !1, line: 278, type: !226)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !324, file: !1, line: 281, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fft_c", file: !144, line: 57, baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 55, size: 64, align: 32, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !338, file: !144, line: 56, baseType: !153, size: 32, align: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !338, file: !144, line: 56, baseType: !153, size: 32, align: 32, offset: 32)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p0", scope: !324, file: !1, line: 281, type: !336)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !324, file: !1, line: 282, type: !149)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !324, file: !1, line: 282, type: !149)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !324, file: !1, line: 282, type: !149)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la2", scope: !324, file: !1, line: 282, type: !149)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la12", scope: !324, file: !1, line: 282, type: !149)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kx", scope: !324, file: !1, line: 283, type: !149)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ky", scope: !324, file: !1, line: 283, type: !149)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kz", scope: !324, file: !1, line: 283, type: !149)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !324, file: !1, line: 283, type: !149)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx0", scope: !324, file: !1, line: 283, type: !149)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxkx", scope: !324, file: !1, line: 283, type: !149)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxky", scope: !324, file: !1, line: 283, type: !149)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxkz", scope: !324, file: !1, line: 283, type: !149)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kystart", scope: !324, file: !1, line: 283, type: !149)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kyend", scope: !324, file: !1, line: 283, type: !149)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m2", scope: !324, file: !1, line: 284, type: !153)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !324, file: !1, line: 284, type: !153)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "my", scope: !324, file: !1, line: 284, type: !153)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mz", scope: !324, file: !1, line: 284, type: !153)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !324, file: !1, line: 285, type: !153)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ets2", scope: !324, file: !1, line: 286, type: !153)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "struct2", scope: !324, file: !1, line: 286, type: !153)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vfactor", scope: !324, file: !1, line: 286, type: !153)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ets2vf", scope: !324, file: !1, line: 286, type: !153)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eterm", scope: !324, file: !1, line: 287, type: !153)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d1", scope: !324, file: !1, line: 287, type: !153)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d2", scope: !324, file: !1, line: 287, type: !153)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "energy", scope: !324, file: !1, line: 287, type: !153)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denom", scope: !324, file: !1, line: 288, type: !153)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx", scope: !324, file: !1, line: 289, type: !153)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by", scope: !324, file: !1, line: 289, type: !153)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mhx", scope: !324, file: !1, line: 290, type: !153)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mhy", scope: !324, file: !1, line: 290, type: !153)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mhz", scope: !324, file: !1, line: 290, type: !153)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "virxx", scope: !324, file: !1, line: 291, type: !153)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "virxy", scope: !324, file: !1, line: 291, type: !153)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "virxz", scope: !324, file: !1, line: 291, type: !153)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "viryy", scope: !324, file: !1, line: 291, type: !153)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "viryz", scope: !324, file: !1, line: 291, type: !153)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "virzz", scope: !324, file: !1, line: 291, type: !153)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bPar", scope: !324, file: !1, line: 292, type: !149)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rxx", scope: !324, file: !1, line: 293, type: !153)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ryx", scope: !324, file: !1, line: 293, type: !153)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ryy", scope: !324, file: !1, line: 293, type: !153)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzx", scope: !324, file: !1, line: 293, type: !153)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzy", scope: !324, file: !1, line: 293, type: !153)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzz", scope: !324, file: !1, line: 293, type: !153)
!390 = !DISubprogram(name: "gather_f_bsplines", scope: !1, file: !1, line: 396, type: !391, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_fftgrid*, [3 x float]*, [3 x i32]*, [3 x float]*, float*, float**, float**, i32, i32, i32*, i32*, i32*)* @gather_f_bsplines, variables: !393)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !256, !178, !191, !189, !213, !281, !281, !149, !149, !194, !194, !194}
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !390, file: !1, line: 396, type: !256)
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "recipbox", arg: 2, scope: !390, file: !1, line: 396, type: !178)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 3, scope: !390, file: !1, line: 397, type: !191)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 4, scope: !390, file: !1, line: 397, type: !189)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 5, scope: !390, file: !1, line: 397, type: !213)
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "theta", arg: 6, scope: !390, file: !1, line: 397, type: !281)
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dtheta", arg: 7, scope: !390, file: !1, line: 398, type: !281)
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 8, scope: !390, file: !1, line: 398, type: !149)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 9, scope: !390, file: !1, line: 398, type: !149)
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnx", arg: 10, scope: !390, file: !1, line: 399, type: !194)
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nny", arg: 11, scope: !390, file: !1, line: 399, type: !194)
!405 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnz", arg: 12, scope: !390, file: !1, line: 399, type: !194)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !390, file: !1, line: 402, type: !149)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !390, file: !1, line: 402, type: !149)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !390, file: !1, line: 402, type: !149)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !390, file: !1, line: 402, type: !149)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !390, file: !1, line: 402, type: !194)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !390, file: !1, line: 402, type: !194)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k0", scope: !390, file: !1, line: 402, type: !194)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii0", scope: !390, file: !1, line: 402, type: !194)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj0", scope: !390, file: !1, line: 402, type: !194)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk0", scope: !390, file: !1, line: 402, type: !194)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ithx", scope: !390, file: !1, line: 402, type: !149)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ithy", scope: !390, file: !1, line: 402, type: !149)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ithz", scope: !390, file: !1, line: 402, type: !149)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !390, file: !1, line: 403, type: !149)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !390, file: !1, line: 403, type: !149)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !390, file: !1, line: 403, type: !149)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la2", scope: !390, file: !1, line: 403, type: !149)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la12", scope: !390, file: !1, line: 403, type: !149)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !390, file: !1, line: 404, type: !151)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xidx", scope: !390, file: !1, line: 405, type: !149)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yidx", scope: !390, file: !1, line: 405, type: !149)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zidx", scope: !390, file: !1, line: 405, type: !149)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tx", scope: !390, file: !1, line: 406, type: !153)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ty", scope: !390, file: !1, line: 406, type: !153)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !390, file: !1, line: 406, type: !153)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !390, file: !1, line: 406, type: !153)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qn", scope: !390, file: !1, line: 406, type: !153)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fx", scope: !390, file: !1, line: 407, type: !153)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fy", scope: !390, file: !1, line: 407, type: !153)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fz", scope: !390, file: !1, line: 407, type: !153)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gval", scope: !390, file: !1, line: 407, type: !153)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tgz", scope: !390, file: !1, line: 407, type: !153)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dgz", scope: !390, file: !1, line: 407, type: !153)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gval1", scope: !390, file: !1, line: 408, type: !153)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gval2", scope: !390, file: !1, line: 408, type: !153)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gval3", scope: !390, file: !1, line: 408, type: !153)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gval4", scope: !390, file: !1, line: 408, type: !153)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fxy1", scope: !390, file: !1, line: 409, type: !153)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fz1", scope: !390, file: !1, line: 409, type: !153)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thx", scope: !390, file: !1, line: 410, type: !213)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thy", scope: !390, file: !1, line: 410, type: !213)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thz", scope: !390, file: !1, line: 410, type: !213)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dthx", scope: !390, file: !1, line: 410, type: !213)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dthy", scope: !390, file: !1, line: 410, type: !213)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dthz", scope: !390, file: !1, line: 410, type: !213)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sn", scope: !390, file: !1, line: 411, type: !149)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norder", scope: !390, file: !1, line: 411, type: !149)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norder1", scope: !390, file: !1, line: 411, type: !149)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idxptr", scope: !390, file: !1, line: 411, type: !194)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ind0", scope: !390, file: !1, line: 411, type: !149)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rxx", scope: !390, file: !1, line: 412, type: !153)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ryx", scope: !390, file: !1, line: 412, type: !153)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ryy", scope: !390, file: !1, line: 412, type: !153)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzx", scope: !390, file: !1, line: 412, type: !153)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzy", scope: !390, file: !1, line: 412, type: !153)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzz", scope: !390, file: !1, line: 412, type: !153)
!462 = !DISubprogram(name: "make_bsplines", scope: !1, file: !1, line: 540, type: !463, isLocal: false, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: true, function: void (float**, float**, i32, i32, i32, i32, [3 x float]*, [3 x i32]*, float*, i32)* @make_bsplines, variables: !465)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !281, !281, !149, !149, !149, !149, !189, !191, !213, !149}
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "theta", arg: 1, scope: !462, file: !1, line: 540, type: !281)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dtheta", arg: 2, scope: !462, file: !1, line: 540, type: !281)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 3, scope: !462, file: !1, line: 540, type: !149)
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 4, scope: !462, file: !1, line: 540, type: !149)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 5, scope: !462, file: !1, line: 540, type: !149)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 6, scope: !462, file: !1, line: 541, type: !149)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fractx", arg: 7, scope: !462, file: !1, line: 541, type: !189)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 8, scope: !462, file: !1, line: 541, type: !191)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 9, scope: !462, file: !1, line: 541, type: !213)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 10, scope: !462, file: !1, line: 541, type: !149)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !462, file: !1, line: 544, type: !149)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !462, file: !1, line: 544, type: !149)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !462, file: !1, line: 544, type: !149)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !462, file: !1, line: 544, type: !149)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !462, file: !1, line: 545, type: !153)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "div", scope: !462, file: !1, line: 545, type: !153)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rcons", scope: !462, file: !1, line: 545, type: !153)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !462, file: !1, line: 546, type: !213)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ddata", scope: !462, file: !1, line: 546, type: !213)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xptr", scope: !462, file: !1, line: 546, type: !213)
!486 = !DISubprogram(name: "make_dft_mod", scope: !1, file: !1, line: 586, type: !487, isLocal: false, isDefinition: true, scopeLine: 587, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, float*, i32)* @make_dft_mod, variables: !489)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !213, !213, !149}
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !486, file: !1, line: 586, type: !213)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !486, file: !1, line: 586, type: !213)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndata", arg: 3, scope: !486, file: !1, line: 586, type: !149)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !486, file: !1, line: 588, type: !149)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !486, file: !1, line: 588, type: !149)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !486, file: !1, line: 589, type: !153)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ss", scope: !486, file: !1, line: 589, type: !153)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !486, file: !1, line: 589, type: !153)
!498 = !DISubprogram(name: "make_bspline_moduli", scope: !1, file: !1, line: 607, type: !499, isLocal: false, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: true, function: void (float**, i32, i32, i32, i32)* @make_bspline_moduli, variables: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !281, !149, !149, !149, !149}
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bsp_mod", arg: 1, scope: !498, file: !1, line: 607, type: !281)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !498, file: !1, line: 607, type: !149)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !498, file: !1, line: 607, type: !149)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !498, file: !1, line: 607, type: !149)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 5, scope: !498, file: !1, line: 607, type: !149)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmax", scope: !498, file: !1, line: 609, type: !149)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !498, file: !1, line: 610, type: !213)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ddata", scope: !498, file: !1, line: 610, type: !213)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bsp_data", scope: !498, file: !1, line: 610, type: !213)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !498, file: !1, line: 611, type: !149)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !498, file: !1, line: 611, type: !149)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !498, file: !1, line: 611, type: !149)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "div", scope: !498, file: !1, line: 612, type: !153)
!515 = !DISubprogram(name: "init_pme", scope: !1, file: !1, line: 667, type: !516, isLocal: false, isDefinition: true, scopeLine: 670, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, i32, i32, i32, i32, i32, i32, i32)* @init_pme, variables: !577)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !518, !226, !149, !149, !149, !149, !149, !149, !149}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !520, line: 153, baseType: !521)
!520 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !520, line: 122, size: 1216, align: 64, elements: !522)
!522 = !{!523, !526, !527, !528, !530, !531, !536, !537, !539, !543, !547, !557, !563, !564, !567, !568, !570, !574, !575, !576}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !521, file: !520, line: 123, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !521, file: !520, line: 124, baseType: !149, size: 32, align: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !521, file: !520, line: 125, baseType: !149, size: 32, align: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !521, file: !520, line: 126, baseType: !529, size: 16, align: 16, offset: 128)
!529 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !521, file: !520, line: 127, baseType: !529, size: 16, align: 16, offset: 144)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !521, file: !520, line: 128, baseType: !532, size: 128, align: 64, offset: 192)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !520, line: 88, size: 128, align: 64, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !532, file: !520, line: 89, baseType: !524, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !532, file: !520, line: 90, baseType: !149, size: 32, align: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !521, file: !520, line: 129, baseType: !149, size: 32, align: 32, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !521, file: !520, line: 132, baseType: !538, size: 64, align: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !521, file: !520, line: 133, baseType: !540, size: 64, align: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!149, !538}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !521, file: !520, line: 134, baseType: !544, size: 64, align: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!149, !538, !166, !149}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !521, file: !520, line: 135, baseType: !548, size: 64, align: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !538, !551, !149}
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !520, line: 77, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !553, line: 71, baseType: !554)
!553 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !555, line: 46, baseType: !556)
!555 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!556 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !521, file: !520, line: 136, baseType: !558, size: 64, align: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!149, !538, !561, !149}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !521, file: !520, line: 139, baseType: !532, size: 128, align: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !521, file: !520, line: 140, baseType: !565, size: 64, align: 64, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !520, line: 94, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !521, file: !520, line: 141, baseType: !149, size: 32, align: 32, offset: 896)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !521, file: !520, line: 144, baseType: !569, size: 24, align: 8, offset: 928)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 24, align: 8, elements: !180)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !521, file: !520, line: 145, baseType: !571, size: 8, align: 8, offset: 952)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 8, align: 8, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 1)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !521, file: !520, line: 148, baseType: !532, size: 128, align: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !521, file: !520, line: 151, baseType: !149, size: 32, align: 32, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !521, file: !520, line: 152, baseType: !551, size: 64, align: 64, offset: 1152)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !515, file: !1, line: 667, type: !518)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !515, file: !1, line: 667, type: !226)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nkx", arg: 3, scope: !515, file: !1, line: 668, type: !149)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nky", arg: 4, scope: !515, file: !1, line: 668, type: !149)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nkz", arg: 5, scope: !515, file: !1, line: 668, type: !149)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pme_order", arg: 6, scope: !515, file: !1, line: 668, type: !149)
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 7, scope: !515, file: !1, line: 668, type: !149)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOptFFT", arg: 8, scope: !515, file: !1, line: 669, type: !149)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ewald_geometry", arg: 9, scope: !515, file: !1, line: 669, type: !149)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !515, file: !1, line: 671, type: !149)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bPar", scope: !515, file: !1, line: 672, type: !149)
!589 = !DISubprogram(name: "spread_on_grid", scope: !1, file: !1, line: 719, type: !590, isLocal: false, isDefinition: true, scopeLine: 723, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_fftgrid* (%struct.__sFILE*, i32, i32, [3 x float]*, float*, [3 x float]*, i32)* @spread_on_grid, variables: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{!256, !518, !149, !149, !189, !213, !178, !149}
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "logfile", arg: 1, scope: !589, file: !1, line: 719, type: !518)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 2, scope: !589, file: !1, line: 719, type: !149)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pme_order", arg: 3, scope: !589, file: !1, line: 720, type: !149)
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !589, file: !1, line: 720, type: !189)
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 5, scope: !589, file: !1, line: 721, type: !213)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !589, file: !1, line: 721, type: !178)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bGatherOnly", arg: 7, scope: !589, file: !1, line: 722, type: !149)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !589, file: !1, line: 724, type: !149)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !589, file: !1, line: 724, type: !149)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !589, file: !1, line: 724, type: !149)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la2", scope: !589, file: !1, line: 724, type: !149)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la12", scope: !589, file: !1, line: 724, type: !149)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !589, file: !1, line: 725, type: !151)
!606 = !DISubprogram(name: "do_pme", scope: !1, file: !1, line: 746, type: !607, isLocal: false, isDefinition: true, scopeLine: 753, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, %struct.t_inputrec*, [3 x float]*, [3 x float]*, float*, [3 x float]*, %struct.t_commrec*, %struct.t_nsborder*, %struct.t_nrnb*, [3 x float]*, float, i32)* @do_pme, variables: !729)
!607 = !DISubroutineType(types: !608)
!608 = !{!153, !518, !149, !609, !189, !189, !213, !178, !226, !237, !720, !178, !153, !149}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !611, line: 143, baseType: !612)
!611 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!612 = !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 55, size: 4736, align: 64, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !711, !719}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !612, file: !611, line: 56, baseType: !149, size: 32, align: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !612, file: !611, line: 57, baseType: !149, size: 32, align: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !612, file: !611, line: 58, baseType: !149, size: 32, align: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !612, file: !611, line: 59, baseType: !149, size: 32, align: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !612, file: !611, line: 60, baseType: !149, size: 32, align: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !612, file: !611, line: 61, baseType: !149, size: 32, align: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !612, file: !611, line: 62, baseType: !149, size: 32, align: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !612, file: !611, line: 63, baseType: !149, size: 32, align: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !612, file: !611, line: 65, baseType: !149, size: 32, align: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !612, file: !611, line: 66, baseType: !149, size: 32, align: 32, offset: 288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !612, file: !611, line: 67, baseType: !149, size: 32, align: 32, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !612, file: !611, line: 68, baseType: !149, size: 32, align: 32, offset: 352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !612, file: !611, line: 69, baseType: !149, size: 32, align: 32, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !612, file: !611, line: 70, baseType: !149, size: 32, align: 32, offset: 416)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !612, file: !611, line: 71, baseType: !153, size: 32, align: 32, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !612, file: !611, line: 72, baseType: !153, size: 32, align: 32, offset: 480)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !612, file: !611, line: 73, baseType: !153, size: 32, align: 32, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !612, file: !611, line: 74, baseType: !149, size: 32, align: 32, offset: 544)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !612, file: !611, line: 74, baseType: !149, size: 32, align: 32, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !612, file: !611, line: 74, baseType: !149, size: 32, align: 32, offset: 608)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !612, file: !611, line: 76, baseType: !149, size: 32, align: 32, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !612, file: !611, line: 77, baseType: !153, size: 32, align: 32, offset: 672)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !612, file: !611, line: 79, baseType: !149, size: 32, align: 32, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !612, file: !611, line: 80, baseType: !149, size: 32, align: 32, offset: 736)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !612, file: !611, line: 81, baseType: !149, size: 32, align: 32, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !612, file: !611, line: 82, baseType: !149, size: 32, align: 32, offset: 800)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !612, file: !611, line: 83, baseType: !149, size: 32, align: 32, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !612, file: !611, line: 84, baseType: !149, size: 32, align: 32, offset: 864)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !612, file: !611, line: 85, baseType: !149, size: 32, align: 32, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !612, file: !611, line: 86, baseType: !149, size: 32, align: 32, offset: 928)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !612, file: !611, line: 87, baseType: !153, size: 32, align: 32, offset: 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !612, file: !611, line: 88, baseType: !646, size: 288, align: 32, offset: 992)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !154, line: 105, baseType: !647)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 288, align: 32, elements: !648)
!648 = !{!181, !181}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !612, file: !611, line: 89, baseType: !646, size: 288, align: 32, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !612, file: !611, line: 90, baseType: !149, size: 32, align: 32, offset: 1568)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !612, file: !611, line: 91, baseType: !153, size: 32, align: 32, offset: 1600)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !612, file: !611, line: 92, baseType: !153, size: 32, align: 32, offset: 1632)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !612, file: !611, line: 93, baseType: !149, size: 32, align: 32, offset: 1664)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !612, file: !611, line: 94, baseType: !153, size: 32, align: 32, offset: 1696)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !612, file: !611, line: 95, baseType: !153, size: 32, align: 32, offset: 1728)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !612, file: !611, line: 96, baseType: !149, size: 32, align: 32, offset: 1760)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !612, file: !611, line: 97, baseType: !153, size: 32, align: 32, offset: 1792)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !612, file: !611, line: 98, baseType: !153, size: 32, align: 32, offset: 1824)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !612, file: !611, line: 99, baseType: !153, size: 32, align: 32, offset: 1856)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !612, file: !611, line: 100, baseType: !149, size: 32, align: 32, offset: 1888)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !612, file: !611, line: 101, baseType: !153, size: 32, align: 32, offset: 1920)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !612, file: !611, line: 102, baseType: !153, size: 32, align: 32, offset: 1952)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !612, file: !611, line: 103, baseType: !149, size: 32, align: 32, offset: 1984)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !612, file: !611, line: 104, baseType: !153, size: 32, align: 32, offset: 2016)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !612, file: !611, line: 105, baseType: !153, size: 32, align: 32, offset: 2048)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !612, file: !611, line: 106, baseType: !153, size: 32, align: 32, offset: 2080)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !612, file: !611, line: 107, baseType: !153, size: 32, align: 32, offset: 2112)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !612, file: !611, line: 108, baseType: !153, size: 32, align: 32, offset: 2144)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !612, file: !611, line: 109, baseType: !149, size: 32, align: 32, offset: 2176)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !612, file: !611, line: 110, baseType: !149, size: 32, align: 32, offset: 2208)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !612, file: !611, line: 111, baseType: !149, size: 32, align: 32, offset: 2240)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !612, file: !611, line: 112, baseType: !153, size: 32, align: 32, offset: 2272)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !612, file: !611, line: 113, baseType: !153, size: 32, align: 32, offset: 2304)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !612, file: !611, line: 114, baseType: !153, size: 32, align: 32, offset: 2336)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !612, file: !611, line: 115, baseType: !149, size: 32, align: 32, offset: 2368)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !612, file: !611, line: 116, baseType: !153, size: 32, align: 32, offset: 2400)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !612, file: !611, line: 117, baseType: !153, size: 32, align: 32, offset: 2432)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !612, file: !611, line: 118, baseType: !149, size: 32, align: 32, offset: 2464)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !612, file: !611, line: 120, baseType: !149, size: 32, align: 32, offset: 2496)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !612, file: !611, line: 122, baseType: !149, size: 32, align: 32, offset: 2528)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !612, file: !611, line: 124, baseType: !149, size: 32, align: 32, offset: 2560)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !612, file: !611, line: 125, baseType: !149, size: 32, align: 32, offset: 2592)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !612, file: !611, line: 126, baseType: !153, size: 32, align: 32, offset: 2624)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !612, file: !611, line: 127, baseType: !149, size: 32, align: 32, offset: 2656)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !612, file: !611, line: 128, baseType: !153, size: 32, align: 32, offset: 2688)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !612, file: !611, line: 129, baseType: !153, size: 32, align: 32, offset: 2720)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !612, file: !611, line: 130, baseType: !149, size: 32, align: 32, offset: 2752)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !612, file: !611, line: 131, baseType: !153, size: 32, align: 32, offset: 2784)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !612, file: !611, line: 132, baseType: !149, size: 32, align: 32, offset: 2816)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !612, file: !611, line: 133, baseType: !149, size: 32, align: 32, offset: 2848)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !612, file: !611, line: 134, baseType: !149, size: 32, align: 32, offset: 2880)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !612, file: !611, line: 135, baseType: !149, size: 32, align: 32, offset: 2912)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !612, file: !611, line: 136, baseType: !153, size: 32, align: 32, offset: 2944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !612, file: !611, line: 137, baseType: !153, size: 32, align: 32, offset: 2976)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !612, file: !611, line: 138, baseType: !153, size: 32, align: 32, offset: 3008)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !612, file: !611, line: 139, baseType: !153, size: 32, align: 32, offset: 3040)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !612, file: !611, line: 140, baseType: !698, size: 512, align: 64, offset: 3072)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !611, line: 53, baseType: !699)
!699 = !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 42, size: 512, align: 64, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !699, file: !611, line: 43, baseType: !149, size: 32, align: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !699, file: !611, line: 44, baseType: !149, size: 32, align: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !699, file: !611, line: 45, baseType: !149, size: 32, align: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !699, file: !611, line: 46, baseType: !149, size: 32, align: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !699, file: !611, line: 47, baseType: !213, size: 64, align: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !699, file: !611, line: 48, baseType: !213, size: 64, align: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !699, file: !611, line: 49, baseType: !213, size: 64, align: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !699, file: !611, line: 50, baseType: !189, size: 64, align: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !699, file: !611, line: 51, baseType: !191, size: 64, align: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !699, file: !611, line: 52, baseType: !194, size: 64, align: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !612, file: !611, line: 141, baseType: !712, size: 576, align: 64, offset: 3584)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 576, align: 64, elements: !180)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !611, line: 40, baseType: !714)
!714 = !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 36, size: 192, align: 64, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !714, file: !611, line: 37, baseType: !149, size: 32, align: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !714, file: !611, line: 38, baseType: !213, size: 64, align: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !714, file: !611, line: 39, baseType: !213, size: 64, align: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !612, file: !611, line: 142, baseType: !712, size: 576, align: 64, offset: 4160)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !10, line: 95, baseType: !722)
!722 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 93, size: 8256, align: 64, elements: !723)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !722, file: !10, line: 94, baseType: !725, size: 8256, align: 64)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 8256, align: 64, elements: !727)
!726 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!727 = !{!728}
!728 = !DISubrange(count: 129)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "logfile", arg: 1, scope: !606, file: !1, line: 746, type: !518)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !606, file: !1, line: 746, type: !149)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 3, scope: !606, file: !1, line: 747, type: !609)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !606, file: !1, line: 747, type: !189)
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !606, file: !1, line: 748, type: !189)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 6, scope: !606, file: !1, line: 748, type: !213)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !606, file: !1, line: 749, type: !178)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 8, scope: !606, file: !1, line: 749, type: !226)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 9, scope: !606, file: !1, line: 750, type: !237)
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 10, scope: !606, file: !1, line: 750, type: !720)
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vir", arg: 11, scope: !606, file: !1, line: 751, type: !178)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ewaldcoeff", arg: 12, scope: !606, file: !1, line: 751, type: !153)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bGatherOnly", arg: 13, scope: !606, file: !1, line: 752, type: !149)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !606, file: !1, line: 755, type: !149)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntot", scope: !606, file: !1, line: 755, type: !149)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npme", scope: !606, file: !1, line: 755, type: !149)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !606, file: !1, line: 756, type: !149)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !606, file: !1, line: 756, type: !149)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !606, file: !1, line: 756, type: !149)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la12", scope: !606, file: !1, line: 756, type: !149)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la2", scope: !606, file: !1, line: 756, type: !149)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !606, file: !1, line: 757, type: !151)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vol", scope: !606, file: !1, line: 758, type: !153)
!753 = !DISubprogram(name: "det", scope: !754, file: !754, line: 478, type: !755, isLocal: true, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, variables: !757)
!754 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!755 = !DISubroutineType(types: !756)
