; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/poisson.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_PSgrid = type { i32, i32, i32, float*** }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_inputrec = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, float, [3 x [3 x float]], [3 x [3 x float]], i32, float, float, i32, float, float, i32, float, float, float, i32, float, float, i32, float, float, float, float, float, i32, i32, i32, float, float, float, i32, float, float, i32, i32, i32, i32, i32, float, i32, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, %struct.t_grpopts, [3 x %struct.t_cosines], [3 x %struct.t_cosines] }
%struct.t_grpopts = type { i32, i32, i32, i32, float*, float*, float*, [3 x float]*, [3 x i32]*, i32* }
%struct.t_cosines = type { i32, float*, float* }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_nrnb = type { [129 x double] }

@.str = private unnamed_addr constant [3 x i8] c"ps\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !375, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/poisson.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{!7, !75, !81, !106, !117, !131, !143, !163, !175, !332, !369}
!7 = !DISubprogram(name: "__sputc", scope: !8, file: !8, line: 348, type: !9, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DISubroutineType(types: !10)
!10 = !{!5, !5, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !8, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !8, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !8, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !8, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !8, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !8, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !8, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !8, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !8, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !8, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !8, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !8, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !8, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!5, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !8, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!5, !30, !39, !5}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !8, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !5}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !8, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !8, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!5, !30, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !8, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !8, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !8, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !8, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !8, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !8, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !8, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !8, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !8, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !7, file: !8, line: 348, type: !5)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !7, file: !8, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!5, !5}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !5)
!81 = !DISubprogram(name: "mk_PSgrid", scope: !1, file: !1, line: 44, type: !82, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_PSgrid* (i32, i32, i32)* @mk_PSgrid, variables: !99)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !5, !5, !5}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_PSgrid", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/poisson.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!87 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 43, size: 192, align: 64, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !87, file: !86, line: 44, baseType: !5, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !87, file: !86, line: 44, baseType: !5, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !87, file: !86, line: 44, baseType: !5, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !87, file: !86, line: 45, baseType: !93, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !97, line: 87, baseType: !98)
!97 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!98 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!99 = !{!100, !101, !102, !103, !104, !105}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !81, file: !1, line: 44, type: !5)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !81, file: !1, line: 44, type: !5)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 3, scope: !81, file: !1, line: 44, type: !5)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !81, file: !1, line: 46, type: !84)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !81, file: !1, line: 47, type: !5)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !81, file: !1, line: 47, type: !5)
!106 = !DISubprogram(name: "unpack_PSgrid", scope: !1, file: !1, line: 62, type: !107, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_PSgrid*, i32*, i32*, i32*, float****)* @unpack_PSgrid, variables: !111)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !84, !109, !109, !109, !110}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!111 = !{!112, !113, !114, !115, !116}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !106, file: !1, line: 62, type: !84)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !106, file: !1, line: 62, type: !109)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !106, file: !1, line: 62, type: !109)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !106, file: !1, line: 62, type: !109)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 5, scope: !106, file: !1, line: 62, type: !110)
!117 = !DISubprogram(name: "copy_PSgrid", scope: !1, file: !1, line: 70, type: !118, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_PSgrid*, %struct.t_PSgrid*)* @copy_PSgrid, variables: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !84, !84}
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !117, file: !1, line: 70, type: !84)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !117, file: !1, line: 70, type: !84)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !117, file: !1, line: 72, type: !5)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !117, file: !1, line: 72, type: !5)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !117, file: !1, line: 72, type: !5)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !117, file: !1, line: 73, type: !5)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !117, file: !1, line: 73, type: !5)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !117, file: !1, line: 73, type: !5)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src_ptr", scope: !117, file: !1, line: 74, type: !93)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dst_ptr", scope: !117, file: !1, line: 74, type: !93)
!131 = !DISubprogram(name: "clear_PSgrid", scope: !1, file: !1, line: 85, type: !132, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_PSgrid*)* @clear_PSgrid, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !84}
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !131, file: !1, line: 85, type: !84)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !131, file: !1, line: 87, type: !5)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !131, file: !1, line: 87, type: !5)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !131, file: !1, line: 87, type: !5)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !131, file: !1, line: 88, type: !5)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !131, file: !1, line: 88, type: !5)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !131, file: !1, line: 88, type: !5)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !131, file: !1, line: 89, type: !93)
!143 = !DISubprogram(name: "symmetrize_PSgrid", scope: !1, file: !1, line: 99, type: !144, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_PSgrid*, float)* @symmetrize_PSgrid, variables: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !11, !84, !96}
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !162}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !143, file: !1, line: 99, type: !11)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 2, scope: !143, file: !1, line: 99, type: !84)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sum", arg: 3, scope: !143, file: !1, line: 99, type: !96)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !143, file: !1, line: 101, type: !5)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !143, file: !1, line: 101, type: !5)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !143, file: !1, line: 101, type: !5)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !143, file: !1, line: 102, type: !5)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !143, file: !1, line: 102, type: !5)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !143, file: !1, line: 102, type: !5)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !143, file: !1, line: 103, type: !93)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ming", scope: !143, file: !1, line: 104, type: !96)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxg", scope: !143, file: !1, line: 104, type: !96)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imin", scope: !143, file: !1, line: 105, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !97, line: 107, baseType: !161)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, align: 32, elements: !63)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imax", scope: !143, file: !1, line: 105, type: !160)
!163 = !DISubprogram(name: "calc_nxyz", scope: !1, file: !1, line: 143, type: !164, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32**, i32**, i32**)* @calc_nxyz, variables: !167)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !5, !5, !5, !166, !166, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!167 = !{!168, !169, !170, !171, !172, !173, !174}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !163, file: !1, line: 143, type: !5)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !163, file: !1, line: 143, type: !5)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 3, scope: !163, file: !1, line: 143, type: !5)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnx", arg: 4, scope: !163, file: !1, line: 144, type: !166)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nny", arg: 5, scope: !163, file: !1, line: 144, type: !166)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnz", arg: 6, scope: !163, file: !1, line: 144, type: !166)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !163, file: !1, line: 146, type: !5)
!175 = !DISubprogram(name: "do_poisson", scope: !1, file: !1, line: 159, type: !176, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, %struct.t_inputrec*, i32, [3 x float]*, [3 x float]*, float*, float*, float*, %struct.t_commrec*, %struct.t_nrnb*, i32*, i32)* @do_poisson, variables: !314)
!176 = !DISubroutineType(types: !177)
!177 = !{!96, !11, !5, !178, !5, !278, !278, !95, !95, !95, !293, !304, !109, !5}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !180, line: 143, baseType: !181)
!180 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 55, size: 4736, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !284, !292}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !181, file: !180, line: 56, baseType: !5, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !181, file: !180, line: 57, baseType: !5, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !181, file: !180, line: 58, baseType: !5, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !181, file: !180, line: 59, baseType: !5, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !181, file: !180, line: 60, baseType: !5, size: 32, align: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !181, file: !180, line: 61, baseType: !5, size: 32, align: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !181, file: !180, line: 62, baseType: !5, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !181, file: !180, line: 63, baseType: !5, size: 32, align: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !181, file: !180, line: 65, baseType: !5, size: 32, align: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !181, file: !180, line: 66, baseType: !5, size: 32, align: 32, offset: 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !181, file: !180, line: 67, baseType: !5, size: 32, align: 32, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !181, file: !180, line: 68, baseType: !5, size: 32, align: 32, offset: 352)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !181, file: !180, line: 69, baseType: !5, size: 32, align: 32, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !181, file: !180, line: 70, baseType: !5, size: 32, align: 32, offset: 416)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !181, file: !180, line: 71, baseType: !96, size: 32, align: 32, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !181, file: !180, line: 72, baseType: !96, size: 32, align: 32, offset: 480)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !181, file: !180, line: 73, baseType: !96, size: 32, align: 32, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !181, file: !180, line: 74, baseType: !5, size: 32, align: 32, offset: 544)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !181, file: !180, line: 74, baseType: !5, size: 32, align: 32, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !181, file: !180, line: 74, baseType: !5, size: 32, align: 32, offset: 608)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !181, file: !180, line: 76, baseType: !5, size: 32, align: 32, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !181, file: !180, line: 77, baseType: !96, size: 32, align: 32, offset: 672)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !181, file: !180, line: 79, baseType: !5, size: 32, align: 32, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !181, file: !180, line: 80, baseType: !5, size: 32, align: 32, offset: 736)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !181, file: !180, line: 81, baseType: !5, size: 32, align: 32, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !181, file: !180, line: 82, baseType: !5, size: 32, align: 32, offset: 800)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !181, file: !180, line: 83, baseType: !5, size: 32, align: 32, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !181, file: !180, line: 84, baseType: !5, size: 32, align: 32, offset: 864)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !181, file: !180, line: 85, baseType: !5, size: 32, align: 32, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !181, file: !180, line: 86, baseType: !5, size: 32, align: 32, offset: 928)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !181, file: !180, line: 87, baseType: !96, size: 32, align: 32, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !181, file: !180, line: 88, baseType: !215, size: 288, align: 32, offset: 992)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !97, line: 105, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 288, align: 32, elements: !217)
!217 = !{!64, !64}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !181, file: !180, line: 89, baseType: !215, size: 288, align: 32, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !181, file: !180, line: 90, baseType: !5, size: 32, align: 32, offset: 1568)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !181, file: !180, line: 91, baseType: !96, size: 32, align: 32, offset: 1600)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !181, file: !180, line: 92, baseType: !96, size: 32, align: 32, offset: 1632)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !181, file: !180, line: 93, baseType: !5, size: 32, align: 32, offset: 1664)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !181, file: !180, line: 94, baseType: !96, size: 32, align: 32, offset: 1696)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !181, file: !180, line: 95, baseType: !96, size: 32, align: 32, offset: 1728)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !181, file: !180, line: 96, baseType: !5, size: 32, align: 32, offset: 1760)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !181, file: !180, line: 97, baseType: !96, size: 32, align: 32, offset: 1792)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !181, file: !180, line: 98, baseType: !96, size: 32, align: 32, offset: 1824)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !181, file: !180, line: 99, baseType: !96, size: 32, align: 32, offset: 1856)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !181, file: !180, line: 100, baseType: !5, size: 32, align: 32, offset: 1888)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !181, file: !180, line: 101, baseType: !96, size: 32, align: 32, offset: 1920)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !181, file: !180, line: 102, baseType: !96, size: 32, align: 32, offset: 1952)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !181, file: !180, line: 103, baseType: !5, size: 32, align: 32, offset: 1984)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !181, file: !180, line: 104, baseType: !96, size: 32, align: 32, offset: 2016)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !181, file: !180, line: 105, baseType: !96, size: 32, align: 32, offset: 2048)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !181, file: !180, line: 106, baseType: !96, size: 32, align: 32, offset: 2080)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !181, file: !180, line: 107, baseType: !96, size: 32, align: 32, offset: 2112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !181, file: !180, line: 108, baseType: !96, size: 32, align: 32, offset: 2144)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !181, file: !180, line: 109, baseType: !5, size: 32, align: 32, offset: 2176)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !181, file: !180, line: 110, baseType: !5, size: 32, align: 32, offset: 2208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !181, file: !180, line: 111, baseType: !5, size: 32, align: 32, offset: 2240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !181, file: !180, line: 112, baseType: !96, size: 32, align: 32, offset: 2272)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !181, file: !180, line: 113, baseType: !96, size: 32, align: 32, offset: 2304)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !181, file: !180, line: 114, baseType: !96, size: 32, align: 32, offset: 2336)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !181, file: !180, line: 115, baseType: !5, size: 32, align: 32, offset: 2368)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !181, file: !180, line: 116, baseType: !96, size: 32, align: 32, offset: 2400)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !181, file: !180, line: 117, baseType: !96, size: 32, align: 32, offset: 2432)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !181, file: !180, line: 118, baseType: !5, size: 32, align: 32, offset: 2464)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !181, file: !180, line: 120, baseType: !5, size: 32, align: 32, offset: 2496)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !181, file: !180, line: 122, baseType: !5, size: 32, align: 32, offset: 2528)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !181, file: !180, line: 124, baseType: !5, size: 32, align: 32, offset: 2560)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !181, file: !180, line: 125, baseType: !5, size: 32, align: 32, offset: 2592)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !181, file: !180, line: 126, baseType: !96, size: 32, align: 32, offset: 2624)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !181, file: !180, line: 127, baseType: !5, size: 32, align: 32, offset: 2656)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !181, file: !180, line: 128, baseType: !96, size: 32, align: 32, offset: 2688)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !181, file: !180, line: 129, baseType: !96, size: 32, align: 32, offset: 2720)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !181, file: !180, line: 130, baseType: !5, size: 32, align: 32, offset: 2752)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !181, file: !180, line: 131, baseType: !96, size: 32, align: 32, offset: 2784)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !181, file: !180, line: 132, baseType: !5, size: 32, align: 32, offset: 2816)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !181, file: !180, line: 133, baseType: !5, size: 32, align: 32, offset: 2848)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !181, file: !180, line: 134, baseType: !5, size: 32, align: 32, offset: 2880)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !181, file: !180, line: 135, baseType: !5, size: 32, align: 32, offset: 2912)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !181, file: !180, line: 136, baseType: !96, size: 32, align: 32, offset: 2944)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !181, file: !180, line: 137, baseType: !96, size: 32, align: 32, offset: 2976)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !181, file: !180, line: 138, baseType: !96, size: 32, align: 32, offset: 3008)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !181, file: !180, line: 139, baseType: !96, size: 32, align: 32, offset: 3040)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !181, file: !180, line: 140, baseType: !267, size: 512, align: 64, offset: 3072)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !180, line: 53, baseType: !268)
!268 = !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 42, size: 512, align: 64, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !281, !283}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !268, file: !180, line: 43, baseType: !5, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !268, file: !180, line: 44, baseType: !5, size: 32, align: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !268, file: !180, line: 45, baseType: !5, size: 32, align: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !268, file: !180, line: 46, baseType: !5, size: 32, align: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !268, file: !180, line: 47, baseType: !95, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !268, file: !180, line: 48, baseType: !95, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !268, file: !180, line: 49, baseType: !95, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !268, file: !180, line: 50, baseType: !278, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !97, line: 101, baseType: !280)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 96, align: 32, elements: !63)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !268, file: !180, line: 51, baseType: !282, size: 64, align: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !268, file: !180, line: 52, baseType: !109, size: 64, align: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !181, file: !180, line: 141, baseType: !285, size: 576, align: 64, offset: 3584)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 576, align: 64, elements: !63)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !180, line: 40, baseType: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 36, size: 192, align: 64, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !287, file: !180, line: 37, baseType: !5, size: 32, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !287, file: !180, line: 38, baseType: !95, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !287, file: !180, line: 39, baseType: !95, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !181, file: !180, line: 142, baseType: !285, size: 576, align: 64, offset: 4160)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !295, line: 40, baseType: !296)
!295 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!296 = !DICompositeType(tag: DW_TAG_structure_type, file: !295, line: 36, size: 192, align: 32, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !296, file: !295, line: 37, baseType: !5, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !296, file: !295, line: 37, baseType: !5, size: 32, align: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !296, file: !295, line: 38, baseType: !5, size: 32, align: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !296, file: !295, line: 38, baseType: !5, size: 32, align: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !296, file: !295, line: 39, baseType: !5, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !296, file: !295, line: 39, baseType: !5, size: 32, align: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !306, line: 95, baseType: !307)
!306 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nrnb.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!307 = !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 93, size: 8256, align: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !307, file: !306, line: 94, baseType: !310, size: 8256, align: 64)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 8256, align: 64, elements: !312)
!311 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!312 = !{!313}
!313 = !DISubrange(count: 129)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !330, !331}
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !175, file: !1, line: 159, type: !11)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !175, file: !1, line: 159, type: !5)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 3, scope: !175, file: !1, line: 160, type: !178)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 4, scope: !175, file: !1, line: 160, type: !5)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !175, file: !1, line: 161, type: !278)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 6, scope: !175, file: !1, line: 161, type: !278)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 7, scope: !175, file: !1, line: 162, type: !95)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 8, scope: !175, file: !1, line: 162, type: !95)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 9, scope: !175, file: !1, line: 163, type: !95)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 10, scope: !175, file: !1, line: 163, type: !293)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 11, scope: !175, file: !1, line: 164, type: !304)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nit", arg: 12, scope: !175, file: !1, line: 164, type: !109)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOld", arg: 13, scope: !175, file: !1, line: 165, type: !5)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tol", scope: !175, file: !1, line: 173, type: !329)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !175, file: !1, line: 174, type: !5)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ener", scope: !175, file: !1, line: 175, type: !96)
!332 = !DISubprogram(name: "do_optimize_poisson", scope: !1, file: !1, line: 231, type: !333, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, %struct.t_inputrec*, i32, [3 x float]*, [3 x float]*, float*, float*, float*, %struct.t_commrec*, %struct.t_nrnb*, [3 x float]*, float*, float*, i32)* @do_optimize_poisson, variables: !335)
!333 = !DISubroutineType(types: !334)
!334 = !{!96, !11, !5, !178, !5, !278, !278, !95, !95, !95, !293, !304, !278, !95, !95, !5}
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !368}
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !332, file: !1, line: 231, type: !11)
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !332, file: !1, line: 231, type: !5)
