; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pppm.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_fftgrid = type { float*, float*, float*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.t_nrnb = type { [129 x double] }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_fft_c = type { float, float }
%struct.t_nsborder = type { i32, i32, i32, i32, i32, i32, i32, [256 x i32], [256 x i32], [256 x i32], [256 x i32] }
%struct.t_inputrec = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, float, [3 x [3 x float]], [3 x [3 x float]], i32, float, float, i32, float, float, i32, float, float, float, i32, float, float, i32, float, float, float, float, float, i32, i32, i32, float, float, float, i32, float, float, i32, i32, i32, i32, i32, float, i32, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, %struct.t_grpopts, [3 x %struct.t_cosines], [3 x %struct.t_cosines] }

!160 = !{null, !161, !155, !155, !155, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!162 = !{!163, !164, !165, !166, !167}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !158, file: !1, line: 57, type: !161)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !158, file: !1, line: 57, type: !155)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !158, file: !1, line: 57, type: !155)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !158, file: !1, line: 57, type: !155)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invh", arg: 5, scope: !158, file: !1, line: 57, type: !161)
!168 = !DISubprogram(name: "calc_weights", scope: !1, file: !1, line: 64, type: !169, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, float*, float*, float*, i32*, float*)* @calc_weights, variables: !172)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !155, !155, !155, !155, !161, !161, !161, !171, !161}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !184, !189, !190, !191, !192, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iatom", arg: 1, scope: !168, file: !1, line: 64, type: !155)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !168, file: !1, line: 64, type: !155)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !168, file: !1, line: 64, type: !155)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !168, file: !1, line: 64, type: !155)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !168, file: !1, line: 65, type: !161)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !168, file: !1, line: 65, type: !161)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invh", arg: 7, scope: !168, file: !1, line: 65, type: !161)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ixyz", arg: 8, scope: !168, file: !1, line: 65, type: !171)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "WXYZ", arg: 9, scope: !168, file: !1, line: 65, type: !161)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "half", scope: !168, file: !1, line: 67, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wxyz", scope: !168, file: !1, line: 68, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !144, line: 105, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 288, align: 32, elements: !187)
!187 = !{!188, !188}
!188 = !DISubrange(count: 3)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abc", scope: !168, file: !1, line: 69, type: !143)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ttt", scope: !168, file: !1, line: 69, type: !143)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fact", scope: !168, file: !1, line: 69, type: !143)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nxyz", scope: !168, file: !1, line: 73, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !144, line: 107, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 96, align: 32, elements: !195)
!195 = !{!188}
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !168, file: !1, line: 74, type: !155)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !168, file: !1, line: 74, type: !155)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !168, file: !1, line: 74, type: !155)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !168, file: !1, line: 74, type: !155)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nm", scope: !168, file: !1, line: 74, type: !155)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Wx", scope: !168, file: !1, line: 75, type: !143)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Wy", scope: !168, file: !1, line: 75, type: !143)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Wzx", scope: !168, file: !1, line: 75, type: !143)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Wzy", scope: !168, file: !1, line: 75, type: !143)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Wzz", scope: !168, file: !1, line: 75, type: !143)
!206 = !DISubprogram(name: "spread_q", scope: !1, file: !1, line: 149, type: !207, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, i32, [3 x float]*, float*, float*, %struct.t_fftgrid*, %struct.t_nrnb*)* @spread_q, variables: !297)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209, !155, !155, !155, !269, !161, !161, !272, !288}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !211, line: 153, baseType: !212)
!211 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !211, line: 122, size: 1216, align: 64, elements: !213)
!213 = !{!214, !217, !218, !219, !221, !222, !227, !228, !229, !233, !239, !249, !255, !256, !259, !260, !262, !266, !267, !268}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !212, file: !211, line: 123, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !212, file: !211, line: 124, baseType: !155, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !212, file: !211, line: 125, baseType: !155, size: 32, align: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !212, file: !211, line: 126, baseType: !220, size: 16, align: 16, offset: 128)
!220 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !212, file: !211, line: 127, baseType: !220, size: 16, align: 16, offset: 144)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !212, file: !211, line: 128, baseType: !223, size: 128, align: 64, offset: 192)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !211, line: 88, size: 128, align: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !223, file: !211, line: 89, baseType: !215, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !223, file: !211, line: 90, baseType: !155, size: 32, align: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !212, file: !211, line: 129, baseType: !155, size: 32, align: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !212, file: !211, line: 132, baseType: !149, size: 64, align: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !212, file: !211, line: 133, baseType: !230, size: 64, align: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!155, !149}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !212, file: !211, line: 134, baseType: !234, size: 64, align: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!155, !149, !237, !155}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !212, file: !211, line: 135, baseType: !240, size: 64, align: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !149, !243, !155}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !211, line: 77, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !245, line: 71, baseType: !246)
!245 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!248 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !212, file: !211, line: 136, baseType: !250, size: 64, align: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!155, !149, !253, !155}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !212, file: !211, line: 139, baseType: !223, size: 128, align: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !212, file: !211, line: 140, baseType: !257, size: 64, align: 64, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !211, line: 94, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !212, file: !211, line: 141, baseType: !155, size: 32, align: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !212, file: !211, line: 144, baseType: !261, size: 24, align: 8, offset: 928)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 24, align: 8, elements: !195)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !212, file: !211, line: 145, baseType: !263, size: 8, align: 8, offset: 952)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 8, align: 8, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 1)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !212, file: !211, line: 148, baseType: !223, size: 128, align: 64, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !212, file: !211, line: 151, baseType: !155, size: 32, align: 32, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !212, file: !211, line: 152, baseType: !243, size: 64, align: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !144, line: 101, baseType: !271)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 96, align: 32, elements: !195)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fftgrid", file: !138, line: 86, baseType: !274)
!274 = !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 71, size: 512, align: 64, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !274, file: !138, line: 72, baseType: !147, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "localptr", scope: !274, file: !138, line: 73, baseType: !147, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "workspace", scope: !274, file: !138, line: 74, baseType: !147, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !274, file: !138, line: 75, baseType: !155, size: 32, align: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !274, file: !138, line: 75, baseType: !155, size: 32, align: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !274, file: !138, line: 75, baseType: !155, size: 32, align: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "la2r", scope: !274, file: !138, line: 75, baseType: !155, size: 32, align: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "la2c", scope: !274, file: !138, line: 75, baseType: !155, size: 32, align: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "la12r", scope: !274, file: !138, line: 75, baseType: !155, size: 32, align: 32, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "la12c", scope: !274, file: !138, line: 75, baseType: !155, size: 32, align: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nptr", scope: !274, file: !138, line: 76, baseType: !155, size: 32, align: 32, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nxyz", scope: !274, file: !138, line: 76, baseType: !155, size: 32, align: 32, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !4, line: 95, baseType: !290)
!290 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 93, size: 8256, align: 64, elements: !291)
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !290, file: !4, line: 94, baseType: !293, size: 8256, align: 64)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 8256, align: 64, elements: !295)
!294 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!295 = !{!296}
!296 = !DISubrange(count: 129)
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !206, file: !1, line: 149, type: !209)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !206, file: !1, line: 149, type: !155)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !206, file: !1, line: 150, type: !155)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 4, scope: !206, file: !1, line: 150, type: !155)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !206, file: !1, line: 151, type: !269)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 6, scope: !206, file: !1, line: 151, type: !161)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !206, file: !1, line: 151, type: !161)
!305 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 8, scope: !206, file: !1, line: 152, type: !272)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 9, scope: !206, file: !1, line: 152, type: !288)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invh", scope: !206, file: !1, line: 156, type: !270)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qi", scope: !206, file: !1, line: 157, type: !143)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qwt", scope: !206, file: !1, line: 157, type: !143)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "WXYZ", scope: !206, file: !1, line: 161, type: !311)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 864, align: 32, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 27)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ixyz", scope: !206, file: !1, line: 162, type: !193)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !206, file: !1, line: 163, type: !155)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iX", scope: !206, file: !1, line: 163, type: !155)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iY", scope: !206, file: !1, line: 163, type: !155)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iZ", scope: !206, file: !1, line: 163, type: !155)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !206, file: !1, line: 163, type: !155)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jx", scope: !206, file: !1, line: 164, type: !155)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jy", scope: !206, file: !1, line: 164, type: !155)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jz", scope: !206, file: !1, line: 164, type: !155)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcx", scope: !206, file: !1, line: 164, type: !155)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcy", scope: !206, file: !1, line: 164, type: !155)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcz", scope: !206, file: !1, line: 164, type: !155)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nxyz", scope: !206, file: !1, line: 165, type: !155)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !206, file: !1, line: 166, type: !155)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !206, file: !1, line: 166, type: !155)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !206, file: !1, line: 166, type: !155)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la2", scope: !206, file: !1, line: 166, type: !155)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la12", scope: !206, file: !1, line: 166, type: !155)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !206, file: !1, line: 167, type: !147)
!333 = !DISubprogram(name: "gather_inner", scope: !1, file: !1, line: 229, type: !334, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: float (i32*, float*, i32*, i32*, i32*, i32, i32, float, float, float, float, float, float, float, float*, float*)* @gather_inner, variables: !336)
!334 = !DISubroutineType(types: !335)
!335 = !{!143, !171, !161, !171, !171, !171, !155, !155, !143, !143, !143, !143, !143, !143, !143, !161, !147}
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "JCXYZ", arg: 1, scope: !333, file: !1, line: 229, type: !171)
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "WXYZ", arg: 2, scope: !333, file: !1, line: 229, type: !161)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ixw", arg: 3, scope: !333, file: !1, line: 229, type: !171)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iyw", arg: 4, scope: !333, file: !1, line: 229, type: !171)
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "izw", arg: 5, scope: !333, file: !1, line: 229, type: !171)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "la2", arg: 6, scope: !333, file: !1, line: 230, type: !155)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "la12", arg: 7, scope: !333, file: !1, line: 230, type: !155)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1x", arg: 8, scope: !333, file: !1, line: 231, type: !143)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1y", arg: 9, scope: !333, file: !1, line: 231, type: !143)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1z", arg: 10, scope: !333, file: !1, line: 231, type: !143)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2x", arg: 11, scope: !333, file: !1, line: 231, type: !143)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2y", arg: 12, scope: !333, file: !1, line: 231, type: !143)
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2z", arg: 13, scope: !333, file: !1, line: 231, type: !143)
!350 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "qi", arg: 14, scope: !333, file: !1, line: 232, type: !143)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 15, scope: !333, file: !1, line: 232, type: !161)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 16, scope: !333, file: !1, line: 232, type: !147)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pi", scope: !333, file: !1, line: 234, type: !143)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fX", scope: !333, file: !1, line: 234, type: !143)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fY", scope: !333, file: !1, line: 234, type: !143)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fZ", scope: !333, file: !1, line: 234, type: !143)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !333, file: !1, line: 234, type: !143)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jxyz", scope: !333, file: !1, line: 235, type: !155)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !333, file: !1, line: 235, type: !155)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcx", scope: !333, file: !1, line: 235, type: !155)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcy", scope: !333, file: !1, line: 235, type: !155)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcz", scope: !333, file: !1, line: 235, type: !155)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcx0", scope: !333, file: !1, line: 236, type: !155)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcy0", scope: !333, file: !1, line: 236, type: !155)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcz0", scope: !333, file: !1, line: 236, type: !155)
!366 = !DISubprogram(name: "convolution", scope: !1, file: !1, line: 362, type: !367, isLocal: false, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_fftgrid*, float***, %struct.t_commrec*)* @convolution, variables: !382)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !209, !155, !272, !369, !371}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !373, line: 40, baseType: !374)
!373 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!374 = !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 36, size: 192, align: 32, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !374, file: !373, line: 37, baseType: !155, size: 32, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !374, file: !373, line: 37, baseType: !155, size: 32, align: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !374, file: !373, line: 38, baseType: !155, size: 32, align: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !374, file: !373, line: 38, baseType: !155, size: 32, align: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !374, file: !373, line: 39, baseType: !155, size: 32, align: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !374, file: !373, line: 39, baseType: !155, size: 32, align: 32, offset: 160)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !405, !406, !407}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !366, file: !1, line: 362, type: !209)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !366, file: !1, line: 362, type: !155)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 3, scope: !366, file: !1, line: 362, type: !272)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghat", arg: 4, scope: !366, file: !1, line: 362, type: !369)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 5, scope: !366, file: !1, line: 363, type: !371)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !366, file: !1, line: 365, type: !155)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !366, file: !1, line: 365, type: !155)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !366, file: !1, line: 365, type: !155)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !366, file: !1, line: 365, type: !155)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gk", scope: !366, file: !1, line: 366, type: !143)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !366, file: !1, line: 367, type: !155)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !366, file: !1, line: 367, type: !155)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !366, file: !1, line: 367, type: !155)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la2", scope: !366, file: !1, line: 367, type: !155)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "la12", scope: !366, file: !1, line: 367, type: !155)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !366, file: !1, line: 368, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fft_c", file: !138, line: 57, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 55, size: 64, align: 32, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !401, file: !138, line: 56, baseType: !143, size: 32, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !401, file: !138, line: 56, baseType: !143, size: 32, align: 32, offset: 32)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nTest", scope: !366, file: !1, line: 369, type: !171)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jstart", scope: !366, file: !1, line: 370, type: !155)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jend", scope: !366, file: !1, line: 370, type: !155)
!408 = !DISubprogram(name: "solve_pppm", scope: !1, file: !1, line: 430, type: !409, isLocal: false, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, %struct.t_fftgrid*, float***, float*, i32, %struct.t_nrnb*)* @solve_pppm, variables: !411)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !209, !371, !272, !369, !161, !155, !288}
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !408, file: !1, line: 430, type: !209)
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !408, file: !1, line: 430, type: !371)
!414 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 3, scope: !408, file: !1, line: 431, type: !272)
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghat", arg: 4, scope: !408, file: !1, line: 431, type: !369)
!416 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !408, file: !1, line: 431, type: !161)
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 6, scope: !408, file: !1, line: 432, type: !155)
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 7, scope: !408, file: !1, line: 432, type: !288)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntot", scope: !408, file: !1, line: 434, type: !155)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npppm", scope: !408, file: !1, line: 434, type: !155)
!421 = !DISubprogram(name: "init_pppm", scope: !1, file: !1, line: 469, type: !422, isLocal: false, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, %struct.t_nsborder*, i32, i32, float*, i8*, %struct.t_inputrec*)* @init_pppm, variables: !552)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !209, !371, !424, !155, !155, !161, !237, !443}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !426, line: 59, baseType: !427)
!426 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 36, size: 32992, align: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !440, !441, !442}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !427, file: !426, line: 37, baseType: !155, size: 32, align: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !427, file: !426, line: 38, baseType: !155, size: 32, align: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !427, file: !426, line: 39, baseType: !155, size: 32, align: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !427, file: !426, line: 40, baseType: !155, size: 32, align: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !427, file: !426, line: 41, baseType: !155, size: 32, align: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !427, file: !426, line: 43, baseType: !155, size: 32, align: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !427, file: !426, line: 43, baseType: !155, size: 32, align: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !427, file: !426, line: 50, baseType: !437, size: 8192, align: 32, offset: 224)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 8192, align: 32, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !427, file: !426, line: 51, baseType: !437, size: 8192, align: 32, offset: 8416)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !427, file: !426, line: 52, baseType: !437, size: 8192, align: 32, offset: 16608)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !427, file: !426, line: 55, baseType: !437, size: 8192, align: 32, offset: 24800)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !445, line: 143, baseType: !446)
!445 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!446 = !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 55, size: 4736, align: 64, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !543, !551}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !446, file: !445, line: 56, baseType: !155, size: 32, align: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !446, file: !445, line: 57, baseType: !155, size: 32, align: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !446, file: !445, line: 58, baseType: !155, size: 32, align: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !446, file: !445, line: 59, baseType: !155, size: 32, align: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !446, file: !445, line: 60, baseType: !155, size: 32, align: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !446, file: !445, line: 61, baseType: !155, size: 32, align: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !446, file: !445, line: 62, baseType: !155, size: 32, align: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !446, file: !445, line: 63, baseType: !155, size: 32, align: 32, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !446, file: !445, line: 65, baseType: !155, size: 32, align: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !446, file: !445, line: 66, baseType: !155, size: 32, align: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !446, file: !445, line: 67, baseType: !155, size: 32, align: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !446, file: !445, line: 68, baseType: !155, size: 32, align: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !446, file: !445, line: 69, baseType: !155, size: 32, align: 32, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !446, file: !445, line: 70, baseType: !155, size: 32, align: 32, offset: 416)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !446, file: !445, line: 71, baseType: !143, size: 32, align: 32, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !446, file: !445, line: 72, baseType: !143, size: 32, align: 32, offset: 480)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !446, file: !445, line: 73, baseType: !143, size: 32, align: 32, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !446, file: !445, line: 74, baseType: !155, size: 32, align: 32, offset: 544)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !446, file: !445, line: 74, baseType: !155, size: 32, align: 32, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !446, file: !445, line: 74, baseType: !155, size: 32, align: 32, offset: 608)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !446, file: !445, line: 76, baseType: !155, size: 32, align: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !446, file: !445, line: 77, baseType: !143, size: 32, align: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !446, file: !445, line: 79, baseType: !155, size: 32, align: 32, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !446, file: !445, line: 80, baseType: !155, size: 32, align: 32, offset: 736)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !446, file: !445, line: 81, baseType: !155, size: 32, align: 32, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !446, file: !445, line: 82, baseType: !155, size: 32, align: 32, offset: 800)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !446, file: !445, line: 83, baseType: !155, size: 32, align: 32, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !446, file: !445, line: 84, baseType: !155, size: 32, align: 32, offset: 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !446, file: !445, line: 85, baseType: !155, size: 32, align: 32, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !446, file: !445, line: 86, baseType: !155, size: 32, align: 32, offset: 928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !446, file: !445, line: 87, baseType: !143, size: 32, align: 32, offset: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !446, file: !445, line: 88, baseType: !185, size: 288, align: 32, offset: 992)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !446, file: !445, line: 89, baseType: !185, size: 288, align: 32, offset: 1280)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !446, file: !445, line: 90, baseType: !155, size: 32, align: 32, offset: 1568)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !446, file: !445, line: 91, baseType: !143, size: 32, align: 32, offset: 1600)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !446, file: !445, line: 92, baseType: !143, size: 32, align: 32, offset: 1632)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !446, file: !445, line: 93, baseType: !155, size: 32, align: 32, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !446, file: !445, line: 94, baseType: !143, size: 32, align: 32, offset: 1696)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !446, file: !445, line: 95, baseType: !143, size: 32, align: 32, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !446, file: !445, line: 96, baseType: !155, size: 32, align: 32, offset: 1760)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !446, file: !445, line: 97, baseType: !143, size: 32, align: 32, offset: 1792)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !446, file: !445, line: 98, baseType: !143, size: 32, align: 32, offset: 1824)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !446, file: !445, line: 99, baseType: !143, size: 32, align: 32, offset: 1856)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !446, file: !445, line: 100, baseType: !155, size: 32, align: 32, offset: 1888)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !446, file: !445, line: 101, baseType: !143, size: 32, align: 32, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !446, file: !445, line: 102, baseType: !143, size: 32, align: 32, offset: 1952)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !446, file: !445, line: 103, baseType: !155, size: 32, align: 32, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !446, file: !445, line: 104, baseType: !143, size: 32, align: 32, offset: 2016)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !446, file: !445, line: 105, baseType: !143, size: 32, align: 32, offset: 2048)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !446, file: !445, line: 106, baseType: !143, size: 32, align: 32, offset: 2080)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !446, file: !445, line: 107, baseType: !143, size: 32, align: 32, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !446, file: !445, line: 108, baseType: !143, size: 32, align: 32, offset: 2144)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !446, file: !445, line: 109, baseType: !155, size: 32, align: 32, offset: 2176)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !446, file: !445, line: 110, baseType: !155, size: 32, align: 32, offset: 2208)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !446, file: !445, line: 111, baseType: !155, size: 32, align: 32, offset: 2240)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !446, file: !445, line: 112, baseType: !143, size: 32, align: 32, offset: 2272)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !446, file: !445, line: 113, baseType: !143, size: 32, align: 32, offset: 2304)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !446, file: !445, line: 114, baseType: !143, size: 32, align: 32, offset: 2336)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !446, file: !445, line: 115, baseType: !155, size: 32, align: 32, offset: 2368)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !446, file: !445, line: 116, baseType: !143, size: 32, align: 32, offset: 2400)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !446, file: !445, line: 117, baseType: !143, size: 32, align: 32, offset: 2432)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !446, file: !445, line: 118, baseType: !155, size: 32, align: 32, offset: 2464)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !446, file: !445, line: 120, baseType: !155, size: 32, align: 32, offset: 2496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !446, file: !445, line: 122, baseType: !155, size: 32, align: 32, offset: 2528)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !446, file: !445, line: 124, baseType: !155, size: 32, align: 32, offset: 2560)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !446, file: !445, line: 125, baseType: !155, size: 32, align: 32, offset: 2592)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !446, file: !445, line: 126, baseType: !143, size: 32, align: 32, offset: 2624)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !446, file: !445, line: 127, baseType: !155, size: 32, align: 32, offset: 2656)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !446, file: !445, line: 128, baseType: !143, size: 32, align: 32, offset: 2688)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !446, file: !445, line: 129, baseType: !143, size: 32, align: 32, offset: 2720)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !446, file: !445, line: 130, baseType: !155, size: 32, align: 32, offset: 2752)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !446, file: !445, line: 131, baseType: !143, size: 32, align: 32, offset: 2784)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !446, file: !445, line: 132, baseType: !155, size: 32, align: 32, offset: 2816)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !446, file: !445, line: 133, baseType: !155, size: 32, align: 32, offset: 2848)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !446, file: !445, line: 134, baseType: !155, size: 32, align: 32, offset: 2880)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !446, file: !445, line: 135, baseType: !155, size: 32, align: 32, offset: 2912)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !446, file: !445, line: 136, baseType: !143, size: 32, align: 32, offset: 2944)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !446, file: !445, line: 137, baseType: !143, size: 32, align: 32, offset: 2976)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !446, file: !445, line: 138, baseType: !143, size: 32, align: 32, offset: 3008)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !446, file: !445, line: 139, baseType: !143, size: 32, align: 32, offset: 3040)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !446, file: !445, line: 140, baseType: !529, size: 512, align: 64, offset: 3072)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !445, line: 53, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 42, size: 512, align: 64, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !542}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !530, file: !445, line: 43, baseType: !155, size: 32, align: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !530, file: !445, line: 44, baseType: !155, size: 32, align: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !530, file: !445, line: 45, baseType: !155, size: 32, align: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !530, file: !445, line: 46, baseType: !155, size: 32, align: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !530, file: !445, line: 47, baseType: !161, size: 64, align: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !530, file: !445, line: 48, baseType: !161, size: 64, align: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !530, file: !445, line: 49, baseType: !161, size: 64, align: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !530, file: !445, line: 50, baseType: !269, size: 64, align: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !530, file: !445, line: 51, baseType: !541, size: 64, align: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !530, file: !445, line: 52, baseType: !171, size: 64, align: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !446, file: !445, line: 141, baseType: !544, size: 576, align: 64, offset: 3584)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 576, align: 64, elements: !195)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !445, line: 40, baseType: !546)
!546 = !DICompositeType(tag: DW_TAG_structure_type, file: !445, line: 36, size: 192, align: 64, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !546, file: !445, line: 37, baseType: !155, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !546, file: !445, line: 38, baseType: !161, size: 64, align: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !546, file: !445, line: 39, baseType: !161, size: 64, align: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !446, file: !445, line: 142, baseType: !544, size: 576, align: 64, offset: 4160)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !421, file: !1, line: 469, type: !209)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !421, file: !1, line: 469, type: !371)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 3, scope: !421, file: !1, line: 469, type: !424)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 4, scope: !421, file: !1, line: 470, type: !155)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOld", arg: 5, scope: !421, file: !1, line: 470, type: !155)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !421, file: !1, line: 470, type: !161)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghatfn", arg: 7, scope: !421, file: !1, line: 470, type: !237)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 8, scope: !421, file: !1, line: 470, type: !443)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !421, file: !1, line: 472, type: !155)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !421, file: !1, line: 472, type: !155)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nz", scope: !421, file: !1, line: 472, type: !155)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !421, file: !1, line: 472, type: !155)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "porder", scope: !421, file: !1, line: 472, type: !155)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grids", scope: !421, file: !1, line: 473, type: !193)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r1", scope: !421, file: !1, line: 474, type: !143)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !421, file: !1, line: 474, type: !143)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tol", scope: !421, file: !1, line: 475, type: !183)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "spacing", scope: !421, file: !1, line: 476, type: !270)
!571 = !DISubprogram(name: "do_pppm", scope: !1, file: !1, line: 545, type: !572, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, [3 x float]*, [3 x float]*, float*, float*, float*, %struct.t_commrec*, %struct.t_nsborder*, %struct.t_nrnb*)* @do_pppm, variables: !574)
!572 = !DISubroutineType(types: !573)
!573 = !{!143, !209, !155, !269, !269, !161, !161, !161, !371, !424, !288}
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !571, file: !1, line: 545, type: !209)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !571, file: !1, line: 545, type: !155)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !571, file: !1, line: 546, type: !269)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 4, scope: !571, file: !1, line: 546, type: !269)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 5, scope: !571, file: !1, line: 547, type: !161)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !571, file: !1, line: 547, type: !161)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 7, scope: !571, file: !1, line: 548, type: !161)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 8, scope: !571, file: !1, line: 548, type: !371)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 9, scope: !571, file: !1, line: 549, type: !424)
