; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/princ.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }

@.str = private unnamed_addr constant [6 x i8] c"inten\00", align 1
@.str1 = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/princ.c\00", align 1
@.str2 = private unnamed_addr constant [3 x i8] c"ev\00", align 1
@.str3 = private unnamed_addr constant [9 x i8] c"inten[i]\00", align 1
@.str4 = private unnamed_addr constant [6 x i8] c"ev[i]\00", align 1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/princ.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{!7, !75, !81, !88, !94, !100, !103, !106, !109, !112, !115, !118, !127, !136, !149, !152, !155, !158, !172, !186, !192, !198, !253, !266, !281, !292, !302, !373, !379, !384, !393, !400, !408}
!7 = !DISubprogram(name: "__sputc", scope: !8, file: !8, line: 348, type: !9, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DISubroutineType(types: !10)
!10 = !{!5, !5, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !8, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !8, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !8, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !8, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !8, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !8, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !8, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !8, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !8, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !8, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !8, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !8, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !8, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!5, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !8, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!5, !30, !39, !5}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !8, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !5}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !8, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !8, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!5, !30, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !8, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !8, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !8, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !8, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !8, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !8, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !8, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !8, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !8, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !7, file: !8, line: 348, type: !5)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !7, file: !8, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!5, !5}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !5)
!81 = !DISubprogram(name: "__inline_isfinitef", scope: !82, file: !82, line: 204, type: !83, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !86)
!82 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DISubroutineType(types: !84)
!84 = !{!5, !85}
!85 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !81, file: !82, line: 204, type: !85)
!88 = !DISubprogram(name: "__inline_isfinited", scope: !82, file: !82, line: 207, type: !89, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !92)
!89 = !DISubroutineType(types: !90)
!90 = !{!5, !91}
!91 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !88, file: !82, line: 207, type: !91)
!94 = !DISubprogram(name: "__inline_isfinitel", scope: !82, file: !82, line: 210, type: !95, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!5, !97}
!97 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!98 = !{!99}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !94, file: !82, line: 210, type: !97)
!100 = !DISubprogram(name: "__inline_isinff", scope: !82, file: !82, line: 213, type: !83, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !101)
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !100, file: !82, line: 213, type: !85)
!103 = !DISubprogram(name: "__inline_isinfd", scope: !82, file: !82, line: 216, type: !89, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !104)
!104 = !{!105}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !103, file: !82, line: 216, type: !91)
!106 = !DISubprogram(name: "__inline_isinfl", scope: !82, file: !82, line: 219, type: !95, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !106, file: !82, line: 219, type: !97)
!109 = !DISubprogram(name: "__inline_isnanf", scope: !82, file: !82, line: 222, type: !83, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !110)
!110 = !{!111}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !109, file: !82, line: 222, type: !85)
!112 = !DISubprogram(name: "__inline_isnand", scope: !82, file: !82, line: 225, type: !89, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !113)
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !112, file: !82, line: 225, type: !91)
!115 = !DISubprogram(name: "__inline_isnanl", scope: !82, file: !82, line: 228, type: !95, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !116)
!116 = !{!117}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !115, file: !82, line: 228, type: !97)
!118 = !DISubprogram(name: "__inline_signbitf", scope: !82, file: !82, line: 231, type: !83, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !119)
!119 = !{!120, !121}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !118, file: !82, line: 231, type: !85)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !118, file: !82, line: 232, type: !122)
!122 = !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !82, line: 232, size: 32, align: 32, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !122, file: !82, line: 232, baseType: !85, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !122, file: !82, line: 232, baseType: !126, size: 32, align: 32)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DISubprogram(name: "__inline_signbitd", scope: !82, file: !82, line: 236, type: !89, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !128)
!128 = !{!129, !130}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !127, file: !82, line: 236, type: !91)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !127, file: !82, line: 237, type: !131)
!131 = !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !82, line: 237, size: 64, align: 64, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !131, file: !82, line: 237, baseType: !91, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !131, file: !82, line: 237, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DISubprogram(name: "__inline_signbitl", scope: !82, file: !82, line: 242, type: !95, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !137)
!137 = !{!138, !139}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !136, file: !82, line: 242, type: !97)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !136, file: !82, line: 246, type: !140)
!140 = !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !82, line: 243, size: 128, align: 128, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !140, file: !82, line: 244, baseType: !97, size: 128, align: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !140, file: !82, line: 245, baseType: !144, size: 128, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !82, line: 245, size: 128, align: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !144, file: !82, line: 245, baseType: !135, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !144, file: !82, line: 245, baseType: !148, size: 16, align: 16, offset: 64)
!148 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!149 = !DISubprogram(name: "__inline_isnormalf", scope: !82, file: !82, line: 257, type: !83, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !150)
!150 = !{!151}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !149, file: !82, line: 257, type: !85)
!152 = !DISubprogram(name: "__inline_isnormald", scope: !82, file: !82, line: 260, type: !89, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !153)
!153 = !{!154}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !152, file: !82, line: 260, type: !91)
!155 = !DISubprogram(name: "__inline_isnormall", scope: !82, file: !82, line: 263, type: !95, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !156)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !155, file: !82, line: 263, type: !97)
!158 = !DISubprogram(name: "__sincosf", scope: !82, file: !82, line: 642, type: !159, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !162)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !85, !161, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !158, file: !82, line: 642, type: !85)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !158, file: !82, line: 642, type: !161)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !158, file: !82, line: 642, type: !161)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !158, file: !82, line: 643, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !82, line: 634, size: 64, align: 32, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32, offset: 32)
!172 = !DISubprogram(name: "__sincos", scope: !82, file: !82, line: 647, type: !173, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !91, !175, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !82, line: 647, type: !91)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !172, file: !82, line: 647, type: !175)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !172, file: !82, line: 647, type: !175)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !172, file: !82, line: 648, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !82, line: 635, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64, offset: 64)
!186 = !DISubprogram(name: "__sincospif", scope: !82, file: !82, line: 652, type: !159, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !82, line: 652, type: !85)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !186, file: !82, line: 652, type: !161)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !186, file: !82, line: 652, type: !161)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !186, file: !82, line: 653, type: !167)
!192 = !DISubprogram(name: "__sincospi", scope: !82, file: !82, line: 657, type: !173, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !192, file: !82, line: 657, type: !91)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !192, file: !82, line: 657, type: !175)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !192, file: !82, line: 657, type: !175)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !192, file: !82, line: 658, type: !181)
!198 = !DISubprogram(name: "principal_comp", scope: !1, file: !1, line: 85, type: !199, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, %struct.t_atom*, [3 x float]*, [3 x float]*, float*)* @principal_comp, variables: !228)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !5, !201, !204, !223, !226, !227}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !203, line: 73, baseType: !5)
!203 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !206, line: 57, baseType: !207)
!206 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!207 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 48, size: 320, align: 32, elements: !208)
!208 = !{!209, !211, !212, !213, !214, !215, !216, !217, !218, !222}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !207, file: !206, line: 49, baseType: !210, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !203, line: 87, baseType: !85)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !207, file: !206, line: 49, baseType: !210, size: 32, align: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !207, file: !206, line: 50, baseType: !210, size: 32, align: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !207, file: !206, line: 50, baseType: !210, size: 32, align: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !206, line: 51, baseType: !148, size: 16, align: 16, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !207, file: !206, line: 52, baseType: !148, size: 16, align: 16, offset: 144)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !207, file: !206, line: 53, baseType: !5, size: 32, align: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !207, file: !206, line: 54, baseType: !5, size: 32, align: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !207, file: !206, line: 55, baseType: !219, size: 72, align: 8, offset: 224)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 72, align: 8, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 9)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !207, file: !206, line: 56, baseType: !17, size: 8, align: 8, offset: 296)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !203, line: 101, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 96, align: 32, elements: !63)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !246, !250, !251, !252}
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !198, file: !1, line: 85, type: !5)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !198, file: !1, line: 85, type: !201)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atom", arg: 3, scope: !198, file: !1, line: 85, type: !204)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !198, file: !1, line: 85, type: !223)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "trans", arg: 5, scope: !198, file: !1, line: 86, type: !226)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 6, scope: !198, file: !1, line: 86, type: !227)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !198, file: !1, line: 88, type: !5)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !198, file: !1, line: 88, type: !5)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !198, file: !1, line: 88, type: !5)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !198, file: !1, line: 88, type: !5)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrot", scope: !198, file: !1, line: 88, type: !5)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mm", scope: !198, file: !1, line: 89, type: !210)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rx", scope: !198, file: !1, line: 89, type: !210)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ry", scope: !198, file: !1, line: 89, type: !210)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rz", scope: !198, file: !1, line: 89, type: !210)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inten", scope: !198, file: !1, line: 90, type: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dd", scope: !198, file: !1, line: 90, type: !247)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, align: 64, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 4)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tvec", scope: !198, file: !1, line: 90, type: !247)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ev", scope: !198, file: !1, line: 90, type: !245)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !198, file: !1, line: 94, type: !210)
!253 = !DISubprogram(name: "rotate_atoms", scope: !1, file: !1, line: 173, type: !254, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, [3 x float]*, [3 x float]*)* @rotate_atoms, variables: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !201, !223, !226}
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265}
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnx", arg: 1, scope: !253, file: !1, line: 173, type: !5)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !253, file: !1, line: 173, type: !201)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !253, file: !1, line: 173, type: !223)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "trans", arg: 4, scope: !253, file: !1, line: 173, type: !226)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xt", scope: !253, file: !1, line: 175, type: !210)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yt", scope: !253, file: !1, line: 175, type: !210)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zt", scope: !253, file: !1, line: 175, type: !210)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !253, file: !1, line: 176, type: !5)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !253, file: !1, line: 176, type: !5)
!266 = !DISubprogram(name: "calc_xcm", scope: !1, file: !1, line: 189, type: !267, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: float ([3 x float]*, i32, i32*, %struct.t_atom*, float*, i32)* @calc_xcm, variables: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!210, !223, !5, !201, !204, !227, !5}
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !266, file: !1, line: 189, type: !223)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnx", arg: 2, scope: !266, file: !1, line: 189, type: !5)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !266, file: !1, line: 189, type: !201)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atom", arg: 4, scope: !266, file: !1, line: 189, type: !204)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xcm", arg: 5, scope: !266, file: !1, line: 189, type: !227)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bQ", arg: 6, scope: !266, file: !1, line: 190, type: !5)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !266, file: !1, line: 192, type: !5)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !266, file: !1, line: 192, type: !5)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !266, file: !1, line: 192, type: !5)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m0", scope: !266, file: !1, line: 193, type: !210)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !266, file: !1, line: 193, type: !210)
!281 = !DISubprogram(name: "sub_xcm", scope: !1, file: !1, line: 217, type: !267, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: float ([3 x float]*, i32, i32*, %struct.t_atom*, float*, i32)* @sub_xcm, variables: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291}
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !281, file: !1, line: 217, type: !223)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnx", arg: 2, scope: !281, file: !1, line: 217, type: !5)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !281, file: !1, line: 217, type: !201)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atom", arg: 4, scope: !281, file: !1, line: 217, type: !204)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xcm", arg: 5, scope: !281, file: !1, line: 217, type: !227)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bQ", arg: 6, scope: !281, file: !1, line: 218, type: !5)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !281, file: !1, line: 220, type: !5)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !281, file: !1, line: 220, type: !5)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !281, file: !1, line: 221, type: !210)
!292 = !DISubprogram(name: "add_xcm", scope: !1, file: !1, line: 231, type: !293, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*, i32, i32*, float*)* @add_xcm, variables: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !223, !5, !201, !227}
!295 = !{!296, !297, !298, !299, !300, !301}
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !292, file: !1, line: 231, type: !223)
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnx", arg: 2, scope: !292, file: !1, line: 231, type: !5)
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !292, file: !1, line: 231, type: !201)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xcm", arg: 4, scope: !292, file: !1, line: 231, type: !227)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !292, file: !1, line: 233, type: !5)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !292, file: !1, line: 233, type: !5)
!302 = !DISubprogram(name: "orient_princ", scope: !1, file: !1, line: 253, type: !303, isLocal: false, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*, i32, i32*, i32, [3 x float]*, [3 x float]*, float*)* @orient_princ, variables: !358)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !305, !5, !201, !5, !223, !223, !227}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !206, line: 94, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 75, size: 10240, align: 64, elements: !308)
!308 = !{!309, !310, !311, !314, !315, !316, !317, !318, !319, !320, !333, !341}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !307, file: !206, line: 76, baseType: !5, size: 32, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !307, file: !206, line: 77, baseType: !204, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !307, file: !206, line: 80, baseType: !312, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !307, file: !206, line: 82, baseType: !312, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !307, file: !206, line: 84, baseType: !312, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !307, file: !206, line: 86, baseType: !5, size: 32, align: 32, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !307, file: !206, line: 87, baseType: !312, size: 64, align: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !307, file: !206, line: 89, baseType: !5, size: 32, align: 32, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !307, file: !206, line: 90, baseType: !312, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !307, file: !206, line: 91, baseType: !321, size: 8448, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !322, line: 52, baseType: !323)
!322 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!323 = !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 36, size: 8448, align: 64, elements: !324)
!324 = !{!325, !329, !330, !331, !332}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !323, file: !322, line: 37, baseType: !326, size: 8192, align: 32)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, align: 32, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !323, file: !322, line: 43, baseType: !5, size: 32, align: 32, offset: 8192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !323, file: !322, line: 44, baseType: !201, size: 64, align: 64, offset: 8256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !323, file: !322, line: 45, baseType: !5, size: 32, align: 32, offset: 8320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !323, file: !322, line: 46, baseType: !201, size: 64, align: 64, offset: 8384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !307, file: !206, line: 92, baseType: !334, size: 1152, align: 64, offset: 9024)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 1152, align: 64, elements: !220)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !206, line: 73, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 70, size: 128, align: 64, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !336, file: !206, line: 71, baseType: !5, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !336, file: !206, line: 72, baseType: !340, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !307, file: !206, line: 93, baseType: !342, size: 64, align: 64, offset: 10176)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !206, line: 68, baseType: !344)
!344 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 59, size: 416, align: 32, elements: !345)
!345 = !{!346, !347, !348, !349, !353, !354, !355, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !206, line: 60, baseType: !5, size: 32, align: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !344, file: !206, line: 61, baseType: !5, size: 32, align: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !344, file: !206, line: 62, baseType: !4, size: 8, align: 8, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !344, file: !206, line: 63, baseType: !350, size: 48, align: 8, offset: 72)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, align: 8, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 6)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !344, file: !206, line: 64, baseType: !210, size: 32, align: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !344, file: !206, line: 65, baseType: !210, size: 32, align: 32, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !344, file: !206, line: 66, baseType: !5, size: 32, align: 32, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !344, file: !206, line: 67, baseType: !357, size: 192, align: 32, offset: 224)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, align: 32, elements: !351)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 1, scope: !302, file: !1, line: 253, type: !305)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isize", arg: 2, scope: !302, file: !1, line: 253, type: !5)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !302, file: !1, line: 253, type: !201)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 4, scope: !302, file: !1, line: 254, type: !5)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !302, file: !1, line: 254, type: !223)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 6, scope: !302, file: !1, line: 254, type: !223)
!365 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 7, scope: !302, file: !1, line: 254, type: !227)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !302, file: !1, line: 256, type: !5)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xcm", scope: !302, file: !1, line: 257, type: !224)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prcomp", scope: !302, file: !1, line: 257, type: !224)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trans", scope: !302, file: !1, line: 258, type: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !203, line: 103, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 288, align: 32, elements: !372)
!372 = !{!64, !64}
!373 = !DISubprogram(name: "sqr", scope: !374, file: !374, line: 197, type: !375, isLocal: true, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, variables: !377)
!374 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!375 = !DISubroutineType(types: !376)
!376 = !{!210, !210}
!377 = !{!378}
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !373, file: !374, line: 197, type: !210)
!379 = !DISubprogram(name: "clear_rvec", scope: !374, file: !374, line: 316, type: !380, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, variables: !382)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !227}
!382 = !{!383}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !379, file: !374, line: 316, type: !227)
!384 = !DISubprogram(name: "rvec_dec", scope: !374, file: !374, line: 257, type: !385, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, variables: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !227, !227}
!387 = !{!388, !389, !390, !391, !392}
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !384, file: !374, line: 257, type: !227)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !384, file: !374, line: 257, type: !227)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !384, file: !374, line: 259, type: !210)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !384, file: !374, line: 259, type: !210)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !384, file: !374, line: 259, type: !210)
!393 = !DISubprogram(name: "rvec_inc", scope: !374, file: !374, line: 231, type: !385, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, variables: !394)
!394 = !{!395, !396, !397, !398, !399}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !393, file: !374, line: 231, type: !227)
