; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/psgather.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_PSgrid = type { i32, i32, i32, float*** }
%struct.t_nrnb = type { [129 x double] }

@ps_gather_f.bFirst = internal unnamed_addr global i1 false
@ps_gather_f.nnx = internal global i32* null, align 8
@ps_gather_f.nny = internal global i32* null, align 8
@ps_gather_f.nnz = internal global i32* null, align 8
@ps_gather_f.JCXYZ = internal global [81 x i32] zeroinitializer, align 16
@.str = private unnamed_addr constant [57 x i8] c"Gathering Forces using Triangle Shaped on %dx%dx%d grid\0A\00", align 1
@.str1 = private unnamed_addr constant [23 x i8] c"beta = %10g,%10g,%10g\0A\00", align 1
@.str2 = private unnamed_addr constant [23 x i8] c"c1   = %10g,%10g,%10g\0A\00", align 1
@.str3 = private unnamed_addr constant [23 x i8] c"c2   = %10g,%10g,%10g\0A\00", align 1
@.str4 = private unnamed_addr constant [23 x i8] c"invh = %10g,%10g,%10g\0A\00", align 1

; Function Attrs: alwaysinline nounwind optsize ssp uwtable
define i32 @__sputc(i32 %_c, %struct.__sFILE* %_p) #0 {

!50 = !DIEnumerator(name: "eNR_INL2300", value: 44)
!51 = !DIEnumerator(name: "eNR_INL2310", value: 45)
!52 = !DIEnumerator(name: "eNR_INL2320", value: 46)
!53 = !DIEnumerator(name: "eNR_INL2330", value: 47)
!54 = !DIEnumerator(name: "eNR_INL2400", value: 48)
!55 = !DIEnumerator(name: "eNR_INL2410", value: 49)
!56 = !DIEnumerator(name: "eNR_INL2420", value: 50)
!57 = !DIEnumerator(name: "eNR_INL2430", value: 51)
!58 = !DIEnumerator(name: "eNR_INL3000", value: 52)
!59 = !DIEnumerator(name: "eNR_INL3001", value: 53)
!60 = !DIEnumerator(name: "eNR_INL3002", value: 54)
!61 = !DIEnumerator(name: "eNR_INL3010", value: 55)
!62 = !DIEnumerator(name: "eNR_INL3020", value: 56)
!63 = !DIEnumerator(name: "eNR_INL3030", value: 57)
!64 = !DIEnumerator(name: "eNR_INL3100", value: 58)
!65 = !DIEnumerator(name: "eNR_INL3110", value: 59)
!66 = !DIEnumerator(name: "eNR_INL3120", value: 60)
!67 = !DIEnumerator(name: "eNR_INL3130", value: 61)
!68 = !DIEnumerator(name: "eNR_INL3200", value: 62)
!69 = !DIEnumerator(name: "eNR_INL3210", value: 63)
!70 = !DIEnumerator(name: "eNR_INL3220", value: 64)
!71 = !DIEnumerator(name: "eNR_INL3230", value: 65)
!72 = !DIEnumerator(name: "eNR_INL3300", value: 66)
!73 = !DIEnumerator(name: "eNR_INL3301", value: 67)
!74 = !DIEnumerator(name: "eNR_INL3302", value: 68)
!75 = !DIEnumerator(name: "eNR_INL3310", value: 69)
!76 = !DIEnumerator(name: "eNR_INL3320", value: 70)
!77 = !DIEnumerator(name: "eNR_INL3330", value: 71)
!78 = !DIEnumerator(name: "eNR_INL3400", value: 72)
!79 = !DIEnumerator(name: "eNR_INL3401", value: 73)
!80 = !DIEnumerator(name: "eNR_INL3402", value: 74)
!81 = !DIEnumerator(name: "eNR_INL3410", value: 75)
!82 = !DIEnumerator(name: "eNR_INL3420", value: 76)
!83 = !DIEnumerator(name: "eNR_INL3430", value: 77)
!84 = !DIEnumerator(name: "eNR_INLOOP", value: 78)
!85 = !DIEnumerator(name: "eNR_INL_IATOM", value: 78)
!86 = !DIEnumerator(name: "eNR_WEIGHTS", value: 79)
!87 = !DIEnumerator(name: "eNR_SPREADQ", value: 80)
!88 = !DIEnumerator(name: "eNR_SPREADQBSP", value: 81)
!89 = !DIEnumerator(name: "eNR_GATHERF", value: 82)
!90 = !DIEnumerator(name: "eNR_GATHERFBSP", value: 83)
!91 = !DIEnumerator(name: "eNR_FFT", value: 84)
!92 = !DIEnumerator(name: "eNR_CONV", value: 85)
!93 = !DIEnumerator(name: "eNR_SOLVEPME", value: 86)
!94 = !DIEnumerator(name: "eNR_NS", value: 87)
!95 = !DIEnumerator(name: "eNR_RESETX", value: 88)
!96 = !DIEnumerator(name: "eNR_SHIFTX", value: 89)
!97 = !DIEnumerator(name: "eNR_CGCM", value: 90)
!98 = !DIEnumerator(name: "eNR_FSUM", value: 91)
!99 = !DIEnumerator(name: "eNR_BONDS", value: 92)
!100 = !DIEnumerator(name: "eNR_G96BONDS", value: 93)
!101 = !DIEnumerator(name: "eNR_ANGLES", value: 94)
!102 = !DIEnumerator(name: "eNR_G96ANGLES", value: 95)
!103 = !DIEnumerator(name: "eNR_PROPER", value: 96)
!104 = !DIEnumerator(name: "eNR_IMPROPER", value: 97)
!105 = !DIEnumerator(name: "eNR_RB", value: 98)
!106 = !DIEnumerator(name: "eNR_DISRES", value: 99)
!107 = !DIEnumerator(name: "eNR_ORIRES", value: 100)
!108 = !DIEnumerator(name: "eNR_POSRES", value: 101)
!109 = !DIEnumerator(name: "eNR_ANGRES", value: 102)
!110 = !DIEnumerator(name: "eNR_ANGRESZ", value: 103)
!111 = !DIEnumerator(name: "eNR_MORSE", value: 104)
!112 = !DIEnumerator(name: "eNR_CUBICBONDS", value: 105)
!113 = !DIEnumerator(name: "eNR_WPOL", value: 106)
!114 = !DIEnumerator(name: "eNR_VIRIAL", value: 107)
!115 = !DIEnumerator(name: "eNR_UPDATE", value: 108)
!116 = !DIEnumerator(name: "eNR_EXTUPDATE", value: 109)
!117 = !DIEnumerator(name: "eNR_STOPCM", value: 110)
!118 = !DIEnumerator(name: "eNR_PCOUPL", value: 111)
!119 = !DIEnumerator(name: "eNR_EKIN", value: 112)
!120 = !DIEnumerator(name: "eNR_LINCS", value: 113)
!121 = !DIEnumerator(name: "eNR_LINCSMAT", value: 114)
!122 = !DIEnumerator(name: "eNR_SHAKE", value: 115)
!123 = !DIEnumerator(name: "eNR_SHAKE_V", value: 116)
!124 = !DIEnumerator(name: "eNR_SHAKE_RIJ", value: 117)
!125 = !DIEnumerator(name: "eNR_SHAKE_VIR", value: 118)
!126 = !DIEnumerator(name: "eNR_SETTLE", value: 119)
!127 = !DIEnumerator(name: "eNR_PSHAKEINITLD", value: 120)
!128 = !DIEnumerator(name: "eNR_PSHAKEINITMD", value: 121)
!129 = !DIEnumerator(name: "eNR_PSHAKE", value: 122)
!130 = !DIEnumerator(name: "eNR_DUM2", value: 123)
!131 = !DIEnumerator(name: "eNR_DUM3", value: 124)
!132 = !DIEnumerator(name: "eNR_DUM3FD", value: 125)
!133 = !DIEnumerator(name: "eNR_DUM3FAD", value: 126)
!134 = !DIEnumerator(name: "eNR_DUM3OUT", value: 127)
!135 = !DIEnumerator(name: "eNR_DUM4FD", value: 128)
!136 = !DIEnumerator(name: "eNRNB", value: 129)
!137 = !{!138}
!138 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!139 = !{!140, !209, !215, !253, !322}
!140 = !DISubprogram(name: "__sputc", scope: !141, file: !141, line: 348, type: !142, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !206)
!141 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !144, !145}
!144 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !141, line: 153, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !141, line: 122, size: 1216, align: 64, elements: !148)
!148 = !{!149, !152, !153, !154, !156, !157, !162, !163, !165, !169, !174, !184, !190, !191, !194, !195, !199, !203, !204, !205}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !147, file: !141, line: 123, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !147, file: !141, line: 124, baseType: !144, size: 32, align: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !147, file: !141, line: 125, baseType: !144, size: 32, align: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !147, file: !141, line: 126, baseType: !155, size: 16, align: 16, offset: 128)
!155 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !147, file: !141, line: 127, baseType: !155, size: 16, align: 16, offset: 144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !147, file: !141, line: 128, baseType: !158, size: 128, align: 64, offset: 192)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !141, line: 88, size: 128, align: 64, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !158, file: !141, line: 89, baseType: !150, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !158, file: !141, line: 90, baseType: !144, size: 32, align: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !147, file: !141, line: 129, baseType: !144, size: 32, align: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !147, file: !141, line: 132, baseType: !164, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !147, file: !141, line: 133, baseType: !166, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!144, !164}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !147, file: !141, line: 134, baseType: !170, size: 64, align: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!144, !164, !173, !144}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !147, file: !141, line: 135, baseType: !175, size: 64, align: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !164, !178, !144}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !141, line: 77, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !180, line: 71, baseType: !181)
!180 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !182, line: 46, baseType: !183)
!182 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!183 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !147, file: !141, line: 136, baseType: !185, size: 64, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!144, !164, !188, !144}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !147, file: !141, line: 139, baseType: !158, size: 128, align: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !147, file: !141, line: 140, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !141, line: 94, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !147, file: !141, line: 141, baseType: !144, size: 32, align: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !147, file: !141, line: 144, baseType: !196, size: 24, align: 8, offset: 928)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 24, align: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 3)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !147, file: !141, line: 145, baseType: !200, size: 8, align: 8, offset: 952)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !147, file: !141, line: 148, baseType: !158, size: 128, align: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !147, file: !141, line: 151, baseType: !144, size: 32, align: 32, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !147, file: !141, line: 152, baseType: !178, size: 64, align: 64, offset: 1152)
!206 = !{!207, !208}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !140, file: !141, line: 348, type: !144)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !140, file: !141, line: 348, type: !145)
!209 = !DISubprogram(name: "__sigbits", scope: !210, file: !210, line: 114, type: !211, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !213)
!210 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!211 = !DISubroutineType(types: !212)
!212 = !{!144, !144}
!213 = !{!214}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !209, file: !210, line: 114, type: !144)
!215 = !DISubprogram(name: "ps_gather_inner", scope: !1, file: !1, line: 38, type: !216, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, function: float (i32*, float*, i32*, i32*, i32*, float, float, float, float, float, float, float, float*, float***)* @ps_gather_inner, variables: !225)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !221, !222, !221, !221, !221, !218, !218, !218, !218, !218, !218, !218, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !219, line: 87, baseType: !220)
!219 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!220 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "JCXYZ", arg: 1, scope: !215, file: !1, line: 38, type: !221)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "WXYZ", arg: 2, scope: !215, file: !1, line: 38, type: !222)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ixw", arg: 3, scope: !215, file: !1, line: 38, type: !221)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iyw", arg: 4, scope: !215, file: !1, line: 38, type: !221)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "izw", arg: 5, scope: !215, file: !1, line: 38, type: !221)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1x", arg: 6, scope: !215, file: !1, line: 39, type: !218)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1y", arg: 7, scope: !215, file: !1, line: 39, type: !218)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1z", arg: 8, scope: !215, file: !1, line: 39, type: !218)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2x", arg: 9, scope: !215, file: !1, line: 39, type: !218)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2y", arg: 10, scope: !215, file: !1, line: 39, type: !218)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2z", arg: 11, scope: !215, file: !1, line: 39, type: !218)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "qi", arg: 12, scope: !215, file: !1, line: 40, type: !218)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 13, scope: !215, file: !1, line: 40, type: !222)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 14, scope: !215, file: !1, line: 40, type: !223)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pi", scope: !215, file: !1, line: 42, type: !218)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fX", scope: !215, file: !1, line: 42, type: !218)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fY", scope: !215, file: !1, line: 42, type: !218)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fZ", scope: !215, file: !1, line: 42, type: !218)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !215, file: !1, line: 42, type: !218)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jxyz", scope: !215, file: !1, line: 43, type: !144)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !215, file: !1, line: 43, type: !144)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcx", scope: !215, file: !1, line: 43, type: !144)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcy", scope: !215, file: !1, line: 43, type: !144)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcz", scope: !215, file: !1, line: 43, type: !144)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcx0", scope: !215, file: !1, line: 44, type: !144)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcy0", scope: !215, file: !1, line: 44, type: !144)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcz0", scope: !215, file: !1, line: 44, type: !144)
!253 = !DISubprogram(name: "ps_gather_f", scope: !1, file: !1, line: 86, type: !254, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, i32, [3 x float]*, [3 x float]*, float*, float*, float*, %struct.t_PSgrid*, float*, %struct.t_nrnb*)* @ps_gather_f, variables: !277)
!254 = !DISubroutineType(types: !255)
!255 = !{!218, !145, !144, !144, !256, !256, !222, !222, !222, !259, !222, !268}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !219, line: 101, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 96, align: 32, elements: !197)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_PSgrid", file: !261, line: 46, baseType: !262)
!261 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/poisson.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!262 = !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 43, size: 192, align: 64, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !262, file: !261, line: 44, baseType: !144, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !262, file: !261, line: 44, baseType: !144, size: 32, align: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !262, file: !261, line: 44, baseType: !144, size: 32, align: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !262, file: !261, line: 45, baseType: !223, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !4, line: 95, baseType: !270)
!270 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 93, size: 8256, align: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !270, file: !4, line: 94, baseType: !273, size: 8256, align: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 8256, align: 64, elements: !275)
!274 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!275 = !{!276}
!276 = !DISubrange(count: 129)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !297, !298, !299, !300, !301, !305, !306, !307, !308, !309, !310, !311, !315, !316, !317, !318, !319, !320, !321}
!278 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !253, file: !1, line: 86, type: !145)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !253, file: !1, line: 86, type: !144)
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 3, scope: !253, file: !1, line: 87, type: !144)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !253, file: !1, line: 87, type: !256)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !253, file: !1, line: 87, type: !256)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 6, scope: !253, file: !1, line: 87, type: !222)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !253, file: !1, line: 87, type: !222)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pot", arg: 8, scope: !253, file: !1, line: 88, type: !222)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 9, scope: !253, file: !1, line: 88, type: !259)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "beta", arg: 10, scope: !253, file: !1, line: 88, type: !222)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 11, scope: !253, file: !1, line: 88, type: !268)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !253, file: !1, line: 93, type: !144)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !253, file: !1, line: 93, type: !144)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "energy", scope: !253, file: !1, line: 94, type: !218)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qi", scope: !253, file: !1, line: 95, type: !218)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pi", scope: !253, file: !1, line: 95, type: !218)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ixyz", scope: !253, file: !1, line: 96, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !219, line: 107, baseType: !296)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, align: 32, elements: !197)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invh", scope: !253, file: !1, line: 97, type: !257)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !253, file: !1, line: 97, type: !257)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !253, file: !1, line: 97, type: !257)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !253, file: !1, line: 97, type: !257)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "WXYZ", scope: !253, file: !1, line: 98, type: !302)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 864, align: 32, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 27)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1x", scope: !253, file: !1, line: 99, type: !218)
