; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pullutil.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_mdatoms = type { float, i32, float*, float*, float*, float*, float*, float*, float*, i32*, i32*, i32*, i32*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16* }
%struct.t_pull = type { %struct.t_pullgrps, %struct.t_pullgrps, %struct.t_pullgrps, i32, i32, [3 x float], [3 x float], float, float, [3 x i32], float, float, i32, float, float, float, i32, i32, i32, %struct.__sFILE*, float, float, float, i32, i32, i32 }
%struct.t_pullgrps = type { i32, i32**, float**, i32*, i8**, float*, [3 x float]**, [3 x float]**, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, float*, [3 x float]*, [3 x float]** }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [38 x i8] c"Jumped +box: nr %d dir: %d old:%8.3f\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !20, globals: !463, imports: !471)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pullutil.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/pull.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "eStart", value: 0)
!7 = !DIEnumerator(name: "eAfm", value: 1)
!8 = !DIEnumerator(name: "eConstraint", value: 2)
!9 = !DIEnumerator(name: "eUmbrella", value: 3)
!10 = !DIEnumerator(name: "eTest", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 48, size: 32, align: 32, elements: !12)
!12 = !{!13, !14, !15, !16}
!13 = !DIEnumerator(name: "eCom", value: 0)
!14 = !DIEnumerator(name: "eComT0", value: 1)
!15 = !DIEnumerator(name: "eDyn", value: 2)
!16 = !DIEnumerator(name: "eDynT0", value: 3)
!17 = !{!18, !19}
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !{!21, !89, !95, !102, !108, !114, !117, !120, !123, !126, !129, !132, !141, !150, !163, !166, !169, !172, !186, !200, !206, !212, !266, !279, !347, !362, !371, !379, !396, !402, !409, !418, !425, !433, !443, !451}
!21 = !DISubprogram(name: "__sputc", scope: !22, file: !22, line: 348, type: !23, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !86)
!22 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DISubroutineType(types: !24)
!24 = !{!19, !19, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !22, line: 153, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !22, line: 122, size: 1216, align: 64, elements: !28)
!28 = !{!29, !32, !33, !34, !36, !37, !42, !43, !45, !49, !54, !64, !70, !71, !74, !75, !79, !83, !84, !85}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !27, file: !22, line: 123, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !27, file: !22, line: 124, baseType: !19, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !27, file: !22, line: 125, baseType: !19, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !22, line: 126, baseType: !35, size: 16, align: 16, offset: 128)
!35 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !27, file: !22, line: 127, baseType: !35, size: 16, align: 16, offset: 144)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !27, file: !22, line: 128, baseType: !38, size: 128, align: 64, offset: 192)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !22, line: 88, size: 128, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !38, file: !22, line: 89, baseType: !30, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !38, file: !22, line: 90, baseType: !19, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !27, file: !22, line: 129, baseType: !19, size: 32, align: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !27, file: !22, line: 132, baseType: !44, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !27, file: !22, line: 133, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!19, !44}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !27, file: !22, line: 134, baseType: !50, size: 64, align: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!19, !44, !53, !19}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !27, file: !22, line: 135, baseType: !55, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !44, !58, !19}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !22, line: 77, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !60, line: 71, baseType: !61)
!60 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !27, file: !22, line: 136, baseType: !65, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!19, !44, !68, !19}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !27, file: !22, line: 139, baseType: !38, size: 128, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !27, file: !22, line: 140, baseType: !72, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !22, line: 94, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !27, file: !22, line: 141, baseType: !19, size: 32, align: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !27, file: !22, line: 144, baseType: !76, size: 24, align: 8, offset: 928)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 3)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !27, file: !22, line: 145, baseType: !80, size: 8, align: 8, offset: 952)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !27, file: !22, line: 148, baseType: !38, size: 128, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !27, file: !22, line: 151, baseType: !19, size: 32, align: 32, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !22, line: 152, baseType: !58, size: 64, align: 64, offset: 1152)
!86 = !{!87, !88}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !21, file: !22, line: 348, type: !19)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !21, file: !22, line: 348, type: !25)
!89 = !DISubprogram(name: "__sigbits", scope: !90, file: !90, line: 114, type: !91, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !93)
!90 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!91 = !DISubroutineType(types: !92)
!92 = !{!19, !19}
!93 = !{!94}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !89, file: !90, line: 114, type: !19)
!95 = !DISubprogram(name: "__inline_isfinitef", scope: !96, file: !96, line: 204, type: !97, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !100)
!96 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !DISubroutineType(types: !98)
!98 = !{!19, !99}
!99 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!100 = !{!101}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !95, file: !96, line: 204, type: !99)
!102 = !DISubprogram(name: "__inline_isfinited", scope: !96, file: !96, line: 207, type: !103, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !106)
!103 = !DISubroutineType(types: !104)
!104 = !{!19, !105}
!105 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!106 = !{!107}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !102, file: !96, line: 207, type: !105)
!108 = !DISubprogram(name: "__inline_isfinitel", scope: !96, file: !96, line: 210, type: !109, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !112)
!109 = !DISubroutineType(types: !110)
!110 = !{!19, !111}
!111 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!112 = !{!113}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !108, file: !96, line: 210, type: !111)
!114 = !DISubprogram(name: "__inline_isinff", scope: !96, file: !96, line: 213, type: !97, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !115)
!115 = !{!116}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !114, file: !96, line: 213, type: !99)
!117 = !DISubprogram(name: "__inline_isinfd", scope: !96, file: !96, line: 216, type: !103, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !118)
!118 = !{!119}
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !117, file: !96, line: 216, type: !105)
!120 = !DISubprogram(name: "__inline_isinfl", scope: !96, file: !96, line: 219, type: !109, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !121)
!121 = !{!122}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !120, file: !96, line: 219, type: !111)
!123 = !DISubprogram(name: "__inline_isnanf", scope: !96, file: !96, line: 222, type: !97, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !124)
!124 = !{!125}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !123, file: !96, line: 222, type: !99)
!126 = !DISubprogram(name: "__inline_isnand", scope: !96, file: !96, line: 225, type: !103, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !127)
!127 = !{!128}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !126, file: !96, line: 225, type: !105)
!129 = !DISubprogram(name: "__inline_isnanl", scope: !96, file: !96, line: 228, type: !109, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !130)
!130 = !{!131}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !129, file: !96, line: 228, type: !111)
!132 = !DISubprogram(name: "__inline_signbitf", scope: !96, file: !96, line: 231, type: !97, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !133)
!133 = !{!134, !135}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !132, file: !96, line: 231, type: !99)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !132, file: !96, line: 232, type: !136)
!136 = !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !96, line: 232, size: 32, align: 32, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !136, file: !96, line: 232, baseType: !99, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !136, file: !96, line: 232, baseType: !140, size: 32, align: 32)
!140 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!141 = !DISubprogram(name: "__inline_signbitd", scope: !96, file: !96, line: 236, type: !103, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !142)
!142 = !{!143, !144}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !141, file: !96, line: 236, type: !105)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !141, file: !96, line: 237, type: !145)
!145 = !DICompositeType(tag: DW_TAG_union_type, scope: !141, file: !96, line: 237, size: 64, align: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !145, file: !96, line: 237, baseType: !105, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !145, file: !96, line: 237, baseType: !149, size: 64, align: 64)
!149 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!150 = !DISubprogram(name: "__inline_signbitl", scope: !96, file: !96, line: 242, type: !109, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !151)
!151 = !{!152, !153}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !150, file: !96, line: 242, type: !111)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !150, file: !96, line: 246, type: !154)
!154 = !DICompositeType(tag: DW_TAG_union_type, scope: !150, file: !96, line: 243, size: 128, align: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !154, file: !96, line: 244, baseType: !111, size: 128, align: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !154, file: !96, line: 245, baseType: !158, size: 128, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, scope: !154, file: !96, line: 245, size: 128, align: 64, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !158, file: !96, line: 245, baseType: !149, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !158, file: !96, line: 245, baseType: !162, size: 16, align: 16, offset: 64)
!162 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!163 = !DISubprogram(name: "__inline_isnormalf", scope: !96, file: !96, line: 257, type: !97, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !164)
!164 = !{!165}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !163, file: !96, line: 257, type: !99)
!166 = !DISubprogram(name: "__inline_isnormald", scope: !96, file: !96, line: 260, type: !103, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !167)
!167 = !{!168}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !166, file: !96, line: 260, type: !105)
!169 = !DISubprogram(name: "__inline_isnormall", scope: !96, file: !96, line: 263, type: !109, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !170)
!170 = !{!171}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !169, file: !96, line: 263, type: !111)
!172 = !DISubprogram(name: "__sincosf", scope: !96, file: !96, line: 642, type: !173, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !99, !175, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !96, line: 642, type: !99)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !172, file: !96, line: 642, type: !175)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !172, file: !96, line: 642, type: !175)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !172, file: !96, line: 643, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !96, line: 634, size: 64, align: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !182, file: !96, line: 634, baseType: !99, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !182, file: !96, line: 634, baseType: !99, size: 32, align: 32, offset: 32)
!186 = !DISubprogram(name: "__sincos", scope: !96, file: !96, line: 647, type: !187, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !190)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !105, !189, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!190 = !{!191, !192, !193, !194}
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !96, line: 647, type: !105)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !186, file: !96, line: 647, type: !189)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !186, file: !96, line: 647, type: !189)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !186, file: !96, line: 648, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !96, line: 635, size: 128, align: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !196, file: !96, line: 635, baseType: !105, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !196, file: !96, line: 635, baseType: !105, size: 64, align: 64, offset: 64)
!200 = !DISubprogram(name: "__sincospif", scope: !96, file: !96, line: 652, type: !173, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !200, file: !96, line: 652, type: !99)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !200, file: !96, line: 652, type: !175)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !200, file: !96, line: 652, type: !175)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !200, file: !96, line: 653, type: !181)
!206 = !DISubprogram(name: "__sincospi", scope: !96, file: !96, line: 657, type: !187, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !206, file: !96, line: 657, type: !105)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !206, file: !96, line: 657, type: !189)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !206, file: !96, line: 657, type: !189)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !206, file: !96, line: 658, type: !195)
!212 = !DISubprogram(name: "calc_com", scope: !1, file: !1, line: 51, type: !213, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: float ([3 x float]*, i32, i32*, %struct.t_mdatoms*, float*, [3 x float]*)* @calc_com, variables: !254)
!213 = !DISubroutineType(types: !214)
!214 = !{!215, !217, !19, !220, !222, !230, !253}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !216, line: 87, baseType: !99)
!216 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !216, line: 101, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 96, align: 32, elements: !77)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !216, line: 73, baseType: !19)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !224, line: 51, baseType: !225)
!224 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !224, line: 40, size: 1408, align: 64, elements: !226)
!226 = !{!227, !228, !229, !231, !232, !233, !234, !235, !236, !237, !239, !240, !241, !242, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !225, file: !224, line: 41, baseType: !215, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !225, file: !224, line: 42, baseType: !19, size: 32, align: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !225, file: !224, line: 43, baseType: !230, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !225, file: !224, line: 43, baseType: !230, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !225, file: !224, line: 43, baseType: !230, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !225, file: !224, line: 43, baseType: !230, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !225, file: !224, line: 44, baseType: !230, size: 64, align: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !225, file: !224, line: 44, baseType: !230, size: 64, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !225, file: !224, line: 44, baseType: !230, size: 64, align: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !225, file: !224, line: 45, baseType: !238, size: 64, align: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !225, file: !224, line: 46, baseType: !238, size: 64, align: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !225, file: !224, line: 47, baseType: !238, size: 64, align: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !225, file: !224, line: 47, baseType: !238, size: 64, align: 64, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !225, file: !224, line: 48, baseType: !243, size: 64, align: 64, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !225, file: !224, line: 49, baseType: !243, size: 64, align: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !225, file: !224, line: 49, baseType: !243, size: 64, align: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !225, file: !224, line: 49, baseType: !243, size: 64, align: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !225, file: !224, line: 49, baseType: !243, size: 64, align: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !225, file: !224, line: 49, baseType: !243, size: 64, align: 64, offset: 1088)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !225, file: !224, line: 49, baseType: !243, size: 64, align: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !225, file: !224, line: 50, baseType: !243, size: 64, align: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !225, file: !224, line: 50, baseType: !243, size: 64, align: 64, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !225, file: !224, line: 50, baseType: !243, size: 64, align: 64, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !212, file: !1, line: 51, type: !217)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnx", arg: 2, scope: !212, file: !1, line: 51, type: !19)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !212, file: !1, line: 51, type: !220)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 4, scope: !212, file: !1, line: 51, type: !222)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "com", arg: 5, scope: !212, file: !1, line: 52, type: !230)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !212, file: !1, line: 52, type: !253)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !212, file: !1, line: 54, type: !19)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !212, file: !1, line: 54, type: !19)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !212, file: !1, line: 54, type: !19)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m0", scope: !212, file: !1, line: 55, type: !215)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !212, file: !1, line: 55, type: !215)
!266 = !DISubprogram(name: "calc_com2", scope: !1, file: !1, line: 77, type: !213, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: float ([3 x float]*, i32, i32*, %struct.t_mdatoms*, float*, [3 x float]*)* @calc_com2, variables: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !266, file: !1, line: 77, type: !217)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnx", arg: 2, scope: !266, file: !1, line: 77, type: !19)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !266, file: !1, line: 77, type: !220)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 4, scope: !266, file: !1, line: 77, type: !222)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "com", arg: 5, scope: !266, file: !1, line: 77, type: !230)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !266, file: !1, line: 78, type: !253)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !266, file: !1, line: 80, type: !19)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !266, file: !1, line: 80, type: !19)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !266, file: !1, line: 80, type: !19)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m0", scope: !266, file: !1, line: 81, type: !215)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !266, file: !1, line: 81, type: !215)
!279 = !DISubprogram(name: "calc_running_com", scope: !1, file: !1, line: 101, type: !280, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_pull*)* @calc_running_com, variables: !340)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pull", file: !4, line: 98, baseType: !284)
!284 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 71, size: 4416, align: 64, elements: !285)
!285 = !{!286, !312, !313, !314, !316, !318, !319, !320, !321, !322, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dyna", scope: !284, file: !4, line: 72, baseType: !287, size: 1152, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pullgrps", file: !4, line: 69, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 50, size: 1152, align: 64, elements: !289)
!289 = !{!290, !291, !293, !295, !296, !298, !299, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !288, file: !4, line: 51, baseType: !19, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !288, file: !4, line: 52, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !288, file: !4, line: 53, baseType: !294, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ngx", scope: !288, file: !4, line: 54, baseType: !238, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !288, file: !4, line: 55, baseType: !297, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !288, file: !4, line: 56, baseType: !230, size: 64, align: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !288, file: !4, line: 57, baseType: !300, size: 64, align: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "xp", scope: !288, file: !4, line: 58, baseType: !300, size: 64, align: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "x_ref", scope: !288, file: !4, line: 59, baseType: !217, size: 64, align: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "x_unc", scope: !288, file: !4, line: 60, baseType: !217, size: 64, align: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "x_con", scope: !288, file: !4, line: 61, baseType: !217, size: 64, align: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "xprev", scope: !288, file: !4, line: 62, baseType: !217, size: 64, align: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !288, file: !4, line: 63, baseType: !217, size: 64, align: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "spring", scope: !288, file: !4, line: 64, baseType: !217, size: 64, align: 64, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !288, file: !4, line: 65, baseType: !217, size: 64, align: 64, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "d_ref", scope: !288, file: !4, line: 66, baseType: !230, size: 64, align: 64, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "xtarget", scope: !288, file: !4, line: 67, baseType: !217, size: 64, align: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "comhist", scope: !288, file: !4, line: 68, baseType: !300, size: 64, align: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pull", scope: !284, file: !4, line: 73, baseType: !287, size: 1152, align: 64, offset: 1152)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !284, file: !4, line: 74, baseType: !287, size: 1152, align: 64, offset: 2304)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "runtype", scope: !284, file: !4, line: 75, baseType: !315, size: 32, align: 32, offset: 3456)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_runtype", file: !4, line: 47, baseType: !3)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reftype", scope: !284, file: !4, line: 76, baseType: !317, size: 32, align: 32, offset: 3488)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_reftype", file: !4, line: 48, baseType: !11)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !284, file: !4, line: 77, baseType: !218, size: 96, align: 32, offset: 3520)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "coor", scope: !284, file: !4, line: 78, baseType: !218, size: 96, align: 32, offset: 3616)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !284, file: !4, line: 79, baseType: !215, size: 32, align: 32, offset: 3712)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !284, file: !4, line: 80, baseType: !215, size: 32, align: 32, offset: 3744)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bRot", scope: !284, file: !4, line: 81, baseType: !323, size: 96, align: 32, offset: 3776)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, align: 32, elements: !77)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rot_rate", scope: !284, file: !4, line: 82, baseType: !215, size: 32, align: 32, offset: 3872)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "xlt_rate", scope: !284, file: !4, line: 83, baseType: !215, size: 32, align: 32, offset: 3904)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rot_incr", scope: !284, file: !4, line: 84, baseType: !19, size: 32, align: 32, offset: 3936)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "xlt_incr", scope: !284, file: !4, line: 85, baseType: !215, size: 32, align: 32, offset: 3968)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tolerance", scope: !284, file: !4, line: 86, baseType: !215, size: 32, align: 32, offset: 4000)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "constr_tol", scope: !284, file: !4, line: 87, baseType: !215, size: 32, align: 32, offset: 4032)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bPull", scope: !284, file: !4, line: 88, baseType: !19, size: 32, align: 32, offset: 4064)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bCyl", scope: !284, file: !4, line: 89, baseType: !19, size: 32, align: 32, offset: 4096)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bReverse", scope: !284, file: !4, line: 90, baseType: !19, size: 32, align: 32, offset: 4128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !284, file: !4, line: 91, baseType: !25, size: 64, align: 64, offset: 4160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !284, file: !4, line: 92, baseType: !215, size: 32, align: 32, offset: 4224)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !284, file: !4, line: 93, baseType: !215, size: 32, align: 32, offset: 4256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "um_width", scope: !284, file: !4, line: 94, baseType: !215, size: 32, align: 32, offset: 4288)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !284, file: !4, line: 95, baseType: !19, size: 32, align: 32, offset: 4320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reflag", scope: !284, file: !4, line: 96, baseType: !19, size: 32, align: 32, offset: 4352)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bVerbose", scope: !284, file: !4, line: 97, baseType: !19, size: 32, align: 32, offset: 4384)
!340 = !{!341, !342, !343, !344, !345, !346}
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pull", arg: 1, scope: !279, file: !1, line: 101, type: !282)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !279, file: !1, line: 102, type: !19)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !279, file: !1, line: 102, type: !19)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !279, file: !1, line: 102, type: !19)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ave", scope: !279, file: !1, line: 103, type: !218)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !279, file: !1, line: 104, type: !215)
!347 = !DISubprogram(name: "correct_t0_pbc", scope: !1, file: !1, line: 164, type: !348, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_pull*, [3 x float]*, %struct.t_mdatoms*, [3 x float]*)* @correct_t0_pbc, variables: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !282, !217, !222, !253}
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pull", arg: 1, scope: !347, file: !1, line: 164, type: !282)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !347, file: !1, line: 164, type: !217)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 3, scope: !347, file: !1, line: 164, type: !222)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !347, file: !1, line: 164, type: !253)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !347, file: !1, line: 165, type: !19)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !347, file: !1, line: 165, type: !19)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !347, file: !1, line: 165, type: !19)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !347, file: !1, line: 165, type: !19)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !347, file: !1, line: 166, type: !215)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "com", scope: !347, file: !1, line: 167, type: !218)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !347, file: !1, line: 167, type: !218)
!362 = !DISubprogram(name: "string2rvec", scope: !1, file: !1, line: 204, type: !363, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, float*)* @string2rvec, variables: !365)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !53, !230}
!365 = !{!366, !367, !368, !369, !370}
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !362, file: !1, line: 204, type: !53)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nums", arg: 2, scope: !362, file: !1, line: 204, type: !230)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !362, file: !1, line: 205, type: !99)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !362, file: !1, line: 205, type: !99)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !362, file: !1, line: 205, type: !99)
!371 = !DISubprogram(name: "get_weight", scope: !1, file: !1, line: 212, type: !372, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @get_weight, variables: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{!215, !215, !215, !215}
!374 = !{!375, !376, !377, !378}
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !371, file: !1, line: 212, type: !215)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 2, scope: !371, file: !1, line: 212, type: !215)
