; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/random.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [59 x i8] c"Velocities were taken from a Maxwell distribution at %g K\0A\00", align 1
@debug = external global %struct.__sFILE*
@.str1 = private unnamed_addr constant [109 x i8] c"Velocities were taken from a Maxwell distribution\0AInitial generated temperature: %12.5e (scaled to: %12.5e)\0A\00", align 1
@.str2 = private unnamed_addr constant [48 x i8] c"Using random seed %d for generating velocities\0A\00", align 1
@.str3 = private unnamed_addr constant [6 x i8] c"dummy\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/random.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !{!6, !75, !81, !95, !192, !207, !218, !238, !256, !262, !269}
!6 = !DISubprogram(name: "__sputc", scope: !7, file: !7, line: 348, type: !8, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !7, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !7, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !7, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !7, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !7, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !7, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !7, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !7, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !7, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !7, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !7, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !7, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !7, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !7, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!10, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !7, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!10, !30, !39, !10}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !7, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !10}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !7, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !7, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!10, !30, !54, !10}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !7, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !7, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !7, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !7, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !7, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !7, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !7, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !7, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !7, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !6, file: !7, line: 348, type: !10)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !6, file: !7, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!10, !10}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !10)
!81 = !DISubprogram(name: "gauss", scope: !1, file: !1, line: 41, type: !82, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, i32*)* @gauss, variables: !88)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !84, !84, !87}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !85, line: 87, baseType: !86)
!85 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!88 = !{!89, !90, !91, !92, !93, !94}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "am", arg: 1, scope: !81, file: !1, line: 41, type: !84)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sd", arg: 2, scope: !81, file: !1, line: 41, type: !84)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ig", arg: 3, scope: !81, file: !1, line: 41, type: !87)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !81, file: !1, line: 51, type: !84)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !81, file: !1, line: 52, type: !10)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gval", scope: !81, file: !1, line: 58, type: !84)
!95 = !DISubprogram(name: "low_mspeed", scope: !1, file: !1, line: 84, type: !96, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: void (float, i32, i32, i32, i32*, %struct.t_atoms*, [3 x float]*)* @low_mspeed, variables: !174)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !84, !10, !10, !10, !98, !100, !171}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !85, line: 73, baseType: !10)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !102, line: 94, baseType: !103)
!102 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 75, size: 10240, align: 64, elements: !104)
!104 = !{!105, !106, !125, !128, !129, !130, !131, !132, !133, !134, !147, !154}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !103, file: !102, line: 76, baseType: !10, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !103, file: !102, line: 77, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !102, line: 57, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 48, size: 320, align: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !117, !118, !119, !120, !124}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !109, file: !102, line: 49, baseType: !84, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !109, file: !102, line: 49, baseType: !84, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !109, file: !102, line: 50, baseType: !84, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !109, file: !102, line: 50, baseType: !84, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !102, line: 51, baseType: !116, size: 16, align: 16, offset: 128)
!116 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !109, file: !102, line: 52, baseType: !116, size: 16, align: 16, offset: 144)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !109, file: !102, line: 53, baseType: !10, size: 32, align: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !109, file: !102, line: 54, baseType: !10, size: 32, align: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !109, file: !102, line: 55, baseType: !121, size: 72, align: 8, offset: 224)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 72, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 9)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !109, file: !102, line: 56, baseType: !17, size: 8, align: 8, offset: 296)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !103, file: !102, line: 80, baseType: !126, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !103, file: !102, line: 82, baseType: !126, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !103, file: !102, line: 84, baseType: !126, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !103, file: !102, line: 86, baseType: !10, size: 32, align: 32, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !103, file: !102, line: 87, baseType: !126, size: 64, align: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !103, file: !102, line: 89, baseType: !10, size: 32, align: 32, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !103, file: !102, line: 90, baseType: !126, size: 64, align: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !103, file: !102, line: 91, baseType: !135, size: 8448, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !136, line: 52, baseType: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 36, size: 8448, align: 64, elements: !138)
!138 = !{!139, !143, !144, !145, !146}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !137, file: !136, line: 37, baseType: !140, size: 8192, align: 32)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !137, file: !136, line: 43, baseType: !10, size: 32, align: 32, offset: 8192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !137, file: !136, line: 44, baseType: !98, size: 64, align: 64, offset: 8256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !137, file: !136, line: 45, baseType: !10, size: 32, align: 32, offset: 8320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !137, file: !136, line: 46, baseType: !98, size: 64, align: 64, offset: 8384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !103, file: !102, line: 92, baseType: !148, size: 1152, align: 64, offset: 9024)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 1152, align: 64, elements: !122)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !102, line: 73, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 70, size: 128, align: 64, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !150, file: !102, line: 71, baseType: !10, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !150, file: !102, line: 72, baseType: !87, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !103, file: !102, line: 93, baseType: !155, size: 64, align: 64, offset: 10176)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !102, line: 68, baseType: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 59, size: 416, align: 32, elements: !158)
!158 = !{!159, !160, !161, !162, !166, !167, !168, !169}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !102, line: 60, baseType: !10, size: 32, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !157, file: !102, line: 61, baseType: !10, size: 32, align: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !157, file: !102, line: 62, baseType: !4, size: 8, align: 8, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !157, file: !102, line: 63, baseType: !163, size: 48, align: 8, offset: 72)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, align: 8, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 6)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !157, file: !102, line: 64, baseType: !84, size: 32, align: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !157, file: !102, line: 65, baseType: !84, size: 32, align: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !157, file: !102, line: 66, baseType: !10, size: 32, align: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !157, file: !102, line: 67, baseType: !170, size: 192, align: 32, offset: 224)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, align: 32, elements: !164)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !85, line: 101, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 96, align: 32, elements: !63)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tempi", arg: 1, scope: !95, file: !1, line: 84, type: !84)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrdf", arg: 2, scope: !95, file: !1, line: 84, type: !10)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 3, scope: !95, file: !1, line: 84, type: !10)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nat", arg: 4, scope: !95, file: !1, line: 84, type: !10)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 5, scope: !95, file: !1, line: 84, type: !98)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 6, scope: !95, file: !1, line: 85, type: !100)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 7, scope: !95, file: !1, line: 85, type: !171)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !95, file: !1, line: 87, type: !10)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !95, file: !1, line: 87, type: !10)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !95, file: !1, line: 87, type: !10)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ig", scope: !95, file: !1, line: 87, type: !10)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "boltz", scope: !95, file: !1, line: 88, type: !84)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !95, file: !1, line: 88, type: !84)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ekin", scope: !95, file: !1, line: 89, type: !84)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !95, file: !1, line: 89, type: !84)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mass", scope: !95, file: !1, line: 89, type: !84)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scal", scope: !95, file: !1, line: 89, type: !84)
!192 = !DISubprogram(name: "grp_maxwell", scope: !1, file: !1, line: 122, type: !193, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_block*, float*, i32*, i32, %struct.t_atoms*, [3 x float]*)* @grp_maxwell, variables: !197)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !195, !196, !87, !10, !100, !171}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grp", arg: 1, scope: !192, file: !1, line: 122, type: !195)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tempi", arg: 2, scope: !192, file: !1, line: 122, type: !196)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrdf", arg: 3, scope: !192, file: !1, line: 122, type: !87)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 4, scope: !192, file: !1, line: 122, type: !10)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 5, scope: !192, file: !1, line: 123, type: !100)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 6, scope: !192, file: !1, line: 123, type: !171)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !192, file: !1, line: 125, type: !10)
