; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rbin.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_bin = type { i32, i32, double* }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [2 x i8] c"b\00", align 1
@.str1 = private unnamed_addr constant [64 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rbin.c\00", align 1
@.str2 = private unnamed_addr constant [8 x i8] c"b->rbuf\00", align 1

; Function Attrs: alwaysinline nounwind optsize ssp uwtable
define i32 @__sputc(i32 %_c, %struct.__sFILE* %_p) #0 {
  tail call void @llvm.dbg.value(metadata i32 %_c, i64 0, metadata !73, metadata !171), !dbg !172
  tail call void @llvm.dbg.value(metadata %struct.__sFILE* %_p, i64 0, metadata !74, metadata !171), !dbg !173
  %1 = getelementptr inbounds %struct.__sFILE* %_p, i64 0, i32 2, !dbg !174
  %2 = load i32* %1, align 4, !dbg !176, !tbaa !177
  %3 = add nsw i32 %2, -1, !dbg !176
  store i32 %3, i32* %1, align 4, !dbg !176, !tbaa !177
  %4 = icmp sgt i32 %2, 0, !dbg !186
  br i1 %4, label %._crit_edge, label %5, !dbg !187


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rbin.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !{!6, !75, !81, !96, !101, !117, !129, !147, !157}
!6 = !DISubprogram(name: "__sputc", scope: !7, file: !7, line: 348, type: !8, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !7, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !7, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !7, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !7, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !7, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !7, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !7, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !7, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !7, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !7, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !7, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !7, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !7, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !7, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!10, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !7, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!10, !30, !39, !10}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !7, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !10}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !7, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !7, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!10, !30, !54, !10}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !7, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !7, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !7, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !7, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !7, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !7, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !7, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !7, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !7, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !6, file: !7, line: 348, type: !10)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !6, file: !7, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!10, !10}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !10)
!81 = !DISubprogram(name: "mk_bin", scope: !1, file: !1, line: 39, type: !82, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_bin* ()* @mk_bin, variables: !94)
!82 = !DISubroutineType(types: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_bin", file: !86, line: 49, baseType: !87)
!86 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rbin.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!87 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 45, size: 128, align: 64, elements: !88)
!88 = !{!89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nreal", scope: !87, file: !86, line: 46, baseType: !10, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "maxreal", scope: !87, file: !86, line: 47, baseType: !10, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !87, file: !86, line: 48, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!94 = !{!95}
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !81, file: !1, line: 41, type: !84)
!96 = !DISubprogram(name: "reset_bin", scope: !1, file: !1, line: 48, type: !97, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_bin*)* @reset_bin, variables: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !84}
!99 = !{!100}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !96, file: !1, line: 48, type: !84)
!101 = !DISubprogram(name: "add_binr", scope: !1, file: !1, line: 53, type: !102, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_bin*, i32, float*)* @add_binr, variables: !108)
!102 = !DISubroutineType(types: !103)
!103 = !{!10, !11, !84, !10, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !106, line: 87, baseType: !107)
!106 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!107 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !101, file: !1, line: 53, type: !11)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !101, file: !1, line: 53, type: !84)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 3, scope: !101, file: !1, line: 53, type: !10)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 4, scope: !101, file: !1, line: 53, type: !104)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !101, file: !1, line: 56, type: !10)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rest", scope: !101, file: !1, line: 56, type: !10)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !101, file: !1, line: 56, type: !10)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rbuf", scope: !101, file: !1, line: 57, type: !92)
!117 = !DISubprogram(name: "add_bind", scope: !1, file: !1, line: 85, type: !118, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_bin*, i32, double*)* @add_bind, variables: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{!10, !11, !84, !10, !92}
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !117, file: !1, line: 85, type: !11)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !117, file: !1, line: 85, type: !84)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 3, scope: !117, file: !1, line: 85, type: !10)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 4, scope: !117, file: !1, line: 85, type: !92)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !117, file: !1, line: 88, type: !10)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rest", scope: !117, file: !1, line: 88, type: !10)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !117, file: !1, line: 88, type: !10)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rbuf", scope: !117, file: !1, line: 89, type: !92)
!129 = !DISubprogram(name: "sum_bin", scope: !1, file: !1, line: 117, type: !130, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_bin*, %struct.t_commrec*)* @sum_bin, variables: !143)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !84, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !134, line: 40, baseType: !135)
!134 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 36, size: 192, align: 32, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !135, file: !134, line: 37, baseType: !10, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !135, file: !134, line: 37, baseType: !10, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !135, file: !134, line: 38, baseType: !10, size: 32, align: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !135, file: !134, line: 38, baseType: !10, size: 32, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !135, file: !134, line: 39, baseType: !10, size: 32, align: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !135, file: !134, line: 39, baseType: !10, size: 32, align: 32, offset: 160)
!143 = !{!144, !145, !146}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !129, file: !1, line: 117, type: !84)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !129, file: !1, line: 117, type: !132)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !129, file: !1, line: 119, type: !10)
!147 = !DISubprogram(name: "extract_binr", scope: !1, file: !1, line: 126, type: !148, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_bin*, i32, i32, float*)* @extract_binr, variables: !150)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !84, !10, !10, !104}
!150 = !{!151, !152, !153, !154, !155, !156}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !147, file: !1, line: 126, type: !84)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !147, file: !1, line: 126, type: !10)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 3, scope: !147, file: !1, line: 126, type: !10)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 4, scope: !147, file: !1, line: 126, type: !104)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !147, file: !1, line: 128, type: !10)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rbuf", scope: !147, file: !1, line: 129, type: !92)
!157 = !DISubprogram(name: "extract_bind", scope: !1, file: !1, line: 136, type: !158, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_bin*, i32, i32, double*)* @extract_bind, variables: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !84, !10, !10, !92}
!160 = !{!161, !162, !163, !164, !165, !166}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !157, file: !1, line: 136, type: !84)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !157, file: !1, line: 136, type: !10)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 3, scope: !157, file: !1, line: 136, type: !10)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 4, scope: !157, file: !1, line: 136, type: !92)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !157, file: !1, line: 138, type: !10)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rbuf", scope: !157, file: !1, line: 139, type: !92)
!167 = !{i32 2, !"Dwarf Version", i32 2}
!168 = !{i32 2, !"Debug Info Version", i32 700000003}
!169 = !{i32 1, !"PIC Level", i32 2}
!170 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!171 = !DIExpression()
!172 = !DILocation(line: 348, column: 40, scope: !6)
!173 = !DILocation(line: 348, column: 50, scope: !6)
!174 = !DILocation(line: 349, column: 12, scope: !175)
!175 = distinct !DILexicalBlock(scope: !6, file: !7, line: 349, column: 6)
!176 = !DILocation(line: 349, column: 6, scope: !175)
!177 = !{!178, !182, i64 12}
!178 = !{!"__sFILE", !179, i64 0, !182, i64 8, !182, i64 12, !183, i64 16, !183, i64 18, !184, i64 24, !182, i64 40, !179, i64 48, !179, i64 56, !179, i64 64, !179, i64 72, !179, i64 80, !184, i64 88, !179, i64 104, !182, i64 112, !180, i64 116, !180, i64 119, !184, i64 120, !182, i64 136, !185, i64 144}
!179 = !{!"any pointer", !180, i64 0}
!180 = !{!"omnipotent char", !181, i64 0}
!181 = !{!"Simple C/C++ TBAA"}
!182 = !{!"int", !180, i64 0}
!183 = !{!"short", !180, i64 0}
!184 = !{!"__sbuf", !179, i64 0, !182, i64 8}
!185 = !{!"long long", !180, i64 0}
!186 = !DILocation(line: 349, column: 15, scope: !175)
!187 = !DILocation(line: 349, column: 20, scope: !175)
!188 = !DILocation(line: 350, column: 10, scope: !175)
!189 = !DILocation(line: 349, column: 38, scope: !175)
!190 = !{!178, !182, i64 40}
