; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rdgroup.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }

@.str = private unnamed_addr constant [76 x i8] c"%s atom number (index[%d]=%d) is larger than the number of atoms in %s (%d)\00", align 1
@.str1 = private unnamed_addr constant [6 x i8] c"Index\00", align 1
@.str2 = private unnamed_addr constant [15 x i8] c"the trajectory\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [2 x i8] c"b\00", align 1
@.str5 = private unnamed_addr constant [67 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rdgroup.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rdgroup.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !{!7, !75, !81, !94, !128, !142, !154, !226, !240}
!7 = !DISubprogram(name: "__sputc", scope: !8, file: !8, line: 348, type: !9, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !12}
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 153, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !8, line: 122, size: 1216, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21, !23, !24, !29, !30, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !14, file: !8, line: 123, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !14, file: !8, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !14, file: !8, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !8, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !14, file: !8, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !14, file: !8, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !8, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !8, line: 89, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !8, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !14, file: !8, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !14, file: !8, line: 132, baseType: !5, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !14, file: !8, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!11, !5}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !14, file: !8, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!11, !5, !39, !11}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !14, file: !8, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !44, !11}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !8, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !14, file: !8, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!11, !5, !54, !11}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !14, file: !8, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !14, file: !8, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !8, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !14, file: !8, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !14, file: !8, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !14, file: !8, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !14, file: !8, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !14, file: !8, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !8, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !7, file: !8, line: 348, type: !11)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !7, file: !8, line: 348, type: !12)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!11, !11}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !11)
!81 = !DISubprogram(name: "check_index", scope: !1, file: !1, line: 43, type: !82, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32*, i8*, i32)* @check_index, variables: !87)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !39, !11, !84, !39, !11}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !86, line: 73, baseType: !11)
!86 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gname", arg: 1, scope: !81, file: !1, line: 43, type: !39)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !81, file: !1, line: 43, type: !11)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !81, file: !1, line: 43, type: !84)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traj", arg: 4, scope: !81, file: !1, line: 43, type: !39)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 5, scope: !81, file: !1, line: 43, type: !11)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !81, file: !1, line: 45, type: !11)
!94 = !DISubprogram(name: "init_index", scope: !1, file: !1, line: 54, type: !95, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_block* (i8*, i8***)* @init_index, variables: !112)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !39, !110}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !99, line: 52, baseType: !100)
!99 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 36, size: 8448, align: 64, elements: !101)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !100, file: !99, line: 37, baseType: !103, size: 8192, align: 32)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8192, align: 32, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !100, file: !99, line: 43, baseType: !11, size: 32, align: 32, offset: 8192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !100, file: !99, line: 44, baseType: !84, size: 64, align: 64, offset: 8256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !100, file: !99, line: 45, baseType: !11, size: 32, align: 32, offset: 8320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !100, file: !99, line: 46, baseType: !84, size: 64, align: 64, offset: 8384)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !126, !127}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gfile", arg: 1, scope: !94, file: !1, line: 54, type: !39)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grpname", arg: 2, scope: !94, file: !1, line: 54, type: !110)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !94, file: !1, line: 56, type: !12)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !94, file: !1, line: 57, type: !97)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !94, file: !1, line: 58, type: !11)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxentries", scope: !94, file: !1, line: 58, type: !11)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !94, file: !1, line: 59, type: !11)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !94, file: !1, line: 59, type: !11)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ng", scope: !94, file: !1, line: 59, type: !11)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !94, file: !1, line: 60, type: !123)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 4096)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pt", scope: !94, file: !1, line: 60, type: !39)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !94, file: !1, line: 60, type: !123)
!128 = !DISubprogram(name: "rd_index", scope: !1, file: !1, line: 197, type: !129, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32*, i32**, i8**)* @rd_index, variables: !133)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !39, !11, !131, !132, !111}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "statfile", arg: 1, scope: !128, file: !1, line: 197, type: !39)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngrps", arg: 2, scope: !128, file: !1, line: 197, type: !11)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isize", arg: 3, scope: !128, file: !1, line: 197, type: !131)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !128, file: !1, line: 198, type: !132)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grpnames", arg: 5, scope: !128, file: !1, line: 198, type: !111)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gnames", scope: !128, file: !1, line: 200, type: !111)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grps", scope: !128, file: !1, line: 201, type: !97)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grpnr", scope: !128, file: !1, line: 202, type: !131)
!142 = !DISubprogram(name: "rd_index_nrs", scope: !1, file: !1, line: 211, type: !143, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32*, i32**, i8**, i32*)* @rd_index_nrs, variables: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !39, !11, !131, !132, !111, !131}
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "statfile", arg: 1, scope: !142, file: !1, line: 211, type: !39)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngrps", arg: 2, scope: !142, file: !1, line: 211, type: !11)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isize", arg: 3, scope: !142, file: !1, line: 211, type: !131)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !142, file: !1, line: 212, type: !132)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grpnames", arg: 5, scope: !142, file: !1, line: 212, type: !111)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grpnr", arg: 6, scope: !142, file: !1, line: 212, type: !131)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gnames", scope: !142, file: !1, line: 214, type: !111)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grps", scope: !142, file: !1, line: 215, type: !97)
!154 = !DISubprogram(name: "get_index", scope: !1, file: !1, line: 224, type: !155, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*, i8*, i32, i32*, i32**, i8**)* @get_index, variables: !216)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157, !39, !11, !131, !132, !111}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !159, line: 94, baseType: !160)
!159 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!160 = !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 75, size: 10240, align: 64, elements: !161)
!161 = !{!162, !163, !184, !185, !186, !187, !188, !189, !190, !191, !192, !199}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !160, file: !159, line: 76, baseType: !11, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !160, file: !159, line: 77, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !159, line: 57, baseType: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 48, size: 320, align: 32, elements: !167)
!167 = !{!168, !171, !172, !173, !174, !176, !177, !178, !179, !183}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !166, file: !159, line: 49, baseType: !169, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !86, line: 87, baseType: !170)
!170 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !166, file: !159, line: 49, baseType: !169, size: 32, align: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !166, file: !159, line: 50, baseType: !169, size: 32, align: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !166, file: !159, line: 50, baseType: !169, size: 32, align: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !159, line: 51, baseType: !175, size: 16, align: 16, offset: 128)
!175 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !166, file: !159, line: 52, baseType: !175, size: 16, align: 16, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !166, file: !159, line: 53, baseType: !11, size: 32, align: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !166, file: !159, line: 54, baseType: !11, size: 32, align: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !166, file: !159, line: 55, baseType: !180, size: 72, align: 8, offset: 224)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 72, align: 8, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 9)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !166, file: !159, line: 56, baseType: !18, size: 8, align: 8, offset: 296)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !160, file: !159, line: 80, baseType: !110, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !160, file: !159, line: 82, baseType: !110, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !160, file: !159, line: 84, baseType: !110, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !160, file: !159, line: 86, baseType: !11, size: 32, align: 32, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !160, file: !159, line: 87, baseType: !110, size: 64, align: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !160, file: !159, line: 89, baseType: !11, size: 32, align: 32, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !160, file: !159, line: 90, baseType: !110, size: 64, align: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !160, file: !159, line: 91, baseType: !98, size: 8448, align: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !160, file: !159, line: 92, baseType: !193, size: 1152, align: 64, offset: 9024)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1152, align: 64, elements: !181)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !159, line: 73, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 70, size: 128, align: 64, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !195, file: !159, line: 71, baseType: !11, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !195, file: !159, line: 72, baseType: !131, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !160, file: !159, line: 93, baseType: !200, size: 64, align: 64, offset: 10176)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !159, line: 68, baseType: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 59, size: 416, align: 32, elements: !203)
!203 = !{!204, !205, !206, !207, !211, !212, !213, !214}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !159, line: 60, baseType: !11, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !202, file: !159, line: 61, baseType: !11, size: 32, align: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !202, file: !159, line: 62, baseType: !4, size: 8, align: 8, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !202, file: !159, line: 63, baseType: !208, size: 48, align: 8, offset: 72)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, align: 8, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 6)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !202, file: !159, line: 64, baseType: !169, size: 32, align: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !202, file: !159, line: 65, baseType: !169, size: 32, align: 32, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !202, file: !159, line: 66, baseType: !11, size: 32, align: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !202, file: !159, line: 67, baseType: !215, size: 192, align: 32, offset: 224)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, align: 32, elements: !209)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 1, scope: !154, file: !1, line: 224, type: !157)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 2, scope: !154, file: !1, line: 224, type: !39)
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngrps", arg: 3, scope: !154, file: !1, line: 224, type: !11)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isize", arg: 4, scope: !154, file: !1, line: 225, type: !131)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 5, scope: !154, file: !1, line: 225, type: !132)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grpnames", arg: 6, scope: !154, file: !1, line: 225, type: !111)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gnames", scope: !154, file: !1, line: 227, type: !110)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grps", scope: !154, file: !1, line: 228, type: !97)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grpnr", scope: !154, file: !1, line: 229, type: !131)
!226 = !DISubprogram(name: "rd_groups", scope: !1, file: !1, line: 168, type: !227, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_block*, i8**, i8**, i32, i32*, i32**, i32*)* @rd_groups, variables: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !97, !111, !111, !11, !131, !132, !131}
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 1, scope: !226, file: !1, line: 168, type: !97)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grpname", arg: 2, scope: !226, file: !1, line: 168, type: !111)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnames", arg: 3, scope: !226, file: !1, line: 168, type: !111)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngrps", arg: 4, scope: !226, file: !1, line: 169, type: !11)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isize", arg: 5, scope: !226, file: !1, line: 169, type: !131)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 6, scope: !226, file: !1, line: 169, type: !132)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grpnr", arg: 7, scope: !226, file: !1, line: 169, type: !131)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !226, file: !1, line: 171, type: !11)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !226, file: !1, line: 171, type: !11)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gnr1", scope: !226, file: !1, line: 171, type: !11)
!240 = !DISubprogram(name: "qgroup", scope: !1, file: !1, line: 123, type: !241, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, variables: !243)
!241 = !DISubroutineType(types: !242)
!242 = !{!11, !131}
!243 = !{!244}
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !240, file: !1, line: 123, type: !131)
!245 = !{i32 2, !"Dwarf Version", i32 2}
!246 = !{i32 2, !"Debug Info Version", i32 700000003}
!247 = !{i32 1, !"PIC Level", i32 2}
!248 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!249 = !DIExpression()
!250 = !DILocation(line: 348, column: 40, scope: !7)
!251 = !DILocation(line: 348, column: 50, scope: !7)
!252 = !DILocation(line: 349, column: 12, scope: !253)
!253 = distinct !DILexicalBlock(scope: !7, file: !8, line: 349, column: 6)
!254 = !DILocation(line: 349, column: 6, scope: !253)
!255 = !{!256, !260, i64 12}
