; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/readinp.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_inpfile = type { i32, i32, i8*, i8* }

@debug = external global %struct.__sFILE*
@.str = private unnamed_addr constant [21 x i8] c"Reading MDP file %s\0A\00", align 1
@inp_count = internal unnamed_addr global i32 1, align 4
@.str1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str2 = private unnamed_addr constant [37 x i8] c"No = on line %d in file %s, ignored\0A\00", align 1
@.str3 = private unnamed_addr constant [53 x i8] c"Empty left hand side on line %d in file %s, ignored\0A\00", align 1
@.str4 = private unnamed_addr constant [54 x i8] c"Empty right hand side on line %d in file %s, ignored\0A\00", align 1
@.str5 = private unnamed_addr constant [4 x i8] c"inp\00", align 1
@.str6 = private unnamed_addr constant [67 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/readinp.c\00", align 1
@.str7 = private unnamed_addr constant [55 x i8] c"Done reading MDP file, there were %d entries in there\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22, globals: !203, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/readinp.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 30, baseType: !7)
!6 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !8, line: 92, baseType: !9)
!8 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inpfile", file: !12, line: 48, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/readinp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 43, size: 192, align: 64, elements: !14)
!14 = !{!15, !17, !18, !21}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !13, file: !12, line: 44, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "bSet", scope: !13, file: !12, line: 45, baseType: !16, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !12, line: 46, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !13, file: !12, line: 47, baseType: !19, size: 64, align: 64, offset: 128)
!22 = !{!23, !29, !110, !119, !133, !146, !156, !170, !179, !187, !195}
!23 = !DISubprogram(name: "__sigbits", scope: !24, file: !24, line: 114, type: !25, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !27)
!24 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DISubroutineType(types: !26)
!26 = !{!16, !16}
!27 = !{!28}
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !23, file: !24, line: 114, type: !16)
!29 = !DISubprogram(name: "read_inpfile", scope: !1, file: !1, line: 45, type: !30, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_inpfile* (i8*, i32*)* @read_inpfile, variables: !33)
!30 = !DISubroutineType(types: !31)
!31 = !{!10, !19, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!33 = !{!34, !35, !36, !96, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!34 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !29, file: !1, line: 45, type: !19)
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ninp", arg: 2, scope: !29, file: !1, line: 45, type: !32)
!36 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !29, file: !1, line: 47, type: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !39, line: 153, baseType: !40)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !39, line: 122, size: 1216, align: 64, elements: !41)
!41 = !{!42, !45, !46, !47, !49, !50, !55, !56, !57, !61, !65, !74, !80, !81, !84, !85, !89, !93, !94, !95}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !40, file: !39, line: 123, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !40, file: !39, line: 124, baseType: !16, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !40, file: !39, line: 125, baseType: !16, size: 32, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !40, file: !39, line: 126, baseType: !48, size: 16, align: 16, offset: 128)
!48 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !40, file: !39, line: 127, baseType: !48, size: 16, align: 16, offset: 144)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !40, file: !39, line: 128, baseType: !51, size: 128, align: 64, offset: 192)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !39, line: 88, size: 128, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !51, file: !39, line: 89, baseType: !43, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !51, file: !39, line: 90, baseType: !16, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !40, file: !39, line: 129, baseType: !16, size: 32, align: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !40, file: !39, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !40, file: !39, line: 133, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!16, !4}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !40, file: !39, line: 134, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!16, !4, !19, !16}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !40, file: !39, line: 135, baseType: !66, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !4, !69, !16}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !39, line: 77, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !71, line: 71, baseType: !72)
!71 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !8, line: 46, baseType: !73)
!73 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !40, file: !39, line: 136, baseType: !75, size: 64, align: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!16, !4, !78, !16}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !40, file: !39, line: 139, baseType: !51, size: 128, align: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !40, file: !39, line: 140, baseType: !82, size: 64, align: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !39, line: 94, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !40, file: !39, line: 141, baseType: !16, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !40, file: !39, line: 144, baseType: !86, size: 24, align: 8, offset: 928)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 3)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !40, file: !39, line: 145, baseType: !90, size: 8, align: 8, offset: 952)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !40, file: !39, line: 148, baseType: !51, size: 128, align: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !40, file: !39, line: 151, baseType: !16, size: 32, align: 32, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !40, file: !39, line: 152, baseType: !69, size: 64, align: 64, offset: 1152)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !29, file: !1, line: 48, type: !97)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32768, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 4096)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lbuf", scope: !29, file: !1, line: 48, type: !97)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rbuf", scope: !29, file: !1, line: 48, type: !97)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !29, file: !1, line: 49, type: !19)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cptr", scope: !29, file: !1, line: 49, type: !19)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inp", scope: !29, file: !1, line: 50, type: !10)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nin", scope: !29, file: !1, line: 51, type: !16)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lc", scope: !29, file: !1, line: 51, type: !16)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !29, file: !1, line: 51, type: !16)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !29, file: !1, line: 51, type: !16)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !29, file: !1, line: 51, type: !16)
!110 = !DISubprogram(name: "write_inpfile", scope: !1, file: !1, line: 134, type: !111, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, %struct.t_inpfile*)* @write_inpfile, variables: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !19, !16, !10}
!113 = !{!114, !115, !116, !117, !118}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !110, file: !1, line: 134, type: !19)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ninp", arg: 2, scope: !110, file: !1, line: 134, type: !16)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inp", arg: 3, scope: !110, file: !1, line: 134, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !110, file: !1, line: 136, type: !37)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !110, file: !1, line: 137, type: !16)
!119 = !DISubprogram(name: "get_eint", scope: !1, file: !1, line: 180, type: !120, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, %struct.t_inpfile**, i8*, i32)* @get_eint, variables: !123)
!120 = !DISubroutineType(types: !121)
!121 = !{!16, !32, !122, !19, !16}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!123 = !{!124, !125, !126, !127, !128, !132}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ninp", arg: 1, scope: !119, file: !1, line: 180, type: !32)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inp", arg: 2, scope: !119, file: !1, line: 180, type: !122)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !119, file: !1, line: 180, type: !19)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "def", arg: 4, scope: !119, file: !1, line: 180, type: !16)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !119, file: !1, line: 182, type: !129)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 32)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !119, file: !1, line: 183, type: !16)
!133 = !DISubprogram(name: "get_ereal", scope: !1, file: !1, line: 197, type: !134, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, function: float (i32*, %struct.t_inpfile**, i8*, float)* @get_ereal, variables: !139)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !32, !122, !19, !136}
