; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/shakef.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.t_iparams = type { %struct.anon.2 }
%struct.anon.2 = type { float, float, float, float, float, float }
%struct.t_idef = type { i32, i32, i32, i32*, %union.t_iparams*, [44 x %struct.t_ilist] }
%struct.t_ilist = type { i32, [256 x i32], i32* }
%struct.t_inputrec = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, float, [3 x [3 x float]], [3 x [3 x float]], i32, float, float, i32, float, float, i32, float, float, float, i32, float, float, i32, float, float, float, float, float, i32, i32, i32, float, float, float, i32, float, float, i32, i32, i32, i32, i32, float, i32, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, %struct.t_grpopts, [3 x %struct.t_cosines], [3 x %struct.t_cosines] }
%struct.t_grpopts = type { i32, i32, i32, i32, float*, float*, float*, [3 x float]*, [3 x i32]*, i32* }
%struct.t_cosines = type { i32, float*, float* }

!105 = !DIEnumerator(name: "eNR_INL2310", value: 45)
!106 = !DIEnumerator(name: "eNR_INL2320", value: 46)
!107 = !DIEnumerator(name: "eNR_INL2330", value: 47)
!108 = !DIEnumerator(name: "eNR_INL2400", value: 48)
!109 = !DIEnumerator(name: "eNR_INL2410", value: 49)
!110 = !DIEnumerator(name: "eNR_INL2420", value: 50)
!111 = !DIEnumerator(name: "eNR_INL2430", value: 51)
!112 = !DIEnumerator(name: "eNR_INL3000", value: 52)
!113 = !DIEnumerator(name: "eNR_INL3001", value: 53)
!114 = !DIEnumerator(name: "eNR_INL3002", value: 54)
!115 = !DIEnumerator(name: "eNR_INL3010", value: 55)
!116 = !DIEnumerator(name: "eNR_INL3020", value: 56)
!117 = !DIEnumerator(name: "eNR_INL3030", value: 57)
!118 = !DIEnumerator(name: "eNR_INL3100", value: 58)
!119 = !DIEnumerator(name: "eNR_INL3110", value: 59)
!120 = !DIEnumerator(name: "eNR_INL3120", value: 60)
!121 = !DIEnumerator(name: "eNR_INL3130", value: 61)
!122 = !DIEnumerator(name: "eNR_INL3200", value: 62)
!123 = !DIEnumerator(name: "eNR_INL3210", value: 63)
!124 = !DIEnumerator(name: "eNR_INL3220", value: 64)
!125 = !DIEnumerator(name: "eNR_INL3230", value: 65)
!126 = !DIEnumerator(name: "eNR_INL3300", value: 66)
!127 = !DIEnumerator(name: "eNR_INL3301", value: 67)
!128 = !DIEnumerator(name: "eNR_INL3302", value: 68)
!129 = !DIEnumerator(name: "eNR_INL3310", value: 69)
!130 = !DIEnumerator(name: "eNR_INL3320", value: 70)
!131 = !DIEnumerator(name: "eNR_INL3330", value: 71)
!132 = !DIEnumerator(name: "eNR_INL3400", value: 72)
!133 = !DIEnumerator(name: "eNR_INL3401", value: 73)
!134 = !DIEnumerator(name: "eNR_INL3402", value: 74)
!135 = !DIEnumerator(name: "eNR_INL3410", value: 75)
!136 = !DIEnumerator(name: "eNR_INL3420", value: 76)
!137 = !DIEnumerator(name: "eNR_INL3430", value: 77)
!138 = !DIEnumerator(name: "eNR_INLOOP", value: 78)
!139 = !DIEnumerator(name: "eNR_INL_IATOM", value: 78)
!140 = !DIEnumerator(name: "eNR_WEIGHTS", value: 79)
!141 = !DIEnumerator(name: "eNR_SPREADQ", value: 80)
!142 = !DIEnumerator(name: "eNR_SPREADQBSP", value: 81)
!143 = !DIEnumerator(name: "eNR_GATHERF", value: 82)
!144 = !DIEnumerator(name: "eNR_GATHERFBSP", value: 83)
!145 = !DIEnumerator(name: "eNR_FFT", value: 84)
!146 = !DIEnumerator(name: "eNR_CONV", value: 85)
!147 = !DIEnumerator(name: "eNR_SOLVEPME", value: 86)
!148 = !DIEnumerator(name: "eNR_NS", value: 87)
!149 = !DIEnumerator(name: "eNR_RESETX", value: 88)
!150 = !DIEnumerator(name: "eNR_SHIFTX", value: 89)
!151 = !DIEnumerator(name: "eNR_CGCM", value: 90)
!152 = !DIEnumerator(name: "eNR_FSUM", value: 91)
!153 = !DIEnumerator(name: "eNR_BONDS", value: 92)
!154 = !DIEnumerator(name: "eNR_G96BONDS", value: 93)
!155 = !DIEnumerator(name: "eNR_ANGLES", value: 94)
!156 = !DIEnumerator(name: "eNR_G96ANGLES", value: 95)
!157 = !DIEnumerator(name: "eNR_PROPER", value: 96)
!158 = !DIEnumerator(name: "eNR_IMPROPER", value: 97)
!159 = !DIEnumerator(name: "eNR_RB", value: 98)
!160 = !DIEnumerator(name: "eNR_DISRES", value: 99)
!161 = !DIEnumerator(name: "eNR_ORIRES", value: 100)
!162 = !DIEnumerator(name: "eNR_POSRES", value: 101)
!163 = !DIEnumerator(name: "eNR_ANGRES", value: 102)
!164 = !DIEnumerator(name: "eNR_ANGRESZ", value: 103)
!165 = !DIEnumerator(name: "eNR_MORSE", value: 104)
!166 = !DIEnumerator(name: "eNR_CUBICBONDS", value: 105)
!167 = !DIEnumerator(name: "eNR_WPOL", value: 106)
!168 = !DIEnumerator(name: "eNR_VIRIAL", value: 107)
!169 = !DIEnumerator(name: "eNR_UPDATE", value: 108)
!170 = !DIEnumerator(name: "eNR_EXTUPDATE", value: 109)
!171 = !DIEnumerator(name: "eNR_STOPCM", value: 110)
!172 = !DIEnumerator(name: "eNR_PCOUPL", value: 111)
!173 = !DIEnumerator(name: "eNR_EKIN", value: 112)
!174 = !DIEnumerator(name: "eNR_LINCS", value: 113)
!175 = !DIEnumerator(name: "eNR_LINCSMAT", value: 114)
!176 = !DIEnumerator(name: "eNR_SHAKE", value: 115)
!177 = !DIEnumerator(name: "eNR_SHAKE_V", value: 116)
!178 = !DIEnumerator(name: "eNR_SHAKE_RIJ", value: 117)
!179 = !DIEnumerator(name: "eNR_SHAKE_VIR", value: 118)
!180 = !DIEnumerator(name: "eNR_SETTLE", value: 119)
!181 = !DIEnumerator(name: "eNR_PSHAKEINITLD", value: 120)
!182 = !DIEnumerator(name: "eNR_PSHAKEINITMD", value: 121)
!183 = !DIEnumerator(name: "eNR_PSHAKE", value: 122)
!184 = !DIEnumerator(name: "eNR_DUM2", value: 123)
!185 = !DIEnumerator(name: "eNR_DUM3", value: 124)
!186 = !DIEnumerator(name: "eNR_DUM3FD", value: 125)
!187 = !DIEnumerator(name: "eNR_DUM3FAD", value: 126)
!188 = !DIEnumerator(name: "eNR_DUM3OUT", value: 127)
!189 = !DIEnumerator(name: "eNR_DUM4FD", value: 128)
!190 = !DIEnumerator(name: "eNRNB", value: 129)
!191 = !{!192}
!192 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!193 = !{!194, !263, !269, !333, !478, !655, !661, !679, !690}
!194 = !DISubprogram(name: "__sputc", scope: !195, file: !195, line: 348, type: !196, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !260)
!195 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !198, !199}
!198 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !195, line: 153, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !195, line: 122, size: 1216, align: 64, elements: !202)
!202 = !{!203, !206, !207, !208, !210, !211, !216, !217, !219, !223, !228, !238, !244, !245, !248, !249, !253, !257, !258, !259}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !201, file: !195, line: 123, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !201, file: !195, line: 124, baseType: !198, size: 32, align: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !201, file: !195, line: 125, baseType: !198, size: 32, align: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !201, file: !195, line: 126, baseType: !209, size: 16, align: 16, offset: 128)
!209 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !201, file: !195, line: 127, baseType: !209, size: 16, align: 16, offset: 144)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !201, file: !195, line: 128, baseType: !212, size: 128, align: 64, offset: 192)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !195, line: 88, size: 128, align: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !212, file: !195, line: 89, baseType: !204, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !212, file: !195, line: 90, baseType: !198, size: 32, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !201, file: !195, line: 129, baseType: !198, size: 32, align: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !201, file: !195, line: 132, baseType: !218, size: 64, align: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !201, file: !195, line: 133, baseType: !220, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!198, !218}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !201, file: !195, line: 134, baseType: !224, size: 64, align: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!198, !218, !227, !198}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !201, file: !195, line: 135, baseType: !229, size: 64, align: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !218, !232, !198}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !195, line: 77, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !234, line: 71, baseType: !235)
!234 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !236, line: 46, baseType: !237)
!236 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!237 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !201, file: !195, line: 136, baseType: !239, size: 64, align: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!198, !218, !242, !198}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !201, file: !195, line: 139, baseType: !212, size: 128, align: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !201, file: !195, line: 140, baseType: !246, size: 64, align: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !195, line: 94, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !201, file: !195, line: 141, baseType: !198, size: 32, align: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !201, file: !195, line: 144, baseType: !250, size: 24, align: 8, offset: 928)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 24, align: 8, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 3)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !201, file: !195, line: 145, baseType: !254, size: 8, align: 8, offset: 952)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 8, align: 8, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 1)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !201, file: !195, line: 148, baseType: !212, size: 128, align: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !201, file: !195, line: 151, baseType: !198, size: 32, align: 32, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !201, file: !195, line: 152, baseType: !232, size: 64, align: 64, offset: 1152)
!260 = !{!261, !262}
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !194, file: !195, line: 348, type: !198)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !194, file: !195, line: 348, type: !199)
!263 = !DISubprogram(name: "__sigbits", scope: !264, file: !264, line: 114, type: !265, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !267)
!264 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!265 = !DISubroutineType(types: !266)
!266 = !{!198, !198}
!267 = !{!268}
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !263, file: !264, line: 114, type: !198)
!269 = !DISubprogram(name: "cshake", scope: !1, file: !1, line: 59, type: !270, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32, i32*, i32, float*, float*, float*, float*, float, float*, float*, float*, i32*)* @cshake, variables: !279)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !272, !198, !275, !198, !276, !276, !276, !276, !277, !276, !276, !276, !275}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !274, line: 73, baseType: !198)
!274 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !274, line: 87, baseType: !278)
!278 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iatom", arg: 1, scope: !269, file: !1, line: 59, type: !272)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncon", arg: 2, scope: !269, file: !1, line: 59, type: !198)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnit", arg: 3, scope: !269, file: !1, line: 59, type: !275)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxnit", arg: 4, scope: !269, file: !1, line: 59, type: !198)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dist2", arg: 5, scope: !269, file: !1, line: 60, type: !276)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xp", arg: 6, scope: !269, file: !1, line: 60, type: !276)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rij", arg: 7, scope: !269, file: !1, line: 60, type: !276)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m2", arg: 8, scope: !269, file: !1, line: 60, type: !276)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omega", arg: 9, scope: !269, file: !1, line: 60, type: !277)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invmass", arg: 10, scope: !269, file: !1, line: 61, type: !276)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tt", arg: 11, scope: !269, file: !1, line: 61, type: !276)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lagr", arg: 12, scope: !269, file: !1, line: 61, type: !276)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nerror", arg: 13, scope: !269, file: !1, line: 61, type: !275)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mytol", scope: !269, file: !1, line: 69, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ll", scope: !269, file: !1, line: 71, type: !198)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !269, file: !1, line: 71, type: !198)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !269, file: !1, line: 71, type: !198)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i3", scope: !269, file: !1, line: 71, type: !198)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j3", scope: !269, file: !1, line: 71, type: !198)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l3", scope: !269, file: !1, line: 71, type: !198)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !269, file: !1, line: 72, type: !198)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !269, file: !1, line: 72, type: !198)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !269, file: !1, line: 72, type: !198)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jx", scope: !269, file: !1, line: 72, type: !198)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jy", scope: !269, file: !1, line: 72, type: !198)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jz", scope: !269, file: !1, line: 72, type: !198)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toler", scope: !269, file: !1, line: 73, type: !277)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rpij2", scope: !269, file: !1, line: 73, type: !277)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rrpr", scope: !269, file: !1, line: 73, type: !277)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tx", scope: !269, file: !1, line: 73, type: !277)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ty", scope: !269, file: !1, line: 73, type: !277)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tz", scope: !269, file: !1, line: 73, type: !277)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !269, file: !1, line: 73, type: !277)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "acor", scope: !269, file: !1, line: 73, type: !277)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "im", scope: !269, file: !1, line: 73, type: !277)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jm", scope: !269, file: !1, line: 73, type: !277)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xh", scope: !269, file: !1, line: 74, type: !277)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yh", scope: !269, file: !1, line: 74, type: !277)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zh", scope: !269, file: !1, line: 74, type: !277)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rijx", scope: !269, file: !1, line: 74, type: !277)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rijy", scope: !269, file: !1, line: 74, type: !277)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rijz", scope: !269, file: !1, line: 74, type: !277)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tix", scope: !269, file: !1, line: 75, type: !277)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tiy", scope: !269, file: !1, line: 75, type: !277)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tiz", scope: !269, file: !1, line: 75, type: !277)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tjx", scope: !269, file: !1, line: 76, type: !277)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tjy", scope: !269, file: !1, line: 76, type: !277)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tjz", scope: !269, file: !1, line: 76, type: !277)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nit", scope: !269, file: !1, line: 77, type: !198)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !269, file: !1, line: 77, type: !198)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iconv", scope: !269, file: !1, line: 77, type: !198)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nconv", scope: !269, file: !1, line: 77, type: !198)
!333 = !DISubprogram(name: "vec_shakef", scope: !1, file: !1, line: 152, type: !334, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, float*, i32, %union.t_iparams*, i32*, float, [3 x float]*, [3 x float]*, float, i32, float, float*)* @vec_shakef, variables: !452)
!334 = !DISubroutineType(types: !335)
!335 = !{!198, !199, !198, !276, !198, !336, !448, !277, !450, !450, !277, !198, !277, !276}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !4, line: 131, baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_union_type, file: !4, line: 97, size: 192, align: 32, elements: !339)
!339 = !{!340, !346, !353, !359, !368, !373, !380, !388, !393, !398, !404, !410, !417, !426, !435, !444}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !338, file: !4, line: 105, baseType: !341, size: 96, align: 32)
!341 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 105, size: 96, align: 32, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !341, file: !4, line: 105, baseType: !277, size: 32, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !341, file: !4, line: 105, baseType: !277, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !341, file: !4, line: 105, baseType: !277, size: 32, align: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !338, file: !4, line: 106, baseType: !347, size: 128, align: 32)
!347 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 106, size: 128, align: 32, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !347, file: !4, line: 106, baseType: !277, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !347, file: !4, line: 106, baseType: !277, size: 32, align: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !347, file: !4, line: 106, baseType: !277, size: 32, align: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !347, file: !4, line: 106, baseType: !277, size: 32, align: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !338, file: !4, line: 108, baseType: !354, size: 96, align: 32)
!354 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 108, size: 96, align: 32, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !354, file: !4, line: 108, baseType: !277, size: 32, align: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !354, file: !4, line: 108, baseType: !277, size: 32, align: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !354, file: !4, line: 108, baseType: !277, size: 32, align: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !338, file: !4, line: 110, baseType: !360, size: 192, align: 32)
!360 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 110, size: 192, align: 32, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !360, file: !4, line: 110, baseType: !277, size: 32, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !360, file: !4, line: 110, baseType: !277, size: 32, align: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !360, file: !4, line: 110, baseType: !277, size: 32, align: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !360, file: !4, line: 110, baseType: !277, size: 32, align: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !360, file: !4, line: 110, baseType: !277, size: 32, align: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !360, file: !4, line: 110, baseType: !277, size: 32, align: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !338, file: !4, line: 111, baseType: !369, size: 64, align: 32)
!369 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 111, size: 64, align: 32, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !369, file: !4, line: 111, baseType: !277, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !369, file: !4, line: 111, baseType: !277, size: 32, align: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !338, file: !4, line: 112, baseType: !374, size: 128, align: 32)
!374 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 112, size: 128, align: 32, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !374, file: !4, line: 112, baseType: !277, size: 32, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !374, file: !4, line: 112, baseType: !277, size: 32, align: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !374, file: !4, line: 112, baseType: !277, size: 32, align: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !374, file: !4, line: 112, baseType: !277, size: 32, align: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !338, file: !4, line: 117, baseType: !381, size: 160, align: 32)
!381 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 117, size: 160, align: 32, elements: !382)
!382 = !{!383, !384, !385, !386, !387}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !381, file: !4, line: 117, baseType: !277, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !381, file: !4, line: 117, baseType: !277, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !381, file: !4, line: 117, baseType: !198, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !381, file: !4, line: 117, baseType: !277, size: 32, align: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !381, file: !4, line: 117, baseType: !277, size: 32, align: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !338, file: !4, line: 118, baseType: !389, size: 64, align: 32)
!389 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 118, size: 64, align: 32, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !389, file: !4, line: 118, baseType: !277, size: 32, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !389, file: !4, line: 118, baseType: !277, size: 32, align: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !338, file: !4, line: 123, baseType: !394, size: 64, align: 32)
!394 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 123, size: 64, align: 32, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !394, file: !4, line: 123, baseType: !277, size: 32, align: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !394, file: !4, line: 123, baseType: !277, size: 32, align: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !338, file: !4, line: 124, baseType: !399, size: 96, align: 32)
!399 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 124, size: 96, align: 32, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !399, file: !4, line: 124, baseType: !277, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !399, file: !4, line: 124, baseType: !277, size: 32, align: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !399, file: !4, line: 124, baseType: !277, size: 32, align: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !338, file: !4, line: 125, baseType: !405, size: 192, align: 32)
!405 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 125, size: 192, align: 32, elements: !406)
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !405, file: !4, line: 125, baseType: !408, size: 96, align: 32)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 96, align: 32, elements: !251)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !405, file: !4, line: 125, baseType: !408, size: 96, align: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !338, file: !4, line: 126, baseType: !411, size: 192, align: 32)
!411 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 126, size: 192, align: 32, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !411, file: !4, line: 126, baseType: !414, size: 192, align: 32)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 192, align: 32, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 6)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !338, file: !4, line: 127, baseType: !418, size: 192, align: 32)
!418 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 127, size: 192, align: 32, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !418, file: !4, line: 127, baseType: !277, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !418, file: !4, line: 127, baseType: !277, size: 32, align: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !418, file: !4, line: 127, baseType: !277, size: 32, align: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !418, file: !4, line: 127, baseType: !277, size: 32, align: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !418, file: !4, line: 127, baseType: !277, size: 32, align: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !418, file: !4, line: 127, baseType: !277, size: 32, align: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !338, file: !4, line: 128, baseType: !427, size: 192, align: 32)
!427 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 128, size: 192, align: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !427, file: !4, line: 128, baseType: !277, size: 32, align: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !427, file: !4, line: 128, baseType: !277, size: 32, align: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !427, file: !4, line: 128, baseType: !277, size: 32, align: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !427, file: !4, line: 128, baseType: !277, size: 32, align: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !4, line: 128, baseType: !198, size: 32, align: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !427, file: !4, line: 128, baseType: !198, size: 32, align: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !338, file: !4, line: 129, baseType: !436, size: 192, align: 32)
!436 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 129, size: 192, align: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !436, file: !4, line: 129, baseType: !198, size: 32, align: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !436, file: !4, line: 129, baseType: !198, size: 32, align: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !436, file: !4, line: 129, baseType: !198, size: 32, align: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !436, file: !4, line: 129, baseType: !277, size: 32, align: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !436, file: !4, line: 129, baseType: !277, size: 32, align: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !436, file: !4, line: 129, baseType: !277, size: 32, align: 32, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !338, file: !4, line: 130, baseType: !445, size: 192, align: 32)
!445 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 130, size: 192, align: 32, elements: !446)
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !445, file: !4, line: 130, baseType: !414, size: 192, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !4, line: 45, baseType: !273)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !274, line: 101, baseType: !408)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !333, file: !1, line: 152, type: !199)
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !333, file: !1, line: 153, type: !198)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invmass", arg: 3, scope: !333, file: !1, line: 153, type: !276)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncon", arg: 4, scope: !333, file: !1, line: 153, type: !198)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 5, scope: !333, file: !1, line: 154, type: !336)
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iatom", arg: 6, scope: !333, file: !1, line: 154, type: !448)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tol", arg: 7, scope: !333, file: !1, line: 155, type: !277)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !333, file: !1, line: 155, type: !450)
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xp", arg: 9, scope: !333, file: !1, line: 155, type: !450)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omega", arg: 10, scope: !333, file: !1, line: 155, type: !277)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bFEP", arg: 11, scope: !333, file: !1, line: 156, type: !198)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 12, scope: !333, file: !1, line: 156, type: !277)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lagr", arg: 13, scope: !333, file: !1, line: 156, type: !276)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxnit", scope: !333, file: !1, line: 161, type: !198)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nit", scope: !333, file: !1, line: 162, type: !198)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ll", scope: !333, file: !1, line: 162, type: !198)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !333, file: !1, line: 162, type: !198)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !333, file: !1, line: 162, type: !198)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !333, file: !1, line: 162, type: !198)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ia", scope: !333, file: !1, line: 163, type: !448)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L1", scope: !333, file: !1, line: 164, type: !277)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tol2", scope: !333, file: !1, line: 164, type: !277)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toler", scope: !333, file: !1, line: 164, type: !277)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mm", scope: !333, file: !1, line: 165, type: !277)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !333, file: !1, line: 166, type: !198)
!478 = !DISubprogram(name: "bshakef", scope: !1, file: !1, line: 257, type: !479, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, float*, i32, i32*, %struct.t_idef*, %struct.t_inputrec*, [3 x float]*, [3 x float]*, [3 x float]*, %struct.t_nrnb*, float, float*, i32)* @bshakef, variables: !629)
!479 = !DISubroutineType(types: !480)
!480 = !{!198, !199, !198, !276, !198, !275, !481, !505, !619, !450, !450, !620, !277, !276, !198}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !4, line: 188, baseType: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 179, size: 366336, align: 64, elements: !484)
!484 = !{!485, !486, !487, !488, !491, !492}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !483, file: !4, line: 181, baseType: !198, size: 32, align: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !483, file: !4, line: 182, baseType: !198, size: 32, align: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !483, file: !4, line: 183, baseType: !198, size: 32, align: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !483, file: !4, line: 184, baseType: !489, size: 64, align: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !4, line: 133, baseType: !198)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !483, file: !4, line: 185, baseType: !336, size: 64, align: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !483, file: !4, line: 187, baseType: !493, size: 366080, align: 64, offset: 256)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 366080, align: 64, elements: !503)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !4, line: 140, baseType: !495)
!495 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 135, size: 8320, align: 64, elements: !496)
!496 = !{!497, !498, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !495, file: !4, line: 137, baseType: !198, size: 32, align: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !495, file: !4, line: 138, baseType: !499, size: 8192, align: 32, offset: 32)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 8192, align: 32, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !495, file: !4, line: 139, baseType: !448, size: 64, align: 64, offset: 8256)
!503 = !{!504}
!504 = !DISubrange(count: 44)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !507, line: 143, baseType: !508)
!507 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!508 = !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 55, size: 4736, align: 64, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !610, !618}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !508, file: !507, line: 56, baseType: !198, size: 32, align: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !508, file: !507, line: 57, baseType: !198, size: 32, align: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !508, file: !507, line: 58, baseType: !198, size: 32, align: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !508, file: !507, line: 59, baseType: !198, size: 32, align: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !508, file: !507, line: 60, baseType: !198, size: 32, align: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !508, file: !507, line: 61, baseType: !198, size: 32, align: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !508, file: !507, line: 62, baseType: !198, size: 32, align: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !508, file: !507, line: 63, baseType: !198, size: 32, align: 32, offset: 224)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !508, file: !507, line: 65, baseType: !198, size: 32, align: 32, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !508, file: !507, line: 66, baseType: !198, size: 32, align: 32, offset: 288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !508, file: !507, line: 67, baseType: !198, size: 32, align: 32, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !508, file: !507, line: 68, baseType: !198, size: 32, align: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !508, file: !507, line: 69, baseType: !198, size: 32, align: 32, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !508, file: !507, line: 70, baseType: !198, size: 32, align: 32, offset: 416)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !508, file: !507, line: 71, baseType: !277, size: 32, align: 32, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !508, file: !507, line: 72, baseType: !277, size: 32, align: 32, offset: 480)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !508, file: !507, line: 73, baseType: !277, size: 32, align: 32, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !508, file: !507, line: 74, baseType: !198, size: 32, align: 32, offset: 544)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !508, file: !507, line: 74, baseType: !198, size: 32, align: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !508, file: !507, line: 74, baseType: !198, size: 32, align: 32, offset: 608)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !508, file: !507, line: 76, baseType: !198, size: 32, align: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !508, file: !507, line: 77, baseType: !277, size: 32, align: 32, offset: 672)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !508, file: !507, line: 79, baseType: !198, size: 32, align: 32, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !508, file: !507, line: 80, baseType: !198, size: 32, align: 32, offset: 736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !508, file: !507, line: 81, baseType: !198, size: 32, align: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !508, file: !507, line: 82, baseType: !198, size: 32, align: 32, offset: 800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !508, file: !507, line: 83, baseType: !198, size: 32, align: 32, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !508, file: !507, line: 84, baseType: !198, size: 32, align: 32, offset: 864)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !508, file: !507, line: 85, baseType: !198, size: 32, align: 32, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !508, file: !507, line: 86, baseType: !198, size: 32, align: 32, offset: 928)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !508, file: !507, line: 87, baseType: !277, size: 32, align: 32, offset: 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !508, file: !507, line: 88, baseType: !542, size: 288, align: 32, offset: 992)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !274, line: 105, baseType: !543)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 288, align: 32, elements: !544)
!544 = !{!252, !252}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !508, file: !507, line: 89, baseType: !542, size: 288, align: 32, offset: 1280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !508, file: !507, line: 90, baseType: !198, size: 32, align: 32, offset: 1568)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !508, file: !507, line: 91, baseType: !277, size: 32, align: 32, offset: 1600)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !508, file: !507, line: 92, baseType: !277, size: 32, align: 32, offset: 1632)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !508, file: !507, line: 93, baseType: !198, size: 32, align: 32, offset: 1664)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !508, file: !507, line: 94, baseType: !277, size: 32, align: 32, offset: 1696)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !508, file: !507, line: 95, baseType: !277, size: 32, align: 32, offset: 1728)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !508, file: !507, line: 96, baseType: !198, size: 32, align: 32, offset: 1760)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !508, file: !507, line: 97, baseType: !277, size: 32, align: 32, offset: 1792)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !508, file: !507, line: 98, baseType: !277, size: 32, align: 32, offset: 1824)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !508, file: !507, line: 99, baseType: !277, size: 32, align: 32, offset: 1856)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !508, file: !507, line: 100, baseType: !198, size: 32, align: 32, offset: 1888)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !508, file: !507, line: 101, baseType: !277, size: 32, align: 32, offset: 1920)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !508, file: !507, line: 102, baseType: !277, size: 32, align: 32, offset: 1952)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !508, file: !507, line: 103, baseType: !198, size: 32, align: 32, offset: 1984)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !508, file: !507, line: 104, baseType: !277, size: 32, align: 32, offset: 2016)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !508, file: !507, line: 105, baseType: !277, size: 32, align: 32, offset: 2048)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !508, file: !507, line: 106, baseType: !277, size: 32, align: 32, offset: 2080)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !508, file: !507, line: 107, baseType: !277, size: 32, align: 32, offset: 2112)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !508, file: !507, line: 108, baseType: !277, size: 32, align: 32, offset: 2144)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !508, file: !507, line: 109, baseType: !198, size: 32, align: 32, offset: 2176)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !508, file: !507, line: 110, baseType: !198, size: 32, align: 32, offset: 2208)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !508, file: !507, line: 111, baseType: !198, size: 32, align: 32, offset: 2240)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !508, file: !507, line: 112, baseType: !277, size: 32, align: 32, offset: 2272)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !508, file: !507, line: 113, baseType: !277, size: 32, align: 32, offset: 2304)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !508, file: !507, line: 114, baseType: !277, size: 32, align: 32, offset: 2336)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !508, file: !507, line: 115, baseType: !198, size: 32, align: 32, offset: 2368)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !508, file: !507, line: 116, baseType: !277, size: 32, align: 32, offset: 2400)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !508, file: !507, line: 117, baseType: !277, size: 32, align: 32, offset: 2432)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !508, file: !507, line: 118, baseType: !198, size: 32, align: 32, offset: 2464)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !508, file: !507, line: 120, baseType: !198, size: 32, align: 32, offset: 2496)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !508, file: !507, line: 122, baseType: !198, size: 32, align: 32, offset: 2528)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !508, file: !507, line: 124, baseType: !198, size: 32, align: 32, offset: 2560)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !508, file: !507, line: 125, baseType: !198, size: 32, align: 32, offset: 2592)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !508, file: !507, line: 126, baseType: !277, size: 32, align: 32, offset: 2624)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !508, file: !507, line: 127, baseType: !198, size: 32, align: 32, offset: 2656)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !508, file: !507, line: 128, baseType: !277, size: 32, align: 32, offset: 2688)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !508, file: !507, line: 129, baseType: !277, size: 32, align: 32, offset: 2720)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !508, file: !507, line: 130, baseType: !198, size: 32, align: 32, offset: 2752)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !508, file: !507, line: 131, baseType: !277, size: 32, align: 32, offset: 2784)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !508, file: !507, line: 132, baseType: !198, size: 32, align: 32, offset: 2816)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !508, file: !507, line: 133, baseType: !198, size: 32, align: 32, offset: 2848)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !508, file: !507, line: 134, baseType: !198, size: 32, align: 32, offset: 2880)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !508, file: !507, line: 135, baseType: !198, size: 32, align: 32, offset: 2912)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !508, file: !507, line: 136, baseType: !277, size: 32, align: 32, offset: 2944)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !508, file: !507, line: 137, baseType: !277, size: 32, align: 32, offset: 2976)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !508, file: !507, line: 138, baseType: !277, size: 32, align: 32, offset: 3008)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !508, file: !507, line: 139, baseType: !277, size: 32, align: 32, offset: 3040)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !508, file: !507, line: 140, baseType: !594, size: 512, align: 64, offset: 3072)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !507, line: 53, baseType: !595)
!595 = !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 42, size: 512, align: 64, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !609}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !595, file: !507, line: 43, baseType: !198, size: 32, align: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !595, file: !507, line: 44, baseType: !198, size: 32, align: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !595, file: !507, line: 45, baseType: !198, size: 32, align: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !595, file: !507, line: 46, baseType: !198, size: 32, align: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !595, file: !507, line: 47, baseType: !276, size: 64, align: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !595, file: !507, line: 48, baseType: !276, size: 64, align: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !595, file: !507, line: 49, baseType: !276, size: 64, align: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !595, file: !507, line: 50, baseType: !450, size: 64, align: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !595, file: !507, line: 51, baseType: !606, size: 64, align: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !274, line: 107, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 96, align: 32, elements: !251)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !595, file: !507, line: 52, baseType: !275, size: 64, align: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !508, file: !507, line: 141, baseType: !611, size: 576, align: 64, offset: 3584)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 576, align: 64, elements: !251)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !507, line: 40, baseType: !613)
!613 = !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 36, size: 192, align: 64, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !613, file: !507, line: 37, baseType: !198, size: 32, align: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !613, file: !507, line: 38, baseType: !276, size: 64, align: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !613, file: !507, line: 39, baseType: !276, size: 64, align: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !508, file: !507, line: 142, baseType: !611, size: 576, align: 64, offset: 4160)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !58, line: 95, baseType: !622)
!622 = !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 93, size: 8256, align: 64, elements: !623)
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !622, file: !58, line: 94, baseType: !625, size: 8256, align: 64)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 8256, align: 64, elements: !627)
!626 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!627 = !{!628}
!628 = !DISubrange(count: 129)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !478, file: !1, line: 257, type: !199)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !478, file: !1, line: 257, type: !198)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invmass", arg: 3, scope: !478, file: !1, line: 257, type: !276)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nblocks", arg: 4, scope: !478, file: !1, line: 257, type: !198)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sblock", arg: 5, scope: !478, file: !1, line: 257, type: !275)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 6, scope: !478, file: !1, line: 258, type: !481)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 7, scope: !478, file: !1, line: 258, type: !505)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 8, scope: !478, file: !1, line: 258, type: !619)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x_s", arg: 9, scope: !478, file: !1, line: 258, type: !450)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xp", arg: 10, scope: !478, file: !1, line: 258, type: !450)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 11, scope: !478, file: !1, line: 259, type: !620)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 12, scope: !478, file: !1, line: 259, type: !277)
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvdlambda", arg: 13, scope: !478, file: !1, line: 259, type: !276)
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDumpOnError", arg: 14, scope: !478, file: !1, line: 259, type: !198)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iatoms", scope: !478, file: !1, line: 268, type: !448)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lam", scope: !478, file: !1, line: 269, type: !276)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dt_2", scope: !478, file: !1, line: 269, type: !277)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvdl", scope: !478, file: !1, line: 269, type: !277)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !478, file: !1, line: 270, type: !198)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n0", scope: !478, file: !1, line: 270, type: !198)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncons", scope: !478, file: !1, line: 270, type: !198)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blen", scope: !478, file: !1, line: 270, type: !198)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !478, file: !1, line: 270, type: !198)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tnit", scope: !478, file: !1, line: 271, type: !198)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trij", scope: !478, file: !1, line: 271, type: !198)
