; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/shift_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }
%struct.t_nblist = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32* }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_nsborder = type { i32, i32, i32, i32, i32, i32, i32, [256 x i32], [256 x i32], [256 x i32], [256 x i32] }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !633, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/shift_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !5, line: 87, baseType: !6)
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!7 = !{!8, !15, !189, !198, !205, !216, !224, !230, !239, !244, !251, !257, !304, !310, !315, !386, !410, !418, !428, !448, !467, !477, !548, !561, !588, !594, !606, !615, !622, !629}
!8 = !DISubprogram(name: "__sigbits", scope: !9, file: !9, line: 114, type: !10, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !13)
!9 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !12}
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !{!14}
!14 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !8, file: !9, line: 114, type: !12)
!15 = !DISubprogram(name: "set_shift_consts", scope: !1, file: !1, line: 54, type: !16, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, float, float, float*, %struct.t_forcerec*)* @set_shift_consts, variables: !183)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !4, !4, !81, !82}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 153, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !22)
!22 = !{!23, !26, !27, !28, !30, !31, !36, !37, !39, !43, !49, !59, !65, !66, !69, !70, !74, !78, !79, !80}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !21, file: !20, line: 123, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !21, file: !20, line: 124, baseType: !12, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !21, file: !20, line: 125, baseType: !12, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !21, file: !20, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !21, file: !20, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !21, file: !20, line: 128, baseType: !32, size: 128, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !32, file: !20, line: 89, baseType: !24, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !32, file: !20, line: 90, baseType: !12, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !21, file: !20, line: 129, baseType: !12, size: 32, align: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !21, file: !20, line: 132, baseType: !38, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !21, file: !20, line: 133, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!12, !38}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !21, file: !20, line: 134, baseType: !44, size: 64, align: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!12, !38, !47, !12}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !21, file: !20, line: 135, baseType: !50, size: 64, align: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !38, !53, !12}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !55, line: 71, baseType: !56)
!55 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !57, line: 46, baseType: !58)
!57 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !21, file: !20, line: 136, baseType: !60, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!12, !38, !63, !12}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !21, file: !20, line: 139, baseType: !32, size: 128, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !21, file: !20, line: 140, baseType: !67, size: 64, align: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !21, file: !20, line: 141, baseType: !12, size: 32, align: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !21, file: !20, line: 144, baseType: !71, size: 24, align: 8, offset: 928)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 24, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !21, file: !20, line: 145, baseType: !75, size: 8, align: 8, offset: 952)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !21, file: !20, line: 148, baseType: !32, size: 128, align: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !21, file: !20, line: 151, baseType: !12, size: 32, align: 32, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !21, file: !20, line: 152, baseType: !53, size: 64, align: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_forcerec", file: !84, line: 149, baseType: !85)
!84 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/forcerec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 43, size: 22784, align: 64, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !129, !130, !131, !132, !133, !135, !136, !139, !140, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !85, file: !84, line: 45, baseType: !12, size: 32, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !85, file: !84, line: 46, baseType: !4, size: 32, align: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rlistlong", scope: !85, file: !84, line: 46, baseType: !4, size: 32, align: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "zsquare", scope: !85, file: !84, line: 49, baseType: !4, size: 32, align: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !85, file: !84, line: 49, baseType: !4, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !85, file: !84, line: 50, baseType: !4, size: 32, align: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "epsfac", scope: !85, file: !84, line: 50, baseType: !4, size: 32, align: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "bRF", scope: !85, file: !84, line: 53, baseType: !12, size: 32, align: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "kappa", scope: !85, file: !84, line: 54, baseType: !4, size: 32, align: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "k_rf", scope: !85, file: !84, line: 54, baseType: !4, size: 32, align: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "c_rf", scope: !85, file: !84, line: 54, baseType: !4, size: 32, align: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "avcsix", scope: !85, file: !84, line: 57, baseType: !4, size: 32, align: 32, offset: 352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !85, file: !84, line: 60, baseType: !4, size: 32, align: 32, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bcoultab", scope: !85, file: !84, line: 63, baseType: !12, size: 32, align: 32, offset: 416)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bvdwtab", scope: !85, file: !84, line: 64, baseType: !12, size: 32, align: 32, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "rtab", scope: !85, file: !84, line: 65, baseType: !4, size: 32, align: 32, offset: 480)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ntab", scope: !85, file: !84, line: 66, baseType: !12, size: 32, align: 32, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !85, file: !84, line: 67, baseType: !4, size: 32, align: 32, offset: 544)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "coultab", scope: !85, file: !84, line: 69, baseType: !81, size: 64, align: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtab", scope: !85, file: !84, line: 70, baseType: !81, size: 64, align: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdwtab", scope: !85, file: !84, line: 71, baseType: !81, size: 64, align: 64, offset: 704)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdw14tab", scope: !85, file: !84, line: 72, baseType: !81, size: 64, align: 64, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !85, file: !84, line: 75, baseType: !4, size: 32, align: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !85, file: !84, line: 75, baseType: !4, size: 32, align: 32, offset: 864)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !85, file: !84, line: 76, baseType: !81, size: 64, align: 64, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !85, file: !84, line: 79, baseType: !4, size: 32, align: 32, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !85, file: !84, line: 79, baseType: !4, size: 32, align: 32, offset: 992)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "bham_b_max", scope: !85, file: !84, line: 80, baseType: !4, size: 32, align: 32, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale_exp", scope: !85, file: !84, line: 81, baseType: !4, size: 32, align: 32, offset: 1056)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !85, file: !84, line: 84, baseType: !12, size: 32, align: 32, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !85, file: !84, line: 85, baseType: !4, size: 32, align: 32, offset: 1120)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma6", scope: !85, file: !84, line: 86, baseType: !4, size: 32, align: 32, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bSepDVDL", scope: !85, file: !84, line: 87, baseType: !12, size: 32, align: 32, offset: 1184)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "eeltype", scope: !85, file: !84, line: 90, baseType: !12, size: 32, align: 32, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !85, file: !84, line: 91, baseType: !12, size: 32, align: 32, offset: 1248)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cg0", scope: !85, file: !84, line: 92, baseType: !12, size: 32, align: 32, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "hcg", scope: !85, file: !84, line: 92, baseType: !12, size: 32, align: 32, offset: 1312)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !85, file: !84, line: 93, baseType: !12, size: 32, align: 32, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bSolvOpt", scope: !85, file: !84, line: 94, baseType: !12, size: 32, align: 32, offset: 1376)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOMol", scope: !85, file: !84, line: 95, baseType: !12, size: 32, align: 32, offset: 1408)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOav", scope: !85, file: !84, line: 96, baseType: !128, size: 96, align: 32, offset: 1440)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, align: 32, elements: !72)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nWatMol", scope: !85, file: !84, line: 97, baseType: !12, size: 32, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Dimension", scope: !85, file: !84, line: 98, baseType: !12, size: 32, align: 32, offset: 1568)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bGrid", scope: !85, file: !84, line: 99, baseType: !12, size: 32, align: 32, offset: 1600)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !85, file: !84, line: 99, baseType: !12, size: 32, align: 32, offset: 1632)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "solvent_type", scope: !85, file: !84, line: 100, baseType: !134, size: 64, align: 64, offset: 1664)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mno_index", scope: !85, file: !84, line: 101, baseType: !134, size: 64, align: 64, offset: 1728)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cg_cm", scope: !85, file: !84, line: 102, baseType: !137, size: 64, align: 64, offset: 1792)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !5, line: 101, baseType: !128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "shift_vec", scope: !85, file: !84, line: 103, baseType: !137, size: 64, align: 64, offset: 1856)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_sr", scope: !85, file: !84, line: 108, baseType: !141, size: 9984, align: 64, offset: 1920)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 9984, align: 64, elements: !163)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nblist", file: !143, line: 60, baseType: !144)
!143 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nblist.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!144 = !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 36, size: 768, align: 64, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !156, !157, !158, !159, !160, !161, !162}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "il_code", scope: !144, file: !143, line: 37, baseType: !12, size: 32, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nri", scope: !144, file: !143, line: 39, baseType: !12, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "maxnri", scope: !144, file: !143, line: 39, baseType: !12, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nrj", scope: !144, file: !143, line: 40, baseType: !12, size: 32, align: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "maxnrj", scope: !144, file: !143, line: 40, baseType: !12, size: 32, align: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !144, file: !143, line: 41, baseType: !12, size: 32, align: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "solvent", scope: !144, file: !143, line: 42, baseType: !12, size: 32, align: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "iinr", scope: !144, file: !143, line: 43, baseType: !154, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !5, line: 73, baseType: !12)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !144, file: !143, line: 44, baseType: !134, size: 64, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !144, file: !143, line: 45, baseType: !134, size: 64, align: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "jindex", scope: !144, file: !143, line: 46, baseType: !134, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "jjnr", scope: !144, file: !143, line: 47, baseType: !154, size: 64, align: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nsatoms", scope: !144, file: !143, line: 48, baseType: !134, size: 64, align: 64, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !144, file: !143, line: 58, baseType: !12, size: 32, align: 32, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !144, file: !143, line: 58, baseType: !134, size: 64, align: 64, offset: 704)
!163 = !{!164}
!164 = !DISubrange(count: 13)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_lr", scope: !85, file: !84, line: 109, baseType: !141, size: 9984, align: 64, offset: 11904)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bTwinRange", scope: !85, file: !84, line: 120, baseType: !12, size: 32, align: 32, offset: 21888)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nlr", scope: !85, file: !84, line: 121, baseType: !12, size: 32, align: 32, offset: 21920)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f_twin", scope: !85, file: !84, line: 122, baseType: !137, size: 64, align: 64, offset: 21952)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fshift_twin", scope: !85, file: !84, line: 123, baseType: !137, size: 64, align: 64, offset: 22016)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "f_pme", scope: !85, file: !84, line: 126, baseType: !137, size: 64, align: 64, offset: 22080)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "bEwald", scope: !85, file: !84, line: 127, baseType: !12, size: 32, align: 32, offset: 22144)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcoeff", scope: !85, file: !84, line: 128, baseType: !4, size: 32, align: 32, offset: 22176)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !85, file: !84, line: 131, baseType: !137, size: 64, align: 64, offset: 22208)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nmol", scope: !85, file: !84, line: 134, baseType: !12, size: 32, align: 32, offset: 22272)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mol_nr", scope: !85, file: !84, line: 135, baseType: !154, size: 64, align: 64, offset: 22336)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mol_epot", scope: !85, file: !84, line: 136, baseType: !81, size: 64, align: 64, offset: 22400)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nstcalc", scope: !85, file: !84, line: 137, baseType: !12, size: 32, align: 32, offset: 22464)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ntype", scope: !85, file: !84, line: 140, baseType: !12, size: 32, align: 32, offset: 22496)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bBHAM", scope: !85, file: !84, line: 141, baseType: !12, size: 32, align: 32, offset: 22528)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nbfp", scope: !85, file: !84, line: 142, baseType: !81, size: 64, align: 64, offset: 22592)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !85, file: !84, line: 145, baseType: !134, size: 64, align: 64, offset: 22656)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !85, file: !84, line: 148, baseType: !4, size: 32, align: 32, offset: 22720)
!183 = !{!184, !185, !186, !187, !188}
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !15, file: !1, line: 54, type: !18)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 2, scope: !15, file: !1, line: 54, type: !4)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 3, scope: !15, file: !1, line: 54, type: !4)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !15, file: !1, line: 54, type: !81)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 5, scope: !15, file: !1, line: 54, type: !82)
!189 = !DISubprogram(name: "gk", scope: !1, file: !1, line: 96, type: !190, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @gk, variables: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{!4, !4, !4, !4}
!192 = !{!193, !194, !195, !196, !197}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k", arg: 1, scope: !189, file: !1, line: 96, type: !4)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !189, file: !1, line: 96, type: !4)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 3, scope: !189, file: !1, line: 96, type: !4)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N", scope: !189, file: !1, line: 99, type: !4)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gg", scope: !189, file: !1, line: 99, type: !4)
!198 = !DISubprogram(name: "gknew", scope: !1, file: !1, line: 111, type: !190, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @gknew, variables: !199)
!199 = !{!200, !201, !202, !203, !204}
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k", arg: 1, scope: !198, file: !1, line: 111, type: !4)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !198, file: !1, line: 111, type: !4)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 3, scope: !198, file: !1, line: 111, type: !4)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rck", scope: !198, file: !1, line: 113, type: !4)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rck2", scope: !198, file: !1, line: 113, type: !4)
!205 = !DISubprogram(name: "calc_dx2dx", scope: !1, file: !1, line: 121, type: !206, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, function: float (float*, float*, float*, float*)* @calc_dx2dx, variables: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{!4, !81, !81, !81, !81}
!208 = !{!209, !210, !211, !212, !213, !214, !215}
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xi", arg: 1, scope: !205, file: !1, line: 121, type: !81)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xj", arg: 2, scope: !205, file: !1, line: 121, type: !81)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 3, scope: !205, file: !1, line: 121, type: !81)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dx", arg: 4, scope: !205, file: !1, line: 121, type: !81)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !205, file: !1, line: 123, type: !12)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ddx", scope: !205, file: !1, line: 124, type: !4)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx2", scope: !205, file: !1, line: 124, type: !4)
!216 = !DISubprogram(name: "calc_dx2", scope: !1, file: !1, line: 139, type: !217, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: float (float*, float*, float*)* @calc_dx2, variables: !219)
!217 = !DISubroutineType(types: !218)
!218 = !{!4, !81, !81, !81}
!219 = !{!220, !221, !222, !223}
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xi", arg: 1, scope: !216, file: !1, line: 139, type: !81)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xj", arg: 2, scope: !216, file: !1, line: 139, type: !81)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 3, scope: !216, file: !1, line: 139, type: !81)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !216, file: !1, line: 141, type: !138)
!224 = !DISubprogram(name: "shiftfunction", scope: !1, file: !1, line: 146, type: !190, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @shiftfunction, variables: !225)
!225 = !{!226, !227, !228, !229}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 1, scope: !224, file: !1, line: 146, type: !4)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !224, file: !1, line: 146, type: !4)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "R", arg: 3, scope: !224, file: !1, line: 146, type: !4)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !224, file: !1, line: 148, type: !4)
!230 = !DISubprogram(name: "new_f", scope: !1, file: !1, line: 160, type: !231, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float)* @new_f, variables: !233)
!231 = !DISubroutineType(types: !232)
!232 = !{!4, !4, !4}
!233 = !{!234, !235, !236, !237, !238}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 1, scope: !230, file: !1, line: 160, type: !4)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !230, file: !1, line: 160, type: !4)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rrc", scope: !230, file: !1, line: 162, type: !4)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rrc2", scope: !230, file: !1, line: 162, type: !4)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rrc3", scope: !230, file: !1, line: 162, type: !4)
!239 = !DISubprogram(name: "new_phi", scope: !1, file: !1, line: 170, type: !231, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float)* @new_phi, variables: !240)
!240 = !{!241, !242, !243}
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 1, scope: !239, file: !1, line: 170, type: !4)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !239, file: !1, line: 170, type: !4)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rrr", scope: !239, file: !1, line: 172, type: !4)
!244 = !DISubprogram(name: "old_f", scope: !1, file: !1, line: 179, type: !190, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @old_f, variables: !245)
!245 = !{!246, !247, !248, !249, !250}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 1, scope: !244, file: !1, line: 179, type: !4)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !244, file: !1, line: 179, type: !4)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 3, scope: !244, file: !1, line: 179, type: !4)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !244, file: !1, line: 181, type: !4)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r2", scope: !244, file: !1, line: 181, type: !4)
!251 = !DISubprogram(name: "old_phi", scope: !1, file: !1, line: 193, type: !190, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @old_phi, variables: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 1, scope: !251, file: !1, line: 193, type: !4)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !251, file: !1, line: 193, type: !4)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 3, scope: !251, file: !1, line: 193, type: !4)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !251, file: !1, line: 195, type: !4)
!257 = !DISubprogram(name: "phi_sr", scope: !1, file: !1, line: 207, type: !258, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, [3 x float]*, float*, float, float, float*, float*, %struct.t_block*, [3 x float]*, i32)* @phi_sr, variables: !273)
!258 = !DISubroutineType(types: !259)
!259 = !{!4, !18, !12, !137, !81, !4, !4, !81, !81, !260, !137, !12}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !262, line: 52, baseType: !263)
!262 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!263 = !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 36, size: 8448, align: 64, elements: !264)
!264 = !{!265, !269, !270, !271, !272}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !263, file: !262, line: 37, baseType: !266, size: 8192, align: 32)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8192, align: 32, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !263, file: !262, line: 43, baseType: !12, size: 32, align: 32, offset: 8192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !263, file: !262, line: 44, baseType: !154, size: 64, align: 64, offset: 8256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !263, file: !262, line: 45, baseType: !12, size: 32, align: 32, offset: 8320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !263, file: !262, line: 46, baseType: !154, size: 64, align: 64, offset: 8384)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !257, file: !1, line: 207, type: !18)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nj", arg: 2, scope: !257, file: !1, line: 207, type: !12)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !257, file: !1, line: 207, type: !137)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 4, scope: !257, file: !1, line: 207, type: !81)
!278 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 5, scope: !257, file: !1, line: 207, type: !4)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 6, scope: !257, file: !1, line: 207, type: !4)
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !257, file: !1, line: 207, type: !81)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 8, scope: !257, file: !1, line: 208, type: !81)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "excl", arg: 9, scope: !257, file: !1, line: 208, type: !260)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f_sr", arg: 10, scope: !257, file: !1, line: 208, type: !137)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOld", arg: 11, scope: !257, file: !1, line: 208, type: !12)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !257, file: !1, line: 210, type: !12)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !257, file: !1, line: 210, type: !12)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !257, file: !1, line: 210, type: !12)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !257, file: !1, line: 210, type: !12)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ni", scope: !257, file: !1, line: 210, type: !12)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !257, file: !1, line: 210, type: !12)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2", scope: !257, file: !1, line: 210, type: !12)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !257, file: !1, line: 211, type: !4)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r2", scope: !257, file: !1, line: 211, type: !4)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R", scope: !257, file: !1, line: 211, type: !4)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R_1", scope: !257, file: !1, line: 211, type: !4)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R_2", scope: !257, file: !1, line: 211, type: !4)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc2", scope: !257, file: !1, line: 211, type: !4)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qi", scope: !257, file: !1, line: 212, type: !4)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qj", scope: !257, file: !1, line: 212, type: !4)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsr", scope: !257, file: !1, line: 212, type: !4)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eps", scope: !257, file: !1, line: 212, type: !4)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fscal", scope: !257, file: !1, line: 212, type: !4)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !257, file: !1, line: 213, type: !138)
!304 = !DISubprogram(name: "spreadfunction", scope: !1, file: !1, line: 260, type: !190, isLocal: false, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @spreadfunction, variables: !305)
!305 = !{!306, !307, !308, !309}
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 1, scope: !304, file: !1, line: 260, type: !4)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !304, file: !1, line: 260, type: !4)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "R", arg: 3, scope: !304, file: !1, line: 260, type: !4)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !304, file: !1, line: 262, type: !4)
!310 = !DISubprogram(name: "potential", scope: !1, file: !1, line: 274, type: !190, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, float)* @potential, variables: !311)
!311 = !{!312, !313, !314}
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 1, scope: !310, file: !1, line: 274, type: !4)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 2, scope: !310, file: !1, line: 274, type: !4)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "R", arg: 3, scope: !310, file: !1, line: 274, type: !4)
!315 = !DISubprogram(name: "shift_LRcorrection", scope: !1, file: !1, line: 286, type: !316, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, %struct.t_nsborder*, %struct.t_commrec*, %struct.t_forcerec*, float*, %struct.t_block*, [3 x float]*, i32, [3 x float]*, [3 x float]*)* @shift_LRcorrection, variables: !346)
!316 = !DISubroutineType(types: !317)
!317 = !{!4, !18, !318, !334, !82, !81, !260, !137, !12, !345, !345}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !320, line: 59, baseType: !321)
!320 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!321 = !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 36, size: 32992, align: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !321, file: !320, line: 37, baseType: !12, size: 32, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !321, file: !320, line: 38, baseType: !12, size: 32, align: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !321, file: !320, line: 39, baseType: !12, size: 32, align: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !321, file: !320, line: 40, baseType: !12, size: 32, align: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !321, file: !320, line: 41, baseType: !12, size: 32, align: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !321, file: !320, line: 43, baseType: !12, size: 32, align: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !321, file: !320, line: 43, baseType: !12, size: 32, align: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !321, file: !320, line: 50, baseType: !266, size: 8192, align: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !321, file: !320, line: 51, baseType: !266, size: 8192, align: 32, offset: 8416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !321, file: !320, line: 52, baseType: !266, size: 8192, align: 32, offset: 16608)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !321, file: !320, line: 55, baseType: !266, size: 8192, align: 32, offset: 24800)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !336, line: 40, baseType: !337)
!336 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!337 = !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 36, size: 192, align: 32, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !337, file: !336, line: 37, baseType: !12, size: 32, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !337, file: !336, line: 37, baseType: !12, size: 32, align: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !337, file: !336, line: 38, baseType: !12, size: 32, align: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !337, file: !336, line: 38, baseType: !12, size: 32, align: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !337, file: !336, line: 39, baseType: !12, size: 32, align: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !337, file: !336, line: 39, baseType: !12, size: 32, align: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !384, !385}
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !315, file: !1, line: 286, type: !18)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 2, scope: !315, file: !1, line: 286, type: !318)
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !315, file: !1, line: 286, type: !334)
!350 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 4, scope: !315, file: !1, line: 286, type: !82)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 5, scope: !315, file: !1, line: 287, type: !81)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "excl", arg: 6, scope: !315, file: !1, line: 287, type: !260)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 7, scope: !315, file: !1, line: 287, type: !137)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOld", arg: 8, scope: !315, file: !1, line: 288, type: !12)
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 9, scope: !315, file: !1, line: 288, type: !345)
!356 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lr_vir", arg: 10, scope: !315, file: !1, line: 288, type: !345)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !315, file: !1, line: 292, type: !12)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !315, file: !1, line: 292, type: !12)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2", scope: !315, file: !1, line: 292, type: !12)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !315, file: !1, line: 292, type: !12)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !315, file: !1, line: 292, type: !12)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !315, file: !1, line: 292, type: !12)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !315, file: !1, line: 292, type: !12)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jv", scope: !315, file: !1, line: 292, type: !12)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "AA", scope: !315, file: !1, line: 293, type: !134)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qq", scope: !315, file: !1, line: 294, type: !367)
!367 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isp", scope: !315, file: !1, line: 295, type: !367)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qi", scope: !315, file: !1, line: 296, type: !4)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !315, file: !1, line: 296, type: !4)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr2", scope: !315, file: !1, line: 296, type: !4)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr_1", scope: !315, file: !1, line: 296, type: !4)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr_3", scope: !315, file: !1, line: 296, type: !4)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fscal", scope: !315, file: !1, line: 296, type: !4)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Vexcl", scope: !315, file: !1, line: 296, type: !4)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qtot", scope: !315, file: !1, line: 296, type: !4)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "df", scope: !315, file: !1, line: 297, type: !138)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !315, file: !1, line: 297, type: !138)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r1", scope: !315, file: !1, line: 298, type: !4)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !315, file: !1, line: 299, type: !4)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !315, file: !1, line: 300, type: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !5, line: 107, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, align: 32, elements: !72)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !315, file: !1, line: 301, type: !12)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "natoms", scope: !315, file: !1, line: 302, type: !12)
!386 = !DISubprogram(name: "calc_ener", scope: !1, file: !1, line: 390, type: !387, isLocal: false, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, i32, i32, i32, float*, float*, %struct.t_block*)* @calc_ener, variables: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !18, !47, !12, !12, !12, !81, !81, !260}
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !386, file: !1, line: 390, type: !18)
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !386, file: !1, line: 390, type: !47)
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bHeader", arg: 3, scope: !386, file: !1, line: 390, type: !12)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmol", arg: 4, scope: !386, file: !1, line: 390, type: !12)
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 5, scope: !386, file: !1, line: 391, type: !12)
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 6, scope: !386, file: !1, line: 391, type: !81)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 7, scope: !386, file: !1, line: 391, type: !81)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "excl", arg: 8, scope: !386, file: !1, line: 391, type: !260)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !386, file: !1, line: 393, type: !12)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !386, file: !1, line: 393, type: !12)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2", scope: !386, file: !1, line: 393, type: !12)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !386, file: !1, line: 393, type: !12)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !386, file: !1, line: 393, type: !12)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qq", scope: !386, file: !1, line: 394, type: !4)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qi", scope: !386, file: !1, line: 394, type: !4)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vv", scope: !386, file: !1, line: 394, type: !4)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !386, file: !1, line: 394, type: !4)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Vex", scope: !386, file: !1, line: 394, type: !4)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Vc", scope: !386, file: !1, line: 394, type: !4)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Vt", scope: !386, file: !1, line: 394, type: !4)
!410 = !DISubprogram(name: "phi_aver", scope: !1, file: !1, line: 432, type: !411, isLocal: false, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: true, function: float (i32, float*)* @phi_aver, variables: !413)
!411 = !DISubroutineType(types: !412)
!412 = !{!4, !12, !81}
!413 = !{!414, !415, !416, !417}
!414 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 1, scope: !410, file: !1, line: 432, type: !12)
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 2, scope: !410, file: !1, line: 432, type: !81)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phitot", scope: !410, file: !1, line: 434, type: !4)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !410, file: !1, line: 435, type: !12)
!418 = !DISubprogram(name: "symmetrize_phi", scope: !1, file: !1, line: 444, type: !419, isLocal: false, isDefinition: true, scopeLine: 445, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, float*, i32)* @symmetrize_phi, variables: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!4, !18, !12, !81, !12}
!421 = !{!422, !423, !424, !425, !426, !427}
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !418, file: !1, line: 444, type: !18)
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !418, file: !1, line: 444, type: !12)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 3, scope: !418, file: !1, line: 444, type: !81)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 4, scope: !418, file: !1, line: 444, type: !12)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phitot", scope: !418, file: !1, line: 446, type: !4)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !418, file: !1, line: 447, type: !12)
!428 = !DISubprogram(name: "plot_phi", scope: !1, file: !1, line: 467, type: !429, isLocal: false, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, float*, i32, [3 x float]*, float*)* @plot_phi, variables: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !47, !81, !12, !137, !81}
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !428, file: !1, line: 467, type: !47)
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 2, scope: !428, file: !1, line: 467, type: !81)
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 3, scope: !428, file: !1, line: 467, type: !12)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !428, file: !1, line: 467, type: !137)
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 5, scope: !428, file: !1, line: 467, type: !81)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eps", scope: !428, file: !1, line: 469, type: !18)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi_max", scope: !428, file: !1, line: 470, type: !4)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rr", scope: !428, file: !1, line: 470, type: !4)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gg", scope: !428, file: !1, line: 470, type: !4)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb", scope: !428, file: !1, line: 470, type: !4)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fac", scope: !428, file: !1, line: 470, type: !4)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !428, file: !1, line: 470, type: !4)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x0", scope: !428, file: !1, line: 470, type: !4)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y0", scope: !428, file: !1, line: 470, type: !4)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !428, file: !1, line: 471, type: !4)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !428, file: !1, line: 472, type: !12)
!448 = !DISubprogram(name: "plot_qtab", scope: !1, file: !1, line: 511, type: !449, isLocal: false, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32, i32, float***)* @plot_qtab, variables: !453)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !47, !12, !12, !12, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !448, file: !1, line: 511, type: !47)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !448, file: !1, line: 511, type: !12)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !448, file: !1, line: 511, type: !12)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !448, file: !1, line: 511, type: !12)
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "qtab", arg: 5, scope: !448, file: !1, line: 511, type: !451)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "box", scope: !448, file: !1, line: 513, type: !138)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xx", scope: !448, file: !1, line: 514, type: !137)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi", scope: !448, file: !1, line: 515, type: !81)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !448, file: !1, line: 516, type: !12)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npt", scope: !448, file: !1, line: 516, type: !12)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !448, file: !1, line: 516, type: !12)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !448, file: !1, line: 516, type: !12)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !448, file: !1, line: 516, type: !12)
!467 = !DISubprogram(name: "print_phi", scope: !1, file: !1, line: 544, type: !468, isLocal: false, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, [3 x float]*, float*)* @print_phi, variables: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !47, !12, !137, !81}
!470 = !{!471, !472, !473, !474, !475, !476}
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !467, file: !1, line: 544, type: !47)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !467, file: !1, line: 544, type: !12)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !467, file: !1, line: 544, type: !137)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 4, scope: !467, file: !1, line: 544, type: !81)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !467, file: !1, line: 546, type: !18)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !467, file: !1, line: 547, type: !12)
!477 = !DISubprogram(name: "write_pqr", scope: !1, file: !1, line: 555, type: !478, isLocal: false, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.t_atoms*, [3 x float]*, float*, float)* @write_pqr, variables: !539)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !47, !480, !137, !81, !4}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !482, line: 94, baseType: !483)
!482 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!483 = !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 75, size: 10240, align: 64, elements: !484)
!484 = !{!485, !486, !505, !508, !509, !510, !511, !512, !513, !514, !515, !522}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !483, file: !482, line: 76, baseType: !12, size: 32, align: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !483, file: !482, line: 77, baseType: !487, size: 64, align: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !482, line: 57, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 48, size: 320, align: 32, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !497, !498, !499, !500, !504}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !489, file: !482, line: 49, baseType: !4, size: 32, align: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !489, file: !482, line: 49, baseType: !4, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !489, file: !482, line: 50, baseType: !4, size: 32, align: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !489, file: !482, line: 50, baseType: !4, size: 32, align: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !482, line: 51, baseType: !496, size: 16, align: 16, offset: 128)
!496 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !489, file: !482, line: 52, baseType: !496, size: 16, align: 16, offset: 144)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !489, file: !482, line: 53, baseType: !12, size: 32, align: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !489, file: !482, line: 54, baseType: !12, size: 32, align: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !489, file: !482, line: 55, baseType: !501, size: 72, align: 8, offset: 224)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 72, align: 8, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 9)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !489, file: !482, line: 56, baseType: !25, size: 8, align: 8, offset: 296)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !483, file: !482, line: 80, baseType: !506, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !483, file: !482, line: 82, baseType: !506, size: 64, align: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !483, file: !482, line: 84, baseType: !506, size: 64, align: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !483, file: !482, line: 86, baseType: !12, size: 32, align: 32, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !483, file: !482, line: 87, baseType: !506, size: 64, align: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !483, file: !482, line: 89, baseType: !12, size: 32, align: 32, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !483, file: !482, line: 90, baseType: !506, size: 64, align: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !483, file: !482, line: 91, baseType: !261, size: 8448, align: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !483, file: !482, line: 92, baseType: !516, size: 1152, align: 64, offset: 9024)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 1152, align: 64, elements: !502)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !482, line: 73, baseType: !518)
!518 = !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 70, size: 128, align: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !518, file: !482, line: 71, baseType: !12, size: 32, align: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !518, file: !482, line: 72, baseType: !134, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !483, file: !482, line: 93, baseType: !523, size: 64, align: 64, offset: 10176)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !482, line: 68, baseType: !525)
!525 = !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 59, size: 416, align: 32, elements: !526)
!526 = !{!527, !528, !529, !530, !534, !535, !536, !537}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !482, line: 60, baseType: !12, size: 32, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !525, file: !482, line: 61, baseType: !12, size: 32, align: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !525, file: !482, line: 62, baseType: !48, size: 8, align: 8, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !525, file: !482, line: 63, baseType: !531, size: 48, align: 8, offset: 72)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, align: 8, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 6)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !525, file: !482, line: 64, baseType: !4, size: 32, align: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !525, file: !482, line: 65, baseType: !4, size: 32, align: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !525, file: !482, line: 66, baseType: !12, size: 32, align: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !525, file: !482, line: 67, baseType: !538, size: 192, align: 32, offset: 224)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, align: 32, elements: !532)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !477, file: !1, line: 555, type: !47)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 2, scope: !477, file: !1, line: 555, type: !480)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !477, file: !1, line: 555, type: !137)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 4, scope: !477, file: !1, line: 555, type: !81)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dx", arg: 5, scope: !477, file: !1, line: 555, type: !4)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !477, file: !1, line: 557, type: !18)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !477, file: !1, line: 558, type: !12)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rnr", scope: !477, file: !1, line: 558, type: !12)
!548 = !DISubprogram(name: "write_grid_pqr", scope: !1, file: !1, line: 571, type: !449, isLocal: false, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32, i32, float***)* @write_grid_pqr, variables: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !548, file: !1, line: 571, type: !47)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !548, file: !1, line: 571, type: !12)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !548, file: !1, line: 571, type: !12)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !548, file: !1, line: 571, type: !12)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phi", arg: 5, scope: !548, file: !1, line: 571, type: !451)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !548, file: !1, line: 573, type: !18)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !548, file: !1, line: 574, type: !12)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !548, file: !1, line: 574, type: !12)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !548, file: !1, line: 574, type: !12)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rnr", scope: !548, file: !1, line: 574, type: !12)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fac", scope: !548, file: !1, line: 575, type: !4)
!561 = !DISubprogram(name: "analyse_diff", scope: !1, file: !1, line: 588, type: !562, isLocal: false, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i8*, i32, [3 x float]*, [3 x float]*, float*, float*, float*, i8*, i8*, i8*, i8*)* @analyse_diff, variables: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{!4, !18, !47, !12, !137, !137, !81, !81, !81, !47, !47, !47, !47}
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !561, file: !1, line: 588, type: !18)
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "label", arg: 2, scope: !561, file: !1, line: 588, type: !47)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natom", arg: 3, scope: !561, file: !1, line: 589, type: !12)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ffour", arg: 4, scope: !561, file: !1, line: 589, type: !137)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fpppm", arg: 5, scope: !561, file: !1, line: 589, type: !137)
