; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/sortwater.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }

@.str = private unnamed_addr constant [4 x i8] c"tab\00", align 1
@.str1 = private unnamed_addr constant [69 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/sortwater.c\00", align 1
@NBOX = internal global [3 x i32] zeroinitializer, align 4
@box_1 = internal unnamed_addr global [3 x float] zeroinitializer, align 4
@.str2 = private unnamed_addr constant [8 x i8] c"rvindex\00", align 1
@xptr = internal unnamed_addr global [3 x float]* null, align 8
@nwat = internal unnamed_addr global i32 0, align 4
@debug = external global %struct.__sFILE*
@.str3 = private unnamed_addr constant [46 x i8] c"rvindex[%5d] = %5d (x = %8.3f  %8.3f  %8.3f)\0A\00", align 1
@.str4 = private unnamed_addr constant [4 x i8] c"tmp\00", align 1
@.str5 = private unnamed_addr constant [3 x i8] c"BB\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !392, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/sortwater.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!7 = !{!8, !76, !82, !89, !95, !101, !104, !107, !110, !113, !116, !119, !128, !137, !150, !153, !156, !159, !173, !187, !193, !199, !220, !229, !242, !252, !268, !280, !290, !296, !315, !323, !331, !350, !356, !364, !370, !378, !384}
!8 = !DISubprogram(name: "__sputc", scope: !9, file: !9, line: 348, type: !10, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !73)
!9 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DISubroutineType(types: !11)
!11 = !{!5, !5, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !9, line: 153, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !9, line: 122, size: 1216, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21, !23, !24, !29, !30, !32, !36, !41, !51, !57, !58, !61, !62, !66, !70, !71, !72}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !14, file: !9, line: 123, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !14, file: !9, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !14, file: !9, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !9, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !14, file: !9, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !14, file: !9, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !9, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !9, line: 89, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !9, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !14, file: !9, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !14, file: !9, line: 132, baseType: !31, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !14, file: !9, line: 133, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!5, !31}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !14, file: !9, line: 134, baseType: !37, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!5, !31, !40, !5}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !14, file: !9, line: 135, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !31, !45, !5}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !9, line: 77, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !47, line: 71, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !14, file: !9, line: 136, baseType: !52, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!5, !31, !55, !5}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !14, file: !9, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !14, file: !9, line: 140, baseType: !59, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !9, line: 94, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !14, file: !9, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !14, file: !9, line: 144, baseType: !63, size: 24, align: 8, offset: 928)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 3)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !14, file: !9, line: 145, baseType: !67, size: 8, align: 8, offset: 952)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !14, file: !9, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !14, file: !9, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !9, line: 152, baseType: !45, size: 64, align: 64, offset: 1152)
!73 = !{!74, !75}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !8, file: !9, line: 348, type: !5)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !8, file: !9, line: 348, type: !12)
!76 = !DISubprogram(name: "__sigbits", scope: !77, file: !77, line: 114, type: !78, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !80)
!77 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DISubroutineType(types: !79)
!79 = !{!5, !5}
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !76, file: !77, line: 114, type: !5)
!82 = !DISubprogram(name: "__inline_isfinitef", scope: !83, file: !83, line: 204, type: !84, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !87)
!83 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !DISubroutineType(types: !85)
!85 = !{!5, !86}
!86 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!87 = !{!88}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !82, file: !83, line: 204, type: !86)
!89 = !DISubprogram(name: "__inline_isfinited", scope: !83, file: !83, line: 207, type: !90, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !93)
!90 = !DISubroutineType(types: !91)
!91 = !{!5, !92}
!92 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!93 = !{!94}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !89, file: !83, line: 207, type: !92)
!95 = !DISubprogram(name: "__inline_isfinitel", scope: !83, file: !83, line: 210, type: !96, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !99)
!96 = !DISubroutineType(types: !97)
!97 = !{!5, !98}
!98 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!99 = !{!100}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !95, file: !83, line: 210, type: !98)
!101 = !DISubprogram(name: "__inline_isinff", scope: !83, file: !83, line: 213, type: !84, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !102)
!102 = !{!103}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !101, file: !83, line: 213, type: !86)
!104 = !DISubprogram(name: "__inline_isinfd", scope: !83, file: !83, line: 216, type: !90, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !105)
!105 = !{!106}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !104, file: !83, line: 216, type: !92)
!107 = !DISubprogram(name: "__inline_isinfl", scope: !83, file: !83, line: 219, type: !96, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !108)
!108 = !{!109}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !107, file: !83, line: 219, type: !98)
!110 = !DISubprogram(name: "__inline_isnanf", scope: !83, file: !83, line: 222, type: !84, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !111)
!111 = !{!112}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !110, file: !83, line: 222, type: !86)
!113 = !DISubprogram(name: "__inline_isnand", scope: !83, file: !83, line: 225, type: !90, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !114)
!114 = !{!115}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !113, file: !83, line: 225, type: !92)
!116 = !DISubprogram(name: "__inline_isnanl", scope: !83, file: !83, line: 228, type: !96, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !117)
!117 = !{!118}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !116, file: !83, line: 228, type: !98)
!119 = !DISubprogram(name: "__inline_signbitf", scope: !83, file: !83, line: 231, type: !84, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !120)
!120 = !{!121, !122}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !119, file: !83, line: 231, type: !86)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !119, file: !83, line: 232, type: !123)
!123 = !DICompositeType(tag: DW_TAG_union_type, scope: !119, file: !83, line: 232, size: 32, align: 32, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !123, file: !83, line: 232, baseType: !86, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !123, file: !83, line: 232, baseType: !127, size: 32, align: 32)
!127 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!128 = !DISubprogram(name: "__inline_signbitd", scope: !83, file: !83, line: 236, type: !90, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !129)
!129 = !{!130, !131}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !128, file: !83, line: 236, type: !92)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !128, file: !83, line: 237, type: !132)
!132 = !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !83, line: 237, size: 64, align: 64, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !132, file: !83, line: 237, baseType: !92, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !132, file: !83, line: 237, baseType: !136, size: 64, align: 64)
!136 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!137 = !DISubprogram(name: "__inline_signbitl", scope: !83, file: !83, line: 242, type: !96, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !138)
!138 = !{!139, !140}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !137, file: !83, line: 242, type: !98)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !137, file: !83, line: 246, type: !141)
!141 = !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !83, line: 243, size: 128, align: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !141, file: !83, line: 244, baseType: !98, size: 128, align: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !141, file: !83, line: 245, baseType: !145, size: 128, align: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !83, line: 245, size: 128, align: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !145, file: !83, line: 245, baseType: !136, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !145, file: !83, line: 245, baseType: !149, size: 16, align: 16, offset: 64)
!149 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!150 = !DISubprogram(name: "__inline_isnormalf", scope: !83, file: !83, line: 257, type: !84, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !151)
!151 = !{!152}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !150, file: !83, line: 257, type: !86)
!153 = !DISubprogram(name: "__inline_isnormald", scope: !83, file: !83, line: 260, type: !90, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !154)
!154 = !{!155}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !153, file: !83, line: 260, type: !92)
!156 = !DISubprogram(name: "__inline_isnormall", scope: !83, file: !83, line: 263, type: !96, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !157)
!157 = !{!158}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !156, file: !83, line: 263, type: !98)
!159 = !DISubprogram(name: "__sincosf", scope: !83, file: !83, line: 642, type: !160, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !163)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !86, !162, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!163 = !{!164, !165, !166, !167}
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !159, file: !83, line: 642, type: !86)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !159, file: !83, line: 642, type: !162)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !159, file: !83, line: 642, type: !162)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !159, file: !83, line: 643, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !83, line: 634, size: 64, align: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !169, file: !83, line: 634, baseType: !86, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !169, file: !83, line: 634, baseType: !86, size: 32, align: 32, offset: 32)
!173 = !DISubprogram(name: "__sincos", scope: !83, file: !83, line: 647, type: !174, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !177)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !92, !176, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!177 = !{!178, !179, !180, !181}
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !173, file: !83, line: 647, type: !92)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !173, file: !83, line: 647, type: !176)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !173, file: !83, line: 647, type: !176)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !173, file: !83, line: 648, type: !182)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !83, line: 635, size: 128, align: 64, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !183, file: !83, line: 635, baseType: !92, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !183, file: !83, line: 635, baseType: !92, size: 64, align: 64, offset: 64)
!187 = !DISubprogram(name: "__sincospif", scope: !83, file: !83, line: 652, type: !160, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !188)
!188 = !{!189, !190, !191, !192}
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !187, file: !83, line: 652, type: !86)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !187, file: !83, line: 652, type: !162)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !187, file: !83, line: 652, type: !162)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !187, file: !83, line: 653, type: !168)
!193 = !DISubprogram(name: "__sincospi", scope: !83, file: !83, line: 657, type: !174, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !194)
!194 = !{!195, !196, !197, !198}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !193, file: !83, line: 657, type: !92)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !193, file: !83, line: 657, type: !176)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !193, file: !83, line: 657, type: !176)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !193, file: !83, line: 658, type: !182)
!199 = !DISubprogram(name: "randwater", scope: !1, file: !1, line: 44, type: !200, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, [3 x float]*, [3 x float]*, i32*)* @randwater, variables: !207)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !5, !5, !5, !202, !202, !6}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !204, line: 101, baseType: !205)
!204 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 96, align: 32, elements: !64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !204, line: 87, baseType: !86)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "astart", arg: 1, scope: !199, file: !1, line: 44, type: !5)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nwater", arg: 2, scope: !199, file: !1, line: 44, type: !5)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nwatom", arg: 3, scope: !199, file: !1, line: 44, type: !5)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !199, file: !1, line: 44, type: !202)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 5, scope: !199, file: !1, line: 44, type: !202)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 6, scope: !199, file: !1, line: 44, type: !6)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !199, file: !1, line: 46, type: !5)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !199, file: !1, line: 46, type: !5)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wi", scope: !199, file: !1, line: 46, type: !5)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wj", scope: !199, file: !1, line: 46, type: !5)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tab", scope: !199, file: !1, line: 46, type: !6)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !199, file: !1, line: 47, type: !203)
