; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/splittop.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.2 }
%struct.anon.2 = type { float, float, float, float, float, float }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }
%struct.t_nblist = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32* }
%struct.t_graph = type { i32, i32, i32, i32, i32, i32*, i32**, [3 x i32]* }
%struct.t_mdatoms = type { float, i32, float*, float*, float*, float*, float*, float*, float*, i32*, i32*, i32*, i32*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !51, subprograms: !53, globals: !478, imports: !478)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/splittop.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 49, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!6 = !DIEnumerator(name: "F_BONDS", value: 0)
!7 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!8 = !DIEnumerator(name: "F_MORSE", value: 2)
!9 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!10 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!11 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!12 = !DIEnumerator(name: "F_ANGLES", value: 6)
!13 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!14 = !DIEnumerator(name: "F_PDIHS", value: 8)
!15 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!16 = !DIEnumerator(name: "F_IDIHS", value: 10)
!17 = !DIEnumerator(name: "F_LJ14", value: 11)
!18 = !DIEnumerator(name: "F_COUL14", value: 12)
!19 = !DIEnumerator(name: "F_LJ", value: 13)
!20 = !DIEnumerator(name: "F_BHAM", value: 14)
!21 = !DIEnumerator(name: "F_LJLR", value: 15)
!22 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!23 = !DIEnumerator(name: "F_SR", value: 17)
!24 = !DIEnumerator(name: "F_LR", value: 18)
!25 = !DIEnumerator(name: "F_WPOL", value: 19)
!26 = !DIEnumerator(name: "F_POSRES", value: 20)
!27 = !DIEnumerator(name: "F_DISRES", value: 21)
!28 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!29 = !DIEnumerator(name: "F_ORIRES", value: 23)
!30 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!31 = !DIEnumerator(name: "F_ANGRES", value: 25)
!32 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!33 = !DIEnumerator(name: "F_SHAKE", value: 27)
!34 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!35 = !DIEnumerator(name: "F_SETTLE", value: 29)
!36 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!37 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!38 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!39 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!40 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!41 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!42 = !DIEnumerator(name: "F_EQM", value: 36)
!43 = !DIEnumerator(name: "F_EPOT", value: 37)
!44 = !DIEnumerator(name: "F_EKIN", value: 38)
!45 = !DIEnumerator(name: "F_ETOT", value: 39)
!46 = !DIEnumerator(name: "F_TEMP", value: 40)
!47 = !DIEnumerator(name: "F_PRES", value: 41)
!48 = !DIEnumerator(name: "F_DVDL", value: 42)
!49 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!50 = !DIEnumerator(name: "F_NRE", value: 44)
!51 = !{!52}
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !{!54, !123, !129, !145, !356, !457, !465}
!54 = !DISubprogram(name: "__sputc", scope: !55, file: !55, line: 348, type: !56, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !120)
!55 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !58, !59}
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !55, line: 153, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !55, line: 122, size: 1216, align: 64, elements: !62)
!62 = !{!63, !66, !67, !68, !70, !71, !76, !77, !79, !83, !88, !98, !104, !105, !108, !109, !113, !117, !118, !119}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !61, file: !55, line: 123, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !61, file: !55, line: 124, baseType: !58, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !61, file: !55, line: 125, baseType: !58, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !55, line: 126, baseType: !69, size: 16, align: 16, offset: 128)
!69 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !61, file: !55, line: 127, baseType: !69, size: 16, align: 16, offset: 144)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !61, file: !55, line: 128, baseType: !72, size: 128, align: 64, offset: 192)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !55, line: 88, size: 128, align: 64, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !72, file: !55, line: 89, baseType: !64, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !72, file: !55, line: 90, baseType: !58, size: 32, align: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !61, file: !55, line: 129, baseType: !58, size: 32, align: 32, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !61, file: !55, line: 132, baseType: !78, size: 64, align: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !61, file: !55, line: 133, baseType: !80, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!58, !78}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !61, file: !55, line: 134, baseType: !84, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!58, !78, !87, !58}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !61, file: !55, line: 135, baseType: !89, size: 64, align: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !78, !92, !58}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !55, line: 77, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !94, line: 71, baseType: !95)
!94 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !96, line: 46, baseType: !97)
!96 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !61, file: !55, line: 136, baseType: !99, size: 64, align: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!58, !78, !102, !58}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !61, file: !55, line: 139, baseType: !72, size: 128, align: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !61, file: !55, line: 140, baseType: !106, size: 64, align: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !55, line: 94, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !61, file: !55, line: 141, baseType: !58, size: 32, align: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !61, file: !55, line: 144, baseType: !110, size: 24, align: 8, offset: 928)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 24, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 3)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !61, file: !55, line: 145, baseType: !114, size: 8, align: 8, offset: 952)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !61, file: !55, line: 148, baseType: !72, size: 128, align: 64, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !61, file: !55, line: 151, baseType: !58, size: 32, align: 32, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !55, line: 152, baseType: !92, size: 64, align: 64, offset: 1152)
!120 = !{!121, !122}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !54, file: !55, line: 348, type: !58)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !54, file: !55, line: 348, type: !59)
!123 = !DISubprogram(name: "__sigbits", scope: !124, file: !124, line: 114, type: !125, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !127)
!124 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!125 = !DISubroutineType(types: !126)
!126 = !{!58, !58}
!127 = !{!128}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !123, file: !124, line: 114, type: !58)
!129 = !DISubprogram(name: "create_dummylist", scope: !1, file: !1, line: 41, type: !130, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*, i32**)* @create_dummylist, variables: !134)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !58, !132, !132, !133}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nindex", arg: 1, scope: !129, file: !1, line: 41, type: !58)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !129, file: !1, line: 41, type: !132)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "targetn", arg: 3, scope: !129, file: !1, line: 42, type: !132)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "listptr", arg: 4, scope: !129, file: !1, line: 42, type: !133)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !129, file: !1, line: 44, type: !58)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !129, file: !1, line: 44, type: !58)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !129, file: !1, line: 44, type: !58)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inr", scope: !129, file: !1, line: 44, type: !58)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minidx", scope: !129, file: !1, line: 45, type: !58)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newlist", scope: !129, file: !1, line: 46, type: !132)
!145 = !DISubprogram(name: "setup_parallel_dummies", scope: !1, file: !1, line: 76, type: !146, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_idef*, %struct.t_commrec*, %struct.t_nsborder*, %struct.t_comm_dummies*)* @setup_parallel_dummies, variables: !330)
!146 = !DISubroutineType(types: !147)
!147 = !{!58, !148, !290, !301, !317}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !4, line: 188, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 179, size: 366336, align: 64, elements: !151)
!151 = !{!152, !153, !154, !155, !158, !274}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !150, file: !4, line: 181, baseType: !58, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !150, file: !4, line: 182, baseType: !58, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !150, file: !4, line: 183, baseType: !58, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !150, file: !4, line: 184, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !4, line: 133, baseType: !58)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !150, file: !4, line: 185, baseType: !159, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !4, line: 131, baseType: !161)
!161 = !DICompositeType(tag: DW_TAG_union_type, file: !4, line: 97, size: 192, align: 32, elements: !162)
!162 = !{!163, !172, !179, !185, !194, !199, !206, !214, !219, !224, !230, !236, !243, !252, !261, !270}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !161, file: !4, line: 105, baseType: !164, size: 96, align: 32)
!164 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 105, size: 96, align: 32, elements: !165)
!165 = !{!166, !170, !171}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !164, file: !4, line: 105, baseType: !167, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !168, line: 87, baseType: !169)
!168 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!169 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !164, file: !4, line: 105, baseType: !167, size: 32, align: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !164, file: !4, line: 105, baseType: !167, size: 32, align: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !161, file: !4, line: 106, baseType: !173, size: 128, align: 32)
!173 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 106, size: 128, align: 32, elements: !174)
!174 = !{!175, !176, !177, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !173, file: !4, line: 106, baseType: !167, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !173, file: !4, line: 106, baseType: !167, size: 32, align: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !173, file: !4, line: 106, baseType: !167, size: 32, align: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !173, file: !4, line: 106, baseType: !167, size: 32, align: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !161, file: !4, line: 108, baseType: !180, size: 96, align: 32)
!180 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 108, size: 96, align: 32, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !180, file: !4, line: 108, baseType: !167, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !180, file: !4, line: 108, baseType: !167, size: 32, align: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !180, file: !4, line: 108, baseType: !167, size: 32, align: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !161, file: !4, line: 110, baseType: !186, size: 192, align: 32)
!186 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 110, size: 192, align: 32, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !186, file: !4, line: 110, baseType: !167, size: 32, align: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !186, file: !4, line: 110, baseType: !167, size: 32, align: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !186, file: !4, line: 110, baseType: !167, size: 32, align: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !186, file: !4, line: 110, baseType: !167, size: 32, align: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !186, file: !4, line: 110, baseType: !167, size: 32, align: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !186, file: !4, line: 110, baseType: !167, size: 32, align: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !161, file: !4, line: 111, baseType: !195, size: 64, align: 32)
!195 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 111, size: 64, align: 32, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !195, file: !4, line: 111, baseType: !167, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !195, file: !4, line: 111, baseType: !167, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !161, file: !4, line: 112, baseType: !200, size: 128, align: 32)
!200 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 112, size: 128, align: 32, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !200, file: !4, line: 112, baseType: !167, size: 32, align: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !200, file: !4, line: 112, baseType: !167, size: 32, align: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !200, file: !4, line: 112, baseType: !167, size: 32, align: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !200, file: !4, line: 112, baseType: !167, size: 32, align: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !161, file: !4, line: 117, baseType: !207, size: 160, align: 32)
!207 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 117, size: 160, align: 32, elements: !208)
!208 = !{!209, !210, !211, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !207, file: !4, line: 117, baseType: !167, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !207, file: !4, line: 117, baseType: !167, size: 32, align: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !207, file: !4, line: 117, baseType: !58, size: 32, align: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !207, file: !4, line: 117, baseType: !167, size: 32, align: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !207, file: !4, line: 117, baseType: !167, size: 32, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !161, file: !4, line: 118, baseType: !215, size: 64, align: 32)
!215 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 118, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !215, file: !4, line: 118, baseType: !167, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !215, file: !4, line: 118, baseType: !167, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !161, file: !4, line: 123, baseType: !220, size: 64, align: 32)
!220 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 123, size: 64, align: 32, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !220, file: !4, line: 123, baseType: !167, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !220, file: !4, line: 123, baseType: !167, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !161, file: !4, line: 124, baseType: !225, size: 96, align: 32)
!225 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 124, size: 96, align: 32, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !225, file: !4, line: 124, baseType: !167, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !225, file: !4, line: 124, baseType: !167, size: 32, align: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !225, file: !4, line: 124, baseType: !167, size: 32, align: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !161, file: !4, line: 125, baseType: !231, size: 192, align: 32)
!231 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 125, size: 192, align: 32, elements: !232)
!232 = !{!233, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !231, file: !4, line: 125, baseType: !234, size: 96, align: 32)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 96, align: 32, elements: !111)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !231, file: !4, line: 125, baseType: !234, size: 96, align: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !161, file: !4, line: 126, baseType: !237, size: 192, align: 32)
!237 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 126, size: 192, align: 32, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !237, file: !4, line: 126, baseType: !240, size: 192, align: 32)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 192, align: 32, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 6)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !161, file: !4, line: 127, baseType: !244, size: 192, align: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 127, size: 192, align: 32, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !244, file: !4, line: 127, baseType: !167, size: 32, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !244, file: !4, line: 127, baseType: !167, size: 32, align: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !244, file: !4, line: 127, baseType: !167, size: 32, align: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !244, file: !4, line: 127, baseType: !167, size: 32, align: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !244, file: !4, line: 127, baseType: !167, size: 32, align: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !244, file: !4, line: 127, baseType: !167, size: 32, align: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !161, file: !4, line: 128, baseType: !253, size: 192, align: 32)
!253 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 128, size: 192, align: 32, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !253, file: !4, line: 128, baseType: !167, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !253, file: !4, line: 128, baseType: !167, size: 32, align: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !253, file: !4, line: 128, baseType: !167, size: 32, align: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !253, file: !4, line: 128, baseType: !167, size: 32, align: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !4, line: 128, baseType: !58, size: 32, align: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !253, file: !4, line: 128, baseType: !58, size: 32, align: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !161, file: !4, line: 129, baseType: !262, size: 192, align: 32)
!262 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 129, size: 192, align: 32, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !262, file: !4, line: 129, baseType: !58, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !262, file: !4, line: 129, baseType: !58, size: 32, align: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !262, file: !4, line: 129, baseType: !58, size: 32, align: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !262, file: !4, line: 129, baseType: !167, size: 32, align: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !262, file: !4, line: 129, baseType: !167, size: 32, align: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !262, file: !4, line: 129, baseType: !167, size: 32, align: 32, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !161, file: !4, line: 130, baseType: !271, size: 192, align: 32)
!271 = !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 130, size: 192, align: 32, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !271, file: !4, line: 130, baseType: !240, size: 192, align: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !150, file: !4, line: 187, baseType: !275, size: 366080, align: 64, offset: 256)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 366080, align: 64, elements: !288)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !4, line: 140, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 135, size: 8320, align: 64, elements: !278)
!278 = !{!279, !280, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !277, file: !4, line: 137, baseType: !58, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !277, file: !4, line: 138, baseType: !281, size: 8192, align: 32, offset: 32)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8192, align: 32, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !277, file: !4, line: 139, baseType: !285, size: 64, align: 64, offset: 8256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !4, line: 45, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !168, line: 73, baseType: !58)
!288 = !{!289}
!289 = !DISubrange(count: 44)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !292, line: 40, baseType: !293)
!292 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!293 = !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 36, size: 192, align: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !293, file: !292, line: 37, baseType: !58, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !293, file: !292, line: 37, baseType: !58, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !293, file: !292, line: 38, baseType: !58, size: 32, align: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !293, file: !292, line: 38, baseType: !58, size: 32, align: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !293, file: !292, line: 39, baseType: !58, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !293, file: !292, line: 39, baseType: !58, size: 32, align: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !303, line: 59, baseType: !304)
!303 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!304 = !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 36, size: 32992, align: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !304, file: !303, line: 37, baseType: !58, size: 32, align: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !304, file: !303, line: 38, baseType: !58, size: 32, align: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !304, file: !303, line: 39, baseType: !58, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !304, file: !303, line: 40, baseType: !58, size: 32, align: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !304, file: !303, line: 41, baseType: !58, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !304, file: !303, line: 43, baseType: !58, size: 32, align: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !304, file: !303, line: 43, baseType: !58, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !304, file: !303, line: 50, baseType: !281, size: 8192, align: 32, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !304, file: !303, line: 51, baseType: !281, size: 8192, align: 32, offset: 8416)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !304, file: !303, line: 52, baseType: !281, size: 8192, align: 32, offset: 16608)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !304, file: !303, line: 55, baseType: !281, size: 8192, align: 32, offset: 24800)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_comm_dummies", file: !319, line: 53, baseType: !320)
!319 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/dummies.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!320 = !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 44, size: 384, align: 64, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nprevdum", scope: !320, file: !319, line: 45, baseType: !58, size: 32, align: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nnextdum", scope: !320, file: !319, line: 46, baseType: !58, size: 32, align: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "idxprevdum", scope: !320, file: !319, line: 47, baseType: !132, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "idxnextdum", scope: !320, file: !319, line: 48, baseType: !132, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "nprevconstr", scope: !320, file: !319, line: 49, baseType: !58, size: 32, align: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nnextconstr", scope: !320, file: !319, line: 50, baseType: !58, size: 32, align: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "idxprevconstr", scope: !320, file: !319, line: 51, baseType: !132, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "idxnextconstr", scope: !320, file: !319, line: 52, baseType: !132, size: 64, align: 64, offset: 320)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 1, scope: !145, file: !1, line: 76, type: !148)
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !145, file: !1, line: 76, type: !290)
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 3, scope: !145, file: !1, line: 76, type: !301)
!334 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummycomm", arg: 4, scope: !145, file: !1, line: 77, type: !317)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !145, file: !1, line: 79, type: !58)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inr", scope: !145, file: !1, line: 79, type: !58)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !145, file: !1, line: 79, type: !58)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !145, file: !1, line: 79, type: !58)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftype", scope: !145, file: !1, line: 79, type: !58)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minidx", scope: !145, file: !1, line: 80, type: !58)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minhome", scope: !145, file: !1, line: 80, type: !58)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ihome", scope: !145, file: !1, line: 80, type: !58)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !145, file: !1, line: 81, type: !58)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrd", scope: !145, file: !1, line: 81, type: !58)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nconstr", scope: !145, file: !1, line: 81, type: !58)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !145, file: !1, line: 82, type: !58)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ia", scope: !145, file: !1, line: 83, type: !285)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idxprevdum", scope: !145, file: !1, line: 84, type: !132)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idxnextdum", scope: !145, file: !1, line: 85, type: !132)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idxprevconstr", scope: !145, file: !1, line: 86, type: !132)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idxnextconstr", scope: !145, file: !1, line: 87, type: !132)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nprevdum", scope: !145, file: !1, line: 88, type: !58)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nnextdum", scope: !145, file: !1, line: 88, type: !58)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nprevconstr", scope: !145, file: !1, line: 89, type: !58)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nnextconstr", scope: !145, file: !1, line: 89, type: !58)
!356 = !DISubprogram(name: "mdsplit_top", scope: !1, file: !1, line: 243, type: !357, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_topology*, %struct.t_commrec*, %struct.t_nsborder*, i32*, %struct.t_comm_dummies*)* @mdsplit_top, variables: !450)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !59, !359, !290, !301, !132, !317}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !361, line: 42, baseType: !362)
!361 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!362 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 36, size: 402112, align: 64, elements: !363)
!363 = !{!364, !366, !367, !433, !435}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !361, line: 37, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !362, file: !361, line: 38, baseType: !149, size: 366336, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !362, file: !361, line: 39, baseType: !368, size: 10240, align: 64, offset: 366400)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !369, line: 94, baseType: !370)
!369 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 75, size: 10240, align: 64, elements: !371)
!371 = !{!372, !373, !392, !394, !395, !396, !397, !398, !399, !400, !411, !418}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !370, file: !369, line: 76, baseType: !58, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !370, file: !369, line: 77, baseType: !374, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !369, line: 57, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 48, size: 320, align: 32, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !384, !385, !386, !387, !391}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !376, file: !369, line: 49, baseType: !167, size: 32, align: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !376, file: !369, line: 49, baseType: !167, size: 32, align: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !376, file: !369, line: 50, baseType: !167, size: 32, align: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !376, file: !369, line: 50, baseType: !167, size: 32, align: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !369, line: 51, baseType: !383, size: 16, align: 16, offset: 128)
!383 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !376, file: !369, line: 52, baseType: !383, size: 16, align: 16, offset: 144)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !376, file: !369, line: 53, baseType: !58, size: 32, align: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !376, file: !369, line: 54, baseType: !58, size: 32, align: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !376, file: !369, line: 55, baseType: !388, size: 72, align: 8, offset: 224)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 72, align: 8, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 9)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !376, file: !369, line: 56, baseType: !65, size: 8, align: 8, offset: 296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !370, file: !369, line: 80, baseType: !393, size: 64, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !370, file: !369, line: 82, baseType: !393, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !370, file: !369, line: 84, baseType: !393, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !370, file: !369, line: 86, baseType: !58, size: 32, align: 32, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !370, file: !369, line: 87, baseType: !393, size: 64, align: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !370, file: !369, line: 89, baseType: !58, size: 32, align: 32, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !370, file: !369, line: 90, baseType: !393, size: 64, align: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !370, file: !369, line: 91, baseType: !401, size: 8448, align: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !402, line: 52, baseType: !403)
!402 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!403 = !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 36, size: 8448, align: 64, elements: !404)
!404 = !{!405, !406, !407, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !403, file: !402, line: 37, baseType: !281, size: 8192, align: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !403, file: !402, line: 43, baseType: !58, size: 32, align: 32, offset: 8192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !403, file: !402, line: 44, baseType: !408, size: 64, align: 64, offset: 8256)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !403, file: !402, line: 45, baseType: !58, size: 32, align: 32, offset: 8320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !403, file: !402, line: 46, baseType: !408, size: 64, align: 64, offset: 8384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !370, file: !369, line: 92, baseType: !412, size: 1152, align: 64, offset: 9024)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 1152, align: 64, elements: !389)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !369, line: 73, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 70, size: 128, align: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !414, file: !369, line: 71, baseType: !58, size: 32, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !414, file: !369, line: 72, baseType: !132, size: 64, align: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !370, file: !369, line: 93, baseType: !419, size: 64, align: 64, offset: 10176)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !369, line: 68, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 59, size: 416, align: 32, elements: !422)
!422 = !{!423, !424, !425, !426, !428, !429, !430, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !421, file: !369, line: 60, baseType: !58, size: 32, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !421, file: !369, line: 61, baseType: !58, size: 32, align: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !421, file: !369, line: 62, baseType: !52, size: 8, align: 8, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !421, file: !369, line: 63, baseType: !427, size: 48, align: 8, offset: 72)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, align: 8, elements: !241)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !421, file: !369, line: 64, baseType: !167, size: 32, align: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !421, file: !369, line: 65, baseType: !167, size: 32, align: 32, offset: 160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !421, file: !369, line: 66, baseType: !58, size: 32, align: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !421, file: !369, line: 67, baseType: !432, size: 192, align: 32, offset: 224)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, align: 32, elements: !241)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !362, file: !361, line: 40, baseType: !434, size: 25344, align: 64, offset: 376640)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 25344, align: 64, elements: !111)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !362, file: !361, line: 41, baseType: !436, size: 128, align: 64, offset: 401984)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !437, line: 46, baseType: !438)
!437 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!438 = !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 42, size: 128, align: 64, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !438, file: !437, line: 44, baseType: !58, size: 32, align: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !438, file: !437, line: 45, baseType: !442, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !437, line: 40, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !437, line: 36, size: 192, align: 64, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !444, file: !437, line: 37, baseType: !58, size: 32, align: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !444, file: !437, line: 38, baseType: !365, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !437, line: 39, baseType: !449, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!450 = !{!451, !452, !453, !454, !455, !456}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !356, file: !1, line: 243, type: !59)
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 2, scope: !356, file: !1, line: 243, type: !359)
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !356, file: !1, line: 243, type: !290)
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 4, scope: !356, file: !1, line: 244, type: !301)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bParallelDummies", arg: 5, scope: !356, file: !1, line: 244, type: !132)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummycomm", arg: 6, scope: !356, file: !1, line: 245, type: !317)
!457 = !DISubprogram(name: "split_idef", scope: !1, file: !1, line: 235, type: !458, isLocal: true, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, variables: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !59, !148, !290}
!460 = !{!461, !462, !463, !464}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !457, file: !1, line: 235, type: !59)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 2, scope: !457, file: !1, line: 235, type: !148)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !457, file: !1, line: 235, type: !290)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !457, file: !1, line: 237, type: !58)
!465 = !DISubprogram(name: "split_ilist", scope: !1, file: !1, line: 205, type: !466, isLocal: true, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, variables: !469)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !59, !468, !290}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !465, file: !1, line: 205, type: !59)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "il", arg: 2, scope: !465, file: !1, line: 205, type: !468)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !465, file: !1, line: 205, type: !290)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ia", scope: !465, file: !1, line: 207, type: !285)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !465, file: !1, line: 208, type: !58)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !465, file: !1, line: 208, type: !58)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !465, file: !1, line: 208, type: !58)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !465, file: !1, line: 208, type: !58)
!478 = !{}
!479 = !{i32 2, !"Dwarf Version", i32 2}
!480 = !{i32 2, !"Debug Info Version", i32 700000003}
!481 = !{i32 1, !"PIC Level", i32 2}
!482 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!483 = !DIExpression()
!484 = !DILocation(line: 348, column: 40, scope: !54)
!485 = !DILocation(line: 348, column: 50, scope: !54)
!486 = !DILocation(line: 349, column: 12, scope: !487)
!487 = distinct !DILexicalBlock(scope: !54, file: !55, line: 349, column: 6)
!488 = !DILocation(line: 349, column: 6, scope: !487)
!489 = !{!490, !494, i64 12}
!490 = !{!"__sFILE", !491, i64 0, !494, i64 8, !494, i64 12, !495, i64 16, !495, i64 18, !496, i64 24, !494, i64 40, !491, i64 48, !491, i64 56, !491, i64 64, !491, i64 72, !491, i64 80, !496, i64 88, !491, i64 104, !494, i64 112, !492, i64 116, !492, i64 119, !496, i64 120, !494, i64 136, !497, i64 144}
!491 = !{!"any pointer", !492, i64 0}
!492 = !{!"omnipotent char", !493, i64 0}
!493 = !{!"Simple C/C++ TBAA"}
