; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/statutil.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_pargs = type { i8*, i32, i32, %union.anon.18, i8* }
%union.anon.18 = type { i8* }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_topology = type { i8**, %struct.t_idef, %struct.t_atoms, [3 x %struct.t_block], %struct.t_symtab }
%struct.t_idef = type { i32, i32, i32, i32*, %union.t_iparams*, [44 x %struct.t_ilist] }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }

!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !129, file: !81, line: 261, type: !72)
!132 = !DISubprogram(name: "isspace", scope: !81, file: !81, line: 267, type: !82, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isspace, variables: !133)
!133 = !{!134}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !132, file: !81, line: 267, type: !72)
!135 = !DISubprogram(name: "isupper", scope: !81, file: !81, line: 273, type: !82, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isupper, variables: !136)
!136 = !{!137}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !135, file: !81, line: 273, type: !72)
!138 = !DISubprogram(name: "isxdigit", scope: !81, file: !81, line: 280, type: !82, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isxdigit, variables: !139)
!139 = !{!140}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !138, file: !81, line: 280, type: !72)
!141 = !DISubprogram(name: "toascii", scope: !81, file: !81, line: 286, type: !82, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @toascii, variables: !142)
!142 = !{!143}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !141, file: !81, line: 286, type: !72)
!144 = !DISubprogram(name: "tolower", scope: !81, file: !81, line: 292, type: !82, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @tolower, variables: !145)
!145 = !{!146}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !144, file: !81, line: 292, type: !72)
!147 = !DISubprogram(name: "toupper", scope: !81, file: !81, line: 298, type: !82, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @toupper, variables: !148)
!148 = !{!149}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !147, file: !81, line: 298, type: !72)
!150 = !DISubprogram(name: "digittoint", scope: !81, file: !81, line: 305, type: !82, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @digittoint, variables: !151)
!151 = !{!152}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !150, file: !81, line: 305, type: !72)
!153 = !DISubprogram(name: "ishexnumber", scope: !81, file: !81, line: 311, type: !82, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @ishexnumber, variables: !154)
!154 = !{!155}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !153, file: !81, line: 311, type: !72)
!156 = !DISubprogram(name: "isideogram", scope: !81, file: !81, line: 317, type: !82, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isideogram, variables: !157)
!157 = !{!158}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !156, file: !81, line: 317, type: !72)
!159 = !DISubprogram(name: "isnumber", scope: !81, file: !81, line: 323, type: !82, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isnumber, variables: !160)
!160 = !{!161}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !159, file: !81, line: 323, type: !72)
!162 = !DISubprogram(name: "isphonogram", scope: !81, file: !81, line: 329, type: !82, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isphonogram, variables: !163)
!163 = !{!164}
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !162, file: !81, line: 329, type: !72)
!165 = !DISubprogram(name: "isrune", scope: !81, file: !81, line: 335, type: !82, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isrune, variables: !166)
!166 = !{!167}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !165, file: !81, line: 335, type: !72)
!168 = !DISubprogram(name: "isspecial", scope: !81, file: !81, line: 341, type: !82, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isspecial, variables: !169)
!169 = !{!170}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !168, file: !81, line: 341, type: !72)
!171 = !DISubprogram(name: "__sputc", scope: !172, file: !172, line: 348, type: !173, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !234)
!172 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!173 = !DISubroutineType(types: !174)
!174 = !{!72, !72, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !172, line: 153, baseType: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !172, line: 122, size: 1216, align: 64, elements: !178)
!178 = !{!179, !182, !183, !184, !186, !187, !192, !193, !194, !198, !203, !212, !218, !219, !222, !223, !227, !231, !232, !233}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !177, file: !172, line: 123, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !177, file: !172, line: 124, baseType: !72, size: 32, align: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !177, file: !172, line: 125, baseType: !72, size: 32, align: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !172, line: 126, baseType: !185, size: 16, align: 16, offset: 128)
!185 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !177, file: !172, line: 127, baseType: !185, size: 16, align: 16, offset: 144)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !177, file: !172, line: 128, baseType: !188, size: 128, align: 64, offset: 192)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !172, line: 88, size: 128, align: 64, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !188, file: !172, line: 89, baseType: !180, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !188, file: !172, line: 90, baseType: !72, size: 32, align: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !177, file: !172, line: 129, baseType: !72, size: 32, align: 32, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !177, file: !172, line: 132, baseType: !73, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !177, file: !172, line: 133, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!72, !73}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !177, file: !172, line: 134, baseType: !199, size: 64, align: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!72, !73, !202, !72}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !177, file: !172, line: 135, baseType: !204, size: 64, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !73, !207, !72}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !172, line: 77, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !209, line: 71, baseType: !210)
!209 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !77, line: 46, baseType: !211)
!211 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !177, file: !172, line: 136, baseType: !213, size: 64, align: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!72, !73, !216, !72}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !177, file: !172, line: 139, baseType: !188, size: 128, align: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !177, file: !172, line: 140, baseType: !220, size: 64, align: 64, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !172, line: 94, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !177, file: !172, line: 141, baseType: !72, size: 32, align: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !177, file: !172, line: 144, baseType: !224, size: 24, align: 8, offset: 928)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 24, align: 8, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 3)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !177, file: !172, line: 145, baseType: !228, size: 8, align: 8, offset: 952)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 8, align: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 1)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !177, file: !172, line: 148, baseType: !188, size: 128, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !177, file: !172, line: 151, baseType: !72, size: 32, align: 32, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !172, line: 152, baseType: !207, size: 64, align: 64, offset: 1152)
!234 = !{!235, !236}
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !171, file: !172, line: 348, type: !72)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !171, file: !172, line: 348, type: !175)
!237 = !DISubprogram(name: "__sigbits", scope: !238, file: !238, line: 114, type: !82, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !239)
!238 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!239 = !{!240}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !237, file: !238, line: 114, type: !72)
!241 = !DISubprogram(name: "__inline_isfinitef", scope: !242, file: !242, line: 204, type: !243, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !246)
!242 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!243 = !DISubroutineType(types: !244)
!244 = !{!72, !245}
!245 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!246 = !{!247}
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !241, file: !242, line: 204, type: !245)
!248 = !DISubprogram(name: "__inline_isfinited", scope: !242, file: !242, line: 207, type: !249, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !252)
!249 = !DISubroutineType(types: !250)
!250 = !{!72, !251}
!251 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!252 = !{!253}
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !248, file: !242, line: 207, type: !251)
!254 = !DISubprogram(name: "__inline_isfinitel", scope: !242, file: !242, line: 210, type: !255, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !258)
!255 = !DISubroutineType(types: !256)
!256 = !{!72, !257}
!257 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!258 = !{!259}
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !254, file: !242, line: 210, type: !257)
!260 = !DISubprogram(name: "__inline_isinff", scope: !242, file: !242, line: 213, type: !243, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !261)
!261 = !{!262}
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !260, file: !242, line: 213, type: !245)
!263 = !DISubprogram(name: "__inline_isinfd", scope: !242, file: !242, line: 216, type: !249, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !264)
!264 = !{!265}
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !263, file: !242, line: 216, type: !251)
!266 = !DISubprogram(name: "__inline_isinfl", scope: !242, file: !242, line: 219, type: !255, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !267)
!267 = !{!268}
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !266, file: !242, line: 219, type: !257)
!269 = !DISubprogram(name: "__inline_isnanf", scope: !242, file: !242, line: 222, type: !243, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !270)
!270 = !{!271}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !269, file: !242, line: 222, type: !245)
!272 = !DISubprogram(name: "__inline_isnand", scope: !242, file: !242, line: 225, type: !249, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !273)
!273 = !{!274}
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !272, file: !242, line: 225, type: !251)
!275 = !DISubprogram(name: "__inline_isnanl", scope: !242, file: !242, line: 228, type: !255, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !276)
!276 = !{!277}
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !275, file: !242, line: 228, type: !257)
!278 = !DISubprogram(name: "__inline_signbitf", scope: !242, file: !242, line: 231, type: !243, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !279)
!279 = !{!280, !281}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !278, file: !242, line: 231, type: !245)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !278, file: !242, line: 232, type: !282)
!282 = !DICompositeType(tag: DW_TAG_union_type, scope: !278, file: !242, line: 232, size: 32, align: 32, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !282, file: !242, line: 232, baseType: !245, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !282, file: !242, line: 232, baseType: !70, size: 32, align: 32)
!286 = !DISubprogram(name: "__inline_signbitd", scope: !242, file: !242, line: 236, type: !249, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !287)
!287 = !{!288, !289}
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !286, file: !242, line: 236, type: !251)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !286, file: !242, line: 237, type: !290)
!290 = !DICompositeType(tag: DW_TAG_union_type, scope: !286, file: !242, line: 237, size: 64, align: 64, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !290, file: !242, line: 237, baseType: !251, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !290, file: !242, line: 237, baseType: !294, size: 64, align: 64)
!294 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!295 = !DISubprogram(name: "__inline_signbitl", scope: !242, file: !242, line: 242, type: !255, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !296)
!296 = !{!297, !298}
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !295, file: !242, line: 242, type: !257)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !295, file: !242, line: 246, type: !299)
!299 = !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !242, line: 243, size: 128, align: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !299, file: !242, line: 244, baseType: !257, size: 128, align: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !299, file: !242, line: 245, baseType: !303, size: 128, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !242, line: 245, size: 128, align: 64, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !303, file: !242, line: 245, baseType: !294, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !303, file: !242, line: 245, baseType: !307, size: 16, align: 16, offset: 64)
!307 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!308 = !DISubprogram(name: "__inline_isnormalf", scope: !242, file: !242, line: 257, type: !243, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !309)
!309 = !{!310}
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !308, file: !242, line: 257, type: !245)
!311 = !DISubprogram(name: "__inline_isnormald", scope: !242, file: !242, line: 260, type: !249, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !312)
!312 = !{!313}
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !311, file: !242, line: 260, type: !251)
!314 = !DISubprogram(name: "__inline_isnormall", scope: !242, file: !242, line: 263, type: !255, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !315)
!315 = !{!316}
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !314, file: !242, line: 263, type: !257)
!317 = !DISubprogram(name: "__sincosf", scope: !242, file: !242, line: 642, type: !318, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !321)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !245, !320, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!321 = !{!322, !323, !324, !325}
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !317, file: !242, line: 642, type: !245)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !317, file: !242, line: 642, type: !320)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !317, file: !242, line: 642, type: !320)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !317, file: !242, line: 643, type: !326)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !242, line: 634, size: 64, align: 32, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !327, file: !242, line: 634, baseType: !245, size: 32, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !327, file: !242, line: 634, baseType: !245, size: 32, align: 32, offset: 32)
!331 = !DISubprogram(name: "__sincos", scope: !242, file: !242, line: 647, type: !332, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !335)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !251, !334, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!335 = !{!336, !337, !338, !339}
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !331, file: !242, line: 647, type: !251)
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !331, file: !242, line: 647, type: !334)
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !331, file: !242, line: 647, type: !334)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !331, file: !242, line: 648, type: !340)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !242, line: 635, size: 128, align: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !341, file: !242, line: 635, baseType: !251, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !341, file: !242, line: 635, baseType: !251, size: 64, align: 64, offset: 64)
!345 = !DISubprogram(name: "__sincospif", scope: !242, file: !242, line: 652, type: !318, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !345, file: !242, line: 652, type: !245)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !345, file: !242, line: 652, type: !320)
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !345, file: !242, line: 652, type: !320)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !345, file: !242, line: 653, type: !326)
!351 = !DISubprogram(name: "__sincospi", scope: !242, file: !242, line: 657, type: !332, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !352)
!352 = !{!353, !354, !355, !356}
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !351, file: !242, line: 657, type: !251)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !351, file: !242, line: 657, type: !334)
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !351, file: !242, line: 657, type: !334)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !351, file: !242, line: 658, type: !340)
!357 = !DISubprogram(name: "ShortProgram", scope: !1, file: !1, line: 84, type: !358, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @ShortProgram, variables: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{!202}
!360 = !{!361}
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pr", scope: !357, file: !1, line: 86, type: !202)
!362 = !DISubprogram(name: "Program", scope: !1, file: !1, line: 98, type: !358, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @Program, variables: !363)
!363 = !{}
!364 = !DISubprogram(name: "set_program_name", scope: !1, file: !1, line: 106, type: !365, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @set_program_name, variables: !367)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !202}
!367 = !{!368}
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argvzero", arg: 1, scope: !364, file: !1, line: 106, type: !202)
!369 = !DISubprogram(name: "bRmod", scope: !1, file: !1, line: 126, type: !370, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, double)* @bRmod, variables: !372)
!370 = !DISubroutineType(types: !371)
!371 = !{!72, !251, !251}
!372 = !{!373, !374, !375, !376}
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !369, file: !1, line: 126, type: !251)
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !369, file: !1, line: 126, type: !251)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iq", scope: !369, file: !1, line: 128, type: !72)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tol", scope: !369, file: !1, line: 129, type: !251)
!377 = !DISubprogram(name: "check_times2", scope: !1, file: !1, line: 141, type: !378, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float, float, float, float)* @check_times2, variables: !382)
!378 = !DISubroutineType(types: !379)
!379 = !{!72, !380, !380, !380, !380}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !381, line: 87, baseType: !245)
!381 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!382 = !{!383, !384, !385, !386, !387, !388}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 1, scope: !377, file: !1, line: 141, type: !380)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t0", arg: 2, scope: !377, file: !1, line: 141, type: !380)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 3, scope: !377, file: !1, line: 141, type: !380)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tpp", arg: 4, scope: !377, file: !1, line: 141, type: !380)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !377, file: !1, line: 143, type: !72)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "margin", scope: !377, file: !1, line: 144, type: !380)
!389 = !DISubprogram(name: "check_times", scope: !1, file: !1, line: 166, type: !390, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @check_times, variables: !392)
!390 = !DISubroutineType(types: !391)
!391 = !{!72, !380}
!392 = !{!393}
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 1, scope: !389, file: !1, line: 166, type: !380)
!394 = !DISubprogram(name: "time_unit", scope: !1, file: !1, line: 171, type: !358, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @time_unit, variables: !363)
!395 = !DISubprogram(name: "time_label", scope: !1, file: !1, line: 176, type: !358, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @time_label, variables: !363)
!396 = !DISubprogram(name: "xvgr_tlabel", scope: !1, file: !1, line: 185, type: !358, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @xvgr_tlabel, variables: !363)
!397 = !DISubprogram(name: "time_factor", scope: !1, file: !1, line: 201, type: !398, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: float ()* @time_factor, variables: !363)
!398 = !DISubroutineType(types: !399)
!399 = !{!380}
!400 = !DISubprogram(name: "convert_time", scope: !1, file: !1, line: 208, type: !401, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, function: float (float)* @convert_time, variables: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{!380, !380}
!403 = !{!404}
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 1, scope: !400, file: !1, line: 208, type: !380)
!405 = !DISubprogram(name: "convert_times", scope: !1, file: !1, line: 216, type: !406, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, float*)* @convert_times, variables: !409)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !72, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!409 = !{!410, !411, !412}
!410 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !405, file: !1, line: 216, type: !72)
!411 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 2, scope: !405, file: !1, line: 216, type: !408)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !405, file: !1, line: 218, type: !72)
!413 = !DISubprogram(name: "default_time", scope: !1, file: !1, line: 227, type: !414, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @default_time, variables: !363)
!414 = !DISubroutineType(types: !415)
!415 = !{null}
!416 = !DISubprogram(name: "read_top", scope: !1, file: !1, line: 258, type: !417, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_topology* (i8*)* @read_top, variables: !648)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !202}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !421, line: 42, baseType: !422)
!421 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!422 = !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 36, size: 402112, align: 64, elements: !423)
!423 = !{!424, !426, !565, !631, !633}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !421, line: 37, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !422, file: !421, line: 38, baseType: !427, size: 366336, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !11, line: 188, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 179, size: 366336, align: 64, elements: !429)
!429 = !{!430, !431, !432, !433, !436, !549}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !428, file: !11, line: 181, baseType: !72, size: 32, align: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !428, file: !11, line: 182, baseType: !72, size: 32, align: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !428, file: !11, line: 183, baseType: !72, size: 32, align: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !428, file: !11, line: 184, baseType: !434, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !11, line: 133, baseType: !72)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !428, file: !11, line: 185, baseType: !437, size: 64, align: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !11, line: 131, baseType: !439)
!439 = !DICompositeType(tag: DW_TAG_union_type, file: !11, line: 97, size: 192, align: 32, elements: !440)
!440 = !{!441, !447, !454, !460, !469, !474, !481, !489, !494, !499, !505, !511, !518, !527, !536, !545}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !439, file: !11, line: 105, baseType: !442, size: 96, align: 32)
!442 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 105, size: 96, align: 32, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !442, file: !11, line: 105, baseType: !380, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !442, file: !11, line: 105, baseType: !380, size: 32, align: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !442, file: !11, line: 105, baseType: !380, size: 32, align: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !439, file: !11, line: 106, baseType: !448, size: 128, align: 32)
!448 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 106, size: 128, align: 32, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !448, file: !11, line: 106, baseType: !380, size: 32, align: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !448, file: !11, line: 106, baseType: !380, size: 32, align: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !448, file: !11, line: 106, baseType: !380, size: 32, align: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !448, file: !11, line: 106, baseType: !380, size: 32, align: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !439, file: !11, line: 108, baseType: !455, size: 96, align: 32)
!455 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 108, size: 96, align: 32, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !455, file: !11, line: 108, baseType: !380, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !455, file: !11, line: 108, baseType: !380, size: 32, align: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !455, file: !11, line: 108, baseType: !380, size: 32, align: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !439, file: !11, line: 110, baseType: !461, size: 192, align: 32)
!461 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 110, size: 192, align: 32, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !461, file: !11, line: 110, baseType: !380, size: 32, align: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !461, file: !11, line: 110, baseType: !380, size: 32, align: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !461, file: !11, line: 110, baseType: !380, size: 32, align: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !461, file: !11, line: 110, baseType: !380, size: 32, align: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !461, file: !11, line: 110, baseType: !380, size: 32, align: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !461, file: !11, line: 110, baseType: !380, size: 32, align: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !439, file: !11, line: 111, baseType: !470, size: 64, align: 32)
!470 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 111, size: 64, align: 32, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !470, file: !11, line: 111, baseType: !380, size: 32, align: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !470, file: !11, line: 111, baseType: !380, size: 32, align: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !439, file: !11, line: 112, baseType: !475, size: 128, align: 32)
!475 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 112, size: 128, align: 32, elements: !476)
!476 = !{!477, !478, !479, !480}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !475, file: !11, line: 112, baseType: !380, size: 32, align: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !475, file: !11, line: 112, baseType: !380, size: 32, align: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !475, file: !11, line: 112, baseType: !380, size: 32, align: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !475, file: !11, line: 112, baseType: !380, size: 32, align: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !439, file: !11, line: 117, baseType: !482, size: 160, align: 32)
!482 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 117, size: 160, align: 32, elements: !483)
!483 = !{!484, !485, !486, !487, !488}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !482, file: !11, line: 117, baseType: !380, size: 32, align: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !482, file: !11, line: 117, baseType: !380, size: 32, align: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !482, file: !11, line: 117, baseType: !72, size: 32, align: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !482, file: !11, line: 117, baseType: !380, size: 32, align: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !482, file: !11, line: 117, baseType: !380, size: 32, align: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !439, file: !11, line: 118, baseType: !490, size: 64, align: 32)
!490 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 118, size: 64, align: 32, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !490, file: !11, line: 118, baseType: !380, size: 32, align: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !490, file: !11, line: 118, baseType: !380, size: 32, align: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !439, file: !11, line: 123, baseType: !495, size: 64, align: 32)
!495 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 123, size: 64, align: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !495, file: !11, line: 123, baseType: !380, size: 32, align: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !495, file: !11, line: 123, baseType: !380, size: 32, align: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !439, file: !11, line: 124, baseType: !500, size: 96, align: 32)
!500 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 124, size: 96, align: 32, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !500, file: !11, line: 124, baseType: !380, size: 32, align: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !500, file: !11, line: 124, baseType: !380, size: 32, align: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !500, file: !11, line: 124, baseType: !380, size: 32, align: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !439, file: !11, line: 125, baseType: !506, size: 192, align: 32)
!506 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 125, size: 192, align: 32, elements: !507)
!507 = !{!508, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !506, file: !11, line: 125, baseType: !509, size: 96, align: 32)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 96, align: 32, elements: !225)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !506, file: !11, line: 125, baseType: !509, size: 96, align: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !439, file: !11, line: 126, baseType: !512, size: 192, align: 32)
!512 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 126, size: 192, align: 32, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !512, file: !11, line: 126, baseType: !515, size: 192, align: 32)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 192, align: 32, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 6)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !439, file: !11, line: 127, baseType: !519, size: 192, align: 32)
!519 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 127, size: 192, align: 32, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !519, file: !11, line: 127, baseType: !380, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !519, file: !11, line: 127, baseType: !380, size: 32, align: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !519, file: !11, line: 127, baseType: !380, size: 32, align: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !519, file: !11, line: 127, baseType: !380, size: 32, align: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !519, file: !11, line: 127, baseType: !380, size: 32, align: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !519, file: !11, line: 127, baseType: !380, size: 32, align: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !439, file: !11, line: 128, baseType: !528, size: 192, align: 32)
!528 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 128, size: 192, align: 32, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !528, file: !11, line: 128, baseType: !380, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !528, file: !11, line: 128, baseType: !380, size: 32, align: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !528, file: !11, line: 128, baseType: !380, size: 32, align: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !528, file: !11, line: 128, baseType: !380, size: 32, align: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !11, line: 128, baseType: !72, size: 32, align: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !528, file: !11, line: 128, baseType: !72, size: 32, align: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !439, file: !11, line: 129, baseType: !537, size: 192, align: 32)
!537 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 129, size: 192, align: 32, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !537, file: !11, line: 129, baseType: !72, size: 32, align: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !537, file: !11, line: 129, baseType: !72, size: 32, align: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !537, file: !11, line: 129, baseType: !72, size: 32, align: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !537, file: !11, line: 129, baseType: !380, size: 32, align: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !537, file: !11, line: 129, baseType: !380, size: 32, align: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !537, file: !11, line: 129, baseType: !380, size: 32, align: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !439, file: !11, line: 130, baseType: !546, size: 192, align: 32)
!546 = !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !11, line: 130, size: 192, align: 32, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !546, file: !11, line: 130, baseType: !515, size: 192, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !428, file: !11, line: 187, baseType: !550, size: 366080, align: 64, offset: 256)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 366080, align: 64, elements: !563)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !11, line: 140, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 135, size: 8320, align: 64, elements: !553)
!553 = !{!554, !555, !559}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !552, file: !11, line: 137, baseType: !72, size: 32, align: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !552, file: !11, line: 138, baseType: !556, size: 8192, align: 32, offset: 32)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 8192, align: 32, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !552, file: !11, line: 139, baseType: !560, size: 64, align: 64, offset: 8256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !11, line: 45, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !381, line: 73, baseType: !72)
!563 = !{!564}
!564 = !DISubrange(count: 44)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !422, file: !421, line: 39, baseType: !566, size: 10240, align: 64, offset: 366400)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !567, line: 94, baseType: !568)
!567 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!568 = !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 75, size: 10240, align: 64, elements: !569)
!569 = !{!570, !571, !589, !591, !592, !593, !594, !595, !596, !597, !608, !616}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !568, file: !567, line: 76, baseType: !72, size: 32, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !568, file: !567, line: 77, baseType: !572, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !567, line: 57, baseType: !574)
!574 = !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 48, size: 320, align: 32, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !588}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !574, file: !567, line: 49, baseType: !380, size: 32, align: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !574, file: !567, line: 49, baseType: !380, size: 32, align: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !574, file: !567, line: 50, baseType: !380, size: 32, align: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !574, file: !567, line: 50, baseType: !380, size: 32, align: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !567, line: 51, baseType: !307, size: 16, align: 16, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !574, file: !567, line: 52, baseType: !307, size: 16, align: 16, offset: 144)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !574, file: !567, line: 53, baseType: !72, size: 32, align: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !574, file: !567, line: 54, baseType: !72, size: 32, align: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !574, file: !567, line: 55, baseType: !585, size: 72, align: 8, offset: 224)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 72, align: 8, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 9)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !574, file: !567, line: 56, baseType: !181, size: 8, align: 8, offset: 296)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !568, file: !567, line: 80, baseType: !590, size: 64, align: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !568, file: !567, line: 82, baseType: !590, size: 64, align: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !568, file: !567, line: 84, baseType: !590, size: 64, align: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !568, file: !567, line: 86, baseType: !72, size: 32, align: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !568, file: !567, line: 87, baseType: !590, size: 64, align: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !568, file: !567, line: 89, baseType: !72, size: 32, align: 32, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !568, file: !567, line: 90, baseType: !590, size: 64, align: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !568, file: !567, line: 91, baseType: !598, size: 8448, align: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !599, line: 52, baseType: !600)
!599 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!600 = !DICompositeType(tag: DW_TAG_structure_type, file: !599, line: 36, size: 8448, align: 64, elements: !601)
!601 = !{!602, !603, !604, !606, !607}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !600, file: !599, line: 37, baseType: !556, size: 8192, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !600, file: !599, line: 43, baseType: !72, size: 32, align: 32, offset: 8192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !600, file: !599, line: 44, baseType: !605, size: 64, align: 64, offset: 8256)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !600, file: !599, line: 45, baseType: !72, size: 32, align: 32, offset: 8320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !600, file: !599, line: 46, baseType: !605, size: 64, align: 64, offset: 8384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !568, file: !567, line: 92, baseType: !609, size: 1152, align: 64, offset: 9024)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 1152, align: 64, elements: !586)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !567, line: 73, baseType: !611)
!611 = !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 70, size: 128, align: 64, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !611, file: !567, line: 71, baseType: !72, size: 32, align: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !611, file: !567, line: 72, baseType: !615, size: 64, align: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !568, file: !567, line: 93, baseType: !617, size: 64, align: 64, offset: 10176)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !567, line: 68, baseType: !619)
!619 = !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 59, size: 416, align: 32, elements: !620)
!620 = !{!621, !622, !623, !624, !626, !627, !628, !629}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !567, line: 60, baseType: !72, size: 32, align: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !619, file: !567, line: 61, baseType: !72, size: 32, align: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !619, file: !567, line: 62, baseType: !71, size: 8, align: 8, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !619, file: !567, line: 63, baseType: !625, size: 48, align: 8, offset: 72)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 48, align: 8, elements: !516)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !619, file: !567, line: 64, baseType: !380, size: 32, align: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !619, file: !567, line: 65, baseType: !380, size: 32, align: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !619, file: !567, line: 66, baseType: !72, size: 32, align: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !619, file: !567, line: 67, baseType: !630, size: 192, align: 32, offset: 224)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 192, align: 32, elements: !516)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !422, file: !421, line: 40, baseType: !632, size: 25344, align: 64, offset: 376640)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 25344, align: 64, elements: !225)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !422, file: !421, line: 41, baseType: !634, size: 128, align: 64, offset: 401984)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !635, line: 46, baseType: !636)
!635 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!636 = !DICompositeType(tag: DW_TAG_structure_type, file: !635, line: 42, size: 128, align: 64, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !636, file: !635, line: 44, baseType: !72, size: 32, align: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !636, file: !635, line: 45, baseType: !640, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !635, line: 40, baseType: !642)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !635, line: 36, size: 192, align: 64, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !642, file: !635, line: 37, baseType: !72, size: 32, align: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !642, file: !635, line: 38, baseType: !425, size: 64, align: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !642, file: !635, line: 39, baseType: !647, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!648 = !{!649, !650, !651, !652, !653, !654}
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !416, file: !1, line: 258, type: !202)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !416, file: !1, line: 260, type: !72)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "natoms", scope: !416, file: !1, line: 260, type: !72)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !416, file: !1, line: 261, type: !380)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda", scope: !416, file: !1, line: 261, type: !380)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top", scope: !416, file: !1, line: 262, type: !419)
!655 = !DISubprogram(name: "mk_single_top", scope: !1, file: !1, line: 271, type: !656, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_topology*)* @mk_single_top, variables: !658)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !419}
!658 = !{!659, !660}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 1, scope: !655, file: !1, line: 271, type: !419)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !655, file: !1, line: 273, type: !72)
!661 = !DISubprogram(name: "iscan", scope: !1, file: !1, line: 293, type: !662, isLocal: false, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**, i32*)* @iscan, variables: !664)
!662 = !DISubroutineType(types: !663)
!663 = !{!72, !72, !425, !615}
!664 = !{!665, !666, !667, !668}
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !661, file: !1, line: 293, type: !72)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !661, file: !1, line: 293, type: !425)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !661, file: !1, line: 293, type: !615)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !661, file: !1, line: 295, type: !72)
!669 = !DISubprogram(name: "dscan", scope: !1, file: !1, line: 306, type: !670, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, i8**, i32*)* @dscan, variables: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{!251, !72, !425, !615}
!672 = !{!673, !674, !675, !676}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !669, file: !1, line: 306, type: !72)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !669, file: !1, line: 306, type: !425)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !669, file: !1, line: 306, type: !615)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !669, file: !1, line: 308, type: !251)
!677 = !DISubprogram(name: "sscan", scope: !1, file: !1, line: 319, type: !678, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32, i8**, i32*)* @sscan, variables: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!202, !72, !425, !615}
!680 = !{!681, !682, !683}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !677, file: !1, line: 319, type: !72)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !677, file: !1, line: 319, type: !425)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !677, file: !1, line: 319, type: !615)
!684 = !DISubprogram(name: "nenum", scope: !1, file: !1, line: 331, type: !685, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**)* @nenum, variables: !687)
!685 = !DISubroutineType(types: !686)
!686 = !{!72, !425}
!687 = !{!688, !689}
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enumc", arg: 1, scope: !684, file: !1, line: 331, type: !425)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !684, file: !1, line: 333, type: !72)
!690 = !DISubprogram(name: "bDoView", scope: !1, file: !1, line: 364, type: !691, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @bDoView, variables: !363)
!691 = !DISubroutineType(types: !692)
!692 = !{!72}
!693 = !DISubprogram(name: "parse_common_args", scope: !1, file: !1, line: 457, type: !694, isLocal: false, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8**, i64, i32, %struct.t_filenm*, i32, %struct.t_pargs*, i32, i8**, i32, i8**)* @parse_common_args, variables: !724)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !615, !425, !78, !72, !696, !72, !705, !72, !425, !72, !425}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_filenm", file: !698, line: 62, baseType: !699)
!698 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!699 = !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 57, size: 256, align: 64, elements: !700)
!700 = !{!701, !702, !703, !704}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ftp", scope: !699, file: !698, line: 58, baseType: !72, size: 32, align: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !699, file: !698, line: 59, baseType: !202, size: 64, align: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !699, file: !698, line: 60, baseType: !202, size: 64, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !699, file: !698, line: 61, baseType: !78, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pargs", file: !59, line: 105, baseType: !707)
!707 = !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 91, size: 256, align: 64, elements: !708)
!708 = !{!709, !710, !711, !712, !723}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !707, file: !59, line: 92, baseType: !202, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bSet", scope: !707, file: !59, line: 93, baseType: !72, size: 32, align: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !59, line: 94, baseType: !72, size: 32, align: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !707, file: !59, line: 103, baseType: !713, size: 64, align: 64, offset: 128)
!713 = !DICompositeType(tag: DW_TAG_union_type, scope: !707, file: !59, line: 95, size: 64, align: 64, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !713, file: !59, line: 96, baseType: !73, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !713, file: !59, line: 97, baseType: !615, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !713, file: !59, line: 98, baseType: !408, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !713, file: !59, line: 99, baseType: !425, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !713, file: !59, line: 101, baseType: !615, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !713, file: !59, line: 102, baseType: !721, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !381, line: 101, baseType: !509)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !707, file: !59, line: 104, baseType: !202, size: 64, align: 64, offset: 192)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !762}
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !693, file: !1, line: 457, type: !615)
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !693, file: !1, line: 457, type: !425)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Flags", arg: 3, scope: !693, file: !1, line: 457, type: !78)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 4, scope: !693, file: !1, line: 458, type: !72)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 5, scope: !693, file: !1, line: 458, type: !696)
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 6, scope: !693, file: !1, line: 458, type: !72)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 7, scope: !693, file: !1, line: 458, type: !705)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndesc", arg: 8, scope: !693, file: !1, line: 459, type: !72)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 9, scope: !693, file: !1, line: 459, type: !425)
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbugs", arg: 10, scope: !693, file: !1, line: 459, type: !72)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bugs", arg: 11, scope: !693, file: !1, line: 459, type: !425)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !693, file: !1, line: 471, type: !175)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bPrint", scope: !693, file: !1, line: 472, type: !72)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bExit", scope: !693, file: !1, line: 472, type: !72)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !693, file: !1, line: 473, type: !72)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !693, file: !1, line: 473, type: !72)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !693, file: !1, line: 473, type: !72)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npall", scope: !693, file: !1, line: 473, type: !72)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !693, file: !1, line: 474, type: !202)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newdesc", scope: !693, file: !1, line: 474, type: !202)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "envstr", scope: !693, file: !1, line: 475, type: !202)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_pa", scope: !693, file: !1, line: 477, type: !705)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "motif_pa", scope: !693, file: !1, line: 479, type: !706)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npri_paX", scope: !693, file: !1, line: 481, type: !706)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npri_pa", scope: !693, file: !1, line: 483, type: !706)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nice_paX", scope: !693, file: !1, line: 485, type: !706)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nice_pa", scope: !693, file: !1, line: 487, type: !706)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deffnm_pa", scope: !693, file: !1, line: 489, type: !706)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "begin_pa", scope: !693, file: !1, line: 491, type: !706)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end_pa", scope: !693, file: !1, line: 493, type: !706)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dt_pa", scope: !693, file: !1, line: 495, type: !706)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view_pa", scope: !693, file: !1, line: 497, type: !706)
