; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/stat.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_bin = type { i32, i32, double* }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_grpopts = type { i32, i32, i32, i32, float*, float*, float*, [3 x float]*, [3 x i32]*, i32* }
%struct.t_groups = type { %struct.t_grp_ener, %struct.t_grp_tcstat*, %struct.t_grp_acc*, %struct.t_cos_acc }
%struct.t_grp_ener = type { i32, [7 x float*] }
%struct.t_grp_tcstat = type { float, float, [3 x [3 x float]], float, float }
%struct.t_grp_acc = type { i32, i32*, float, [3 x float], [3 x float], [3 x float] }
%struct.t_cos_acc = type { float, float, float }
%struct.t_nrnb = type { [129 x double] }
%struct.t_vcm = type { i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x [3 x float]]*, float*, i8**, i16* }

!226 = !DISubprogram(name: "__inline_isfinitel", scope: !214, file: !214, line: 210, type: !227, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !230)
!227 = !DISubroutineType(types: !228)
!228 = !{!204, !229}
!229 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!230 = !{!231}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !226, file: !214, line: 210, type: !229)
!232 = !DISubprogram(name: "__inline_isinff", scope: !214, file: !214, line: 213, type: !215, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !233)
!233 = !{!234}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !232, file: !214, line: 213, type: !217)
!235 = !DISubprogram(name: "__inline_isinfd", scope: !214, file: !214, line: 216, type: !221, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !236)
!236 = !{!237}
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !235, file: !214, line: 216, type: !223)
!238 = !DISubprogram(name: "__inline_isinfl", scope: !214, file: !214, line: 219, type: !227, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !239)
!239 = !{!240}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !238, file: !214, line: 219, type: !229)
!241 = !DISubprogram(name: "__inline_isnanf", scope: !214, file: !214, line: 222, type: !215, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !242)
!242 = !{!243}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !241, file: !214, line: 222, type: !217)
!244 = !DISubprogram(name: "__inline_isnand", scope: !214, file: !214, line: 225, type: !221, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !245)
!245 = !{!246}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !244, file: !214, line: 225, type: !223)
!247 = !DISubprogram(name: "__inline_isnanl", scope: !214, file: !214, line: 228, type: !227, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !248)
!248 = !{!249}
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !247, file: !214, line: 228, type: !229)
!250 = !DISubprogram(name: "__inline_signbitf", scope: !214, file: !214, line: 231, type: !215, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !251)
!251 = !{!252, !253}
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !250, file: !214, line: 231, type: !217)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !250, file: !214, line: 232, type: !254)
!254 = !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !214, line: 232, size: 32, align: 32, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !254, file: !214, line: 232, baseType: !217, size: 32, align: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !254, file: !214, line: 232, baseType: !258, size: 32, align: 32)
!258 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!259 = !DISubprogram(name: "__inline_signbitd", scope: !214, file: !214, line: 236, type: !221, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !260)
!260 = !{!261, !262}
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !259, file: !214, line: 236, type: !223)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !259, file: !214, line: 237, type: !263)
!263 = !DICompositeType(tag: DW_TAG_union_type, scope: !259, file: !214, line: 237, size: 64, align: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !263, file: !214, line: 237, baseType: !223, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !263, file: !214, line: 237, baseType: !267, size: 64, align: 64)
!267 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!268 = !DISubprogram(name: "__inline_signbitl", scope: !214, file: !214, line: 242, type: !227, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !269)
!269 = !{!270, !271}
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !268, file: !214, line: 242, type: !229)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !268, file: !214, line: 246, type: !272)
!272 = !DICompositeType(tag: DW_TAG_union_type, scope: !268, file: !214, line: 243, size: 128, align: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !272, file: !214, line: 244, baseType: !229, size: 128, align: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !272, file: !214, line: 245, baseType: !276, size: 128, align: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, scope: !272, file: !214, line: 245, size: 128, align: 64, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !276, file: !214, line: 245, baseType: !267, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !276, file: !214, line: 245, baseType: !280, size: 16, align: 16, offset: 64)
!280 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!281 = !DISubprogram(name: "__inline_isnormalf", scope: !214, file: !214, line: 257, type: !215, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !282)
!282 = !{!283}
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !281, file: !214, line: 257, type: !217)
!284 = !DISubprogram(name: "__inline_isnormald", scope: !214, file: !214, line: 260, type: !221, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !285)
!285 = !{!286}
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !284, file: !214, line: 260, type: !223)
!287 = !DISubprogram(name: "__inline_isnormall", scope: !214, file: !214, line: 263, type: !227, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !288)
!288 = !{!289}
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !287, file: !214, line: 263, type: !229)
!290 = !DISubprogram(name: "__sincosf", scope: !214, file: !214, line: 642, type: !291, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !294)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !217, !293, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!294 = !{!295, !296, !297, !298}
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !290, file: !214, line: 642, type: !217)
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !290, file: !214, line: 642, type: !293)
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !290, file: !214, line: 642, type: !293)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !290, file: !214, line: 643, type: !299)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !214, line: 634, size: 64, align: 32, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !300, file: !214, line: 634, baseType: !217, size: 32, align: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !300, file: !214, line: 634, baseType: !217, size: 32, align: 32, offset: 32)
!304 = !DISubprogram(name: "__sincos", scope: !214, file: !214, line: 647, type: !305, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !308)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !223, !307, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!308 = !{!309, !310, !311, !312}
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !304, file: !214, line: 647, type: !223)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !304, file: !214, line: 647, type: !307)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !304, file: !214, line: 647, type: !307)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !304, file: !214, line: 648, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !214, line: 635, size: 128, align: 64, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !314, file: !214, line: 635, baseType: !223, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !314, file: !214, line: 635, baseType: !223, size: 64, align: 64, offset: 64)
!318 = !DISubprogram(name: "__sincospif", scope: !214, file: !214, line: 652, type: !291, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !318, file: !214, line: 652, type: !217)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !318, file: !214, line: 652, type: !293)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !318, file: !214, line: 652, type: !293)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !318, file: !214, line: 653, type: !299)
!324 = !DISubprogram(name: "__sincospi", scope: !214, file: !214, line: 657, type: !305, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !324, file: !214, line: 657, type: !223)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !324, file: !214, line: 657, type: !307)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !324, file: !214, line: 657, type: !307)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !324, file: !214, line: 658, type: !313)
!330 = !DISubprogram(name: "global_stat", scope: !1, file: !1, line: 59, type: !331, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, float*, [3 x float]*, [3 x float]*, %struct.t_grpopts*, %struct.t_groups*, %struct.t_nrnb*, %struct.t_nrnb*, %struct.t_vcm*, float*)* @global_stat, variables: !504)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !394, !405, !408, !408, !410, !431, !477, !477, !485, !405}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !335, line: 153, baseType: !336)
!335 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !335, line: 122, size: 1216, align: 64, elements: !337)
!337 = !{!338, !341, !342, !343, !345, !346, !351, !352, !353, !356, !362, !372, !378, !379, !382, !383, !387, !391, !392, !393}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !336, file: !335, line: 123, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !336, file: !335, line: 124, baseType: !204, size: 32, align: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !336, file: !335, line: 125, baseType: !204, size: 32, align: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !336, file: !335, line: 126, baseType: !344, size: 16, align: 16, offset: 128)
!344 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !336, file: !335, line: 127, baseType: !344, size: 16, align: 16, offset: 144)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !336, file: !335, line: 128, baseType: !347, size: 128, align: 64, offset: 192)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !335, line: 88, size: 128, align: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !347, file: !335, line: 89, baseType: !339, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !347, file: !335, line: 90, baseType: !204, size: 32, align: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !336, file: !335, line: 129, baseType: !204, size: 32, align: 32, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !336, file: !335, line: 132, baseType: !205, size: 64, align: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !336, file: !335, line: 133, baseType: !354, size: 64, align: 64, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !203)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !336, file: !335, line: 134, baseType: !357, size: 64, align: 64, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!204, !205, !360, !204}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !336, file: !335, line: 135, baseType: !363, size: 64, align: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !205, !366, !204}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !335, line: 77, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !368, line: 71, baseType: !369)
!368 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !370, line: 46, baseType: !371)
!370 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!371 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !336, file: !335, line: 136, baseType: !373, size: 64, align: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!204, !205, !376, !204}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !336, file: !335, line: 139, baseType: !347, size: 128, align: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !336, file: !335, line: 140, baseType: !380, size: 64, align: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !335, line: 94, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !336, file: !335, line: 141, baseType: !204, size: 32, align: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !336, file: !335, line: 144, baseType: !384, size: 24, align: 8, offset: 928)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 24, align: 8, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 3)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !336, file: !335, line: 145, baseType: !388, size: 8, align: 8, offset: 952)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 8, align: 8, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 1)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !336, file: !335, line: 148, baseType: !347, size: 128, align: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !336, file: !335, line: 151, baseType: !204, size: 32, align: 32, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !336, file: !335, line: 152, baseType: !366, size: 64, align: 64, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !396, line: 40, baseType: !397)
!396 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 36, size: 192, align: 32, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !397, file: !396, line: 37, baseType: !204, size: 32, align: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !397, file: !396, line: 37, baseType: !204, size: 32, align: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !397, file: !396, line: 38, baseType: !204, size: 32, align: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !397, file: !396, line: 38, baseType: !204, size: 32, align: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !397, file: !396, line: 39, baseType: !204, size: 32, align: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !397, file: !396, line: 39, baseType: !204, size: 32, align: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !407, line: 87, baseType: !217)
!407 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 96, align: 32, elements: !385)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !412, line: 53, baseType: !413)
!412 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 42, size: 512, align: 64, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !425, !429}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !413, file: !412, line: 43, baseType: !204, size: 32, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !413, file: !412, line: 44, baseType: !204, size: 32, align: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !413, file: !412, line: 45, baseType: !204, size: 32, align: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !413, file: !412, line: 46, baseType: !204, size: 32, align: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !413, file: !412, line: 47, baseType: !405, size: 64, align: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !413, file: !412, line: 48, baseType: !405, size: 64, align: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !413, file: !412, line: 49, baseType: !405, size: 64, align: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !413, file: !412, line: 50, baseType: !423, size: 64, align: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !407, line: 101, baseType: !409)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !413, file: !412, line: 51, baseType: !426, size: 64, align: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !407, line: 107, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 96, align: 32, elements: !385)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !413, file: !412, line: 52, baseType: !430, size: 64, align: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_groups", file: !186, line: 72, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 67, size: 768, align: 64, elements: !434)
!434 = !{!435, !444, !457, !470}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "estat", scope: !433, file: !186, line: 68, baseType: !436, size: 512, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_ener", file: !186, line: 50, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 46, size: 512, align: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nn", scope: !437, file: !186, line: 47, baseType: !204, size: 32, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !437, file: !186, line: 48, baseType: !441, size: 448, align: 64, offset: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 448, align: 64, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 7)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tcstat", scope: !433, file: !186, line: 69, baseType: !445, size: 64, align: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_tcstat", file: !186, line: 44, baseType: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 38, size: 416, align: 32, elements: !448)
!448 = !{!449, !450, !451, !455, !456}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !447, file: !186, line: 39, baseType: !406, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !447, file: !186, line: 40, baseType: !406, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ekin", scope: !447, file: !186, line: 41, baseType: !452, size: 288, align: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !407, line: 105, baseType: !453)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 288, align: 32, elements: !454)
!454 = !{!386, !386}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !447, file: !186, line: 42, baseType: !406, size: 32, align: 32, offset: 352)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !447, file: !186, line: 43, baseType: !406, size: 32, align: 32, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "grpstat", scope: !433, file: !186, line: 70, baseType: !458, size: 64, align: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_acc", file: !186, line: 59, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 52, size: 448, align: 64, elements: !461)
!461 = !{!462, !463, !466, !467, !468, !469}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nat", scope: !460, file: !186, line: 53, baseType: !204, size: 32, align: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "aid", scope: !460, file: !186, line: 54, baseType: !464, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !407, line: 73, baseType: !204)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !460, file: !186, line: 55, baseType: !406, size: 32, align: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !460, file: !186, line: 56, baseType: !424, size: 96, align: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "uold", scope: !460, file: !186, line: 57, baseType: !424, size: 96, align: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ut", scope: !460, file: !186, line: 58, baseType: !424, size: 96, align: 32, offset: 352)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cosacc", scope: !433, file: !186, line: 71, baseType: !471, size: 96, align: 32, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cos_acc", file: !186, line: 65, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 61, size: 96, align: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !472, file: !186, line: 62, baseType: !406, size: 32, align: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mvcos", scope: !472, file: !186, line: 63, baseType: !406, size: 32, align: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vcos", scope: !472, file: !186, line: 64, baseType: !406, size: 32, align: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !52, line: 95, baseType: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 93, size: 8256, align: 64, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !479, file: !52, line: 94, baseType: !482, size: 8256, align: 64)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 8256, align: 64, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 129)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_vcm", file: !487, line: 56, baseType: !488)
!487 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vcm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!488 = !DICompositeType(tag: DW_TAG_structure_type, file: !487, line: 44, size: 640, align: 64, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !499, !500, !502}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !488, file: !487, line: 45, baseType: !204, size: 32, align: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !488, file: !487, line: 46, baseType: !204, size: 32, align: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "group_p", scope: !488, file: !487, line: 47, baseType: !423, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "group_v", scope: !488, file: !487, line: 48, baseType: !423, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "group_x", scope: !488, file: !487, line: 49, baseType: !423, size: 64, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "group_j", scope: !488, file: !487, line: 50, baseType: !423, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "group_w", scope: !488, file: !487, line: 51, baseType: !423, size: 64, align: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "group_i", scope: !488, file: !487, line: 52, baseType: !498, size: 64, align: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "group_mass", scope: !488, file: !487, line: 53, baseType: !405, size: 64, align: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !488, file: !487, line: 54, baseType: !501, size: 64, align: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !488, file: !487, line: 55, baseType: !503, size: 64, align: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !531, !533}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !330, file: !1, line: 59, type: !333)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !330, file: !1, line: 60, type: !394)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ener", arg: 3, scope: !330, file: !1, line: 60, type: !405)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fvir", arg: 4, scope: !330, file: !1, line: 61, type: !408)
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "svir", arg: 5, scope: !330, file: !1, line: 61, type: !408)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 6, scope: !330, file: !1, line: 62, type: !410)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 7, scope: !330, file: !1, line: 62, type: !431)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mynrnb", arg: 8, scope: !330, file: !1, line: 63, type: !477)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 9, scope: !330, file: !1, line: 63, type: !477)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vcm", arg: 10, scope: !330, file: !1, line: 64, type: !485)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "terminate", arg: 11, scope: !330, file: !1, line: 64, type: !405)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterminate", scope: !330, file: !1, line: 68, type: !204)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imu", scope: !330, file: !1, line: 68, type: !204)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ie", scope: !330, file: !1, line: 68, type: !204)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ifv", scope: !330, file: !1, line: 68, type: !204)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isv", scope: !330, file: !1, line: 68, type: !204)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icm", scope: !330, file: !1, line: 68, type: !204)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imass", scope: !330, file: !1, line: 68, type: !204)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ica", scope: !330, file: !1, line: 68, type: !204)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icj", scope: !330, file: !1, line: 69, type: !204)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ici", scope: !330, file: !1, line: 69, type: !204)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icx", scope: !330, file: !1, line: 69, type: !204)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !330, file: !1, line: 70, type: !528)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 8192, align: 32, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 256)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inn", scope: !330, file: !1, line: 71, type: !532)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 224, align: 32, elements: !442)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !330, file: !1, line: 72, type: !204)
!534 = !DISubprogram(name: "do_per_step", scope: !1, file: !1, line: 156, type: !535, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @do_per_step, variables: !537)
!535 = !DISubroutineType(types: !536)
!536 = !{!204, !204, !204}
!537 = !{!538, !539}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 1, scope: !534, file: !1, line: 156, type: !204)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nstep", arg: 2, scope: !534, file: !1, line: 156, type: !204)
!540 = !DISubprogram(name: "write_traj", scope: !1, file: !1, line: 199, type: !541, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_commrec*, i8*, %struct.t_nsborder*, i32, float, float, %struct.t_nrnb*, i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*)* @write_traj, variables: !559)
!541 = !DISubroutineType(types: !542)
!542 = !{!204, !333, !394, !360, !543, !204, !406, !406, !477, !204, !423, !423, !423, !408}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !545, line: 59, baseType: !546)
!545 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!546 = !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 36, size: 32992, align: 32, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !546, file: !545, line: 37, baseType: !204, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !546, file: !545, line: 38, baseType: !204, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !546, file: !545, line: 39, baseType: !204, size: 32, align: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !546, file: !545, line: 40, baseType: !204, size: 32, align: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !546, file: !545, line: 41, baseType: !204, size: 32, align: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !546, file: !545, line: 43, baseType: !204, size: 32, align: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !546, file: !545, line: 43, baseType: !204, size: 32, align: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !546, file: !545, line: 50, baseType: !528, size: 8192, align: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !546, file: !545, line: 51, baseType: !528, size: 8192, align: 32, offset: 8416)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !546, file: !545, line: 52, baseType: !528, size: 8192, align: 32, offset: 16608)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !546, file: !545, line: 55, baseType: !528, size: 8192, align: 32, offset: 24800)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !540, file: !1, line: 199, type: !333)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !540, file: !1, line: 199, type: !394)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traj", arg: 3, scope: !540, file: !1, line: 200, type: !360)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 4, scope: !540, file: !1, line: 200, type: !543)
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 5, scope: !540, file: !1, line: 201, type: !204)
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 6, scope: !540, file: !1, line: 201, type: !406)
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 7, scope: !540, file: !1, line: 201, type: !406)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 8, scope: !540, file: !1, line: 201, type: !477)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 9, scope: !540, file: !1, line: 202, type: !204)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xx", arg: 10, scope: !540, file: !1, line: 202, type: !423)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 11, scope: !540, file: !1, line: 202, type: !423)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ff", arg: 12, scope: !540, file: !1, line: 202, type: !423)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 13, scope: !540, file: !1, line: 202, type: !408)
!573 = !DISubprogram(name: "write_xtc_traj", scope: !1, file: !1, line: 229, type: !574, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, i8*, %struct.t_nsborder*, %struct.t_mdatoms*, i32, float, [3 x float]*, [3 x float]*, float)* @write_xtc_traj, variables: !604)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !333, !394, !360, !543, !576, !204, !406, !423, !408, !406}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !578, line: 51, baseType: !579)
!578 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!579 = !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 40, size: 1408, align: 64, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !579, file: !578, line: 41, baseType: !406, size: 32, align: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !579, file: !578, line: 42, baseType: !204, size: 32, align: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !579, file: !578, line: 43, baseType: !405, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !579, file: !578, line: 43, baseType: !405, size: 64, align: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !579, file: !578, line: 43, baseType: !405, size: 64, align: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !579, file: !578, line: 43, baseType: !405, size: 64, align: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !579, file: !578, line: 44, baseType: !405, size: 64, align: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !579, file: !578, line: 44, baseType: !405, size: 64, align: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !579, file: !578, line: 44, baseType: !405, size: 64, align: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !579, file: !578, line: 45, baseType: !430, size: 64, align: 64, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !579, file: !578, line: 46, baseType: !430, size: 64, align: 64, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !579, file: !578, line: 47, baseType: !430, size: 64, align: 64, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !579, file: !578, line: 47, baseType: !430, size: 64, align: 64, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !579, file: !578, line: 48, baseType: !503, size: 64, align: 64, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !579, file: !578, line: 49, baseType: !503, size: 64, align: 64, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !579, file: !578, line: 49, baseType: !503, size: 64, align: 64, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !579, file: !578, line: 49, baseType: !503, size: 64, align: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !579, file: !578, line: 49, baseType: !503, size: 64, align: 64, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !579, file: !578, line: 49, baseType: !503, size: 64, align: 64, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !579, file: !578, line: 49, baseType: !503, size: 64, align: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !579, file: !578, line: 50, baseType: !503, size: 64, align: 64, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !579, file: !578, line: 50, baseType: !503, size: 64, align: 64, offset: 1280)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !579, file: !578, line: 50, baseType: !503, size: 64, align: 64, offset: 1344)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !573, file: !1, line: 229, type: !333)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !573, file: !1, line: 229, type: !394)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xtc_traj", arg: 3, scope: !573, file: !1, line: 230, type: !360)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 4, scope: !573, file: !1, line: 230, type: !543)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 5, scope: !573, file: !1, line: 230, type: !576)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 6, scope: !573, file: !1, line: 231, type: !204)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 7, scope: !573, file: !1, line: 231, type: !406)
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xx", arg: 8, scope: !573, file: !1, line: 231, type: !423)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 9, scope: !573, file: !1, line: 231, type: !408)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prec", arg: 10, scope: !573, file: !1, line: 231, type: !406)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !573, file: !1, line: 236, type: !204)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !573, file: !1, line: 236, type: !204)
!617 = !DISubprogram(name: "close_xtc_traj", scope: !1, file: !1, line: 278, type: !618, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @close_xtc_traj, variables: !620)
!618 = !DISubroutineType(types: !619)
!619 = !{null}
!620 = !{}
!621 = !DISubprogram(name: "moveit", scope: !1, file: !1, line: 164, type: !622, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, i8*, [3 x float]*, %struct.t_nsborder*)* @moveit, variables: !624)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !333, !204, !204, !360, !423, !543}
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !621, file: !1, line: 164, type: !333)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 2, scope: !621, file: !1, line: 165, type: !204)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 3, scope: !621, file: !1, line: 165, type: !204)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 4, scope: !621, file: !1, line: 165, type: !360)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xx", arg: 5, scope: !621, file: !1, line: 165, type: !423)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 6, scope: !621, file: !1, line: 165, type: !543)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !621, file: !1, line: 167, type: !423)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !621, file: !1, line: 168, type: !204)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !621, file: !1, line: 168, type: !204)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bP", scope: !621, file: !1, line: 168, type: !204)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !621, file: !1, line: 168, type: !204)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "homenr", scope: !621, file: !1, line: 168, type: !204)
!637 = !DISubprogram(name: "copy_rvec", scope: !638, file: !638, line: 270, type: !639, isLocal: true, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, variables: !643)
!638 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641, !405}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!643 = !{!644, !645}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !637, file: !638, line: 270, type: !641)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !637, file: !638, line: 270, type: !405)
!646 = !{!647, !656, !657, !658, !659, !660, !661}
!647 = !DIGlobalVariable(name: "rb", scope: !330, file: !1, line: 66, type: !648, isLocal: true, isDefinition: true, variable: %struct.t_bin** @global_stat.rb)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_bin", file: !650, line: 49, baseType: !651)
!650 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rbin.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!651 = !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 45, size: 128, align: 64, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nreal", scope: !651, file: !650, line: 46, baseType: !204, size: 32, align: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "maxreal", scope: !651, file: !650, line: 47, baseType: !204, size: 32, align: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !651, file: !650, line: 48, baseType: !307, size: 64, align: 64, offset: 64)
!656 = !DIGlobalVariable(name: "itc", scope: !330, file: !1, line: 67, type: !430, isLocal: true, isDefinition: true, variable: i32** @global_stat.itc)
!657 = !DIGlobalVariable(name: "fp", scope: !540, file: !1, line: 204, type: !204, isLocal: true, isDefinition: true, variable: i32* @write_traj.fp)
!658 = !DIGlobalVariable(name: "bFirst", scope: !573, file: !1, line: 233, type: !204, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariable(name: "x_sel", scope: !573, file: !1, line: 234, type: !423, isLocal: true, isDefinition: true, variable: [3 x float]** @write_xtc_traj.x_sel)
!660 = !DIGlobalVariable(name: "natoms", scope: !573, file: !1, line: 235, type: !204, isLocal: true, isDefinition: true, variable: i32* @write_xtc_traj.natoms)
!661 = !DIGlobalVariable(name: "xd", scope: !0, file: !1, line: 227, type: !204, isLocal: true, isDefinition: true, variable: i32* @xd)
!662 = !{i32 2, !"Dwarf Version", i32 2}
!663 = !{i32 2, !"Debug Info Version", i32 700000003}
!664 = !{i32 1, !"PIC Level", i32 2}
!665 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!666 = !DIExpression()
!667 = !DILocation(line: 114, column: 15, scope: !207)
!668 = !DILocation(line: 116, column: 20, scope: !207)
!669 = !DILocation(line: 116, column: 12, scope: !207)
!670 = !DILocation(line: 116, column: 57, scope: !207)
!671 = !DILocation(line: 116, column: 45, scope: !207)
!672 = !DILocation(line: 116, column: 5, scope: !207)
!673 = !DILocation(line: 204, column: 53, scope: !213)
!674 = !DILocation(line: 205, column: 16, scope: !213)
!675 = !DILocation(line: 205, column: 23, scope: !213)
!676 = !DILocation(line: 205, column: 26, scope: !213)
!677 = !DILocation(line: 205, column: 47, scope: !213)
!678 = !DILocation(line: 205, column: 5, scope: !213)
!679 = !DILocation(line: 207, column: 54, scope: !220)
!680 = !DILocation(line: 208, column: 16, scope: !220)
!681 = !DILocation(line: 208, column: 23, scope: !220)
!682 = !DILocation(line: 208, column: 26, scope: !220)
!683 = !DILocation(line: 208, column: 46, scope: !220)
!684 = !DILocation(line: 208, column: 5, scope: !220)
!685 = !DILocation(line: 210, column: 59, scope: !226)
!686 = !DILocation(line: 211, column: 16, scope: !226)
!687 = !DILocation(line: 211, column: 23, scope: !226)
!688 = !DILocation(line: 211, column: 26, scope: !226)
!689 = !DILocation(line: 211, column: 47, scope: !226)
!690 = !DILocation(line: 211, column: 5, scope: !226)
!691 = !DILocation(line: 213, column: 50, scope: !232)
!692 = !DILocation(line: 214, column: 12, scope: !232)
!693 = !DILocation(line: 214, column: 33, scope: !232)
!694 = !DILocation(line: 214, column: 5, scope: !232)
!695 = !DILocation(line: 216, column: 51, scope: !235)
!696 = !DILocation(line: 217, column: 12, scope: !235)
!697 = !DILocation(line: 217, column: 32, scope: !235)
!698 = !DILocation(line: 217, column: 5, scope: !235)
!699 = !DILocation(line: 219, column: 56, scope: !238)
!700 = !DILocation(line: 220, column: 12, scope: !238)
!701 = !DILocation(line: 220, column: 33, scope: !238)
!702 = !DILocation(line: 220, column: 5, scope: !238)
!703 = !DILocation(line: 222, column: 50, scope: !241)
!704 = !DILocation(line: 223, column: 16, scope: !241)
!705 = !DILocation(line: 223, column: 5, scope: !241)
!706 = !DILocation(line: 225, column: 51, scope: !244)
!707 = !DILocation(line: 226, column: 16, scope: !244)
!708 = !DILocation(line: 226, column: 5, scope: !244)
!709 = !DILocation(line: 228, column: 56, scope: !247)
!710 = !DILocation(line: 229, column: 16, scope: !247)
!711 = !DILocation(line: 229, column: 5, scope: !247)
!712 = !DILocation(line: 231, column: 52, scope: !250)
!713 = !DILocation(line: 232, column: 44, scope: !250)
!714 = !DILocation(line: 233, column: 13, scope: !250)
!715 = !DILocation(line: 234, column: 26, scope: !250)
!716 = !DILocation(line: 234, column: 5, scope: !250)
