; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/string2.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@_DefaultRuneLocale = external global %struct._RuneLocale
@.str = private unnamed_addr constant [9 x i8] c"onbekend\00", align 1
@.str1 = private unnamed_addr constant [4 x i8] c"%c\0A\00", align 1
@.str2 = private unnamed_addr constant [28 x i8] c"%c\09File '%s' was generated\0A\00", align 1
@.str3 = private unnamed_addr constant [21 x i8] c"%c\09By user: %s (%d)\0A\00", align 1
@.str4 = private unnamed_addr constant [16 x i8] c"%c\09On host: %s\0A\00", align 1
@.str5 = private unnamed_addr constant [15 x i8] c"%c\09At date: %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/string2.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !{!9, !76, !82, !90, !96, !102, !105, !108, !111, !114, !117, !120, !123, !126, !129, !132, !135, !138, !141, !144, !147, !150, !153, !156, !159, !162, !165, !168, !172, !178, !186, !192, !196, !201, !205, !208, !231, !239, !245, !254, !260}
!9 = !DISubprogram(name: "__sputc", scope: !10, file: !10, line: 348, type: !11, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !73)
!10 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !DISubroutineType(types: !12)
!12 = !{!7, !7, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !10, line: 153, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !10, line: 122, size: 1216, align: 64, elements: !16)
!16 = !{!17, !20, !21, !22, !24, !25, !30, !31, !32, !36, !41, !51, !57, !58, !61, !62, !66, !70, !71, !72}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !15, file: !10, line: 123, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !15, file: !10, line: 124, baseType: !7, size: 32, align: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !15, file: !10, line: 125, baseType: !7, size: 32, align: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !10, line: 126, baseType: !23, size: 16, align: 16, offset: 128)
!23 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !15, file: !10, line: 127, baseType: !23, size: 16, align: 16, offset: 144)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !15, file: !10, line: 128, baseType: !26, size: 128, align: 64, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !10, line: 88, size: 128, align: 64, elements: !27)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !26, file: !10, line: 89, baseType: !18, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !26, file: !10, line: 90, baseType: !7, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !15, file: !10, line: 129, baseType: !7, size: 32, align: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !15, file: !10, line: 132, baseType: !6, size: 64, align: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !15, file: !10, line: 133, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!7, !6}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !15, file: !10, line: 134, baseType: !37, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!7, !6, !40, !7}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !15, file: !10, line: 135, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !6, !45, !7}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !10, line: 77, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !47, line: 71, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !15, file: !10, line: 136, baseType: !52, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!7, !6, !55, !7}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !15, file: !10, line: 139, baseType: !26, size: 128, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !15, file: !10, line: 140, baseType: !59, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !10, line: 94, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !15, file: !10, line: 141, baseType: !7, size: 32, align: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !15, file: !10, line: 144, baseType: !63, size: 24, align: 8, offset: 928)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 3)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !15, file: !10, line: 145, baseType: !67, size: 8, align: 8, offset: 952)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !15, file: !10, line: 148, baseType: !26, size: 128, align: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !15, file: !10, line: 151, baseType: !7, size: 32, align: 32, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !10, line: 152, baseType: !45, size: 64, align: 64, offset: 1152)
!73 = !{!74, !75}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !9, file: !10, line: 348, type: !7)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !9, file: !10, line: 348, type: !13)
!76 = !DISubprogram(name: "isascii", scope: !77, file: !77, line: 135, type: !78, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isascii, variables: !80)
!77 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DISubroutineType(types: !79)
!79 = !{!7, !7}
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !76, file: !77, line: 135, type: !7)
!82 = !DISubprogram(name: "__istype", scope: !77, file: !77, line: 153, type: !83, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i64)* @__istype, variables: !87)
!83 = !DISubroutineType(types: !84)
!84 = !{!7, !85, !86}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !49, line: 70, baseType: !7)
!86 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!87 = !{!88, !89}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !82, file: !77, line: 153, type: !85)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !82, file: !77, line: 153, type: !86)
!90 = !DISubprogram(name: "__isctype", scope: !77, file: !77, line: 164, type: !91, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i64)* @__isctype, variables: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{!85, !85, !86}
!93 = !{!94, !95}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !90, file: !77, line: 164, type: !85)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !90, file: !77, line: 164, type: !86)
!96 = !DISubprogram(name: "__wcwidth", scope: !77, file: !77, line: 194, type: !97, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__wcwidth, variables: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{!7, !85}
!99 = !{!100, !101}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !96, file: !77, line: 194, type: !85)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_x", scope: !96, file: !77, line: 196, type: !5)
!102 = !DISubprogram(name: "isalnum", scope: !77, file: !77, line: 212, type: !78, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isalnum, variables: !103)
!103 = !{!104}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !102, file: !77, line: 212, type: !7)
!105 = !DISubprogram(name: "isalpha", scope: !77, file: !77, line: 218, type: !78, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isalpha, variables: !106)
!106 = !{!107}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !105, file: !77, line: 218, type: !7)
!108 = !DISubprogram(name: "isblank", scope: !77, file: !77, line: 224, type: !78, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isblank, variables: !109)
!109 = !{!110}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !108, file: !77, line: 224, type: !7)
!111 = !DISubprogram(name: "iscntrl", scope: !77, file: !77, line: 230, type: !78, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @iscntrl, variables: !112)
