; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/symtab.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_symtab = type { i32, %struct.symbuf* }
%struct.symbuf = type { i32, i8**, %struct.symbuf* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [29 x i8] c"symtab lookup \22%s\22 not found\00", align 1
@.str1 = private unnamed_addr constant [38 x i8] c"symtab get_symtab_handle %d not found\00", align 1
@.str2 = private unnamed_addr constant [15 x i8] c"symbuf->buf[i]\00", align 1
@.str3 = private unnamed_addr constant [66 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/symtab.c\00", align 1
@.str4 = private unnamed_addr constant [12 x i8] c"symbuf->buf\00", align 1
@.str5 = private unnamed_addr constant [8 x i8] c"freeptr\00", align 1
@.str6 = private unnamed_addr constant [13 x i8] c"%s[%d]=\22%s\22\0A\00", align 1
@.str7 = private unnamed_addr constant [7 x i8] c"symbuf\00", align 1
@trim_string.buf = internal global [1024 x i8] zeroinitializer, align 16

; Function Attrs: alwaysinline nounwind optsize readnone ssp uwtable
define i32 @__sigbits(i32 %__signo) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !163, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/symtab.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !13, !40, !47, !53, !58, !61, !67, !72, !144, !151, !156}
!6 = !DISubprogram(name: "__sigbits", scope: !7, file: !7, line: 114, type: !8, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !11)
!7 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !{!12}
!12 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !6, file: !7, line: 114, type: !10)
!13 = !DISubprogram(name: "lookup_symtab", scope: !1, file: !1, line: 66, type: !14, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_symtab*, i8**)* @lookup_symtab, variables: !34)
!14 = !DISubroutineType(types: !15)
!15 = !{!10, !16, !29}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !18, line: 46, baseType: !19)
!18 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!19 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 42, size: 128, align: 64, elements: !20)
!20 = !{!21, !22}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !19, file: !18, line: 44, baseType: !10, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !19, file: !18, line: 45, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !18, line: 40, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !18, line: 36, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !32}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !25, file: !18, line: 37, baseType: !10, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !25, file: !18, line: 38, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !18, line: 39, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!34 = !{!35, !36, !37, !38, !39}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !13, file: !1, line: 66, type: !16)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !13, file: !1, line: 66, type: !29)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !13, file: !1, line: 68, type: !10)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !13, file: !1, line: 68, type: !10)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !13, file: !1, line: 69, type: !23)
!40 = !DISubprogram(name: "get_symtab_handle", scope: !1, file: !1, line: 87, type: !41, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: i8** (%struct.t_symtab*, i32)* @get_symtab_handle, variables: !43)
!41 = !DISubroutineType(types: !42)
!42 = !{!29, !16, !10}
!43 = !{!44, !45, !46}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !40, file: !1, line: 87, type: !16)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !40, file: !1, line: 87, type: !10)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !40, file: !1, line: 89, type: !23)
!47 = !DISubprogram(name: "put_symtab", scope: !1, file: !1, line: 151, type: !48, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, function: i8** (%struct.t_symtab*, i8*)* @put_symtab, variables: !50)
!48 = !DISubroutineType(types: !49)
!49 = !{!29, !16, !30}
!50 = !{!51, !52}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !47, file: !1, line: 151, type: !16)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !47, file: !1, line: 151, type: !30)
!53 = !DISubprogram(name: "open_symtab", scope: !1, file: !1, line: 156, type: !54, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_symtab*)* @open_symtab, variables: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !16}
!56 = !{!57}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !53, file: !1, line: 156, type: !16)
!58 = !DISubprogram(name: "close_symtab", scope: !1, file: !1, line: 162, type: !54, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_symtab*)* @close_symtab, variables: !59)
!59 = !{!60}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !58, file: !1, line: 162, type: !16)
!61 = !DISubprogram(name: "done_symtab", scope: !1, file: !1, line: 166, type: !54, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_symtab*)* @done_symtab, variables: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !61, file: !1, line: 166, type: !16)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !61, file: !1, line: 168, type: !10)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !61, file: !1, line: 169, type: !23)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freeptr", scope: !61, file: !1, line: 169, type: !23)
!67 = !DISubprogram(name: "free_symtab", scope: !1, file: !1, line: 186, type: !54, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_symtab*)* @free_symtab, variables: !68)
!68 = !{!69, !70, !71}
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !67, file: !1, line: 186, type: !16)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !67, file: !1, line: 188, type: !23)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freeptr", scope: !67, file: !1, line: 188, type: !23)
!72 = !DISubprogram(name: "pr_symtab", scope: !1, file: !1, line: 202, type: !73, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i8*, %struct.t_symtab*)* @pr_symtab, variables: !135)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75, !10, !30, !16}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 153, baseType: !78)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !77, line: 122, size: 1216, align: 64, elements: !79)
!79 = !{!80, !83, !84, !85, !87, !88, !93, !94, !95, !99, !103, !113, !119, !120, !123, !124, !128, !132, !133, !134}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !78, file: !77, line: 123, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !78, file: !77, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !78, file: !77, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !77, line: 126, baseType: !86, size: 16, align: 16, offset: 128)
!86 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !78, file: !77, line: 127, baseType: !86, size: 16, align: 16, offset: 144)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !78, file: !77, line: 128, baseType: !89, size: 128, align: 64, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !77, line: 88, size: 128, align: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !89, file: !77, line: 89, baseType: !81, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !89, file: !77, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !78, file: !77, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !78, file: !77, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !78, file: !77, line: 133, baseType: !96, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!10, !4}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !78, file: !77, line: 134, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!10, !4, !30, !10}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !78, file: !77, line: 135, baseType: !104, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !4, !107, !10}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !77, line: 77, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !109, line: 71, baseType: !110)
!109 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !78, file: !77, line: 136, baseType: !114, size: 64, align: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!10, !4, !117, !10}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !78, file: !77, line: 139, baseType: !89, size: 128, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !78, file: !77, line: 140, baseType: !121, size: 64, align: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !77, line: 94, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !78, file: !77, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !78, file: !77, line: 144, baseType: !125, size: 24, align: 8, offset: 928)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 24, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 3)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !78, file: !77, line: 145, baseType: !129, size: 8, align: 8, offset: 952)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 1)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !78, file: !77, line: 148, baseType: !89, size: 128, align: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !78, file: !77, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !77, line: 152, baseType: !107, size: 64, align: 64, offset: 1152)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !72, file: !1, line: 202, type: !75)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indent", arg: 2, scope: !72, file: !1, line: 202, type: !10)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 3, scope: !72, file: !1, line: 202, type: !30)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 4, scope: !72, file: !1, line: 202, type: !16)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !72, file: !1, line: 204, type: !10)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !72, file: !1, line: 204, type: !10)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !72, file: !1, line: 204, type: !10)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !72, file: !1, line: 205, type: !23)
!144 = !DISubprogram(name: "enter_buf", scope: !1, file: !1, line: 116, type: !48, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, variables: !145)
!145 = !{!146, !147, !148, !149, !150}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !144, file: !1, line: 116, type: !16)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !144, file: !1, line: 116, type: !30)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !144, file: !1, line: 118, type: !10)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !144, file: !1, line: 119, type: !23)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bCont", scope: !144, file: !1, line: 120, type: !10)
!151 = !DISubprogram(name: "new_symbuf", scope: !1, file: !1, line: 104, type: !152, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, function: %struct.symbuf* ()* @new_symbuf, variables: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{!23}
!154 = !{!155}
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !151, file: !1, line: 106, type: !23)
!156 = !DISubprogram(name: "trim_string", scope: !1, file: !1, line: 48, type: !157, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, variables: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{!30, !30}
!159 = !{!160, !161, !162}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !156, file: !1, line: 48, type: !30)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !156, file: !1, line: 56, type: !10)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !156, file: !1, line: 56, type: !10)
!163 = !{!164}
!164 = !DIGlobalVariable(name: "buf", scope: !156, file: !1, line: 55, type: !165, isLocal: true, isDefinition: true, variable: [1024 x i8]* @trim_string.buf)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8192, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1024)
!168 = !{i32 2, !"Dwarf Version", i32 2}
!169 = !{i32 2, !"Debug Info Version", i32 700000003}
!170 = !{i32 1, !"PIC Level", i32 2}
!171 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!172 = !DIExpression()
!173 = !DILocation(line: 114, column: 15, scope: !6)
!174 = !DILocation(line: 116, column: 20, scope: !6)
!175 = !DILocation(line: 116, column: 12, scope: !6)
!176 = !DILocation(line: 116, column: 57, scope: !6)
!177 = !DILocation(line: 116, column: 45, scope: !6)
!178 = !DILocation(line: 116, column: 5, scope: !6)
!179 = !DILocation(line: 66, column: 29, scope: !13)
!180 = !DILocation(line: 66, column: 43, scope: !13)
!181 = !DILocation(line: 68, column: 7, scope: !13)
!182 = !DILocation(line: 68, column: 12, scope: !13)
