; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/tables.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }
%struct.t_nblist = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32* }
%struct.t_tabledata = type { i32, i32, float, float*, float*, float* }

@bCoulomb = global [13 x i32] [i32 0, i32 0, i32 0, i32 0, i32 1, i32 1, i32 1, i32 1, i32 0, i32 0, i32 1, i32 0, i32 0], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !25, subprograms: !27, globals: !359, imports: !366)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/tables.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 61, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7, !8}
!5 = !DIEnumerator(name: "etiCOUL", value: 0)
!6 = !DIEnumerator(name: "etiLJ6", value: 1)
!7 = !DIEnumerator(name: "etiLJ12", value: 2)
!8 = !DIEnumerator(name: "etiNR", value: 3)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 45, size: 32, align: 32, elements: !10)
!10 = !{!11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!11 = !DIEnumerator(name: "etabLJ6", value: 0)
!12 = !DIEnumerator(name: "etabLJ12", value: 1)
!13 = !DIEnumerator(name: "etabLJ6Shift", value: 2)
!14 = !DIEnumerator(name: "etabLJ12Shift", value: 3)
!15 = !DIEnumerator(name: "etabShift", value: 4)
!16 = !DIEnumerator(name: "etabRF", value: 5)
!17 = !DIEnumerator(name: "etabCOUL", value: 6)
!18 = !DIEnumerator(name: "etabEwald", value: 7)
!19 = !DIEnumerator(name: "etabLJ6Switch", value: 8)
!20 = !DIEnumerator(name: "etabLJ12Switch", value: 9)
!21 = !DIEnumerator(name: "etabCOULSwitch", value: 10)
!22 = !DIEnumerator(name: "etabEXPMIN", value: 11)
!23 = !DIEnumerator(name: "etabUSER", value: 12)
!24 = !DIEnumerator(name: "etabNR", value: 13)
!25 = !{!26}
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !{!28, !97, !103, !241, !247, !265, !277, !314, !332, !353}
!28 = !DISubprogram(name: "__sputc", scope: !29, file: !29, line: 348, type: !30, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !94)
!29 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !32, !33}
!32 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 153, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !29, line: 122, size: 1216, align: 64, elements: !36)
!36 = !{!37, !40, !41, !42, !44, !45, !50, !51, !53, !57, !62, !72, !78, !79, !82, !83, !87, !91, !92, !93}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !35, file: !29, line: 123, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !35, file: !29, line: 124, baseType: !32, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !35, file: !29, line: 125, baseType: !32, size: 32, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !29, line: 126, baseType: !43, size: 16, align: 16, offset: 128)
!43 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !35, file: !29, line: 127, baseType: !43, size: 16, align: 16, offset: 144)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !35, file: !29, line: 128, baseType: !46, size: 128, align: 64, offset: 192)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !29, line: 88, size: 128, align: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !46, file: !29, line: 89, baseType: !38, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !46, file: !29, line: 90, baseType: !32, size: 32, align: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !35, file: !29, line: 129, baseType: !32, size: 32, align: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !35, file: !29, line: 132, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !35, file: !29, line: 133, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!32, !52}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !35, file: !29, line: 134, baseType: !58, size: 64, align: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!32, !52, !61, !32}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !35, file: !29, line: 135, baseType: !63, size: 64, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !52, !66, !32}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !29, line: 77, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !68, line: 71, baseType: !69)
!68 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!71 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !35, file: !29, line: 136, baseType: !73, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!32, !52, !76, !32}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !35, file: !29, line: 139, baseType: !46, size: 128, align: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !35, file: !29, line: 140, baseType: !80, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !29, line: 94, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !35, file: !29, line: 141, baseType: !32, size: 32, align: 32, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !35, file: !29, line: 144, baseType: !84, size: 24, align: 8, offset: 928)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 24, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 3)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !35, file: !29, line: 145, baseType: !88, size: 8, align: 8, offset: 952)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !35, file: !29, line: 148, baseType: !46, size: 128, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !35, file: !29, line: 151, baseType: !32, size: 32, align: 32, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !29, line: 152, baseType: !66, size: 64, align: 64, offset: 1152)
!94 = !{!95, !96}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !28, file: !29, line: 348, type: !32)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !28, file: !29, line: 348, type: !33)
!97 = !DISubprogram(name: "__sigbits", scope: !98, file: !98, line: 114, type: !99, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !101)
!98 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!99 = !DISubroutineType(types: !100)
!100 = !{!32, !32}
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !97, file: !98, line: 114, type: !32)
!103 = !DISubprogram(name: "make_tables", scope: !1, file: !1, line: 475, type: !104, isLocal: false, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_forcerec*, i32, i8*)* @make_tables, variables: !211)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !33, !106, !32, !61}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_forcerec", file: !108, line: 149, baseType: !109)
!108 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/forcerec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!109 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 43, size: 22784, align: 64, elements: !110)
!110 = !{!111, !112, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158, !159, !160, !161, !163, !164, !167, !168, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !109, file: !108, line: 45, baseType: !32, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !109, file: !108, line: 46, baseType: !113, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !114, line: 87, baseType: !115)
!114 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!115 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rlistlong", scope: !109, file: !108, line: 46, baseType: !113, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "zsquare", scope: !109, file: !108, line: 49, baseType: !113, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !109, file: !108, line: 49, baseType: !113, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !109, file: !108, line: 50, baseType: !113, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "epsfac", scope: !109, file: !108, line: 50, baseType: !113, size: 32, align: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "bRF", scope: !109, file: !108, line: 53, baseType: !32, size: 32, align: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "kappa", scope: !109, file: !108, line: 54, baseType: !113, size: 32, align: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "k_rf", scope: !109, file: !108, line: 54, baseType: !113, size: 32, align: 32, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "c_rf", scope: !109, file: !108, line: 54, baseType: !113, size: 32, align: 32, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "avcsix", scope: !109, file: !108, line: 57, baseType: !113, size: 32, align: 32, offset: 352)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !109, file: !108, line: 60, baseType: !113, size: 32, align: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bcoultab", scope: !109, file: !108, line: 63, baseType: !32, size: 32, align: 32, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bvdwtab", scope: !109, file: !108, line: 64, baseType: !32, size: 32, align: 32, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rtab", scope: !109, file: !108, line: 65, baseType: !113, size: 32, align: 32, offset: 480)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ntab", scope: !109, file: !108, line: 66, baseType: !32, size: 32, align: 32, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !109, file: !108, line: 67, baseType: !113, size: 32, align: 32, offset: 544)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "coultab", scope: !109, file: !108, line: 69, baseType: !133, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtab", scope: !109, file: !108, line: 70, baseType: !133, size: 64, align: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdwtab", scope: !109, file: !108, line: 71, baseType: !133, size: 64, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdw14tab", scope: !109, file: !108, line: 72, baseType: !133, size: 64, align: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !109, file: !108, line: 75, baseType: !113, size: 32, align: 32, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !109, file: !108, line: 75, baseType: !113, size: 32, align: 32, offset: 864)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !109, file: !108, line: 76, baseType: !133, size: 64, align: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !109, file: !108, line: 79, baseType: !113, size: 32, align: 32, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !109, file: !108, line: 79, baseType: !113, size: 32, align: 32, offset: 992)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bham_b_max", scope: !109, file: !108, line: 80, baseType: !113, size: 32, align: 32, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale_exp", scope: !109, file: !108, line: 81, baseType: !113, size: 32, align: 32, offset: 1056)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !109, file: !108, line: 84, baseType: !32, size: 32, align: 32, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !109, file: !108, line: 85, baseType: !113, size: 32, align: 32, offset: 1120)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma6", scope: !109, file: !108, line: 86, baseType: !113, size: 32, align: 32, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bSepDVDL", scope: !109, file: !108, line: 87, baseType: !32, size: 32, align: 32, offset: 1184)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "eeltype", scope: !109, file: !108, line: 90, baseType: !32, size: 32, align: 32, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !109, file: !108, line: 91, baseType: !32, size: 32, align: 32, offset: 1248)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cg0", scope: !109, file: !108, line: 92, baseType: !32, size: 32, align: 32, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "hcg", scope: !109, file: !108, line: 92, baseType: !32, size: 32, align: 32, offset: 1312)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !109, file: !108, line: 93, baseType: !32, size: 32, align: 32, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bSolvOpt", scope: !109, file: !108, line: 94, baseType: !32, size: 32, align: 32, offset: 1376)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOMol", scope: !109, file: !108, line: 95, baseType: !32, size: 32, align: 32, offset: 1408)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOav", scope: !109, file: !108, line: 96, baseType: !156, size: 96, align: 32, offset: 1440)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 96, align: 32, elements: !85)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nWatMol", scope: !109, file: !108, line: 97, baseType: !32, size: 32, align: 32, offset: 1536)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Dimension", scope: !109, file: !108, line: 98, baseType: !32, size: 32, align: 32, offset: 1568)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bGrid", scope: !109, file: !108, line: 99, baseType: !32, size: 32, align: 32, offset: 1600)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !109, file: !108, line: 99, baseType: !32, size: 32, align: 32, offset: 1632)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "solvent_type", scope: !109, file: !108, line: 100, baseType: !162, size: 64, align: 64, offset: 1664)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mno_index", scope: !109, file: !108, line: 101, baseType: !162, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cg_cm", scope: !109, file: !108, line: 102, baseType: !165, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !114, line: 101, baseType: !156)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "shift_vec", scope: !109, file: !108, line: 103, baseType: !165, size: 64, align: 64, offset: 1856)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_sr", scope: !109, file: !108, line: 108, baseType: !169, size: 9984, align: 64, offset: 1920)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 9984, align: 64, elements: !191)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nblist", file: !171, line: 60, baseType: !172)
!171 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nblist.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!172 = !DICompositeType(tag: DW_TAG_structure_type, file: !171, line: 36, size: 768, align: 64, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !184, !185, !186, !187, !188, !189, !190}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "il_code", scope: !172, file: !171, line: 37, baseType: !32, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nri", scope: !172, file: !171, line: 39, baseType: !32, size: 32, align: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "maxnri", scope: !172, file: !171, line: 39, baseType: !32, size: 32, align: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nrj", scope: !172, file: !171, line: 40, baseType: !32, size: 32, align: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "maxnrj", scope: !172, file: !171, line: 40, baseType: !32, size: 32, align: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !172, file: !171, line: 41, baseType: !32, size: 32, align: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "solvent", scope: !172, file: !171, line: 42, baseType: !32, size: 32, align: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "iinr", scope: !172, file: !171, line: 43, baseType: !182, size: 64, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !114, line: 73, baseType: !32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !172, file: !171, line: 44, baseType: !162, size: 64, align: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !172, file: !171, line: 45, baseType: !162, size: 64, align: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "jindex", scope: !172, file: !171, line: 46, baseType: !162, size: 64, align: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "jjnr", scope: !172, file: !171, line: 47, baseType: !182, size: 64, align: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nsatoms", scope: !172, file: !171, line: 48, baseType: !162, size: 64, align: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !172, file: !171, line: 58, baseType: !32, size: 32, align: 32, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !172, file: !171, line: 58, baseType: !162, size: 64, align: 64, offset: 704)
!191 = !{!192}
!192 = !DISubrange(count: 13)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_lr", scope: !109, file: !108, line: 109, baseType: !169, size: 9984, align: 64, offset: 11904)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bTwinRange", scope: !109, file: !108, line: 120, baseType: !32, size: 32, align: 32, offset: 21888)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nlr", scope: !109, file: !108, line: 121, baseType: !32, size: 32, align: 32, offset: 21920)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_twin", scope: !109, file: !108, line: 122, baseType: !165, size: 64, align: 64, offset: 21952)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fshift_twin", scope: !109, file: !108, line: 123, baseType: !165, size: 64, align: 64, offset: 22016)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "f_pme", scope: !109, file: !108, line: 126, baseType: !165, size: 64, align: 64, offset: 22080)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bEwald", scope: !109, file: !108, line: 127, baseType: !32, size: 32, align: 32, offset: 22144)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcoeff", scope: !109, file: !108, line: 128, baseType: !113, size: 32, align: 32, offset: 22176)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !109, file: !108, line: 131, baseType: !165, size: 64, align: 64, offset: 22208)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nmol", scope: !109, file: !108, line: 134, baseType: !32, size: 32, align: 32, offset: 22272)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mol_nr", scope: !109, file: !108, line: 135, baseType: !182, size: 64, align: 64, offset: 22336)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mol_epot", scope: !109, file: !108, line: 136, baseType: !133, size: 64, align: 64, offset: 22400)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nstcalc", scope: !109, file: !108, line: 137, baseType: !32, size: 32, align: 32, offset: 22464)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ntype", scope: !109, file: !108, line: 140, baseType: !32, size: 32, align: 32, offset: 22496)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bBHAM", scope: !109, file: !108, line: 141, baseType: !32, size: 32, align: 32, offset: 22528)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nbfp", scope: !109, file: !108, line: 142, baseType: !133, size: 64, align: 64, offset: 22592)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !109, file: !108, line: 145, baseType: !162, size: 64, align: 64, offset: 22656)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !109, file: !108, line: 148, baseType: !113, size: 32, align: 32, offset: 22720)
!211 = !{!212, !213, !214, !215, !216, !217, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !103, file: !1, line: 475, type: !33)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !103, file: !1, line: 475, type: !106)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 3, scope: !103, file: !1, line: 475, type: !32)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 4, scope: !103, file: !1, line: 475, type: !61)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !103, file: !1, line: 478, type: !33)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "td", scope: !103, file: !1, line: 479, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_tabledata", file: !1, line: 67, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 63, size: 320, align: 64, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !220, file: !1, line: 64, baseType: !32, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nx0", scope: !220, file: !1, line: 64, baseType: !32, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !220, file: !1, line: 65, baseType: !113, size: 32, align: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !220, file: !1, line: 66, baseType: !133, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !220, file: !1, line: 66, baseType: !133, size: 64, align: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !220, file: !1, line: 66, baseType: !133, size: 64, align: 64, offset: 256)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bReadTab", scope: !103, file: !1, line: 480, type: !32)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bGenTab", scope: !103, file: !1, line: 480, type: !32)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x0", scope: !103, file: !1, line: 481, type: !113)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y0", scope: !103, file: !1, line: 481, type: !113)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yp", scope: !103, file: !1, line: 481, type: !113)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rtab", scope: !103, file: !1, line: 481, type: !113)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !103, file: !1, line: 482, type: !32)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !103, file: !1, line: 482, type: !32)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !103, file: !1, line: 482, type: !32)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !103, file: !1, line: 482, type: !32)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx0", scope: !103, file: !1, line: 482, type: !32)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tabsel", scope: !103, file: !1, line: 482, type: !240)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, align: 32, elements: !85)
!241 = !DISubprogram(name: "set_table_type", scope: !1, file: !1, line: 400, type: !242, isLocal: true, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: true, variables: !244)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !162, !106}
!244 = !{!245, !246}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tabsel", arg: 1, scope: !241, file: !1, line: 400, type: !162)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !241, file: !1, line: 400, type: !106)
!247 = !DISubprogram(name: "read_tables", scope: !1, file: !1, line: 153, type: !248, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !250)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !33, !61, !218}
!250 = !{!251, !252, !253, !254, !255, !257, !258, !259, !260, !261, !262, !263, !264}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !247, file: !1, line: 153, type: !33)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !247, file: !1, line: 153, type: !61)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "td", arg: 3, scope: !247, file: !1, line: 153, type: !218)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "libfn", scope: !247, file: !1, line: 155, type: !61)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yy", scope: !247, file: !1, line: 156, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !247, file: !1, line: 157, type: !32)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !247, file: !1, line: 157, type: !32)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !247, file: !1, line: 157, type: !32)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx0", scope: !247, file: !1, line: 157, type: !32)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ny", scope: !247, file: !1, line: 157, type: !32)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nny", scope: !247, file: !1, line: 157, type: !32)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bCont", scope: !247, file: !1, line: 158, type: !32)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tabscale", scope: !247, file: !1, line: 159, type: !113)
