; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/tgroup.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_bin = type { i32, i32, double* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_mdatoms = type { float, i32, float*, float*, float*, float*, float*, float*, float*, i32*, i32*, i32*, i32*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16* }
%struct.t_grpopts = type { i32, i32, i32, i32, float*, float*, float*, [3 x float]*, [3 x i32]*, i32* }
%struct.t_groups = type { %struct.t_grp_ener, %struct.t_grp_tcstat*, %struct.t_grp_acc*, %struct.t_cos_acc }
%struct.t_grp_ener = type { i32, [7 x float*] }
%struct.t_grp_tcstat = type { float, float, [3 x [3 x float]], float, float }
%struct.t_grp_acc = type { i32, i32*, float, [3 x float], [3 x float], [3 x float] }
%struct.t_cos_acc = type { float, float, float }
%struct.t_energy = type { float, double, double, float }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [13 x i8] c"grps->tcstat\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !62, subprograms: !65, globals: !393, imports: !404)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/tgroup.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/group.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13}
!6 = !DIEnumerator(name: "egCOUL", value: 0)
!7 = !DIEnumerator(name: "egLJ", value: 1)
!8 = !DIEnumerator(name: "egBHAM", value: 2)
!9 = !DIEnumerator(name: "egLR", value: 3)
!10 = !DIEnumerator(name: "egLJLR", value: 4)
!11 = !DIEnumerator(name: "egCOUL14", value: 5)
!12 = !DIEnumerator(name: "egLJ14", value: 6)
!13 = !DIEnumerator(name: "egNR", value: 7)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 49, size: 32, align: 32, elements: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!17 = !DIEnumerator(name: "F_BONDS", value: 0)
!18 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!19 = !DIEnumerator(name: "F_MORSE", value: 2)
!20 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!21 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!22 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!23 = !DIEnumerator(name: "F_ANGLES", value: 6)
!24 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!25 = !DIEnumerator(name: "F_PDIHS", value: 8)
!26 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!27 = !DIEnumerator(name: "F_IDIHS", value: 10)
!28 = !DIEnumerator(name: "F_LJ14", value: 11)
!29 = !DIEnumerator(name: "F_COUL14", value: 12)
!30 = !DIEnumerator(name: "F_LJ", value: 13)
!31 = !DIEnumerator(name: "F_BHAM", value: 14)
!32 = !DIEnumerator(name: "F_LJLR", value: 15)
!33 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!34 = !DIEnumerator(name: "F_SR", value: 17)
!35 = !DIEnumerator(name: "F_LR", value: 18)
!36 = !DIEnumerator(name: "F_WPOL", value: 19)
!37 = !DIEnumerator(name: "F_POSRES", value: 20)
!38 = !DIEnumerator(name: "F_DISRES", value: 21)
!39 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!40 = !DIEnumerator(name: "F_ORIRES", value: 23)
!41 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!42 = !DIEnumerator(name: "F_ANGRES", value: 25)
!43 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!44 = !DIEnumerator(name: "F_SHAKE", value: 27)
!45 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!46 = !DIEnumerator(name: "F_SETTLE", value: 29)
!47 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!48 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!49 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!50 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!51 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!52 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!53 = !DIEnumerator(name: "F_EQM", value: 36)
!54 = !DIEnumerator(name: "F_EPOT", value: 37)
!55 = !DIEnumerator(name: "F_EKIN", value: 38)
!56 = !DIEnumerator(name: "F_ETOT", value: 39)
!57 = !DIEnumerator(name: "F_TEMP", value: 40)
!58 = !DIEnumerator(name: "F_PRES", value: 41)
!59 = !DIEnumerator(name: "F_DVDL", value: 42)
!60 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!61 = !DIEnumerator(name: "F_NRE", value: 44)
!62 = !{!63, !64}
!63 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!65 = !{!66, !134, !140, !251, !259, !276, !295, !310, !330, !337, !345, !356, !365, !371, !378, !385}
!66 = !DISubprogram(name: "__sputc", scope: !67, file: !67, line: 348, type: !68, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !131)
!67 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !70, !71}
!70 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !67, line: 153, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !67, line: 122, size: 1216, align: 64, elements: !74)
!74 = !{!75, !78, !79, !80, !82, !83, !88, !89, !90, !94, !99, !109, !115, !116, !119, !120, !124, !128, !129, !130}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !73, file: !67, line: 123, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !73, file: !67, line: 124, baseType: !70, size: 32, align: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !73, file: !67, line: 125, baseType: !70, size: 32, align: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !73, file: !67, line: 126, baseType: !81, size: 16, align: 16, offset: 128)
!81 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !73, file: !67, line: 127, baseType: !81, size: 16, align: 16, offset: 144)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !73, file: !67, line: 128, baseType: !84, size: 128, align: 64, offset: 192)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !67, line: 88, size: 128, align: 64, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !84, file: !67, line: 89, baseType: !76, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !84, file: !67, line: 90, baseType: !70, size: 32, align: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !73, file: !67, line: 129, baseType: !70, size: 32, align: 32, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !73, file: !67, line: 132, baseType: !64, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !73, file: !67, line: 133, baseType: !91, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!70, !64}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !73, file: !67, line: 134, baseType: !95, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!70, !64, !98, !70}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !73, file: !67, line: 135, baseType: !100, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !64, !103, !70}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !67, line: 77, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !105, line: 71, baseType: !106)
!105 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 46, baseType: !108)
!107 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !73, file: !67, line: 136, baseType: !110, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!70, !64, !113, !70}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !73, file: !67, line: 139, baseType: !84, size: 128, align: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !73, file: !67, line: 140, baseType: !117, size: 64, align: 64, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !67, line: 94, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !73, file: !67, line: 141, baseType: !70, size: 32, align: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !73, file: !67, line: 144, baseType: !121, size: 24, align: 8, offset: 928)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 24, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 3)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !73, file: !67, line: 145, baseType: !125, size: 8, align: 8, offset: 952)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !73, file: !67, line: 148, baseType: !84, size: 128, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !73, file: !67, line: 151, baseType: !70, size: 32, align: 32, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !73, file: !67, line: 152, baseType: !103, size: 64, align: 64, offset: 1152)
!131 = !{!132, !133}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !66, file: !67, line: 348, type: !70)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !66, file: !67, line: 348, type: !71)
!134 = !DISubprogram(name: "__sigbits", scope: !135, file: !135, line: 114, type: !136, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !138)
!135 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!136 = !DISubroutineType(types: !137)
!137 = !{!70, !70}
!138 = !{!139}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !134, file: !135, line: 114, type: !70)
!140 = !DISubprogram(name: "init_groups", scope: !1, file: !1, line: 106, type: !141, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_mdatoms*, %struct.t_grpopts*, %struct.t_groups*)* @init_groups, variables: !245)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !71, !143, !178, !199}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !145, line: 51, baseType: !146)
!145 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 40, size: 1408, align: 64, elements: !147)
!147 = !{!148, !152, !153, !155, !156, !157, !158, !159, !160, !161, !163, !164, !165, !166, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !146, file: !145, line: 41, baseType: !149, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !150, line: 87, baseType: !151)
!150 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!151 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !146, file: !145, line: 42, baseType: !70, size: 32, align: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !146, file: !145, line: 43, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !146, file: !145, line: 43, baseType: !154, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !146, file: !145, line: 43, baseType: !154, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !146, file: !145, line: 43, baseType: !154, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !146, file: !145, line: 44, baseType: !154, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !146, file: !145, line: 44, baseType: !154, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !146, file: !145, line: 44, baseType: !154, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !146, file: !145, line: 45, baseType: !162, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !146, file: !145, line: 46, baseType: !162, size: 64, align: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !146, file: !145, line: 47, baseType: !162, size: 64, align: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !146, file: !145, line: 47, baseType: !162, size: 64, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !146, file: !145, line: 48, baseType: !167, size: 64, align: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !146, file: !145, line: 49, baseType: !167, size: 64, align: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !146, file: !145, line: 49, baseType: !167, size: 64, align: 64, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !146, file: !145, line: 49, baseType: !167, size: 64, align: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !146, file: !145, line: 49, baseType: !167, size: 64, align: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !146, file: !145, line: 49, baseType: !167, size: 64, align: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !146, file: !145, line: 49, baseType: !167, size: 64, align: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !146, file: !145, line: 50, baseType: !167, size: 64, align: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !146, file: !145, line: 50, baseType: !167, size: 64, align: 64, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !146, file: !145, line: 50, baseType: !167, size: 64, align: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !180, line: 53, baseType: !181)
!180 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 42, size: 512, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !194, !198}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !181, file: !180, line: 43, baseType: !70, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !181, file: !180, line: 44, baseType: !70, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !181, file: !180, line: 45, baseType: !70, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !181, file: !180, line: 46, baseType: !70, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !181, file: !180, line: 47, baseType: !154, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !181, file: !180, line: 48, baseType: !154, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !181, file: !180, line: 49, baseType: !154, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !181, file: !180, line: 50, baseType: !191, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !150, line: 101, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 96, align: 32, elements: !122)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !181, file: !180, line: 51, baseType: !195, size: 64, align: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !150, line: 107, baseType: !197)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 96, align: 32, elements: !122)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !181, file: !180, line: 52, baseType: !162, size: 64, align: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_groups", file: !4, line: 72, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 67, size: 768, align: 64, elements: !202)
!202 = !{!203, !212, !225, !238}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "estat", scope: !201, file: !4, line: 68, baseType: !204, size: 512, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_ener", file: !4, line: 50, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 46, size: 512, align: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nn", scope: !205, file: !4, line: 47, baseType: !70, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !205, file: !4, line: 48, baseType: !209, size: 448, align: 64, offset: 64)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 448, align: 64, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tcstat", scope: !201, file: !4, line: 69, baseType: !213, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_tcstat", file: !4, line: 44, baseType: !215)
!215 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 38, size: 416, align: 32, elements: !216)
!216 = !{!217, !218, !219, !223, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !215, file: !4, line: 39, baseType: !149, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !215, file: !4, line: 40, baseType: !149, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ekin", scope: !215, file: !4, line: 41, baseType: !220, size: 288, align: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !150, line: 105, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 288, align: 32, elements: !222)
!222 = !{!123, !123}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !215, file: !4, line: 42, baseType: !149, size: 32, align: 32, offset: 352)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !215, file: !4, line: 43, baseType: !149, size: 32, align: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "grpstat", scope: !201, file: !4, line: 70, baseType: !226, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_acc", file: !4, line: 59, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 52, size: 448, align: 64, elements: !229)
!229 = !{!230, !231, !234, !235, !236, !237}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nat", scope: !228, file: !4, line: 53, baseType: !70, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "aid", scope: !228, file: !4, line: 54, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !150, line: 73, baseType: !70)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !228, file: !4, line: 55, baseType: !149, size: 32, align: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !228, file: !4, line: 56, baseType: !192, size: 96, align: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "uold", scope: !228, file: !4, line: 57, baseType: !192, size: 96, align: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ut", scope: !228, file: !4, line: 58, baseType: !192, size: 96, align: 32, offset: 352)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cosacc", scope: !201, file: !4, line: 71, baseType: !239, size: 96, align: 32, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cos_acc", file: !4, line: 65, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 61, size: 96, align: 32, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !240, file: !4, line: 62, baseType: !149, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mvcos", scope: !240, file: !4, line: 63, baseType: !149, size: 32, align: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vcos", scope: !240, file: !4, line: 64, baseType: !149, size: 32, align: 32, offset: 64)
!245 = !{!246, !247, !248, !249, !250}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !140, file: !1, line: 106, type: !71)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 2, scope: !140, file: !1, line: 106, type: !143)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 3, scope: !140, file: !1, line: 106, type: !178)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 4, scope: !140, file: !1, line: 106, type: !199)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !140, file: !1, line: 108, type: !70)
!251 = !DISubprogram(name: "dump_estat", scope: !1, file: !1, line: 122, type: !252, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_grp_ener*)* @dump_estat, variables: !255)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !71, !254}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!255 = !{!256, !257, !258}
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !251, file: !1, line: 122, type: !71)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "estat", arg: 2, scope: !251, file: !1, line: 122, type: !254)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !251, file: !1, line: 124, type: !70)
!259 = !DISubprogram(name: "rms_ener", scope: !1, file: !1, line: 132, type: !260, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.t_energy*, i32)* @rms_ener, variables: !272)
!260 = !DISubroutineType(types: !261)
!261 = !{!149, !262, !70}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_energy", file: !264, line: 41, baseType: !265)
!264 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/energy.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!265 = !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 36, size: 256, align: 64, elements: !266)
!266 = !{!267, !268, !270, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !265, file: !264, line: 37, baseType: !149, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "eav", scope: !265, file: !264, line: 38, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "esum", scope: !265, file: !264, line: 39, baseType: !269, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "e2sum", scope: !265, file: !264, line: 40, baseType: !149, size: 32, align: 32, offset: 192)
!272 = !{!273, !274, !275}
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e", arg: 1, scope: !259, file: !1, line: 132, type: !262)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsteps", arg: 2, scope: !259, file: !1, line: 132, type: !70)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "erms2", scope: !259, file: !1, line: 134, type: !149)
!276 = !DISubprogram(name: "accumulate_u", scope: !1, file: !1, line: 143, type: !277, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_commrec*, %struct.t_grpopts*, %struct.t_groups*)* @accumulate_u, variables: !290)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !178, !199}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !281, line: 40, baseType: !282)
!281 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!282 = !DICompositeType(tag: DW_TAG_structure_type, file: !281, line: 36, size: 192, align: 32, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !282, file: !281, line: 37, baseType: !70, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !282, file: !281, line: 37, baseType: !70, size: 32, align: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !282, file: !281, line: 38, baseType: !70, size: 32, align: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !282, file: !281, line: 38, baseType: !70, size: 32, align: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !282, file: !281, line: 39, baseType: !70, size: 32, align: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !282, file: !281, line: 39, baseType: !70, size: 32, align: 32, offset: 160)
!290 = !{!291, !292, !293, !294}
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 1, scope: !276, file: !1, line: 143, type: !279)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 2, scope: !276, file: !1, line: 143, type: !178)
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 3, scope: !276, file: !1, line: 143, type: !199)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !276, file: !1, line: 147, type: !70)
!295 = !DISubprogram(name: "update_grps", scope: !1, file: !1, line: 173, type: !296, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct.t_groups*, %struct.t_grpopts*, [3 x float]*, %struct.t_mdatoms*, i32)* @update_grps, variables: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !70, !70, !199, !178, !191, !143, !70}
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 1, scope: !295, file: !1, line: 173, type: !70)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 2, scope: !295, file: !1, line: 173, type: !70)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 3, scope: !295, file: !1, line: 173, type: !199)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 4, scope: !295, file: !1, line: 174, type: !178)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 5, scope: !295, file: !1, line: 174, type: !191)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 6, scope: !295, file: !1, line: 174, type: !143)
!305 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bNEMD", arg: 7, scope: !295, file: !1, line: 174, type: !70)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !295, file: !1, line: 176, type: !70)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !295, file: !1, line: 176, type: !70)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !295, file: !1, line: 176, type: !70)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !295, file: !1, line: 177, type: !149)
!310 = !DISubprogram(name: "sum_ekin", scope: !1, file: !1, line: 204, type: !311, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.t_grpopts*, %struct.t_groups*, [3 x float]*, i32)* @sum_ekin, variables: !314)
!311 = !DISubroutineType(types: !312)
!312 = !{!149, !178, !199, !313, !70}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 1, scope: !310, file: !1, line: 204, type: !178)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 2, scope: !310, file: !1, line: 204, type: !199)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ekin", arg: 3, scope: !310, file: !1, line: 204, type: !313)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bTYZ", arg: 4, scope: !310, file: !1, line: 204, type: !70)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !310, file: !1, line: 206, type: !70)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !310, file: !1, line: 206, type: !70)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngtc", scope: !310, file: !1, line: 206, type: !70)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !310, file: !1, line: 207, type: !149)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndfac", scope: !310, file: !1, line: 207, type: !149)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ek", scope: !310, file: !1, line: 207, type: !149)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tfac", scope: !310, file: !1, line: 208, type: !192)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tcstat", scope: !310, file: !1, line: 209, type: !213)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrdf", scope: !310, file: !1, line: 210, type: !149)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd", scope: !310, file: !1, line: 210, type: !149)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndf", scope: !310, file: !1, line: 210, type: !154)
!330 = !DISubprogram(name: "sum_epot", scope: !1, file: !1, line: 269, type: !331, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_grpopts*, %struct.t_groups*, float*)* @sum_epot, variables: !333)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !178, !199, !154}
!333 = !{!334, !335, !336}
!334 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 1, scope: !330, file: !1, line: 269, type: !178)
!335 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 2, scope: !330, file: !1, line: 269, type: !199)
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "epot", arg: 3, scope: !330, file: !1, line: 269, type: !154)
!337 = !DISubprogram(name: "init_grptcstat", scope: !1, file: !1, line: 47, type: !338, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, variables: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !70, !213}
!340 = !{!341, !342, !343, !344}
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngtc", arg: 1, scope: !337, file: !1, line: 47, type: !70)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcstat", arg: 2, scope: !337, file: !1, line: 47, type: !213)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !337, file: !1, line: 49, type: !70)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !337, file: !1, line: 49, type: !70)
!345 = !DISubprogram(name: "init_grpstat", scope: !1, file: !1, line: 59, type: !346, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, variables: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !71, !143, !70, !226}
!348 = !{!349, !350, !351, !352, !353, !354, !355}
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !345, file: !1, line: 59, type: !71)
!350 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 2, scope: !345, file: !1, line: 60, type: !143)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngacc", arg: 3, scope: !345, file: !1, line: 60, type: !70)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gstat", arg: 4, scope: !345, file: !1, line: 60, type: !226)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !345, file: !1, line: 62, type: !70)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !345, file: !1, line: 62, type: !70)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grp", scope: !345, file: !1, line: 62, type: !70)
!356 = !DISubprogram(name: "init_grpener", scope: !1, file: !1, line: 92, type: !357, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, variables: !359)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !71, !70, !254}
!359 = !{!360, !361, !362, !363, !364}
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !356, file: !1, line: 92, type: !71)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngener", arg: 2, scope: !356, file: !1, line: 92, type: !70)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "estat", arg: 3, scope: !356, file: !1, line: 92, type: !254)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !356, file: !1, line: 94, type: !70)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !356, file: !1, line: 94, type: !70)
!365 = !DISubprogram(name: "clear_rvec", scope: !366, file: !366, line: 316, type: !367, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, variables: !369)
!366 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!367 = !DISubroutineType(types: !368)
!368 = !{null, !154}
!369 = !{!370}
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !365, file: !366, line: 316, type: !154)
!371 = !DISubprogram(name: "clear_mat", scope: !366, file: !366, line: 334, type: !372, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, variables: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !313}
!374 = !{!375, !376}
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !371, file: !366, line: 334, type: !313)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nul", scope: !371, file: !366, line: 336, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!378 = !DISubprogram(name: "m_add", scope: !366, file: !366, line: 485, type: !379, isLocal: true, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, variables: !381)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !313, !313, !313}
!381 = !{!382, !383, !384}
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !378, file: !366, line: 485, type: !313)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !378, file: !366, line: 485, type: !313)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 3, scope: !378, file: !366, line: 485, type: !313)
!385 = !DISubprogram(name: "sum_v", scope: !1, file: !1, line: 256, type: !386, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, variables: !388)
!386 = !DISubroutineType(types: !387)
!387 = !{!149, !70, !154}
!388 = !{!389, !390, !391, !392}
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !385, file: !1, line: 256, type: !70)
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !385, file: !1, line: 256, type: !154)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !385, file: !1, line: 258, type: !149)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !385, file: !1, line: 259, type: !70)
!393 = !{!394}
!394 = !DIGlobalVariable(name: "rb", scope: !276, file: !1, line: 146, type: !395, isLocal: true, isDefinition: true, variable: %struct.t_bin** @accumulate_u.rb)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_bin", file: !397, line: 49, baseType: !398)
!397 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/rbin.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 45, size: 128, align: 64, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nreal", scope: !398, file: !397, line: 46, baseType: !70, size: 32, align: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "maxreal", scope: !398, file: !397, line: 47, baseType: !70, size: 32, align: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !398, file: !397, line: 48, baseType: !403, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!404 = !{}
!405 = !{i32 2, !"Dwarf Version", i32 2}
!406 = !{i32 2, !"Debug Info Version", i32 700000003}
!407 = !{i32 1, !"PIC Level", i32 2}
!408 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!409 = !DIExpression()
!410 = !DILocation(line: 348, column: 40, scope: !66)
!411 = !DILocation(line: 348, column: 50, scope: !66)
!412 = !DILocation(line: 349, column: 12, scope: !413)
!413 = distinct !DILexicalBlock(scope: !66, file: !67, line: 349, column: 6)
!414 = !DILocation(line: 349, column: 6, scope: !413)
!415 = !{!416, !420, i64 12}
!416 = !{!"__sFILE", !417, i64 0, !420, i64 8, !420, i64 12, !421, i64 16, !421, i64 18, !422, i64 24, !420, i64 40, !417, i64 48, !417, i64 56, !417, i64 64, !417, i64 72, !417, i64 80, !422, i64 88, !417, i64 104, !420, i64 112, !418, i64 116, !418, i64 119, !422, i64 120, !420, i64 136, !423, i64 144}
!417 = !{!"any pointer", !418, i64 0}
!418 = !{!"omnipotent char", !419, i64 0}
!419 = !{!"Simple C/C++ TBAA"}
!420 = !{!"int", !418, i64 0}
!421 = !{!"short", !418, i64 0}
!422 = !{!"__sbuf", !417, i64 0, !420, i64 8}
!423 = !{!"long long", !418, i64 0}
!424 = !DILocation(line: 349, column: 15, scope: !413)
!425 = !DILocation(line: 349, column: 20, scope: !413)
!426 = !DILocation(line: 350, column: 10, scope: !413)
!427 = !DILocation(line: 349, column: 38, scope: !413)
!428 = !{!416, !420, i64 40}
!429 = !DILocation(line: 349, column: 31, scope: !413)
!430 = !DILocation(line: 349, column: 59, scope: !413)
!431 = !DILocation(line: 349, column: 47, scope: !413)
!432 = !DILocation(line: 350, column: 23, scope: !413)
!433 = !DILocation(line: 350, column: 16, scope: !413)
!434 = !DILocation(line: 350, column: 18, scope: !413)
!435 = !{!416, !417, i64 0}
!436 = !DILocation(line: 350, column: 21, scope: !413)
!437 = !{!418, !418, i64 0}
!438 = !DILocation(line: 350, column: 3, scope: !413)
!439 = !DILocation(line: 352, column: 11, scope: !413)
!440 = !DILocation(line: 352, column: 3, scope: !413)
!441 = !DILocation(line: 353, column: 1, scope: !66)
!442 = !DILocation(line: 114, column: 15, scope: !134)
!443 = !DILocation(line: 116, column: 20, scope: !134)
!444 = !DILocation(line: 116, column: 12, scope: !134)
!445 = !DILocation(line: 116, column: 57, scope: !134)
!446 = !DILocation(line: 116, column: 45, scope: !134)
!447 = !DILocation(line: 116, column: 5, scope: !134)
!448 = !DILocation(line: 106, column: 24, scope: !140)
!449 = !DILocation(line: 106, column: 39, scope: !140)
!450 = !DILocation(line: 106, column: 53, scope: !140)
!451 = !DILocation(line: 106, column: 68, scope: !140)
!452 = !DILocation(line: 113, column: 3, scope: !140)
!453 = !{!454, !420, i64 0}
!454 = !{!"", !420, i64 0, !420, i64 4, !420, i64 8, !420, i64 12, !417, i64 16, !417, i64 24, !417, i64 32, !417, i64 40, !417, i64 48, !417, i64 56}
!455 = !{!456, !417, i64 64}
!456 = !{!"", !457, i64 0, !417, i64 64, !417, i64 72, !458, i64 80}
!457 = !{!"", !420, i64 0, !418, i64 8}
!458 = !{!"", !459, i64 0, !459, i64 4, !459, i64 8}
!459 = !{!"float", !418, i64 0}
!460 = !DILocation(line: 114, column: 24, scope: !140)
!461 = !DILocation(line: 47, column: 32, scope: !337, inlinedAt: !462)
!462 = distinct !DILocation(line: 114, column: 3, scope: !140)
!463 = !DILocation(line: 47, column: 50, scope: !337, inlinedAt: !462)
!464 = !DILocation(line: 49, column: 7, scope: !337, inlinedAt: !462)
!465 = !DILocation(line: 51, column: 14, scope: !466, inlinedAt: !462)
!466 = distinct !DILexicalBlock(scope: !467, file: !1, line: 51, column: 3)
!467 = distinct !DILexicalBlock(scope: !337, file: !1, line: 51, column: 3)
!468 = !DILocation(line: 51, column: 3, scope: !467, inlinedAt: !462)
!469 = !DILocation(line: 114, column: 3, scope: !140)
!470 = !DILocation(line: 52, column: 15, scope: !471, inlinedAt: !462)
