; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/tpxio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_ftupd = type { i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }

!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 91, size: 32, align: 32, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIEnumerator(name: "edrwConservative", value: 0)
!108 = !DIEnumerator(name: "edrwEqual", value: 1)
!109 = !DIEnumerator(name: "edrwNR", value: 2)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 38, size: 32, align: 32, elements: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DIEnumerator(name: "ebCGS", value: 0)
!113 = !DIEnumerator(name: "ebMOLS", value: 1)
!114 = !DIEnumerator(name: "ebSBLOCKS", value: 2)
!115 = !DIEnumerator(name: "ebNR", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 41, size: 32, align: 32, elements: !118)
!117 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!119 = !DIEnumerator(name: "egcTC", value: 0)
!120 = !DIEnumerator(name: "egcENER", value: 1)
!121 = !DIEnumerator(name: "egcACC", value: 2)
!122 = !DIEnumerator(name: "egcFREEZE", value: 3)
!123 = !DIEnumerator(name: "egcUser1", value: 4)
!124 = !DIEnumerator(name: "egcUser2", value: 5)
!125 = !DIEnumerator(name: "egcVCM", value: 6)
!126 = !DIEnumerator(name: "egcXTC", value: 7)
!127 = !DIEnumerator(name: "egcORFIT", value: 8)
!128 = !DIEnumerator(name: "egcNR", value: 9)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !130, line: 49, size: 32, align: 32, elements: !131)
!130 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!132 = !DIEnumerator(name: "F_BONDS", value: 0)
!133 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!134 = !DIEnumerator(name: "F_MORSE", value: 2)
!135 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!136 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!137 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!138 = !DIEnumerator(name: "F_ANGLES", value: 6)
!139 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!140 = !DIEnumerator(name: "F_PDIHS", value: 8)
!141 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!142 = !DIEnumerator(name: "F_IDIHS", value: 10)
!143 = !DIEnumerator(name: "F_LJ14", value: 11)
!144 = !DIEnumerator(name: "F_COUL14", value: 12)
!145 = !DIEnumerator(name: "F_LJ", value: 13)
!146 = !DIEnumerator(name: "F_BHAM", value: 14)
!147 = !DIEnumerator(name: "F_LJLR", value: 15)
!148 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!149 = !DIEnumerator(name: "F_SR", value: 17)
!150 = !DIEnumerator(name: "F_LR", value: 18)
!151 = !DIEnumerator(name: "F_WPOL", value: 19)
!152 = !DIEnumerator(name: "F_POSRES", value: 20)
!153 = !DIEnumerator(name: "F_DISRES", value: 21)
!154 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!155 = !DIEnumerator(name: "F_ORIRES", value: 23)
!156 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!157 = !DIEnumerator(name: "F_ANGRES", value: 25)
!158 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!159 = !DIEnumerator(name: "F_SHAKE", value: 27)
!160 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!161 = !DIEnumerator(name: "F_SETTLE", value: 29)
!162 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!163 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!164 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!165 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!166 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!167 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!168 = !DIEnumerator(name: "F_EQM", value: 36)
!169 = !DIEnumerator(name: "F_EPOT", value: 37)
!170 = !DIEnumerator(name: "F_EKIN", value: 38)
!171 = !DIEnumerator(name: "F_ETOT", value: 39)
!172 = !DIEnumerator(name: "F_TEMP", value: 40)
!173 = !DIEnumerator(name: "F_PRES", value: 41)
!174 = !DIEnumerator(name: "F_DVDL", value: 42)
!175 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!176 = !DIEnumerator(name: "F_NRE", value: 44)
!177 = !{!178, !179, !180}
!178 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!179 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!181 = !{!182, !249, !255, !262, !268, !274, !277, !280, !283, !286, !289, !292, !301, !310, !323, !326, !329, !332, !346, !360, !366, !372, !386, !519, !525, !530, !552, !800, !816, !831, !846, !851, !872, !878, !888, !907, !982, !990, !997, !1008, !1016, !1025, !1032, !1041, !1060, !1077, !1097, !1121}
!182 = !DISubprogram(name: "__sputc", scope: !183, file: !183, line: 348, type: !184, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !246)
!183 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!184 = !DISubroutineType(types: !185)
!185 = !{!179, !179, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !183, line: 153, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !183, line: 122, size: 1216, align: 64, elements: !189)
!189 = !{!190, !193, !194, !195, !197, !198, !203, !204, !205, !209, !214, !224, !230, !231, !234, !235, !239, !243, !244, !245}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !188, file: !183, line: 123, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !188, file: !183, line: 124, baseType: !179, size: 32, align: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !188, file: !183, line: 125, baseType: !179, size: 32, align: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !188, file: !183, line: 126, baseType: !196, size: 16, align: 16, offset: 128)
!196 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !188, file: !183, line: 127, baseType: !196, size: 16, align: 16, offset: 144)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !188, file: !183, line: 128, baseType: !199, size: 128, align: 64, offset: 192)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !183, line: 88, size: 128, align: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !199, file: !183, line: 89, baseType: !191, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !199, file: !183, line: 90, baseType: !179, size: 32, align: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !188, file: !183, line: 129, baseType: !179, size: 32, align: 32, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !188, file: !183, line: 132, baseType: !180, size: 64, align: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !188, file: !183, line: 133, baseType: !206, size: 64, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!179, !180}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !188, file: !183, line: 134, baseType: !210, size: 64, align: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!179, !180, !213, !179}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !188, file: !183, line: 135, baseType: !215, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !180, !218, !179}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !183, line: 77, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !220, line: 71, baseType: !221)
!220 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !222, line: 46, baseType: !223)
!222 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!223 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !188, file: !183, line: 136, baseType: !225, size: 64, align: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!179, !180, !228, !179}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !188, file: !183, line: 139, baseType: !199, size: 128, align: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !188, file: !183, line: 140, baseType: !232, size: 64, align: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !183, line: 94, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !188, file: !183, line: 141, baseType: !179, size: 32, align: 32, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !188, file: !183, line: 144, baseType: !236, size: 24, align: 8, offset: 928)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 24, align: 8, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !188, file: !183, line: 145, baseType: !240, size: 8, align: 8, offset: 952)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 8, align: 8, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 1)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !188, file: !183, line: 148, baseType: !199, size: 128, align: 64, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !188, file: !183, line: 151, baseType: !179, size: 32, align: 32, offset: 1088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !188, file: !183, line: 152, baseType: !218, size: 64, align: 64, offset: 1152)
!246 = !{!247, !248}
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !182, file: !183, line: 348, type: !179)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !182, file: !183, line: 348, type: !186)
!249 = !DISubprogram(name: "__sigbits", scope: !250, file: !250, line: 114, type: !251, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !253)
!250 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!251 = !DISubroutineType(types: !252)
!252 = !{!179, !179}
!253 = !{!254}
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !249, file: !250, line: 114, type: !179)
!255 = !DISubprogram(name: "__inline_isfinitef", scope: !256, file: !256, line: 204, type: !257, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !260)
!256 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!257 = !DISubroutineType(types: !258)
!258 = !{!179, !259}
!259 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!260 = !{!261}
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !255, file: !256, line: 204, type: !259)
!262 = !DISubprogram(name: "__inline_isfinited", scope: !256, file: !256, line: 207, type: !263, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !266)
!263 = !DISubroutineType(types: !264)
!264 = !{!179, !265}
!265 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!266 = !{!267}
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !262, file: !256, line: 207, type: !265)
!268 = !DISubprogram(name: "__inline_isfinitel", scope: !256, file: !256, line: 210, type: !269, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !272)
!269 = !DISubroutineType(types: !270)
!270 = !{!179, !271}
!271 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!272 = !{!273}
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !268, file: !256, line: 210, type: !271)
!274 = !DISubprogram(name: "__inline_isinff", scope: !256, file: !256, line: 213, type: !257, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !275)
!275 = !{!276}
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !274, file: !256, line: 213, type: !259)
!277 = !DISubprogram(name: "__inline_isinfd", scope: !256, file: !256, line: 216, type: !263, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !278)
!278 = !{!279}
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !277, file: !256, line: 216, type: !265)
!280 = !DISubprogram(name: "__inline_isinfl", scope: !256, file: !256, line: 219, type: !269, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !281)
!281 = !{!282}
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !280, file: !256, line: 219, type: !271)
!283 = !DISubprogram(name: "__inline_isnanf", scope: !256, file: !256, line: 222, type: !257, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !284)
!284 = !{!285}
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !283, file: !256, line: 222, type: !259)
!286 = !DISubprogram(name: "__inline_isnand", scope: !256, file: !256, line: 225, type: !263, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !287)
!287 = !{!288}
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !286, file: !256, line: 225, type: !265)
!289 = !DISubprogram(name: "__inline_isnanl", scope: !256, file: !256, line: 228, type: !269, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !290)
!290 = !{!291}
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !289, file: !256, line: 228, type: !271)
!292 = !DISubprogram(name: "__inline_signbitf", scope: !256, file: !256, line: 231, type: !257, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !293)
!293 = !{!294, !295}
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !292, file: !256, line: 231, type: !259)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !292, file: !256, line: 232, type: !296)
!296 = !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !256, line: 232, size: 32, align: 32, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !296, file: !256, line: 232, baseType: !259, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !296, file: !256, line: 232, baseType: !300, size: 32, align: 32)
!300 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!301 = !DISubprogram(name: "__inline_signbitd", scope: !256, file: !256, line: 236, type: !263, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !302)
!302 = !{!303, !304}
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !301, file: !256, line: 236, type: !265)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !301, file: !256, line: 237, type: !305)
!305 = !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !256, line: 237, size: 64, align: 64, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !305, file: !256, line: 237, baseType: !265, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !305, file: !256, line: 237, baseType: !309, size: 64, align: 64)
!309 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!310 = !DISubprogram(name: "__inline_signbitl", scope: !256, file: !256, line: 242, type: !269, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !311)
!311 = !{!312, !313}
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !310, file: !256, line: 242, type: !271)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !310, file: !256, line: 246, type: !314)
!314 = !DICompositeType(tag: DW_TAG_union_type, scope: !310, file: !256, line: 243, size: 128, align: 128, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !314, file: !256, line: 244, baseType: !271, size: 128, align: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !314, file: !256, line: 245, baseType: !318, size: 128, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !256, line: 245, size: 128, align: 64, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !318, file: !256, line: 245, baseType: !309, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !318, file: !256, line: 245, baseType: !322, size: 16, align: 16, offset: 64)
!322 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!323 = !DISubprogram(name: "__inline_isnormalf", scope: !256, file: !256, line: 257, type: !257, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !324)
!324 = !{!325}
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !323, file: !256, line: 257, type: !259)
!326 = !DISubprogram(name: "__inline_isnormald", scope: !256, file: !256, line: 260, type: !263, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !327)
!327 = !{!328}
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !326, file: !256, line: 260, type: !265)
!329 = !DISubprogram(name: "__inline_isnormall", scope: !256, file: !256, line: 263, type: !269, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !330)
!330 = !{!331}
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !329, file: !256, line: 263, type: !271)
!332 = !DISubprogram(name: "__sincosf", scope: !256, file: !256, line: 642, type: !333, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !336)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !259, !335, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!336 = !{!337, !338, !339, !340}
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !332, file: !256, line: 642, type: !259)
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !332, file: !256, line: 642, type: !335)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !332, file: !256, line: 642, type: !335)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !332, file: !256, line: 643, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !256, line: 634, size: 64, align: 32, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !342, file: !256, line: 634, baseType: !259, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !342, file: !256, line: 634, baseType: !259, size: 32, align: 32, offset: 32)
!346 = !DISubprogram(name: "__sincos", scope: !256, file: !256, line: 647, type: !347, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !350)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !265, !349, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!350 = !{!351, !352, !353, !354}
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !346, file: !256, line: 647, type: !265)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !346, file: !256, line: 647, type: !349)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !346, file: !256, line: 647, type: !349)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !346, file: !256, line: 648, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !256, line: 635, size: 128, align: 64, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !356, file: !256, line: 635, baseType: !265, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !356, file: !256, line: 635, baseType: !265, size: 64, align: 64, offset: 64)
!360 = !DISubprogram(name: "__sincospif", scope: !256, file: !256, line: 652, type: !333, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !360, file: !256, line: 652, type: !259)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !360, file: !256, line: 652, type: !335)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !360, file: !256, line: 652, type: !335)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !360, file: !256, line: 653, type: !341)
!366 = !DISubprogram(name: "__sincospi", scope: !256, file: !256, line: 657, type: !347, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !367)
!367 = !{!368, !369, !370, !371}
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !366, file: !256, line: 657, type: !265)
!369 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !366, file: !256, line: 657, type: !349)
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !366, file: !256, line: 657, type: !349)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !366, file: !256, line: 658, type: !355)
!372 = !DISubprogram(name: "_do_section", scope: !1, file: !1, line: 81, type: !373, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i8*, i32)* @_do_section, variables: !375)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !179, !179, !179, !213, !179}
!375 = !{!376, !377, !378, !379, !380, !381, !385}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !372, file: !1, line: 81, type: !179)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !372, file: !1, line: 81, type: !179)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 3, scope: !372, file: !1, line: 81, type: !179)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 4, scope: !372, file: !1, line: 81, type: !213)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 5, scope: !372, file: !1, line: 81, type: !179)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !372, file: !1, line: 83, type: !382)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 32768, align: 8, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 4096)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bDbg", scope: !372, file: !1, line: 84, type: !179)
!386 = !DISubprogram(name: "do_iparams", scope: !1, file: !1, line: 374, type: !387, isLocal: false, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %union.t_iparams*, i32)* @do_iparams, variables: !504)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !389, !390, !179}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !130, line: 133, baseType: !179)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !130, line: 131, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_union_type, file: !130, line: 97, size: 192, align: 32, elements: !393)
!393 = !{!394, !402, !409, !415, !424, !429, !436, !444, !449, !454, !460, !466, !473, !482, !491, !500}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !392, file: !130, line: 105, baseType: !395, size: 96, align: 32)
!395 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 105, size: 96, align: 32, elements: !396)
!396 = !{!397, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !395, file: !130, line: 105, baseType: !398, size: 32, align: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !399, line: 87, baseType: !259)
!399 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !395, file: !130, line: 105, baseType: !398, size: 32, align: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !395, file: !130, line: 105, baseType: !398, size: 32, align: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !392, file: !130, line: 106, baseType: !403, size: 128, align: 32)
!403 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 106, size: 128, align: 32, elements: !404)
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !403, file: !130, line: 106, baseType: !398, size: 32, align: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !403, file: !130, line: 106, baseType: !398, size: 32, align: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !403, file: !130, line: 106, baseType: !398, size: 32, align: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !403, file: !130, line: 106, baseType: !398, size: 32, align: 32, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !392, file: !130, line: 108, baseType: !410, size: 96, align: 32)
!410 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 108, size: 96, align: 32, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !410, file: !130, line: 108, baseType: !398, size: 32, align: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !410, file: !130, line: 108, baseType: !398, size: 32, align: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !410, file: !130, line: 108, baseType: !398, size: 32, align: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !392, file: !130, line: 110, baseType: !416, size: 192, align: 32)
!416 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 110, size: 192, align: 32, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !416, file: !130, line: 110, baseType: !398, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !416, file: !130, line: 110, baseType: !398, size: 32, align: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !416, file: !130, line: 110, baseType: !398, size: 32, align: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !416, file: !130, line: 110, baseType: !398, size: 32, align: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !416, file: !130, line: 110, baseType: !398, size: 32, align: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !416, file: !130, line: 110, baseType: !398, size: 32, align: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !392, file: !130, line: 111, baseType: !425, size: 64, align: 32)
!425 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 111, size: 64, align: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !425, file: !130, line: 111, baseType: !398, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !425, file: !130, line: 111, baseType: !398, size: 32, align: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !392, file: !130, line: 112, baseType: !430, size: 128, align: 32)
!430 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 112, size: 128, align: 32, elements: !431)
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !430, file: !130, line: 112, baseType: !398, size: 32, align: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !430, file: !130, line: 112, baseType: !398, size: 32, align: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !430, file: !130, line: 112, baseType: !398, size: 32, align: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !430, file: !130, line: 112, baseType: !398, size: 32, align: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !392, file: !130, line: 117, baseType: !437, size: 160, align: 32)
!437 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 117, size: 160, align: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !437, file: !130, line: 117, baseType: !398, size: 32, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !437, file: !130, line: 117, baseType: !398, size: 32, align: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !437, file: !130, line: 117, baseType: !179, size: 32, align: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !437, file: !130, line: 117, baseType: !398, size: 32, align: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !437, file: !130, line: 117, baseType: !398, size: 32, align: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !392, file: !130, line: 118, baseType: !445, size: 64, align: 32)
!445 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 118, size: 64, align: 32, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !445, file: !130, line: 118, baseType: !398, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !445, file: !130, line: 118, baseType: !398, size: 32, align: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !392, file: !130, line: 123, baseType: !450, size: 64, align: 32)
!450 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 123, size: 64, align: 32, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !450, file: !130, line: 123, baseType: !398, size: 32, align: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !450, file: !130, line: 123, baseType: !398, size: 32, align: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !392, file: !130, line: 124, baseType: !455, size: 96, align: 32)
!455 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 124, size: 96, align: 32, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !455, file: !130, line: 124, baseType: !398, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !455, file: !130, line: 124, baseType: !398, size: 32, align: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !455, file: !130, line: 124, baseType: !398, size: 32, align: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !392, file: !130, line: 125, baseType: !461, size: 192, align: 32)
!461 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 125, size: 192, align: 32, elements: !462)
!462 = !{!463, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !461, file: !130, line: 125, baseType: !464, size: 96, align: 32)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 96, align: 32, elements: !237)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !461, file: !130, line: 125, baseType: !464, size: 96, align: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !392, file: !130, line: 126, baseType: !467, size: 192, align: 32)
!467 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 126, size: 192, align: 32, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !467, file: !130, line: 126, baseType: !470, size: 192, align: 32)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 192, align: 32, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 6)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !392, file: !130, line: 127, baseType: !474, size: 192, align: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 127, size: 192, align: 32, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !474, file: !130, line: 127, baseType: !398, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !474, file: !130, line: 127, baseType: !398, size: 32, align: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !474, file: !130, line: 127, baseType: !398, size: 32, align: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !474, file: !130, line: 127, baseType: !398, size: 32, align: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !474, file: !130, line: 127, baseType: !398, size: 32, align: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !474, file: !130, line: 127, baseType: !398, size: 32, align: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !392, file: !130, line: 128, baseType: !483, size: 192, align: 32)
!483 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 128, size: 192, align: 32, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !483, file: !130, line: 128, baseType: !398, size: 32, align: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !483, file: !130, line: 128, baseType: !398, size: 32, align: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !483, file: !130, line: 128, baseType: !398, size: 32, align: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !483, file: !130, line: 128, baseType: !398, size: 32, align: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !130, line: 128, baseType: !179, size: 32, align: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !483, file: !130, line: 128, baseType: !179, size: 32, align: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !392, file: !130, line: 129, baseType: !492, size: 192, align: 32)
!492 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 129, size: 192, align: 32, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !492, file: !130, line: 129, baseType: !179, size: 32, align: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !492, file: !130, line: 129, baseType: !179, size: 32, align: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !492, file: !130, line: 129, baseType: !179, size: 32, align: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !492, file: !130, line: 129, baseType: !398, size: 32, align: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !492, file: !130, line: 129, baseType: !398, size: 32, align: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !492, file: !130, line: 129, baseType: !398, size: 32, align: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !392, file: !130, line: 130, baseType: !501, size: 192, align: 32)
!501 = !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !130, line: 130, size: 192, align: 32, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !501, file: !130, line: 130, baseType: !470, size: 192, align: 32)
!504 = !{!505, !506, !507, !508, !509, !510}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftype", arg: 1, scope: !386, file: !1, line: 374, type: !389)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iparams", arg: 2, scope: !386, file: !1, line: 374, type: !390)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 3, scope: !386, file: !1, line: 374, type: !179)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !386, file: !1, line: 376, type: !179)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bDum", scope: !386, file: !1, line: 377, type: !179)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !511, file: !1, line: 455, type: !516)
!511 = distinct !DILexicalBlock(scope: !512, file: !1, line: 455, column: 5)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 455, column: 5)
!513 = distinct !DILexicalBlock(scope: !514, file: !1, line: 455, column: 5)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 455, column: 5)
!515 = distinct !DILexicalBlock(scope: !386, file: !1, line: 381, column: 18)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 1024, align: 8, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 128)
!519 = !DISubprogram(name: "open_tpx", scope: !1, file: !1, line: 858, type: !520, isLocal: false, isDefinition: true, scopeLine: 859, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @open_tpx, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!179, !213, !213}
!522 = !{!523, !524}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !519, file: !1, line: 858, type: !213)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !519, file: !1, line: 858, type: !213)
!525 = !DISubprogram(name: "close_tpx", scope: !1, file: !1, line: 863, type: !526, isLocal: false, isDefinition: true, scopeLine: 864, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @close_tpx, variables: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !179}
!528 = !{!529}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !525, file: !1, line: 863, type: !179)
!530 = !DISubprogram(name: "read_tpxheader", scope: !1, file: !1, line: 868, type: !531, isLocal: false, isDefinition: true, scopeLine: 869, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.t_tpxheader*)* @read_tpxheader, variables: !548)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !213, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_tpxheader", file: !535, line: 68, baseType: !536)
!535 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/tpxio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!536 = !DICompositeType(tag: DW_TAG_structure_type, file: !535, line: 55, size: 320, align: 32, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "bIr", scope: !536, file: !535, line: 57, baseType: !179, size: 32, align: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bBox", scope: !536, file: !535, line: 58, baseType: !179, size: 32, align: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bTop", scope: !536, file: !535, line: 59, baseType: !179, size: 32, align: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bX", scope: !536, file: !535, line: 60, baseType: !179, size: 32, align: 32, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bV", scope: !536, file: !535, line: 61, baseType: !179, size: 32, align: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bF", scope: !536, file: !535, line: 62, baseType: !179, size: 32, align: 32, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !536, file: !535, line: 64, baseType: !179, size: 32, align: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !536, file: !535, line: 65, baseType: !179, size: 32, align: 32, offset: 224)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !536, file: !535, line: 66, baseType: !398, size: 32, align: 32, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !536, file: !535, line: 67, baseType: !398, size: 32, align: 32, offset: 288)
!548 = !{!549, !550, !551}
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !530, file: !1, line: 868, type: !213)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tpx", arg: 2, scope: !530, file: !1, line: 868, type: !533)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !530, file: !1, line: 870, type: !179)
!552 = !DISubprogram(name: "write_tpx", scope: !1, file: !1, line: 877, type: !553, isLocal: false, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, float, float, %struct.t_inputrec*, [3 x float]*, i32, [3 x float]*, [3 x float]*, [3 x float]*, %struct.t_topology*)* @write_tpx, variables: !787)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !213, !179, !398, !398, !555, !656, !179, !656, !656, !656, !673}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !557, line: 143, baseType: !558)
!557 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!558 = !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 55, size: 4736, align: 64, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !664, !672}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !558, file: !557, line: 56, baseType: !179, size: 32, align: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !558, file: !557, line: 57, baseType: !179, size: 32, align: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !558, file: !557, line: 58, baseType: !179, size: 32, align: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !558, file: !557, line: 59, baseType: !179, size: 32, align: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !558, file: !557, line: 60, baseType: !179, size: 32, align: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !558, file: !557, line: 61, baseType: !179, size: 32, align: 32, offset: 160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !558, file: !557, line: 62, baseType: !179, size: 32, align: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !558, file: !557, line: 63, baseType: !179, size: 32, align: 32, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !558, file: !557, line: 65, baseType: !179, size: 32, align: 32, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !558, file: !557, line: 66, baseType: !179, size: 32, align: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !558, file: !557, line: 67, baseType: !179, size: 32, align: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !558, file: !557, line: 68, baseType: !179, size: 32, align: 32, offset: 352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !558, file: !557, line: 69, baseType: !179, size: 32, align: 32, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !558, file: !557, line: 70, baseType: !179, size: 32, align: 32, offset: 416)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !558, file: !557, line: 71, baseType: !398, size: 32, align: 32, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !558, file: !557, line: 72, baseType: !398, size: 32, align: 32, offset: 480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !558, file: !557, line: 73, baseType: !398, size: 32, align: 32, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !558, file: !557, line: 74, baseType: !179, size: 32, align: 32, offset: 544)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !558, file: !557, line: 74, baseType: !179, size: 32, align: 32, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !558, file: !557, line: 74, baseType: !179, size: 32, align: 32, offset: 608)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !558, file: !557, line: 76, baseType: !179, size: 32, align: 32, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !558, file: !557, line: 77, baseType: !398, size: 32, align: 32, offset: 672)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !558, file: !557, line: 79, baseType: !179, size: 32, align: 32, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !558, file: !557, line: 80, baseType: !179, size: 32, align: 32, offset: 736)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !558, file: !557, line: 81, baseType: !179, size: 32, align: 32, offset: 768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !558, file: !557, line: 82, baseType: !179, size: 32, align: 32, offset: 800)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !558, file: !557, line: 83, baseType: !179, size: 32, align: 32, offset: 832)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !558, file: !557, line: 84, baseType: !179, size: 32, align: 32, offset: 864)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !558, file: !557, line: 85, baseType: !179, size: 32, align: 32, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !558, file: !557, line: 86, baseType: !179, size: 32, align: 32, offset: 928)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !558, file: !557, line: 87, baseType: !398, size: 32, align: 32, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !558, file: !557, line: 88, baseType: !592, size: 288, align: 32, offset: 992)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !399, line: 105, baseType: !593)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 288, align: 32, elements: !594)
!594 = !{!238, !238}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !558, file: !557, line: 89, baseType: !592, size: 288, align: 32, offset: 1280)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !558, file: !557, line: 90, baseType: !179, size: 32, align: 32, offset: 1568)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !558, file: !557, line: 91, baseType: !398, size: 32, align: 32, offset: 1600)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !558, file: !557, line: 92, baseType: !398, size: 32, align: 32, offset: 1632)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !558, file: !557, line: 93, baseType: !179, size: 32, align: 32, offset: 1664)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !558, file: !557, line: 94, baseType: !398, size: 32, align: 32, offset: 1696)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !558, file: !557, line: 95, baseType: !398, size: 32, align: 32, offset: 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !558, file: !557, line: 96, baseType: !179, size: 32, align: 32, offset: 1760)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !558, file: !557, line: 97, baseType: !398, size: 32, align: 32, offset: 1792)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !558, file: !557, line: 98, baseType: !398, size: 32, align: 32, offset: 1824)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !558, file: !557, line: 99, baseType: !398, size: 32, align: 32, offset: 1856)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !558, file: !557, line: 100, baseType: !179, size: 32, align: 32, offset: 1888)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !558, file: !557, line: 101, baseType: !398, size: 32, align: 32, offset: 1920)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !558, file: !557, line: 102, baseType: !398, size: 32, align: 32, offset: 1952)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !558, file: !557, line: 103, baseType: !179, size: 32, align: 32, offset: 1984)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !558, file: !557, line: 104, baseType: !398, size: 32, align: 32, offset: 2016)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !558, file: !557, line: 105, baseType: !398, size: 32, align: 32, offset: 2048)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !558, file: !557, line: 106, baseType: !398, size: 32, align: 32, offset: 2080)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !558, file: !557, line: 107, baseType: !398, size: 32, align: 32, offset: 2112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !558, file: !557, line: 108, baseType: !398, size: 32, align: 32, offset: 2144)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !558, file: !557, line: 109, baseType: !179, size: 32, align: 32, offset: 2176)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !558, file: !557, line: 110, baseType: !179, size: 32, align: 32, offset: 2208)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !558, file: !557, line: 111, baseType: !179, size: 32, align: 32, offset: 2240)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !558, file: !557, line: 112, baseType: !398, size: 32, align: 32, offset: 2272)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !558, file: !557, line: 113, baseType: !398, size: 32, align: 32, offset: 2304)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !558, file: !557, line: 114, baseType: !398, size: 32, align: 32, offset: 2336)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !558, file: !557, line: 115, baseType: !179, size: 32, align: 32, offset: 2368)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !558, file: !557, line: 116, baseType: !398, size: 32, align: 32, offset: 2400)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !558, file: !557, line: 117, baseType: !398, size: 32, align: 32, offset: 2432)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !558, file: !557, line: 118, baseType: !179, size: 32, align: 32, offset: 2464)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !558, file: !557, line: 120, baseType: !179, size: 32, align: 32, offset: 2496)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !558, file: !557, line: 122, baseType: !179, size: 32, align: 32, offset: 2528)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !558, file: !557, line: 124, baseType: !179, size: 32, align: 32, offset: 2560)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !558, file: !557, line: 125, baseType: !179, size: 32, align: 32, offset: 2592)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !558, file: !557, line: 126, baseType: !398, size: 32, align: 32, offset: 2624)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !558, file: !557, line: 127, baseType: !179, size: 32, align: 32, offset: 2656)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !558, file: !557, line: 128, baseType: !398, size: 32, align: 32, offset: 2688)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !558, file: !557, line: 129, baseType: !398, size: 32, align: 32, offset: 2720)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !558, file: !557, line: 130, baseType: !179, size: 32, align: 32, offset: 2752)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !558, file: !557, line: 131, baseType: !398, size: 32, align: 32, offset: 2784)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !558, file: !557, line: 132, baseType: !179, size: 32, align: 32, offset: 2816)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !558, file: !557, line: 133, baseType: !179, size: 32, align: 32, offset: 2848)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !558, file: !557, line: 134, baseType: !179, size: 32, align: 32, offset: 2880)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !558, file: !557, line: 135, baseType: !179, size: 32, align: 32, offset: 2912)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !558, file: !557, line: 136, baseType: !398, size: 32, align: 32, offset: 2944)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !558, file: !557, line: 137, baseType: !398, size: 32, align: 32, offset: 2976)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !558, file: !557, line: 138, baseType: !398, size: 32, align: 32, offset: 3008)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !558, file: !557, line: 139, baseType: !398, size: 32, align: 32, offset: 3040)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !558, file: !557, line: 140, baseType: !644, size: 512, align: 64, offset: 3072)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !557, line: 53, baseType: !645)
!645 = !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 42, size: 512, align: 64, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !653, !654, !655, !658, !662}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !645, file: !557, line: 43, baseType: !179, size: 32, align: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !645, file: !557, line: 44, baseType: !179, size: 32, align: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !645, file: !557, line: 45, baseType: !179, size: 32, align: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !645, file: !557, line: 46, baseType: !179, size: 32, align: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !645, file: !557, line: 47, baseType: !652, size: 64, align: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !645, file: !557, line: 48, baseType: !652, size: 64, align: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !645, file: !557, line: 49, baseType: !652, size: 64, align: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !645, file: !557, line: 50, baseType: !656, size: 64, align: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !399, line: 101, baseType: !464)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !645, file: !557, line: 51, baseType: !659, size: 64, align: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !399, line: 107, baseType: !661)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 96, align: 32, elements: !237)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !645, file: !557, line: 52, baseType: !663, size: 64, align: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !558, file: !557, line: 141, baseType: !665, size: 576, align: 64, offset: 3584)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 576, align: 64, elements: !237)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !557, line: 40, baseType: !667)
!667 = !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 36, size: 192, align: 64, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !667, file: !557, line: 37, baseType: !179, size: 32, align: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !667, file: !557, line: 38, baseType: !652, size: 64, align: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !667, file: !557, line: 39, baseType: !652, size: 64, align: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !558, file: !557, line: 142, baseType: !665, size: 576, align: 64, offset: 4160)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !675, line: 42, baseType: !676)
!675 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!676 = !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 36, size: 402112, align: 64, elements: !677)
!677 = !{!678, !680, !706, !770, !772}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !675, line: 37, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !676, file: !675, line: 38, baseType: !681, size: 366336, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !130, line: 188, baseType: !682)
!682 = !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 179, size: 366336, align: 64, elements: !683)
!683 = !{!684, !685, !686, !687, !689, !690}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !682, file: !130, line: 181, baseType: !179, size: 32, align: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !682, file: !130, line: 182, baseType: !179, size: 32, align: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !682, file: !130, line: 183, baseType: !179, size: 32, align: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !682, file: !130, line: 184, baseType: !688, size: 64, align: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !682, file: !130, line: 185, baseType: !390, size: 64, align: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !682, file: !130, line: 187, baseType: !691, size: 366080, align: 64, offset: 256)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 366080, align: 64, elements: !704)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !130, line: 140, baseType: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 135, size: 8320, align: 64, elements: !694)
!694 = !{!695, !696, !700}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !693, file: !130, line: 137, baseType: !179, size: 32, align: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !693, file: !130, line: 138, baseType: !697, size: 8192, align: 32, offset: 32)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 8192, align: 32, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !693, file: !130, line: 139, baseType: !701, size: 64, align: 64, offset: 8256)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !130, line: 45, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !399, line: 73, baseType: !179)
!704 = !{!705}
!705 = !DISubrange(count: 44)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !676, file: !675, line: 39, baseType: !707, size: 10240, align: 64, offset: 366400)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !117, line: 94, baseType: !708)
!708 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 75, size: 10240, align: 64, elements: !709)
!709 = !{!710, !711, !729, !731, !732, !733, !734, !735, !736, !737, !748, !755}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !708, file: !117, line: 76, baseType: !179, size: 32, align: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !708, file: !117, line: 77, baseType: !712, size: 64, align: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !117, line: 57, baseType: !714)
!714 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 48, size: 320, align: 32, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !728}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !714, file: !117, line: 49, baseType: !398, size: 32, align: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !714, file: !117, line: 49, baseType: !398, size: 32, align: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !714, file: !117, line: 50, baseType: !398, size: 32, align: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !714, file: !117, line: 50, baseType: !398, size: 32, align: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !714, file: !117, line: 51, baseType: !322, size: 16, align: 16, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !714, file: !117, line: 52, baseType: !322, size: 16, align: 16, offset: 144)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !714, file: !117, line: 53, baseType: !179, size: 32, align: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !714, file: !117, line: 54, baseType: !179, size: 32, align: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !714, file: !117, line: 55, baseType: !725, size: 72, align: 8, offset: 224)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 72, align: 8, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 9)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !714, file: !117, line: 56, baseType: !192, size: 8, align: 8, offset: 296)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !708, file: !117, line: 80, baseType: !730, size: 64, align: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !708, file: !117, line: 82, baseType: !730, size: 64, align: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !708, file: !117, line: 84, baseType: !730, size: 64, align: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !708, file: !117, line: 86, baseType: !179, size: 32, align: 32, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !708, file: !117, line: 87, baseType: !730, size: 64, align: 64, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !708, file: !117, line: 89, baseType: !179, size: 32, align: 32, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !708, file: !117, line: 90, baseType: !730, size: 64, align: 64, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !708, file: !117, line: 91, baseType: !738, size: 8448, align: 64, offset: 576)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !739, line: 52, baseType: !740)
!739 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!740 = !DICompositeType(tag: DW_TAG_structure_type, file: !739, line: 36, size: 8448, align: 64, elements: !741)
!741 = !{!742, !743, !744, !746, !747}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !740, file: !739, line: 37, baseType: !697, size: 8192, align: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !740, file: !739, line: 43, baseType: !179, size: 32, align: 32, offset: 8192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !740, file: !739, line: 44, baseType: !745, size: 64, align: 64, offset: 8256)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !740, file: !739, line: 45, baseType: !179, size: 32, align: 32, offset: 8320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !740, file: !739, line: 46, baseType: !745, size: 64, align: 64, offset: 8384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !708, file: !117, line: 92, baseType: !749, size: 1152, align: 64, offset: 9024)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 1152, align: 64, elements: !726)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !117, line: 73, baseType: !751)
!751 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 70, size: 128, align: 64, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !751, file: !117, line: 71, baseType: !179, size: 32, align: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !751, file: !117, line: 72, baseType: !663, size: 64, align: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !708, file: !117, line: 93, baseType: !756, size: 64, align: 64, offset: 10176)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !117, line: 68, baseType: !758)
!758 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 59, size: 416, align: 32, elements: !759)
!759 = !{!760, !761, !762, !763, !765, !766, !767, !768}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !117, line: 60, baseType: !179, size: 32, align: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !758, file: !117, line: 61, baseType: !179, size: 32, align: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !758, file: !117, line: 62, baseType: !178, size: 8, align: 8, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !758, file: !117, line: 63, baseType: !764, size: 48, align: 8, offset: 72)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 48, align: 8, elements: !471)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !758, file: !117, line: 64, baseType: !398, size: 32, align: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !758, file: !117, line: 65, baseType: !398, size: 32, align: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !758, file: !117, line: 66, baseType: !179, size: 32, align: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !758, file: !117, line: 67, baseType: !769, size: 192, align: 32, offset: 224)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 192, align: 32, elements: !471)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !676, file: !675, line: 40, baseType: !771, size: 25344, align: 64, offset: 376640)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 25344, align: 64, elements: !237)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !676, file: !675, line: 41, baseType: !773, size: 128, align: 64, offset: 401984)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !774, line: 46, baseType: !775)
!774 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!775 = !DICompositeType(tag: DW_TAG_structure_type, file: !774, line: 42, size: 128, align: 64, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !775, file: !774, line: 44, baseType: !179, size: 32, align: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !775, file: !774, line: 45, baseType: !779, size: 64, align: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !774, line: 40, baseType: !781)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !774, line: 36, size: 192, align: 64, elements: !782)
!782 = !{!783, !784, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !781, file: !774, line: 37, baseType: !179, size: 32, align: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !781, file: !774, line: 38, baseType: !679, size: 64, align: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !774, line: 39, baseType: !786, size: 64, align: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !552, file: !1, line: 877, type: !213)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 2, scope: !552, file: !1, line: 877, type: !179)
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 3, scope: !552, file: !1, line: 877, type: !398)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 4, scope: !552, file: !1, line: 877, type: !398)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 5, scope: !552, file: !1, line: 878, type: !555)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !552, file: !1, line: 878, type: !656)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 7, scope: !552, file: !1, line: 878, type: !179)
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !552, file: !1, line: 879, type: !656)
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 9, scope: !552, file: !1, line: 879, type: !656)
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 10, scope: !552, file: !1, line: 879, type: !656)
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 11, scope: !552, file: !1, line: 879, type: !673)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !552, file: !1, line: 881, type: !179)
!800 = !DISubprogram(name: "read_tpx", scope: !1, file: !1, line: 888, type: !801, isLocal: false, isDefinition: true, scopeLine: 891, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32*, float*, float*, %struct.t_inputrec*, [3 x float]*, i32*, [3 x float]*, [3 x float]*, [3 x float]*, %struct.t_topology*)* @read_tpx, variables: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !213, !663, !652, !652, !555, !656, !663, !656, !656, !656, !673}
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !800, file: !1, line: 888, type: !213)
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 2, scope: !800, file: !1, line: 888, type: !663)
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 3, scope: !800, file: !1, line: 888, type: !652)
!807 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 4, scope: !800, file: !1, line: 888, type: !652)
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 5, scope: !800, file: !1, line: 889, type: !555)
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !800, file: !1, line: 889, type: !656)
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 7, scope: !800, file: !1, line: 889, type: !663)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !800, file: !1, line: 890, type: !656)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 9, scope: !800, file: !1, line: 890, type: !656)
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 10, scope: !800, file: !1, line: 890, type: !656)
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 11, scope: !800, file: !1, line: 890, type: !673)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !800, file: !1, line: 892, type: !179)
!816 = !DISubprogram(name: "fwrite_tpx", scope: !1, file: !1, line: 899, type: !817, isLocal: false, isDefinition: true, scopeLine: 902, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, float, float, %struct.t_inputrec*, [3 x float]*, i32, [3 x float]*, [3 x float]*, [3 x float]*, %struct.t_topology*)* @fwrite_tpx, variables: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !179, !179, !398, !398, !555, !656, !179, !656, !656, !656, !673}
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !816, file: !1, line: 899, type: !179)
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 2, scope: !816, file: !1, line: 899, type: !179)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 3, scope: !816, file: !1, line: 899, type: !398)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 4, scope: !816, file: !1, line: 899, type: !398)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 5, scope: !816, file: !1, line: 900, type: !555)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !816, file: !1, line: 900, type: !656)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 7, scope: !816, file: !1, line: 900, type: !179)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !816, file: !1, line: 901, type: !656)
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 9, scope: !816, file: !1, line: 901, type: !656)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 10, scope: !816, file: !1, line: 901, type: !656)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 11, scope: !816, file: !1, line: 901, type: !673)
!831 = !DISubprogram(name: "fread_tpx", scope: !1, file: !1, line: 907, type: !832, isLocal: false, isDefinition: true, scopeLine: 910, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, float*, float*, %struct.t_inputrec*, [3 x float]*, i32*, [3 x float]*, [3 x float]*, [3 x float]*, %struct.t_topology*)* @fread_tpx, variables: !834)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !179, !663, !652, !652, !555, !656, !663, !656, !656, !656, !673}
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !831, file: !1, line: 907, type: !179)
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 2, scope: !831, file: !1, line: 907, type: !663)
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 3, scope: !831, file: !1, line: 907, type: !652)
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 4, scope: !831, file: !1, line: 907, type: !652)
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 5, scope: !831, file: !1, line: 908, type: !555)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !831, file: !1, line: 908, type: !656)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 7, scope: !831, file: !1, line: 908, type: !663)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !831, file: !1, line: 909, type: !656)
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 9, scope: !831, file: !1, line: 909, type: !656)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 10, scope: !831, file: !1, line: 909, type: !656)
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 11, scope: !831, file: !1, line: 909, type: !673)
!846 = !DISubprogram(name: "fn2bTPX", scope: !1, file: !1, line: 914, type: !847, isLocal: false, isDefinition: true, scopeLine: 915, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @fn2bTPX, variables: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{!179, !213}
!849 = !{!850}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !846, file: !1, line: 914, type: !213)
!851 = !DISubprogram(name: "read_tps_conf", scope: !1, file: !1, line: 926, type: !852, isLocal: false, isDefinition: true, scopeLine: 928, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, %struct.t_topology*, [3 x float]**, [3 x float]**, [3 x float]*, i32)* @read_tps_conf, variables: !856)
!852 = !DISubroutineType(types: !853)
!853 = !{!179, !213, !213, !673, !854, !854, !855, !179}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 1, scope: !851, file: !1, line: 926, type: !213)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !851, file: !1, line: 926, type: !213)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 3, scope: !851, file: !1, line: 926, type: !673)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !851, file: !1, line: 927, type: !854)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 5, scope: !851, file: !1, line: 927, type: !854)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !851, file: !1, line: 927, type: !855)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bMass", arg: 7, scope: !851, file: !1, line: 927, type: !179)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header", scope: !851, file: !1, line: 929, type: !534)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !851, file: !1, line: 930, type: !398)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda", scope: !851, file: !1, line: 930, type: !398)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "natoms", scope: !851, file: !1, line: 931, type: !179)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !851, file: !1, line: 931, type: !179)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !851, file: !1, line: 931, type: !179)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bTop", scope: !851, file: !1, line: 932, type: !179)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bXNULL", scope: !851, file: !1, line: 932, type: !179)
!872 = !DISubprogram(name: "do_harm", scope: !1, file: !1, line: 366, type: !873, isLocal: true, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: true, variables: !875)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !390, !179}
!875 = !{!876, !877}
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iparams", arg: 1, scope: !872, file: !1, line: 366, type: !390)
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 2, scope: !872, file: !1, line: 366, type: !179)
!878 = !DISubprogram(name: "do_tpxheader", scope: !1, file: !1, line: 724, type: !879, isLocal: true, isDefinition: true, scopeLine: 725, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct.t_tpxheader*)* @do_tpxheader, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{null, !179, !179, !533}
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !878, file: !1, line: 724, type: !179)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 2, scope: !878, file: !1, line: 724, type: !179)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tpx", arg: 3, scope: !878, file: !1, line: 724, type: !533)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !878, file: !1, line: 726, type: !382)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bDouble", scope: !878, file: !1, line: 727, type: !179)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "precision", scope: !878, file: !1, line: 728, type: !179)
!888 = !DISubprogram(name: "do_tpx", scope: !1, file: !1, line: 782, type: !889, isLocal: true, isDefinition: true, scopeLine: 785, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, float*, float*, %struct.t_inputrec*, [3 x float]*, i32*, [3 x float]*, [3 x float]*, [3 x float]*, %struct.t_topology*)* @do_tpx, variables: !891)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !179, !179, !663, !652, !652, !555, !656, !663, !656, !656, !656, !673}
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906}
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !888, file: !1, line: 782, type: !179)
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 2, scope: !888, file: !1, line: 782, type: !179)
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 3, scope: !888, file: !1, line: 782, type: !663)
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 4, scope: !888, file: !1, line: 782, type: !652)
!896 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 5, scope: !888, file: !1, line: 782, type: !652)
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 6, scope: !888, file: !1, line: 783, type: !555)
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !888, file: !1, line: 783, type: !656)
!899 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 8, scope: !888, file: !1, line: 783, type: !663)
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 9, scope: !888, file: !1, line: 784, type: !656)
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 10, scope: !888, file: !1, line: 784, type: !656)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 11, scope: !888, file: !1, line: 784, type: !656)
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 12, scope: !888, file: !1, line: 784, type: !673)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpx", scope: !888, file: !1, line: 786, type: !534)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dum_ir", scope: !888, file: !1, line: 787, type: !556)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dum_top", scope: !888, file: !1, line: 788, type: !674)
!907 = !DISubprogram(name: "do_inputrec", scope: !1, file: !1, line: 118, type: !908, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_inputrec*, i32)* @do_inputrec, variables: !910)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !555, !179}
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !931, !937, !942, !947, !953, !959, !967, !972, !977}
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 1, scope: !907, file: !1, line: 118, type: !555)
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 2, scope: !907, file: !1, line: 118, type: !179)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !907, file: !1, line: 120, type: !179)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !907, file: !1, line: 120, type: !179)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !907, file: !1, line: 120, type: !663)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idum", scope: !907, file: !1, line: 120, type: !179)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bDum", scope: !907, file: !1, line: 121, type: !179)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdum", scope: !907, file: !1, line: 122, type: !398)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdum", scope: !907, file: !1, line: 123, type: !657)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !921, file: !1, line: 331, type: !516)
!921 = distinct !DILexicalBlock(scope: !922, file: !1, line: 331, column: 2)
!922 = distinct !DILexicalBlock(scope: !923, file: !1, line: 331, column: 2)
!923 = distinct !DILexicalBlock(scope: !924, file: !1, line: 331, column: 2)
!924 = distinct !DILexicalBlock(scope: !925, file: !1, line: 331, column: 2)
!925 = distinct !DILexicalBlock(scope: !926, file: !1, line: 329, column: 37)
!926 = distinct !DILexicalBlock(scope: !927, file: !1, line: 329, column: 11)
!927 = distinct !DILexicalBlock(scope: !928, file: !1, line: 328, column: 28)
!928 = distinct !DILexicalBlock(scope: !929, file: !1, line: 328, column: 9)
!929 = distinct !DILexicalBlock(scope: !930, file: !1, line: 131, column: 26)
!930 = distinct !DILexicalBlock(scope: !907, file: !1, line: 131, column: 7)
!931 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !932, file: !1, line: 336, type: !516)
!932 = distinct !DILexicalBlock(scope: !933, file: !1, line: 336, column: 2)
!933 = distinct !DILexicalBlock(scope: !934, file: !1, line: 336, column: 2)
!934 = distinct !DILexicalBlock(scope: !935, file: !1, line: 336, column: 2)
!935 = distinct !DILexicalBlock(scope: !936, file: !1, line: 336, column: 2)
!936 = distinct !DILexicalBlock(scope: !926, file: !1, line: 335, column: 14)
!937 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !938, file: !1, line: 338, type: !516)
!938 = distinct !DILexicalBlock(scope: !939, file: !1, line: 338, column: 7)
!939 = distinct !DILexicalBlock(scope: !940, file: !1, line: 338, column: 7)
!940 = distinct !DILexicalBlock(scope: !941, file: !1, line: 338, column: 7)
!941 = distinct !DILexicalBlock(scope: !927, file: !1, line: 338, column: 7)
!942 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !943, file: !1, line: 339, type: !516)
!943 = distinct !DILexicalBlock(scope: !944, file: !1, line: 339, column: 7)
!944 = distinct !DILexicalBlock(scope: !945, file: !1, line: 339, column: 7)
!945 = distinct !DILexicalBlock(scope: !946, file: !1, line: 339, column: 7)
!946 = distinct !DILexicalBlock(scope: !927, file: !1, line: 339, column: 7)
!947 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !948, file: !1, line: 342, type: !516)
!948 = distinct !DILexicalBlock(scope: !949, file: !1, line: 342, column: 7)
!949 = distinct !DILexicalBlock(scope: !950, file: !1, line: 342, column: 7)
!950 = distinct !DILexicalBlock(scope: !951, file: !1, line: 342, column: 7)
!951 = distinct !DILexicalBlock(scope: !952, file: !1, line: 342, column: 7)
!952 = distinct !DILexicalBlock(scope: !929, file: !1, line: 341, column: 9)
!953 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !954, file: !1, line: 346, type: !516)
!954 = distinct !DILexicalBlock(scope: !955, file: !1, line: 346, column: 7)
!955 = distinct !DILexicalBlock(scope: !956, file: !1, line: 346, column: 7)
!956 = distinct !DILexicalBlock(scope: !957, file: !1, line: 346, column: 7)
!957 = distinct !DILexicalBlock(scope: !958, file: !1, line: 346, column: 7)
!958 = distinct !DILexicalBlock(scope: !929, file: !1, line: 345, column: 9)
!959 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !960, file: !1, line: 358, type: !516)
!960 = distinct !DILexicalBlock(scope: !961, file: !1, line: 358, column: 7)
!961 = distinct !DILexicalBlock(scope: !962, file: !1, line: 358, column: 7)
!962 = distinct !DILexicalBlock(scope: !963, file: !1, line: 358, column: 7)
!963 = distinct !DILexicalBlock(scope: !964, file: !1, line: 358, column: 7)
!964 = distinct !DILexicalBlock(scope: !965, file: !1, line: 349, column: 28)
!965 = distinct !DILexicalBlock(scope: !966, file: !1, line: 349, column: 5)
!966 = distinct !DILexicalBlock(scope: !929, file: !1, line: 349, column: 5)
!967 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !968, file: !1, line: 359, type: !516)
!968 = distinct !DILexicalBlock(scope: !969, file: !1, line: 359, column: 7)
!969 = distinct !DILexicalBlock(scope: !970, file: !1, line: 359, column: 7)
!970 = distinct !DILexicalBlock(scope: !971, file: !1, line: 359, column: 7)
!971 = distinct !DILexicalBlock(scope: !964, file: !1, line: 359, column: 7)
!972 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !973, file: !1, line: 360, type: !516)
!973 = distinct !DILexicalBlock(scope: !974, file: !1, line: 360, column: 7)
!974 = distinct !DILexicalBlock(scope: !975, file: !1, line: 360, column: 7)
!975 = distinct !DILexicalBlock(scope: !976, file: !1, line: 360, column: 7)
!976 = distinct !DILexicalBlock(scope: !964, file: !1, line: 360, column: 7)
!977 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !978, file: !1, line: 361, type: !516)
!978 = distinct !DILexicalBlock(scope: !979, file: !1, line: 361, column: 7)
!979 = distinct !DILexicalBlock(scope: !980, file: !1, line: 361, column: 7)
!980 = distinct !DILexicalBlock(scope: !981, file: !1, line: 361, column: 7)
!981 = distinct !DILexicalBlock(scope: !964, file: !1, line: 361, column: 7)
!982 = !DISubprogram(name: "clear_mat", scope: !983, file: !983, line: 334, type: !984, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, variables: !986)
!983 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!984 = !DISubroutineType(types: !985)
!985 = !{null, !855}
!986 = !{!987, !988}
!987 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !982, file: !983, line: 334, type: !855)
!988 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nul", scope: !982, file: !983, line: 336, type: !989)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!990 = !DISubprogram(name: "do_top", scope: !1, file: !1, line: 708, type: !991, isLocal: true, isDefinition: true, scopeLine: 709, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_topology*, i32)* @do_top, variables: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !673, !179}
!993 = !{!994, !995, !996}
!994 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 1, scope: !990, file: !1, line: 708, type: !673)
!995 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 2, scope: !990, file: !1, line: 708, type: !179)
!996 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !990, file: !1, line: 710, type: !179)
!997 = !DISubprogram(name: "do_symtab", scope: !1, file: !1, line: 654, type: !998, isLocal: true, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true, variables: !1001)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !1000, !179}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007}
!1002 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 1, scope: !997, file: !1, line: 654, type: !1000)
!1003 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 2, scope: !997, file: !1, line: 654, type: !179)
!1004 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !997, file: !1, line: 656, type: !179)
!1005 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !997, file: !1, line: 656, type: !179)
!1006 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbuf", scope: !997, file: !1, line: 657, type: !779)
!1007 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !997, file: !1, line: 658, type: !382)
!1008 = !DISubprogram(name: "do_symstr", scope: !1, file: !1, line: 596, type: !1009, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, function: void (i8***, i32, %struct.t_symtab*)* @do_symstr, variables: !1011)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !730, !179, !1000}
!1011 = !{!1012, !1013, !1014, !1015}
!1012 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nm", arg: 1, scope: !1008, file: !1, line: 596, type: !730)
!1013 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRead", arg: 2, scope: !1008, file: !1, line: 596, type: !179)
!1014 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 3, scope: !1008, file: !1, line: 596, type: !1000)
!1015 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ls", scope: !1008, file: !1, line: 598, type: !179)
