; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/trnio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_trnheader = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float }

@.str = private unnamed_addr constant [18 x i8] c"box_size    = %d\0A\00", align 1
@.str1 = private unnamed_addr constant [18 x i8] c"x_size      = %d\0A\00", align 1
@.str2 = private unnamed_addr constant [18 x i8] c"v_size      = %d\0A\00", align 1
@.str3 = private unnamed_addr constant [18 x i8] c"f_size      = %d\0A\00", align 1
@.str4 = private unnamed_addr constant [18 x i8] c"natoms      = %d\0A\00", align 1
@.str5 = private unnamed_addr constant [18 x i8] c"step        = %d\0A\00", align 1
@.str6 = private unnamed_addr constant [18 x i8] c"t           = %e\0A\00", align 1
@.str7 = private unnamed_addr constant [18 x i8] c"lambda      = %e\0A\00", align 1
@.str8 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str9 = private unnamed_addr constant [14 x i8] c"Empty file %s\00", align 1
@.str10 = private unnamed_addr constant [2 x i8] c"w\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !15, subprograms: !18, globals: !269, imports: !273)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/trnio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 52, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmxfio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "eioREAL", value: 0)
!7 = !DIEnumerator(name: "eioINT", value: 1)
!8 = !DIEnumerator(name: "eioNUCHAR", value: 2)
!9 = !DIEnumerator(name: "eioUSHORT", value: 3)
!10 = !DIEnumerator(name: "eioRVEC", value: 4)
!11 = !DIEnumerator(name: "eioNRVEC", value: 5)
!12 = !DIEnumerator(name: "eioIVEC", value: 6)
!13 = !DIEnumerator(name: "eioSTRING", value: 7)
!14 = !DIEnumerator(name: "eioNR", value: 8)
!15 = !{!16, !17}
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!18 = !{!19, !87, !93, !124, !132, !140, !157, !172, !185, !198, !208, !214, !219, !231, !237, !253}
!19 = !DISubprogram(name: "__sputc", scope: !20, file: !20, line: 348, type: !21, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !84)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !23, !24}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 153, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !27)
!27 = !{!28, !31, !32, !33, !35, !36, !41, !42, !43, !47, !52, !62, !68, !69, !72, !73, !77, !81, !82, !83}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !26, file: !20, line: 123, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !26, file: !20, line: 124, baseType: !23, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !26, file: !20, line: 125, baseType: !23, size: 32, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !26, file: !20, line: 126, baseType: !34, size: 16, align: 16, offset: 128)
!34 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !26, file: !20, line: 127, baseType: !34, size: 16, align: 16, offset: 144)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !26, file: !20, line: 128, baseType: !37, size: 128, align: 64, offset: 192)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !37, file: !20, line: 89, baseType: !29, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !37, file: !20, line: 90, baseType: !23, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !26, file: !20, line: 129, baseType: !23, size: 32, align: 32, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !26, file: !20, line: 132, baseType: !17, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !26, file: !20, line: 133, baseType: !44, size: 64, align: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!23, !17}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !26, file: !20, line: 134, baseType: !48, size: 64, align: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!23, !17, !51, !23}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !26, file: !20, line: 135, baseType: !53, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !17, !56, !23}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !58, line: 71, baseType: !59)
!58 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !60, line: 46, baseType: !61)
!60 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !26, file: !20, line: 136, baseType: !63, size: 64, align: 64, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!23, !17, !66, !23}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !26, file: !20, line: 139, baseType: !37, size: 128, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !26, file: !20, line: 140, baseType: !70, size: 64, align: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !26, file: !20, line: 141, baseType: !23, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !26, file: !20, line: 144, baseType: !74, size: 24, align: 8, offset: 928)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 24, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !26, file: !20, line: 145, baseType: !78, size: 8, align: 8, offset: 952)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !26, file: !20, line: 148, baseType: !37, size: 128, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !26, file: !20, line: 151, baseType: !23, size: 32, align: 32, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !26, file: !20, line: 152, baseType: !56, size: 64, align: 64, offset: 1152)
!84 = !{!85, !86}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !19, file: !20, line: 348, type: !23)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !19, file: !20, line: 348, type: !24)
!87 = !DISubprogram(name: "__sigbits", scope: !88, file: !88, line: 114, type: !89, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !91)
!88 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DISubroutineType(types: !90)
!90 = !{!23, !23}
!91 = !{!92}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !87, file: !88, line: 114, type: !23)
!93 = !DISubprogram(name: "pr_trnheader", scope: !1, file: !1, line: 114, type: !94, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i8*, %struct.t_trnheader*)* @pr_trnheader, variables: !119)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !24, !23, !51, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_trnheader", file: !98, line: 77, baseType: !99)
!98 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/trnio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!99 = !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 58, size: 480, align: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !118}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ir_size", scope: !99, file: !98, line: 61, baseType: !23, size: 32, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "e_size", scope: !99, file: !98, line: 62, baseType: !23, size: 32, align: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "box_size", scope: !99, file: !98, line: 63, baseType: !23, size: 32, align: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "vir_size", scope: !99, file: !98, line: 64, baseType: !23, size: 32, align: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pres_size", scope: !99, file: !98, line: 65, baseType: !23, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "top_size", scope: !99, file: !98, line: 66, baseType: !23, size: 32, align: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sym_size", scope: !99, file: !98, line: 67, baseType: !23, size: 32, align: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "x_size", scope: !99, file: !98, line: 68, baseType: !23, size: 32, align: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "v_size", scope: !99, file: !98, line: 69, baseType: !23, size: 32, align: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !99, file: !98, line: 70, baseType: !23, size: 32, align: 32, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !99, file: !98, line: 72, baseType: !23, size: 32, align: 32, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !99, file: !98, line: 73, baseType: !23, size: 32, align: 32, offset: 352)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nre", scope: !99, file: !98, line: 74, baseType: !23, size: 32, align: 32, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !99, file: !98, line: 75, baseType: !115, size: 32, align: 32, offset: 416)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !116, line: 87, baseType: !117)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !99, file: !98, line: 76, baseType: !115, size: 32, align: 32, offset: 448)
!119 = !{!120, !121, !122, !123}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !93, file: !1, line: 114, type: !24)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indent", arg: 2, scope: !93, file: !1, line: 114, type: !23)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 3, scope: !93, file: !1, line: 114, type: !51)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sh", arg: 4, scope: !93, file: !1, line: 114, type: !96)
!124 = !DISubprogram(name: "read_trnheader", scope: !1, file: !1, line: 202, type: !125, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.t_trnheader*)* @read_trnheader, variables: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !51, !96}
!127 = !{!128, !129, !130, !131}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !124, file: !1, line: 202, type: !51)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "trn", arg: 2, scope: !124, file: !1, line: 202, type: !96)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !124, file: !1, line: 204, type: !23)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bOK", scope: !124, file: !1, line: 205, type: !23)
!132 = !DISubprogram(name: "fread_trnheader", scope: !1, file: !1, line: 213, type: !133, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.t_trnheader*, i32*)* @fread_trnheader, variables: !136)
!133 = !DISubroutineType(types: !134)
!134 = !{!23, !23, !96, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!136 = !{!137, !138, !139}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !132, file: !1, line: 213, type: !23)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "trn", arg: 2, scope: !132, file: !1, line: 213, type: !96)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOK", arg: 3, scope: !132, file: !1, line: 213, type: !135)
!140 = !DISubprogram(name: "write_trn", scope: !1, file: !1, line: 218, type: !141, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, float, float, [3 x float]*, i32, [3 x float]*, [3 x float]*, [3 x float]*)* @write_trn, variables: !146)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !51, !23, !115, !115, !143, !23, !143, !143, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !116, line: 101, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 96, align: 32, elements: !75)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !140, file: !1, line: 218, type: !51)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 2, scope: !140, file: !1, line: 218, type: !23)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 3, scope: !140, file: !1, line: 218, type: !115)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 4, scope: !140, file: !1, line: 218, type: !115)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !140, file: !1, line: 219, type: !143)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 6, scope: !140, file: !1, line: 219, type: !23)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 7, scope: !140, file: !1, line: 219, type: !143)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 8, scope: !140, file: !1, line: 219, type: !143)
