; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/trxio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_trxframe = type { i32, i32, i32, float, float, float, i32, i8*, i32, i32, i32, float, i32, float, i32, %struct.t_atoms*, i32, float, i32, [3 x float]*, i32, [3 x float]*, i32, [3 x float]*, i32, [3 x [3 x float]] }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_trnheader = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float }

@__frame = internal unnamed_addr global i32 -12345, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !60, subprograms: !68, globals: !637, imports: !261)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/trxio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !53}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!6 = !DIEnumerator(name: "efMDP", value: 0)
!7 = !DIEnumerator(name: "efGCT", value: 1)
!8 = !DIEnumerator(name: "efTRX", value: 2)
!9 = !DIEnumerator(name: "efTRN", value: 3)
!10 = !DIEnumerator(name: "efTRR", value: 4)
!11 = !DIEnumerator(name: "efTRJ", value: 5)
!12 = !DIEnumerator(name: "efXTC", value: 6)
!13 = !DIEnumerator(name: "efG87", value: 7)
!14 = !DIEnumerator(name: "efENX", value: 8)
!15 = !DIEnumerator(name: "efEDR", value: 9)
!16 = !DIEnumerator(name: "efENE", value: 10)
!17 = !DIEnumerator(name: "efSTX", value: 11)
!18 = !DIEnumerator(name: "efSTO", value: 12)
!19 = !DIEnumerator(name: "efGRO", value: 13)
!20 = !DIEnumerator(name: "efG96", value: 14)
!21 = !DIEnumerator(name: "efPDB", value: 15)
!22 = !DIEnumerator(name: "efBRK", value: 16)
!23 = !DIEnumerator(name: "efENT", value: 17)
!24 = !DIEnumerator(name: "efLOG", value: 18)
!25 = !DIEnumerator(name: "efXVG", value: 19)
!26 = !DIEnumerator(name: "efOUT", value: 20)
!27 = !DIEnumerator(name: "efNDX", value: 21)
!28 = !DIEnumerator(name: "efTOP", value: 22)
!29 = !DIEnumerator(name: "efITP", value: 23)
!30 = !DIEnumerator(name: "efTPX", value: 24)
!31 = !DIEnumerator(name: "efTPS", value: 25)
!32 = !DIEnumerator(name: "efTPR", value: 26)
!33 = !DIEnumerator(name: "efTPA", value: 27)
!34 = !DIEnumerator(name: "efTPB", value: 28)
!35 = !DIEnumerator(name: "efTEX", value: 29)
!36 = !DIEnumerator(name: "efRTP", value: 30)
!37 = !DIEnumerator(name: "efATP", value: 31)
!38 = !DIEnumerator(name: "efHDB", value: 32)
!39 = !DIEnumerator(name: "efDAT", value: 33)
!40 = !DIEnumerator(name: "efDLG", value: 34)
!41 = !DIEnumerator(name: "efMAP", value: 35)
!42 = !DIEnumerator(name: "efEPS", value: 36)
!43 = !DIEnumerator(name: "efMAT", value: 37)
!44 = !DIEnumerator(name: "efM2P", value: 38)
!45 = !DIEnumerator(name: "efMTX", value: 39)
!46 = !DIEnumerator(name: "efEDI", value: 40)
!47 = !DIEnumerator(name: "efEDO", value: 41)
!48 = !DIEnumerator(name: "efPPA", value: 42)
!49 = !DIEnumerator(name: "efPDO", value: 43)
!50 = !DIEnumerator(name: "efHAT", value: 44)
!51 = !DIEnumerator(name: "efXPM", value: 45)
!52 = !DIEnumerator(name: "efNR", value: 46)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 107, size: 32, align: 32, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIEnumerator(name: "effXYZ", value: 0)
!56 = !DIEnumerator(name: "effXYZBox", value: 1)
!57 = !DIEnumerator(name: "effG87", value: 2)
!58 = !DIEnumerator(name: "effG87Box", value: 3)
!59 = !DIEnumerator(name: "effNR", value: 4)
!60 = !{!61, !62, !63, !64, !67}
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !65, line: 87, baseType: !66)
!65 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!66 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "eFileFormat", file: !1, line: 107, baseType: !53)
!68 = !{!69, !136, !142, !148, !154, !160, !163, !166, !169, !172, !175, !178, !187, !196, !209, !212, !215, !218, !232, !246, !252, !258, !262, !267, !383, !400, !408, !423, !428, !434, !444, !455, !467, !477, !480, !483, !491, !500, !508, !515, !521, !547, !557, !568, !580, !588, !594, !599, !604, !613, !621, !624, !628, !632}
!69 = !DISubprogram(name: "__sputc", scope: !70, file: !70, line: 348, type: !71, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !133)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!71 = !DISubroutineType(types: !72)
!72 = !{!62, !62, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !70, line: 153, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !70, line: 122, size: 1216, align: 64, elements: !76)
!76 = !{!77, !80, !81, !82, !84, !85, !90, !91, !92, !96, !101, !111, !117, !118, !121, !122, !126, !130, !131, !132}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !75, file: !70, line: 123, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !75, file: !70, line: 124, baseType: !62, size: 32, align: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !75, file: !70, line: 125, baseType: !62, size: 32, align: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !75, file: !70, line: 126, baseType: !83, size: 16, align: 16, offset: 128)
!83 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !75, file: !70, line: 127, baseType: !83, size: 16, align: 16, offset: 144)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !75, file: !70, line: 128, baseType: !86, size: 128, align: 64, offset: 192)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !70, line: 88, size: 128, align: 64, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !86, file: !70, line: 89, baseType: !78, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !86, file: !70, line: 90, baseType: !62, size: 32, align: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !75, file: !70, line: 129, baseType: !62, size: 32, align: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !75, file: !70, line: 132, baseType: !63, size: 64, align: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !75, file: !70, line: 133, baseType: !93, size: 64, align: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!62, !63}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !75, file: !70, line: 134, baseType: !97, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!62, !63, !100, !62}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !75, file: !70, line: 135, baseType: !102, size: 64, align: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !63, !105, !62}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !70, line: 77, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !107, line: 71, baseType: !108)
!107 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !75, file: !70, line: 136, baseType: !112, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!62, !63, !115, !62}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !75, file: !70, line: 139, baseType: !86, size: 128, align: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !75, file: !70, line: 140, baseType: !119, size: 64, align: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !70, line: 94, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !75, file: !70, line: 141, baseType: !62, size: 32, align: 32, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !75, file: !70, line: 144, baseType: !123, size: 24, align: 8, offset: 928)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 24, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !75, file: !70, line: 145, baseType: !127, size: 8, align: 8, offset: 952)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 1)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !75, file: !70, line: 148, baseType: !86, size: 128, align: 64, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !75, file: !70, line: 151, baseType: !62, size: 32, align: 32, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !75, file: !70, line: 152, baseType: !105, size: 64, align: 64, offset: 1152)
!133 = !{!134, !135}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !69, file: !70, line: 348, type: !62)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !69, file: !70, line: 348, type: !73)
!136 = !DISubprogram(name: "__sigbits", scope: !137, file: !137, line: 114, type: !138, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !140)
!137 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!138 = !DISubroutineType(types: !139)
!139 = !{!62, !62}
!140 = !{!141}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !136, file: !137, line: 114, type: !62)
!142 = !DISubprogram(name: "__inline_isfinitef", scope: !143, file: !143, line: 204, type: !144, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !146)
!143 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!144 = !DISubroutineType(types: !145)
!145 = !{!62, !66}
!146 = !{!147}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !142, file: !143, line: 204, type: !66)
!148 = !DISubprogram(name: "__inline_isfinited", scope: !143, file: !143, line: 207, type: !149, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !152)
!149 = !DISubroutineType(types: !150)
!150 = !{!62, !151}
!151 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!152 = !{!153}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !148, file: !143, line: 207, type: !151)
!154 = !DISubprogram(name: "__inline_isfinitel", scope: !143, file: !143, line: 210, type: !155, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !158)
!155 = !DISubroutineType(types: !156)
!156 = !{!62, !157}
!157 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!158 = !{!159}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !154, file: !143, line: 210, type: !157)
!160 = !DISubprogram(name: "__inline_isinff", scope: !143, file: !143, line: 213, type: !144, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !161)
!161 = !{!162}
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !160, file: !143, line: 213, type: !66)
!163 = !DISubprogram(name: "__inline_isinfd", scope: !143, file: !143, line: 216, type: !149, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !164)
!164 = !{!165}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !163, file: !143, line: 216, type: !151)
!166 = !DISubprogram(name: "__inline_isinfl", scope: !143, file: !143, line: 219, type: !155, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !167)
!167 = !{!168}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !166, file: !143, line: 219, type: !157)
!169 = !DISubprogram(name: "__inline_isnanf", scope: !143, file: !143, line: 222, type: !144, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !170)
!170 = !{!171}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !169, file: !143, line: 222, type: !66)
!172 = !DISubprogram(name: "__inline_isnand", scope: !143, file: !143, line: 225, type: !149, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !173)
!173 = !{!174}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !143, line: 225, type: !151)
!175 = !DISubprogram(name: "__inline_isnanl", scope: !143, file: !143, line: 228, type: !155, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !176)
!176 = !{!177}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !175, file: !143, line: 228, type: !157)
!178 = !DISubprogram(name: "__inline_signbitf", scope: !143, file: !143, line: 231, type: !144, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !179)
!179 = !{!180, !181}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !178, file: !143, line: 231, type: !66)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !178, file: !143, line: 232, type: !182)
!182 = !DICompositeType(tag: DW_TAG_union_type, scope: !178, file: !143, line: 232, size: 32, align: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !182, file: !143, line: 232, baseType: !66, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !182, file: !143, line: 232, baseType: !186, size: 32, align: 32)
!186 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!187 = !DISubprogram(name: "__inline_signbitd", scope: !143, file: !143, line: 236, type: !149, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !188)
!188 = !{!189, !190}
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !187, file: !143, line: 236, type: !151)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !187, file: !143, line: 237, type: !191)
!191 = !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !143, line: 237, size: 64, align: 64, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !191, file: !143, line: 237, baseType: !151, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !191, file: !143, line: 237, baseType: !195, size: 64, align: 64)
!195 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!196 = !DISubprogram(name: "__inline_signbitl", scope: !143, file: !143, line: 242, type: !155, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !197)
!197 = !{!198, !199}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !196, file: !143, line: 242, type: !157)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !196, file: !143, line: 246, type: !200)
!200 = !DICompositeType(tag: DW_TAG_union_type, scope: !196, file: !143, line: 243, size: 128, align: 128, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !200, file: !143, line: 244, baseType: !157, size: 128, align: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !200, file: !143, line: 245, baseType: !204, size: 128, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, scope: !200, file: !143, line: 245, size: 128, align: 64, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !204, file: !143, line: 245, baseType: !195, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !204, file: !143, line: 245, baseType: !208, size: 16, align: 16, offset: 64)
!208 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!209 = !DISubprogram(name: "__inline_isnormalf", scope: !143, file: !143, line: 257, type: !144, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !210)
!210 = !{!211}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !209, file: !143, line: 257, type: !66)
!212 = !DISubprogram(name: "__inline_isnormald", scope: !143, file: !143, line: 260, type: !149, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !213)
!213 = !{!214}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !212, file: !143, line: 260, type: !151)
!215 = !DISubprogram(name: "__inline_isnormall", scope: !143, file: !143, line: 263, type: !155, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !216)
!216 = !{!217}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !215, file: !143, line: 263, type: !157)
!218 = !DISubprogram(name: "__sincosf", scope: !143, file: !143, line: 642, type: !219, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !222)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !66, !221, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!222 = !{!223, !224, !225, !226}
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !218, file: !143, line: 642, type: !66)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !218, file: !143, line: 642, type: !221)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !218, file: !143, line: 642, type: !221)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !218, file: !143, line: 643, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !143, line: 634, size: 64, align: 32, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !228, file: !143, line: 634, baseType: !66, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !228, file: !143, line: 634, baseType: !66, size: 32, align: 32, offset: 32)
!232 = !DISubprogram(name: "__sincos", scope: !143, file: !143, line: 647, type: !233, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !236)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !151, !235, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!236 = !{!237, !238, !239, !240}
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !232, file: !143, line: 647, type: !151)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !232, file: !143, line: 647, type: !235)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !232, file: !143, line: 647, type: !235)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !232, file: !143, line: 648, type: !241)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !143, line: 635, size: 128, align: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !242, file: !143, line: 635, baseType: !151, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !242, file: !143, line: 635, baseType: !151, size: 64, align: 64, offset: 64)
!246 = !DISubprogram(name: "__sincospif", scope: !143, file: !143, line: 652, type: !219, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !247)
!247 = !{!248, !249, !250, !251}
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !246, file: !143, line: 652, type: !66)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !246, file: !143, line: 652, type: !221)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !246, file: !143, line: 652, type: !221)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !246, file: !143, line: 653, type: !227)
!252 = !DISubprogram(name: "__sincospi", scope: !143, file: !143, line: 657, type: !233, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !253)
!253 = !{!254, !255, !256, !257}
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !252, file: !143, line: 657, type: !151)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !252, file: !143, line: 657, type: !235)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !252, file: !143, line: 657, type: !235)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !252, file: !143, line: 658, type: !241)
!258 = !DISubprogram(name: "nframes_read", scope: !1, file: !1, line: 60, type: !259, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @nframes_read, variables: !261)
!259 = !DISubroutineType(types: !260)
!260 = !{!62}
!261 = !{}
!262 = !DISubprogram(name: "prec2ndec", scope: !1, file: !1, line: 98, type: !263, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @prec2ndec, variables: !265)
!263 = !DISubroutineType(types: !264)
!264 = !{!62, !64}
!265 = !{!266}
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prec", arg: 1, scope: !262, file: !1, line: 98, type: !64)
!267 = !DISubprogram(name: "clear_trxframe", scope: !1, file: !1, line: 113, type: !268, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_trxframe*, i32)* @clear_trxframe, variables: !380)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !270, !62}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_trxframe", file: !272, line: 72, baseType: !273)
!272 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/trx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!273 = !DICompositeType(tag: DW_TAG_structure_type, file: !272, line: 40, size: 1408, align: 64, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !364, !365, !366, !367, !371, !372, !373, !374, !375, !376}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !272, line: 42, baseType: !62, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "not_ok", scope: !273, file: !272, line: 43, baseType: !62, size: 32, align: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !273, file: !272, line: 44, baseType: !62, size: 32, align: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "t0", scope: !273, file: !272, line: 45, baseType: !64, size: 32, align: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tpf", scope: !273, file: !272, line: 47, baseType: !64, size: 32, align: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tppf", scope: !273, file: !272, line: 49, baseType: !64, size: 32, align: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bTitle", scope: !273, file: !272, line: 52, baseType: !62, size: 32, align: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !273, file: !272, line: 53, baseType: !100, size: 64, align: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bStep", scope: !273, file: !272, line: 54, baseType: !62, size: 32, align: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !273, file: !272, line: 55, baseType: !62, size: 32, align: 32, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "bTime", scope: !273, file: !272, line: 56, baseType: !62, size: 32, align: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !273, file: !272, line: 57, baseType: !64, size: 32, align: 32, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bLambda", scope: !273, file: !272, line: 58, baseType: !62, size: 32, align: 32, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !273, file: !272, line: 59, baseType: !64, size: 32, align: 32, offset: 480)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bAtoms", scope: !273, file: !272, line: 60, baseType: !62, size: 32, align: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !273, file: !272, line: 61, baseType: !291, size: 64, align: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !293, line: 94, baseType: !294)
!293 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!294 = !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 75, size: 10240, align: 64, elements: !295)
!295 = !{!296, !297, !315, !318, !319, !320, !321, !322, !323, !324, !339, !347}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !294, file: !293, line: 76, baseType: !62, size: 32, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !294, file: !293, line: 77, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !293, line: 57, baseType: !300)
!300 = !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 48, size: 320, align: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !314}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !300, file: !293, line: 49, baseType: !64, size: 32, align: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !300, file: !293, line: 49, baseType: !64, size: 32, align: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !300, file: !293, line: 50, baseType: !64, size: 32, align: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !300, file: !293, line: 50, baseType: !64, size: 32, align: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !293, line: 51, baseType: !208, size: 16, align: 16, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !300, file: !293, line: 52, baseType: !208, size: 16, align: 16, offset: 144)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !300, file: !293, line: 53, baseType: !62, size: 32, align: 32, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !300, file: !293, line: 54, baseType: !62, size: 32, align: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !300, file: !293, line: 55, baseType: !311, size: 72, align: 8, offset: 224)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 72, align: 8, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 9)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !300, file: !293, line: 56, baseType: !79, size: 8, align: 8, offset: 296)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !294, file: !293, line: 80, baseType: !316, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !294, file: !293, line: 82, baseType: !316, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !294, file: !293, line: 84, baseType: !316, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !294, file: !293, line: 86, baseType: !62, size: 32, align: 32, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !294, file: !293, line: 87, baseType: !316, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !294, file: !293, line: 89, baseType: !62, size: 32, align: 32, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !294, file: !293, line: 90, baseType: !316, size: 64, align: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !294, file: !293, line: 91, baseType: !325, size: 8448, align: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !326, line: 52, baseType: !327)
!326 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!327 = !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 36, size: 8448, align: 64, elements: !328)
!328 = !{!329, !333, !334, !337, !338}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !327, file: !326, line: 37, baseType: !330, size: 8192, align: 32)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8192, align: 32, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !327, file: !326, line: 43, baseType: !62, size: 32, align: 32, offset: 8192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !327, file: !326, line: 44, baseType: !335, size: 64, align: 64, offset: 8256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !65, line: 73, baseType: !62)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !327, file: !326, line: 45, baseType: !62, size: 32, align: 32, offset: 8320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !327, file: !326, line: 46, baseType: !335, size: 64, align: 64, offset: 8384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !294, file: !293, line: 92, baseType: !340, size: 1152, align: 64, offset: 9024)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 1152, align: 64, elements: !312)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !293, line: 73, baseType: !342)
!342 = !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 70, size: 128, align: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !342, file: !293, line: 71, baseType: !62, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !342, file: !293, line: 72, baseType: !346, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !294, file: !293, line: 93, baseType: !348, size: 64, align: 64, offset: 10176)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !293, line: 68, baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 59, size: 416, align: 32, elements: !351)
!351 = !{!352, !353, !354, !355, !359, !360, !361, !362}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !293, line: 60, baseType: !62, size: 32, align: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !350, file: !293, line: 61, baseType: !62, size: 32, align: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !350, file: !293, line: 62, baseType: !61, size: 8, align: 8, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !350, file: !293, line: 63, baseType: !356, size: 48, align: 8, offset: 72)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 48, align: 8, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 6)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !350, file: !293, line: 64, baseType: !64, size: 32, align: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !350, file: !293, line: 65, baseType: !64, size: 32, align: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !350, file: !293, line: 66, baseType: !62, size: 32, align: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !350, file: !293, line: 67, baseType: !363, size: 192, align: 32, offset: 224)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 192, align: 32, elements: !357)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bPrec", scope: !273, file: !272, line: 62, baseType: !62, size: 32, align: 32, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !273, file: !272, line: 63, baseType: !64, size: 32, align: 32, offset: 672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bX", scope: !273, file: !272, line: 64, baseType: !62, size: 32, align: 32, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !273, file: !272, line: 65, baseType: !368, size: 64, align: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !65, line: 101, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 96, align: 32, elements: !124)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bV", scope: !273, file: !272, line: 66, baseType: !62, size: 32, align: 32, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !273, file: !272, line: 67, baseType: !368, size: 64, align: 64, offset: 896)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bF", scope: !273, file: !272, line: 68, baseType: !62, size: 32, align: 32, offset: 960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !273, file: !272, line: 69, baseType: !368, size: 64, align: 64, offset: 1024)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bBox", scope: !273, file: !272, line: 70, baseType: !62, size: 32, align: 32, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !273, file: !272, line: 71, baseType: !377, size: 288, align: 32, offset: 1120)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !65, line: 103, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 288, align: 32, elements: !379)
!379 = !{!125, !125}
!380 = !{!381, !382}
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 1, scope: !267, file: !1, line: 113, type: !270)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bFirst", arg: 2, scope: !267, file: !1, line: 113, type: !62)
!383 = !DISubprogram(name: "write_trxframe_indexed", scope: !1, file: !1, line: 145, type: !384, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.t_trxframe*, i32, i32*)* @write_trxframe_indexed, variables: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{!62, !62, !270, !62, !335}
!386 = !{!387, !388, !389, !390, !391, !395, !396, !397, !398, !399}
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnum", arg: 1, scope: !383, file: !1, line: 145, type: !62)
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !383, file: !1, line: 145, type: !270)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nind", arg: 3, scope: !383, file: !1, line: 145, type: !62)
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ind", arg: 4, scope: !383, file: !1, line: 145, type: !335)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "title", scope: !383, file: !1, line: 147, type: !392)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32768, align: 8, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 4096)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xout", scope: !383, file: !1, line: 148, type: !368)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vout", scope: !383, file: !1, line: 148, type: !368)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fout", scope: !383, file: !1, line: 148, type: !368)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !383, file: !1, line: 149, type: !62)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prec", scope: !383, file: !1, line: 150, type: !64)
!400 = !DISubprogram(name: "write_trxframe", scope: !1, file: !1, line: 247, type: !401, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.t_trxframe*)* @write_trxframe, variables: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{!62, !62, !270}
!403 = !{!404, !405, !406, !407}
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnum", arg: 1, scope: !400, file: !1, line: 247, type: !62)
!405 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !400, file: !1, line: 247, type: !270)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "title", scope: !400, file: !1, line: 249, type: !392)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prec", scope: !400, file: !1, line: 250, type: !64)
!408 = !DISubprogram(name: "write_trx", scope: !1, file: !1, line: 307, type: !409, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*, %struct.t_atoms*, i32, float, [3 x float]*, [3 x float]*, [3 x float]*)* @write_trx, variables: !412)
!409 = !DISubroutineType(types: !410)
!410 = !{!62, !62, !62, !335, !291, !62, !64, !411, !368, !368}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnum", arg: 1, scope: !408, file: !1, line: 307, type: !62)
!414 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nind", arg: 2, scope: !408, file: !1, line: 307, type: !62)
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ind", arg: 3, scope: !408, file: !1, line: 307, type: !335)
!416 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 4, scope: !408, file: !1, line: 307, type: !291)
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 5, scope: !408, file: !1, line: 308, type: !62)
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 6, scope: !408, file: !1, line: 308, type: !64)
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !408, file: !1, line: 308, type: !411)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !408, file: !1, line: 308, type: !368)
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 9, scope: !408, file: !1, line: 308, type: !368)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !408, file: !1, line: 310, type: !271)
!423 = !DISubprogram(name: "close_trx", scope: !1, file: !1, line: 329, type: !424, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @close_trx, variables: !426)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !62}
!426 = !{!427}
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !423, file: !1, line: 329, type: !62)
!428 = !DISubprogram(name: "open_trx", scope: !1, file: !1, line: 334, type: !429, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @open_trx, variables: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{!62, !100, !100}
!431 = !{!432, !433}
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outfile", arg: 1, scope: !428, file: !1, line: 334, type: !100)
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filemode", arg: 2, scope: !428, file: !1, line: 334, type: !100)
!434 = !DISubprogram(name: "read_next_frame", scope: !1, file: !1, line: 589, type: !401, isLocal: false, isDefinition: true, scopeLine: 590, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.t_trxframe*)* @read_next_frame, variables: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443}
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !434, file: !1, line: 589, type: !62)
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !434, file: !1, line: 589, type: !270)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pt", scope: !434, file: !1, line: 591, type: !64)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ct", scope: !434, file: !1, line: 592, type: !62)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bOK", scope: !434, file: !1, line: 593, type: !62)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRet", scope: !434, file: !1, line: 593, type: !62)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bMissingData", scope: !434, file: !1, line: 593, type: !62)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bSkip", scope: !434, file: !1, line: 593, type: !62)
!444 = !DISubprogram(name: "read_first_frame", scope: !1, file: !1, line: 669, type: !445, isLocal: false, isDefinition: true, scopeLine: 670, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i8*, %struct.t_trxframe*, i32)* @read_first_frame, variables: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{!62, !346, !100, !270, !62}
!447 = !{!448, !449, !450, !451, !452, !453, !454}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !444, file: !1, line: 669, type: !346)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !444, file: !1, line: 669, type: !100)
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 3, scope: !444, file: !1, line: 669, type: !270)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 4, scope: !444, file: !1, line: 669, type: !62)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !444, file: !1, line: 671, type: !62)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bFirst", scope: !444, file: !1, line: 672, type: !62)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bOK", scope: !444, file: !1, line: 672, type: !62)
!455 = !DISubprogram(name: "read_first_x", scope: !1, file: !1, line: 747, type: !456, isLocal: false, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i8*, float*, [3 x float]**, [3 x float]*)* @read_first_x, variables: !460)
!456 = !DISubroutineType(types: !457)
!457 = !{!62, !346, !100, !458, !459, !411}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!460 = !{!461, !462, !463, !464, !465, !466}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !455, file: !1, line: 747, type: !346)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !455, file: !1, line: 747, type: !100)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 3, scope: !455, file: !1, line: 748, type: !458)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !455, file: !1, line: 748, type: !459)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !455, file: !1, line: 748, type: !411)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !455, file: !1, line: 750, type: !271)
!467 = !DISubprogram(name: "read_next_x", scope: !1, file: !1, line: 765, type: !468, isLocal: false, isDefinition: true, scopeLine: 766, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, float*, i32, [3 x float]*, [3 x float]*)* @read_next_x, variables: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!62, !62, !458, !62, !368, !411}
!470 = !{!471, !472, !473, !474, !475, !476}
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !467, file: !1, line: 765, type: !62)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 2, scope: !467, file: !1, line: 765, type: !458)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 3, scope: !467, file: !1, line: 765, type: !62)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !467, file: !1, line: 765, type: !368)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !467, file: !1, line: 765, type: !411)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRet", scope: !467, file: !1, line: 767, type: !62)
!477 = !DISubprogram(name: "close_trj", scope: !1, file: !1, line: 777, type: !424, isLocal: false, isDefinition: true, scopeLine: 778, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @close_trj, variables: !478)
!478 = !{!479}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !477, file: !1, line: 777, type: !62)
!480 = !DISubprogram(name: "rewind_trj", scope: !1, file: !1, line: 782, type: !424, isLocal: false, isDefinition: true, scopeLine: 783, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @rewind_trj, variables: !481)
!481 = !{!482}
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !480, file: !1, line: 782, type: !62)
!483 = !DISubprogram(name: "read_first_v", scope: !1, file: !1, line: 800, type: !456, isLocal: false, isDefinition: true, scopeLine: 801, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i8*, float*, [3 x float]**, [3 x float]*)* @read_first_v, variables: !484)
!484 = !{!485, !486, !487, !488, !489, !490}
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !483, file: !1, line: 800, type: !346)
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !483, file: !1, line: 800, type: !100)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 3, scope: !483, file: !1, line: 800, type: !458)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 4, scope: !483, file: !1, line: 800, type: !459)
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !483, file: !1, line: 800, type: !411)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !483, file: !1, line: 802, type: !271)
!491 = !DISubprogram(name: "read_next_v", scope: !1, file: !1, line: 813, type: !468, isLocal: false, isDefinition: true, scopeLine: 814, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, float*, i32, [3 x float]*, [3 x float]*)* @read_next_v, variables: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499}
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !491, file: !1, line: 813, type: !62)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 2, scope: !491, file: !1, line: 813, type: !458)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 3, scope: !491, file: !1, line: 813, type: !62)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 4, scope: !491, file: !1, line: 813, type: !368)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !491, file: !1, line: 813, type: !411)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !491, file: !1, line: 815, type: !271)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRet", scope: !491, file: !1, line: 816, type: !62)
!500 = !DISubprogram(name: "clear_mat", scope: !501, file: !501, line: 334, type: !502, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, variables: !504)
!501 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!502 = !DISubroutineType(types: !503)
!503 = !{null, !411}
!504 = !{!505, !506}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !500, file: !501, line: 334, type: !411)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nul", scope: !500, file: !501, line: 336, type: !507)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!508 = !DISubprogram(name: "copy_rvec", scope: !501, file: !501, line: 270, type: !509, isLocal: true, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, variables: !512)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !511, !458}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!512 = !{!513, !514}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !508, file: !501, line: 270, type: !511)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !508, file: !501, line: 270, type: !458)
!515 = !DISubprogram(name: "copy_mat", scope: !501, file: !501, line: 297, type: !516, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, variables: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !411, !411}
!518 = !{!519, !520}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !515, file: !501, line: 297, type: !411)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !515, file: !501, line: 297, type: !411)
!521 = !DISubprogram(name: "gmx_next_frame", scope: !1, file: !1, line: 342, type: !401, isLocal: true, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, variables: !522)
!522 = !{!523, !524, !525, !545, !546}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !521, file: !1, line: 342, type: !62)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !521, file: !1, line: 342, type: !270)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sh", scope: !521, file: !1, line: 344, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_trnheader", file: !527, line: 77, baseType: !528)
!527 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/trnio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!528 = !DICompositeType(tag: DW_TAG_structure_type, file: !527, line: 58, size: 480, align: 32, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ir_size", scope: !528, file: !527, line: 61, baseType: !62, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "e_size", scope: !528, file: !527, line: 62, baseType: !62, size: 32, align: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "box_size", scope: !528, file: !527, line: 63, baseType: !62, size: 32, align: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "vir_size", scope: !528, file: !527, line: 64, baseType: !62, size: 32, align: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pres_size", scope: !528, file: !527, line: 65, baseType: !62, size: 32, align: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "top_size", scope: !528, file: !527, line: 66, baseType: !62, size: 32, align: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sym_size", scope: !528, file: !527, line: 67, baseType: !62, size: 32, align: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "x_size", scope: !528, file: !527, line: 68, baseType: !62, size: 32, align: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "v_size", scope: !528, file: !527, line: 69, baseType: !62, size: 32, align: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !528, file: !527, line: 70, baseType: !62, size: 32, align: 32, offset: 288)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !528, file: !527, line: 72, baseType: !62, size: 32, align: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !528, file: !527, line: 73, baseType: !62, size: 32, align: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nre", scope: !528, file: !527, line: 74, baseType: !62, size: 32, align: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !528, file: !527, line: 75, baseType: !64, size: 32, align: 32, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !528, file: !527, line: 76, baseType: !64, size: 32, align: 32, offset: 448)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bOK", scope: !521, file: !1, line: 345, type: !62)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRet", scope: !521, file: !1, line: 345, type: !62)
!547 = !DISubprogram(name: "xyz_next_x", scope: !1, file: !1, line: 469, type: !548, isLocal: true, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, float*, i32, [3 x float]*, [3 x float]*)* @xyz_next_x, variables: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{!62, !73, !458, !62, !368, !411}
!550 = !{!551, !552, !553, !554, !555, !556}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !547, file: !1, line: 469, type: !73)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 2, scope: !547, file: !1, line: 469, type: !458)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 3, scope: !547, file: !1, line: 469, type: !62)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !547, file: !1, line: 469, type: !368)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !547, file: !1, line: 469, type: !411)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pt", scope: !547, file: !1, line: 475, type: !64)
!557 = !DISubprogram(name: "do_read_xyz", scope: !1, file: !1, line: 443, type: !558, isLocal: true, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, [3 x float]*, [3 x float]*)* @do_read_xyz, variables: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{!62, !73, !62, !368, !411}
!560 = !{!561, !562, !563, !564, !565, !566, !567}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !557, file: !1, line: 443, type: !73)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !557, file: !1, line: 443, type: !62)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !557, file: !1, line: 443, type: !368)
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !557, file: !1, line: 443, type: !411)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !557, file: !1, line: 445, type: !62)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !557, file: !1, line: 445, type: !62)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x0", scope: !557, file: !1, line: 446, type: !151)
!568 = !DISubprogram(name: "pdb_next_x", scope: !1, file: !1, line: 525, type: !569, isLocal: true, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_trxframe*)* @pdb_next_x, variables: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{!62, !73, !270}
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !568, file: !1, line: 525, type: !73)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !568, file: !1, line: 525, type: !270)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atoms", scope: !568, file: !1, line: 527, type: !292)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "model_nr", scope: !568, file: !1, line: 528, type: !62)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "na", scope: !568, file: !1, line: 528, type: !62)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "title", scope: !568, file: !1, line: 529, type: !392)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !568, file: !1, line: 529, type: !100)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dbl", scope: !568, file: !1, line: 530, type: !151)
