; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/typedefs.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }
%struct.t_topology = type { i8**, %struct.t_idef, %struct.t_atoms, [3 x %struct.t_block], %struct.t_symtab }
%struct.t_idef = type { i32, i32, i32, i32*, %union.t_iparams*, [44 x %struct.t_ilist] }
%union.t_iparams = type { %struct.anon.2 }
%struct.anon.2 = type { float, float, float, float, float, float }
%struct.t_ilist = type { i32, [256 x i32], i32* }
%struct.t_symtab = type { i32, %struct.symbuf* }
%struct.symbuf = type { i32, i8**, %struct.symbuf* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !23, subprograms: !30, globals: !513, imports: !513)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/typedefs.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !16}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15}
!6 = !DIEnumerator(name: "egcTC", value: 0)
!7 = !DIEnumerator(name: "egcENER", value: 1)
!8 = !DIEnumerator(name: "egcACC", value: 2)
!9 = !DIEnumerator(name: "egcFREEZE", value: 3)
!10 = !DIEnumerator(name: "egcUser1", value: 4)
!11 = !DIEnumerator(name: "egcUser2", value: 5)
!12 = !DIEnumerator(name: "egcVCM", value: 6)
!13 = !DIEnumerator(name: "egcXTC", value: 7)
!14 = !DIEnumerator(name: "egcORFIT", value: 8)
!15 = !DIEnumerator(name: "egcNR", value: 9)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 38, size: 32, align: 32, elements: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/enums.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !{!19, !20, !21, !22}
!19 = !DIEnumerator(name: "ebCGS", value: 0)
!20 = !DIEnumerator(name: "ebMOLS", value: 1)
!21 = !DIEnumerator(name: "ebSBLOCKS", value: 2)
!22 = !DIEnumerator(name: "ebNR", value: 3)
!23 = !{!24, !25}
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 30, baseType: !27)
!26 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !28, line: 92, baseType: !29)
!28 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!30 = !{!31, !99, !105, !127, !194, !358, !480, !488, !491, !494, !498, !502, !509}
!31 = !DISubprogram(name: "__sputc", scope: !32, file: !32, line: 348, type: !33, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !96)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !35, !36}
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 153, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !32, line: 122, size: 1216, align: 64, elements: !39)
!39 = !{!40, !43, !44, !45, !47, !48, !53, !54, !56, !60, !65, !74, !80, !81, !84, !85, !89, !93, !94, !95}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !38, file: !32, line: 123, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !38, file: !32, line: 124, baseType: !35, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !38, file: !32, line: 125, baseType: !35, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !38, file: !32, line: 126, baseType: !46, size: 16, align: 16, offset: 128)
!46 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !38, file: !32, line: 127, baseType: !46, size: 16, align: 16, offset: 144)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !38, file: !32, line: 128, baseType: !49, size: 128, align: 64, offset: 192)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !32, line: 88, size: 128, align: 64, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !49, file: !32, line: 89, baseType: !41, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !49, file: !32, line: 90, baseType: !35, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !38, file: !32, line: 129, baseType: !35, size: 32, align: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !38, file: !32, line: 132, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !38, file: !32, line: 133, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!35, !55}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !38, file: !32, line: 134, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!35, !55, !64, !35}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !38, file: !32, line: 135, baseType: !66, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !55, !69, !35}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !32, line: 77, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !71, line: 71, baseType: !72)
!71 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !28, line: 46, baseType: !73)
!73 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !38, file: !32, line: 136, baseType: !75, size: 64, align: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!35, !55, !78, !35}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !38, file: !32, line: 139, baseType: !49, size: 128, align: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !38, file: !32, line: 140, baseType: !82, size: 64, align: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !32, line: 94, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !38, file: !32, line: 141, baseType: !35, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !38, file: !32, line: 144, baseType: !86, size: 24, align: 8, offset: 928)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 24, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 3)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !38, file: !32, line: 145, baseType: !90, size: 8, align: 8, offset: 952)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !38, file: !32, line: 148, baseType: !49, size: 128, align: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !38, file: !32, line: 151, baseType: !35, size: 32, align: 32, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !38, file: !32, line: 152, baseType: !69, size: 64, align: 64, offset: 1152)
!96 = !{!97, !98}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !31, file: !32, line: 348, type: !35)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !31, file: !32, line: 348, type: !36)
!99 = !DISubprogram(name: "__sigbits", scope: !100, file: !100, line: 114, type: !101, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !103)
!100 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!101 = !DISubroutineType(types: !102)
!102 = !{!35, !35}
!103 = !{!104}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !99, file: !100, line: 114, type: !35)
!105 = !DISubprogram(name: "init_block", scope: !1, file: !1, line: 38, type: !106, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_block*)* @init_block, variables: !124)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !110, line: 52, baseType: !111)
!110 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 36, size: 8448, align: 64, elements: !112)
!112 = !{!113, !117, !118, !122, !123}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !111, file: !110, line: 37, baseType: !114, size: 8192, align: 32)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, align: 32, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !111, file: !110, line: 43, baseType: !35, size: 32, align: 32, offset: 8192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !111, file: !110, line: 44, baseType: !119, size: 64, align: 64, offset: 8256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !121, line: 73, baseType: !35)
!121 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !111, file: !110, line: 45, baseType: !35, size: 32, align: 32, offset: 8320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !111, file: !110, line: 46, baseType: !119, size: 64, align: 64, offset: 8384)
!124 = !{!125, !126}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 1, scope: !105, file: !1, line: 38, type: !108)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !105, file: !1, line: 40, type: !35)
!127 = !DISubprogram(name: "init_atom", scope: !1, file: !1, line: 51, type: !128, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*)* @init_atom, variables: !191)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !4, line: 94, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 75, size: 10240, align: 64, elements: !133)
!133 = !{!134, !135, !156, !159, !160, !161, !162, !163, !164, !165, !166, !174}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !132, file: !4, line: 76, baseType: !35, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !132, file: !4, line: 77, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !4, line: 57, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 320, align: 32, elements: !139)
!139 = !{!140, !143, !144, !145, !146, !148, !149, !150, !151, !155}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !138, file: !4, line: 49, baseType: !141, size: 32, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !121, line: 87, baseType: !142)
!142 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !138, file: !4, line: 49, baseType: !141, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !138, file: !4, line: 50, baseType: !141, size: 32, align: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !138, file: !4, line: 50, baseType: !141, size: 32, align: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !4, line: 51, baseType: !147, size: 16, align: 16, offset: 128)
!147 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !138, file: !4, line: 52, baseType: !147, size: 16, align: 16, offset: 144)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !138, file: !4, line: 53, baseType: !35, size: 32, align: 32, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !138, file: !4, line: 54, baseType: !35, size: 32, align: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !138, file: !4, line: 55, baseType: !152, size: 72, align: 8, offset: 224)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 72, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 9)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !138, file: !4, line: 56, baseType: !42, size: 8, align: 8, offset: 296)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !132, file: !4, line: 80, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !132, file: !4, line: 82, baseType: !157, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !132, file: !4, line: 84, baseType: !157, size: 64, align: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !132, file: !4, line: 86, baseType: !35, size: 32, align: 32, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !132, file: !4, line: 87, baseType: !157, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !132, file: !4, line: 89, baseType: !35, size: 32, align: 32, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !132, file: !4, line: 90, baseType: !157, size: 64, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !132, file: !4, line: 91, baseType: !109, size: 8448, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !132, file: !4, line: 92, baseType: !167, size: 1152, align: 64, offset: 9024)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1152, align: 64, elements: !153)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !4, line: 73, baseType: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 70, size: 128, align: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !169, file: !4, line: 71, baseType: !35, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !169, file: !4, line: 72, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !132, file: !4, line: 93, baseType: !175, size: 64, align: 64, offset: 10176)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !4, line: 68, baseType: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 59, size: 416, align: 32, elements: !178)
!178 = !{!179, !180, !181, !182, !186, !187, !188, !189}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !4, line: 60, baseType: !35, size: 32, align: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !177, file: !4, line: 61, baseType: !35, size: 32, align: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !177, file: !4, line: 62, baseType: !24, size: 8, align: 8, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !177, file: !4, line: 63, baseType: !183, size: 48, align: 8, offset: 72)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, align: 8, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 6)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !177, file: !4, line: 64, baseType: !141, size: 32, align: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !177, file: !4, line: 65, baseType: !141, size: 32, align: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !177, file: !4, line: 66, baseType: !35, size: 32, align: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !177, file: !4, line: 67, baseType: !190, size: 192, align: 32, offset: 224)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, align: 32, elements: !184)
!191 = !{!192, !193}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "at", arg: 1, scope: !127, file: !1, line: 51, type: !130)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !127, file: !1, line: 53, type: !35)
!194 = !DISubprogram(name: "init_top", scope: !1, file: !1, line: 72, type: !195, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_topology*)* @init_top, variables: !355)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !199, line: 42, baseType: !200)
!199 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!200 = !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 36, size: 402112, align: 64, elements: !201)
!201 = !{!202, !203, !337, !338, !340}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !199, line: 37, baseType: !158, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !200, file: !199, line: 38, baseType: !204, size: 366336, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !205, line: 188, baseType: !206)
!205 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!206 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 179, size: 366336, align: 64, elements: !207)
!207 = !{!208, !209, !210, !211, !214, !325}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !206, file: !205, line: 181, baseType: !35, size: 32, align: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !206, file: !205, line: 182, baseType: !35, size: 32, align: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !206, file: !205, line: 183, baseType: !35, size: 32, align: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !206, file: !205, line: 184, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !205, line: 133, baseType: !35)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !206, file: !205, line: 185, baseType: !215, size: 64, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !205, line: 131, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_union_type, file: !205, line: 97, size: 192, align: 32, elements: !218)
!218 = !{!219, !225, !232, !238, !247, !252, !259, !267, !272, !277, !283, !289, !294, !303, !312, !321}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !217, file: !205, line: 105, baseType: !220, size: 96, align: 32)
!220 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 105, size: 96, align: 32, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !220, file: !205, line: 105, baseType: !141, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !220, file: !205, line: 105, baseType: !141, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !220, file: !205, line: 105, baseType: !141, size: 32, align: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !217, file: !205, line: 106, baseType: !226, size: 128, align: 32)
!226 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 106, size: 128, align: 32, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !226, file: !205, line: 106, baseType: !141, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !226, file: !205, line: 106, baseType: !141, size: 32, align: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !226, file: !205, line: 106, baseType: !141, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !226, file: !205, line: 106, baseType: !141, size: 32, align: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !217, file: !205, line: 108, baseType: !233, size: 96, align: 32)
!233 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 108, size: 96, align: 32, elements: !234)
!234 = !{!235, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !233, file: !205, line: 108, baseType: !141, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !233, file: !205, line: 108, baseType: !141, size: 32, align: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !233, file: !205, line: 108, baseType: !141, size: 32, align: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !217, file: !205, line: 110, baseType: !239, size: 192, align: 32)
!239 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 110, size: 192, align: 32, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !239, file: !205, line: 110, baseType: !141, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !239, file: !205, line: 110, baseType: !141, size: 32, align: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !239, file: !205, line: 110, baseType: !141, size: 32, align: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !239, file: !205, line: 110, baseType: !141, size: 32, align: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !239, file: !205, line: 110, baseType: !141, size: 32, align: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !239, file: !205, line: 110, baseType: !141, size: 32, align: 32, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !217, file: !205, line: 111, baseType: !248, size: 64, align: 32)
!248 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 111, size: 64, align: 32, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !248, file: !205, line: 111, baseType: !141, size: 32, align: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !248, file: !205, line: 111, baseType: !141, size: 32, align: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !217, file: !205, line: 112, baseType: !253, size: 128, align: 32)
!253 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 112, size: 128, align: 32, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !253, file: !205, line: 112, baseType: !141, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !253, file: !205, line: 112, baseType: !141, size: 32, align: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !253, file: !205, line: 112, baseType: !141, size: 32, align: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !253, file: !205, line: 112, baseType: !141, size: 32, align: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !217, file: !205, line: 117, baseType: !260, size: 160, align: 32)
!260 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 117, size: 160, align: 32, elements: !261)
!261 = !{!262, !263, !264, !265, !266}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !260, file: !205, line: 117, baseType: !141, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !260, file: !205, line: 117, baseType: !141, size: 32, align: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !260, file: !205, line: 117, baseType: !35, size: 32, align: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !260, file: !205, line: 117, baseType: !141, size: 32, align: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !260, file: !205, line: 117, baseType: !141, size: 32, align: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !217, file: !205, line: 118, baseType: !268, size: 64, align: 32)
!268 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 118, size: 64, align: 32, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !268, file: !205, line: 118, baseType: !141, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !268, file: !205, line: 118, baseType: !141, size: 32, align: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !217, file: !205, line: 123, baseType: !273, size: 64, align: 32)
!273 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 123, size: 64, align: 32, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !273, file: !205, line: 123, baseType: !141, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !273, file: !205, line: 123, baseType: !141, size: 32, align: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !217, file: !205, line: 124, baseType: !278, size: 96, align: 32)
!278 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 124, size: 96, align: 32, elements: !279)
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !278, file: !205, line: 124, baseType: !141, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !278, file: !205, line: 124, baseType: !141, size: 32, align: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !278, file: !205, line: 124, baseType: !141, size: 32, align: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !217, file: !205, line: 125, baseType: !284, size: 192, align: 32)
!284 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 125, size: 192, align: 32, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !284, file: !205, line: 125, baseType: !287, size: 96, align: 32)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 96, align: 32, elements: !87)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !284, file: !205, line: 125, baseType: !287, size: 96, align: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !217, file: !205, line: 126, baseType: !290, size: 192, align: 32)
!290 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 126, size: 192, align: 32, elements: !291)
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !290, file: !205, line: 126, baseType: !293, size: 192, align: 32)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 192, align: 32, elements: !184)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !217, file: !205, line: 127, baseType: !295, size: 192, align: 32)
!295 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 127, size: 192, align: 32, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !295, file: !205, line: 127, baseType: !141, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !295, file: !205, line: 127, baseType: !141, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !295, file: !205, line: 127, baseType: !141, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !295, file: !205, line: 127, baseType: !141, size: 32, align: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !295, file: !205, line: 127, baseType: !141, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !295, file: !205, line: 127, baseType: !141, size: 32, align: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !217, file: !205, line: 128, baseType: !304, size: 192, align: 32)
!304 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 128, size: 192, align: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !304, file: !205, line: 128, baseType: !141, size: 32, align: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !304, file: !205, line: 128, baseType: !141, size: 32, align: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !304, file: !205, line: 128, baseType: !141, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !304, file: !205, line: 128, baseType: !141, size: 32, align: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !205, line: 128, baseType: !35, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !304, file: !205, line: 128, baseType: !35, size: 32, align: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !217, file: !205, line: 129, baseType: !313, size: 192, align: 32)
!313 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 129, size: 192, align: 32, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !313, file: !205, line: 129, baseType: !35, size: 32, align: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !313, file: !205, line: 129, baseType: !35, size: 32, align: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !313, file: !205, line: 129, baseType: !35, size: 32, align: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !313, file: !205, line: 129, baseType: !141, size: 32, align: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !313, file: !205, line: 129, baseType: !141, size: 32, align: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !313, file: !205, line: 129, baseType: !141, size: 32, align: 32, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !217, file: !205, line: 130, baseType: !322, size: 192, align: 32)
!322 = !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !205, line: 130, size: 192, align: 32, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !322, file: !205, line: 130, baseType: !293, size: 192, align: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !206, file: !205, line: 187, baseType: !326, size: 366080, align: 64, offset: 256)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 366080, align: 64, elements: !335)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !205, line: 140, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 135, size: 8320, align: 64, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !328, file: !205, line: 137, baseType: !35, size: 32, align: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !328, file: !205, line: 138, baseType: !114, size: 8192, align: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !328, file: !205, line: 139, baseType: !333, size: 64, align: 64, offset: 8256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !205, line: 45, baseType: !120)
!335 = !{!336}
!336 = !DISubrange(count: 44)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !200, file: !199, line: 39, baseType: !131, size: 10240, align: 64, offset: 366400)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !200, file: !199, line: 40, baseType: !339, size: 25344, align: 64, offset: 376640)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 25344, align: 64, elements: !87)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !200, file: !199, line: 41, baseType: !341, size: 128, align: 64, offset: 401984)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !342, line: 46, baseType: !343)
!342 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!343 = !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 42, size: 128, align: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !343, file: !342, line: 44, baseType: !35, size: 32, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !343, file: !342, line: 45, baseType: !347, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !342, line: 40, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !342, line: 36, size: 192, align: 64, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !349, file: !342, line: 37, baseType: !35, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !349, file: !342, line: 38, baseType: !158, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !342, line: 39, baseType: !354, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!355 = !{!356, !357}
!356 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 1, scope: !194, file: !1, line: 72, type: !197)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !194, file: !1, line: 74, type: !35)
!358 = !DISubprogram(name: "init_inputrec", scope: !1, file: !1, line: 83, type: !359, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_inputrec*)* @init_inputrec, variables: !478)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !363, line: 143, baseType: !364)
!363 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!364 = !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 55, size: 4736, align: 64, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !469, !477}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !364, file: !363, line: 56, baseType: !35, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !364, file: !363, line: 57, baseType: !35, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !364, file: !363, line: 58, baseType: !35, size: 32, align: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !364, file: !363, line: 59, baseType: !35, size: 32, align: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !364, file: !363, line: 60, baseType: !35, size: 32, align: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !364, file: !363, line: 61, baseType: !35, size: 32, align: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !364, file: !363, line: 62, baseType: !35, size: 32, align: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !364, file: !363, line: 63, baseType: !35, size: 32, align: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !364, file: !363, line: 65, baseType: !35, size: 32, align: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !364, file: !363, line: 66, baseType: !35, size: 32, align: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !364, file: !363, line: 67, baseType: !35, size: 32, align: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !364, file: !363, line: 68, baseType: !35, size: 32, align: 32, offset: 352)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !364, file: !363, line: 69, baseType: !35, size: 32, align: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !364, file: !363, line: 70, baseType: !35, size: 32, align: 32, offset: 416)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !364, file: !363, line: 71, baseType: !141, size: 32, align: 32, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !364, file: !363, line: 72, baseType: !141, size: 32, align: 32, offset: 480)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !364, file: !363, line: 73, baseType: !141, size: 32, align: 32, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !364, file: !363, line: 74, baseType: !35, size: 32, align: 32, offset: 544)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !364, file: !363, line: 74, baseType: !35, size: 32, align: 32, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !364, file: !363, line: 74, baseType: !35, size: 32, align: 32, offset: 608)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !364, file: !363, line: 76, baseType: !35, size: 32, align: 32, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !364, file: !363, line: 77, baseType: !141, size: 32, align: 32, offset: 672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !364, file: !363, line: 79, baseType: !35, size: 32, align: 32, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !364, file: !363, line: 80, baseType: !35, size: 32, align: 32, offset: 736)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !364, file: !363, line: 81, baseType: !35, size: 32, align: 32, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !364, file: !363, line: 82, baseType: !35, size: 32, align: 32, offset: 800)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !364, file: !363, line: 83, baseType: !35, size: 32, align: 32, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !364, file: !363, line: 84, baseType: !35, size: 32, align: 32, offset: 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !364, file: !363, line: 85, baseType: !35, size: 32, align: 32, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !364, file: !363, line: 86, baseType: !35, size: 32, align: 32, offset: 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !364, file: !363, line: 87, baseType: !141, size: 32, align: 32, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !364, file: !363, line: 88, baseType: !398, size: 288, align: 32, offset: 992)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !121, line: 105, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 288, align: 32, elements: !400)
!400 = !{!88, !88}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !364, file: !363, line: 89, baseType: !398, size: 288, align: 32, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !364, file: !363, line: 90, baseType: !35, size: 32, align: 32, offset: 1568)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !364, file: !363, line: 91, baseType: !141, size: 32, align: 32, offset: 1600)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !364, file: !363, line: 92, baseType: !141, size: 32, align: 32, offset: 1632)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !364, file: !363, line: 93, baseType: !35, size: 32, align: 32, offset: 1664)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !364, file: !363, line: 94, baseType: !141, size: 32, align: 32, offset: 1696)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !364, file: !363, line: 95, baseType: !141, size: 32, align: 32, offset: 1728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !364, file: !363, line: 96, baseType: !35, size: 32, align: 32, offset: 1760)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !364, file: !363, line: 97, baseType: !141, size: 32, align: 32, offset: 1792)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !364, file: !363, line: 98, baseType: !141, size: 32, align: 32, offset: 1824)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !364, file: !363, line: 99, baseType: !141, size: 32, align: 32, offset: 1856)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !364, file: !363, line: 100, baseType: !35, size: 32, align: 32, offset: 1888)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !364, file: !363, line: 101, baseType: !141, size: 32, align: 32, offset: 1920)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !364, file: !363, line: 102, baseType: !141, size: 32, align: 32, offset: 1952)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !364, file: !363, line: 103, baseType: !35, size: 32, align: 32, offset: 1984)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !364, file: !363, line: 104, baseType: !141, size: 32, align: 32, offset: 2016)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !364, file: !363, line: 105, baseType: !141, size: 32, align: 32, offset: 2048)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !364, file: !363, line: 106, baseType: !141, size: 32, align: 32, offset: 2080)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !364, file: !363, line: 107, baseType: !141, size: 32, align: 32, offset: 2112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !364, file: !363, line: 108, baseType: !141, size: 32, align: 32, offset: 2144)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !364, file: !363, line: 109, baseType: !35, size: 32, align: 32, offset: 2176)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !364, file: !363, line: 110, baseType: !35, size: 32, align: 32, offset: 2208)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !364, file: !363, line: 111, baseType: !35, size: 32, align: 32, offset: 2240)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !364, file: !363, line: 112, baseType: !141, size: 32, align: 32, offset: 2272)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !364, file: !363, line: 113, baseType: !141, size: 32, align: 32, offset: 2304)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !364, file: !363, line: 114, baseType: !141, size: 32, align: 32, offset: 2336)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !364, file: !363, line: 115, baseType: !35, size: 32, align: 32, offset: 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !364, file: !363, line: 116, baseType: !141, size: 32, align: 32, offset: 2400)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !364, file: !363, line: 117, baseType: !141, size: 32, align: 32, offset: 2432)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !364, file: !363, line: 118, baseType: !35, size: 32, align: 32, offset: 2464)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !364, file: !363, line: 120, baseType: !35, size: 32, align: 32, offset: 2496)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !364, file: !363, line: 122, baseType: !35, size: 32, align: 32, offset: 2528)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !364, file: !363, line: 124, baseType: !35, size: 32, align: 32, offset: 2560)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !364, file: !363, line: 125, baseType: !35, size: 32, align: 32, offset: 2592)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !364, file: !363, line: 126, baseType: !141, size: 32, align: 32, offset: 2624)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !364, file: !363, line: 127, baseType: !35, size: 32, align: 32, offset: 2656)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !364, file: !363, line: 128, baseType: !141, size: 32, align: 32, offset: 2688)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !364, file: !363, line: 129, baseType: !141, size: 32, align: 32, offset: 2720)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !364, file: !363, line: 130, baseType: !35, size: 32, align: 32, offset: 2752)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !364, file: !363, line: 131, baseType: !141, size: 32, align: 32, offset: 2784)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !364, file: !363, line: 132, baseType: !35, size: 32, align: 32, offset: 2816)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !364, file: !363, line: 133, baseType: !35, size: 32, align: 32, offset: 2848)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !364, file: !363, line: 134, baseType: !35, size: 32, align: 32, offset: 2880)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !364, file: !363, line: 135, baseType: !35, size: 32, align: 32, offset: 2912)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !364, file: !363, line: 136, baseType: !141, size: 32, align: 32, offset: 2944)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !364, file: !363, line: 137, baseType: !141, size: 32, align: 32, offset: 2976)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !364, file: !363, line: 138, baseType: !141, size: 32, align: 32, offset: 3008)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !364, file: !363, line: 139, baseType: !141, size: 32, align: 32, offset: 3040)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !364, file: !363, line: 140, baseType: !450, size: 512, align: 64, offset: 3072)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !363, line: 53, baseType: !451)
!451 = !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 42, size: 512, align: 64, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !459, !460, !461, !464, !468}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !451, file: !363, line: 43, baseType: !35, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !451, file: !363, line: 44, baseType: !35, size: 32, align: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !451, file: !363, line: 45, baseType: !35, size: 32, align: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !451, file: !363, line: 46, baseType: !35, size: 32, align: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !451, file: !363, line: 47, baseType: !458, size: 64, align: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !451, file: !363, line: 48, baseType: !458, size: 64, align: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !451, file: !363, line: 49, baseType: !458, size: 64, align: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !451, file: !363, line: 50, baseType: !462, size: 64, align: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !121, line: 101, baseType: !287)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !451, file: !363, line: 51, baseType: !465, size: 64, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !121, line: 107, baseType: !467)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 96, align: 32, elements: !87)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !451, file: !363, line: 52, baseType: !173, size: 64, align: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !364, file: !363, line: 141, baseType: !470, size: 576, align: 64, offset: 3584)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 576, align: 64, elements: !87)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !363, line: 40, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 36, size: 192, align: 64, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !472, file: !363, line: 37, baseType: !35, size: 32, align: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !472, file: !363, line: 38, baseType: !458, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !472, file: !363, line: 39, baseType: !458, size: 64, align: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !364, file: !363, line: 142, baseType: !470, size: 576, align: 64, offset: 4160)
!478 = !{!479}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 1, scope: !358, file: !1, line: 83, type: !361)
!480 = !DISubprogram(name: "stupid_fill", scope: !1, file: !1, line: 88, type: !481, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_block*, i32, i32)* @stupid_fill, variables: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !108, !35, !35}
!483 = !{!484, !485, !486, !487}
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grp", arg: 1, scope: !480, file: !1, line: 88, type: !108)
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natom", arg: 2, scope: !480, file: !1, line: 88, type: !35)
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOneIndexGroup", arg: 3, scope: !480, file: !1, line: 88, type: !35)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !480, file: !1, line: 90, type: !35)
!488 = !DISubprogram(name: "done_block", scope: !1, file: !1, line: 112, type: !106, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_block*)* @done_block, variables: !489)
!489 = !{!490}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 1, scope: !488, file: !1, line: 112, type: !108)
!491 = !DISubprogram(name: "done_atom", scope: !1, file: !1, line: 120, type: !128, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*)* @done_atom, variables: !492)
!492 = !{!493}
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "at", arg: 1, scope: !491, file: !1, line: 120, type: !130)
!494 = !DISubprogram(name: "done_top", scope: !1, file: !1, line: 130, type: !195, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_topology*)* @done_top, variables: !495)
!495 = !{!496, !497}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 1, scope: !494, file: !1, line: 130, type: !197)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !494, file: !1, line: 132, type: !35)
!498 = !DISubprogram(name: "done_inputrec", scope: !1, file: !1, line: 140, type: !359, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_inputrec*)* @done_inputrec, variables: !499)
!499 = !{!500, !501}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 1, scope: !498, file: !1, line: 140, type: !361)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !498, file: !1, line: 142, type: !35)
!502 = !DISubprogram(name: "init_t_atoms", scope: !1, file: !1, line: 157, type: !503, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*, i32, i32)* @init_t_atoms, variables: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !130, !35, !35}
!505 = !{!506, !507, !508}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 1, scope: !502, file: !1, line: 157, type: !130)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !502, file: !1, line: 157, type: !35)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bPdbinfo", arg: 3, scope: !502, file: !1, line: 157, type: !35)
!509 = !DISubprogram(name: "free_t_atoms", scope: !1, file: !1, line: 175, type: !128, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*)* @free_t_atoms, variables: !510)
!510 = !{!511, !512}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 1, scope: !509, file: !1, line: 175, type: !130)
