; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vcm.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_vcm = type { i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x [3 x float]]*, float*, i8**, i16* }
%struct.t_topology = type { i8**, %struct.t_idef, %struct.t_atoms, [3 x %struct.t_block], %struct.t_symtab }
%struct.t_idef = type { i32, i32, i32, i32*, %union.t_iparams*, [44 x %struct.t_ilist] }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_ilist = type { i32, [256 x i32], i32* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !23, subprograms: !26, globals: !686, imports: !686)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vcm.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 126, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/enums.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "ecmLINEAR", value: 0)
!7 = !DIEnumerator(name: "ecmANGULAR", value: 1)
!8 = !DIEnumerator(name: "ecmNO", value: 2)
!9 = !DIEnumerator(name: "ecmNR", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 41, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22}
!13 = !DIEnumerator(name: "egcTC", value: 0)
!14 = !DIEnumerator(name: "egcENER", value: 1)
!15 = !DIEnumerator(name: "egcACC", value: 2)
!16 = !DIEnumerator(name: "egcFREEZE", value: 3)
!17 = !DIEnumerator(name: "egcUser1", value: 4)
!18 = !DIEnumerator(name: "egcUser2", value: 5)
!19 = !DIEnumerator(name: "egcVCM", value: 6)
!20 = !DIEnumerator(name: "egcXTC", value: 7)
!21 = !DIEnumerator(name: "egcORFIT", value: 8)
!22 = !DIEnumerator(name: "egcNR", value: 9)
!23 = !{!24, !25}
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !{!27, !95, !101, !108, !114, !120, !123, !126, !129, !132, !135, !138, !147, !156, !169, !172, !175, !178, !192, !206, !212, !218, !527, !549, !566, !582, !588, !596, !603, !613, !622, !633, !640, !647, !654, !663, !670, !675, !681}
!27 = !DISubprogram(name: "__sputc", scope: !28, file: !28, line: 348, type: !29, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !92)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DISubroutineType(types: !30)
!30 = !{!25, !25, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 153, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !28, line: 122, size: 1216, align: 64, elements: !34)
!34 = !{!35, !38, !39, !40, !42, !43, !48, !49, !51, !55, !60, !70, !76, !77, !80, !81, !85, !89, !90, !91}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !33, file: !28, line: 123, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !33, file: !28, line: 124, baseType: !25, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !33, file: !28, line: 125, baseType: !25, size: 32, align: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !33, file: !28, line: 126, baseType: !41, size: 16, align: 16, offset: 128)
!41 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !33, file: !28, line: 127, baseType: !41, size: 16, align: 16, offset: 144)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !33, file: !28, line: 128, baseType: !44, size: 128, align: 64, offset: 192)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !28, line: 88, size: 128, align: 64, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !44, file: !28, line: 89, baseType: !36, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !44, file: !28, line: 90, baseType: !25, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !33, file: !28, line: 129, baseType: !25, size: 32, align: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !33, file: !28, line: 132, baseType: !50, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !33, file: !28, line: 133, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!25, !50}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !33, file: !28, line: 134, baseType: !56, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!25, !50, !59, !25}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !33, file: !28, line: 135, baseType: !61, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !50, !64, !25}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !28, line: 77, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !66, line: 71, baseType: !67)
!66 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !68, line: 46, baseType: !69)
!68 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!69 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !33, file: !28, line: 136, baseType: !71, size: 64, align: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!25, !50, !74, !25}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !33, file: !28, line: 139, baseType: !44, size: 128, align: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !33, file: !28, line: 140, baseType: !78, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !28, line: 94, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !33, file: !28, line: 141, baseType: !25, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !33, file: !28, line: 144, baseType: !82, size: 24, align: 8, offset: 928)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, align: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 3)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !33, file: !28, line: 145, baseType: !86, size: 8, align: 8, offset: 952)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !33, file: !28, line: 148, baseType: !44, size: 128, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !33, file: !28, line: 151, baseType: !25, size: 32, align: 32, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !33, file: !28, line: 152, baseType: !64, size: 64, align: 64, offset: 1152)
!92 = !{!93, !94}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !27, file: !28, line: 348, type: !25)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !27, file: !28, line: 348, type: !31)
!95 = !DISubprogram(name: "__sigbits", scope: !96, file: !96, line: 114, type: !97, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !99)
!96 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !DISubroutineType(types: !98)
!98 = !{!25, !25}
!99 = !{!100}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !95, file: !96, line: 114, type: !25)
!101 = !DISubprogram(name: "__inline_isfinitef", scope: !102, file: !102, line: 204, type: !103, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !106)
!102 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !DISubroutineType(types: !104)
!104 = !{!25, !105}
!105 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!106 = !{!107}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !101, file: !102, line: 204, type: !105)
!108 = !DISubprogram(name: "__inline_isfinited", scope: !102, file: !102, line: 207, type: !109, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !112)
!109 = !DISubroutineType(types: !110)
!110 = !{!25, !111}
!111 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!112 = !{!113}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !108, file: !102, line: 207, type: !111)
!114 = !DISubprogram(name: "__inline_isfinitel", scope: !102, file: !102, line: 210, type: !115, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !118)
!115 = !DISubroutineType(types: !116)
!116 = !{!25, !117}
!117 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!118 = !{!119}
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !114, file: !102, line: 210, type: !117)
!120 = !DISubprogram(name: "__inline_isinff", scope: !102, file: !102, line: 213, type: !103, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !121)
!121 = !{!122}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !120, file: !102, line: 213, type: !105)
!123 = !DISubprogram(name: "__inline_isinfd", scope: !102, file: !102, line: 216, type: !109, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !124)
!124 = !{!125}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !123, file: !102, line: 216, type: !111)
!126 = !DISubprogram(name: "__inline_isinfl", scope: !102, file: !102, line: 219, type: !115, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !127)
!127 = !{!128}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !126, file: !102, line: 219, type: !117)
!129 = !DISubprogram(name: "__inline_isnanf", scope: !102, file: !102, line: 222, type: !103, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !130)
!130 = !{!131}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !129, file: !102, line: 222, type: !105)
!132 = !DISubprogram(name: "__inline_isnand", scope: !102, file: !102, line: 225, type: !109, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !133)
!133 = !{!134}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !132, file: !102, line: 225, type: !111)
!135 = !DISubprogram(name: "__inline_isnanl", scope: !102, file: !102, line: 228, type: !115, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !136)
!136 = !{!137}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !135, file: !102, line: 228, type: !117)
!138 = !DISubprogram(name: "__inline_signbitf", scope: !102, file: !102, line: 231, type: !103, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !139)
!139 = !{!140, !141}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !138, file: !102, line: 231, type: !105)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !138, file: !102, line: 232, type: !142)
!142 = !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !102, line: 232, size: 32, align: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !142, file: !102, line: 232, baseType: !105, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !142, file: !102, line: 232, baseType: !146, size: 32, align: 32)
!146 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!147 = !DISubprogram(name: "__inline_signbitd", scope: !102, file: !102, line: 236, type: !109, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !148)
!148 = !{!149, !150}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !147, file: !102, line: 236, type: !111)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !147, file: !102, line: 237, type: !151)
!151 = !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !102, line: 237, size: 64, align: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !151, file: !102, line: 237, baseType: !111, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !151, file: !102, line: 237, baseType: !155, size: 64, align: 64)
!155 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!156 = !DISubprogram(name: "__inline_signbitl", scope: !102, file: !102, line: 242, type: !115, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !157)
!157 = !{!158, !159}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !156, file: !102, line: 242, type: !117)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !156, file: !102, line: 246, type: !160)
!160 = !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !102, line: 243, size: 128, align: 128, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !160, file: !102, line: 244, baseType: !117, size: 128, align: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !160, file: !102, line: 245, baseType: !164, size: 128, align: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, scope: !160, file: !102, line: 245, size: 128, align: 64, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !164, file: !102, line: 245, baseType: !155, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !164, file: !102, line: 245, baseType: !168, size: 16, align: 16, offset: 64)
!168 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!169 = !DISubprogram(name: "__inline_isnormalf", scope: !102, file: !102, line: 257, type: !103, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !170)
!170 = !{!171}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !169, file: !102, line: 257, type: !105)
!172 = !DISubprogram(name: "__inline_isnormald", scope: !102, file: !102, line: 260, type: !109, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !173)
!173 = !{!174}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !102, line: 260, type: !111)
!175 = !DISubprogram(name: "__inline_isnormall", scope: !102, file: !102, line: 263, type: !115, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !176)
!176 = !{!177}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !175, file: !102, line: 263, type: !117)
!178 = !DISubprogram(name: "__sincosf", scope: !102, file: !102, line: 642, type: !179, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !182)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !105, !181, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!182 = !{!183, !184, !185, !186}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !178, file: !102, line: 642, type: !105)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !178, file: !102, line: 642, type: !181)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !178, file: !102, line: 642, type: !181)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !178, file: !102, line: 643, type: !187)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !102, line: 634, size: 64, align: 32, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !188, file: !102, line: 634, baseType: !105, size: 32, align: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !188, file: !102, line: 634, baseType: !105, size: 32, align: 32, offset: 32)
!192 = !DISubprogram(name: "__sincos", scope: !102, file: !102, line: 647, type: !193, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !196)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !111, !195, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!196 = !{!197, !198, !199, !200}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !192, file: !102, line: 647, type: !111)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !192, file: !102, line: 647, type: !195)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !192, file: !102, line: 647, type: !195)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !192, file: !102, line: 648, type: !201)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !102, line: 635, size: 128, align: 64, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !202, file: !102, line: 635, baseType: !111, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !202, file: !102, line: 635, baseType: !111, size: 64, align: 64, offset: 64)
!206 = !DISubprogram(name: "__sincospif", scope: !102, file: !102, line: 652, type: !179, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !206, file: !102, line: 652, type: !105)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !206, file: !102, line: 652, type: !181)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !206, file: !102, line: 652, type: !181)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !206, file: !102, line: 653, type: !187)
!212 = !DISubprogram(name: "__sincospi", scope: !102, file: !102, line: 657, type: !193, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !212, file: !102, line: 657, type: !111)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !212, file: !102, line: 657, type: !195)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !212, file: !102, line: 657, type: !195)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !212, file: !102, line: 658, type: !201)
!218 = !DISubprogram(name: "init_vcm", scope: !1, file: !1, line: 42, type: !219, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_vcm* (%struct.__sFILE*, %struct.t_topology*, %struct.t_commrec*, %struct.t_mdatoms*, i32, i32, i32)* @init_vcm, variables: !515)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !31, !249, !476, !487, !25, !25, !25}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_vcm", file: !223, line: 56, baseType: !224)
!223 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vcm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!224 = !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 44, size: 640, align: 64, elements: !225)
!225 = !{!226, !227, !228, !234, !235, !236, !237, !238, !243, !245, !247}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !224, file: !223, line: 45, baseType: !25, size: 32, align: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !224, file: !223, line: 46, baseType: !25, size: 32, align: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "group_p", scope: !224, file: !223, line: 47, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !231, line: 101, baseType: !232)
!231 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 96, align: 32, elements: !83)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !231, line: 87, baseType: !105)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "group_v", scope: !224, file: !223, line: 48, baseType: !229, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "group_x", scope: !224, file: !223, line: 49, baseType: !229, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "group_j", scope: !224, file: !223, line: 50, baseType: !229, size: 64, align: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "group_w", scope: !224, file: !223, line: 51, baseType: !229, size: 64, align: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "group_i", scope: !224, file: !223, line: 52, baseType: !239, size: 64, align: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !231, line: 105, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 288, align: 32, elements: !242)
!242 = !{!84, !84}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "group_mass", scope: !224, file: !223, line: 53, baseType: !244, size: 64, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !224, file: !223, line: 54, baseType: !246, size: 64, align: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !224, file: !223, line: 55, baseType: !248, size: 64, align: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !251, line: 42, baseType: !252)
!251 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!252 = !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 36, size: 402112, align: 64, elements: !253)
!253 = !{!254, !255, !394, !459, !461}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !251, line: 37, baseType: !246, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !252, file: !251, line: 38, baseType: !256, size: 366336, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !257, line: 188, baseType: !258)
!257 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!258 = !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 179, size: 366336, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !266, !378}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !258, file: !257, line: 181, baseType: !25, size: 32, align: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !258, file: !257, line: 182, baseType: !25, size: 32, align: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !258, file: !257, line: 183, baseType: !25, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !258, file: !257, line: 184, baseType: !264, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !257, line: 133, baseType: !25)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !258, file: !257, line: 185, baseType: !267, size: 64, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !257, line: 131, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_union_type, file: !257, line: 97, size: 192, align: 32, elements: !270)
!270 = !{!271, !277, !284, !290, !299, !304, !311, !319, !324, !329, !335, !340, !347, !356, !365, !374}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !269, file: !257, line: 105, baseType: !272, size: 96, align: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 105, size: 96, align: 32, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !272, file: !257, line: 105, baseType: !233, size: 32, align: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !272, file: !257, line: 105, baseType: !233, size: 32, align: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !272, file: !257, line: 105, baseType: !233, size: 32, align: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !269, file: !257, line: 106, baseType: !278, size: 128, align: 32)
!278 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 106, size: 128, align: 32, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !278, file: !257, line: 106, baseType: !233, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !278, file: !257, line: 106, baseType: !233, size: 32, align: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !278, file: !257, line: 106, baseType: !233, size: 32, align: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !278, file: !257, line: 106, baseType: !233, size: 32, align: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !269, file: !257, line: 108, baseType: !285, size: 96, align: 32)
!285 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 108, size: 96, align: 32, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !285, file: !257, line: 108, baseType: !233, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !285, file: !257, line: 108, baseType: !233, size: 32, align: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !285, file: !257, line: 108, baseType: !233, size: 32, align: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !269, file: !257, line: 110, baseType: !291, size: 192, align: 32)
!291 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 110, size: 192, align: 32, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !291, file: !257, line: 110, baseType: !233, size: 32, align: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !291, file: !257, line: 110, baseType: !233, size: 32, align: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !291, file: !257, line: 110, baseType: !233, size: 32, align: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !291, file: !257, line: 110, baseType: !233, size: 32, align: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !291, file: !257, line: 110, baseType: !233, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !291, file: !257, line: 110, baseType: !233, size: 32, align: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !269, file: !257, line: 111, baseType: !300, size: 64, align: 32)
!300 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 111, size: 64, align: 32, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !300, file: !257, line: 111, baseType: !233, size: 32, align: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !300, file: !257, line: 111, baseType: !233, size: 32, align: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !269, file: !257, line: 112, baseType: !305, size: 128, align: 32)
!305 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 112, size: 128, align: 32, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !305, file: !257, line: 112, baseType: !233, size: 32, align: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !305, file: !257, line: 112, baseType: !233, size: 32, align: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !305, file: !257, line: 112, baseType: !233, size: 32, align: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !305, file: !257, line: 112, baseType: !233, size: 32, align: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !269, file: !257, line: 117, baseType: !312, size: 160, align: 32)
!312 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 117, size: 160, align: 32, elements: !313)
!313 = !{!314, !315, !316, !317, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !312, file: !257, line: 117, baseType: !233, size: 32, align: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !312, file: !257, line: 117, baseType: !233, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !312, file: !257, line: 117, baseType: !25, size: 32, align: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !312, file: !257, line: 117, baseType: !233, size: 32, align: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !312, file: !257, line: 117, baseType: !233, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !269, file: !257, line: 118, baseType: !320, size: 64, align: 32)
!320 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 118, size: 64, align: 32, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !320, file: !257, line: 118, baseType: !233, size: 32, align: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !320, file: !257, line: 118, baseType: !233, size: 32, align: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !269, file: !257, line: 123, baseType: !325, size: 64, align: 32)
!325 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 123, size: 64, align: 32, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !325, file: !257, line: 123, baseType: !233, size: 32, align: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !325, file: !257, line: 123, baseType: !233, size: 32, align: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !269, file: !257, line: 124, baseType: !330, size: 96, align: 32)
!330 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 124, size: 96, align: 32, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !330, file: !257, line: 124, baseType: !233, size: 32, align: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !330, file: !257, line: 124, baseType: !233, size: 32, align: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !330, file: !257, line: 124, baseType: !233, size: 32, align: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !269, file: !257, line: 125, baseType: !336, size: 192, align: 32)
!336 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 125, size: 192, align: 32, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !336, file: !257, line: 125, baseType: !232, size: 96, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !336, file: !257, line: 125, baseType: !232, size: 96, align: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !269, file: !257, line: 126, baseType: !341, size: 192, align: 32)
!341 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 126, size: 192, align: 32, elements: !342)
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !341, file: !257, line: 126, baseType: !344, size: 192, align: 32)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 192, align: 32, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 6)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !269, file: !257, line: 127, baseType: !348, size: 192, align: 32)
!348 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 127, size: 192, align: 32, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !348, file: !257, line: 127, baseType: !233, size: 32, align: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !348, file: !257, line: 127, baseType: !233, size: 32, align: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !348, file: !257, line: 127, baseType: !233, size: 32, align: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !348, file: !257, line: 127, baseType: !233, size: 32, align: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !348, file: !257, line: 127, baseType: !233, size: 32, align: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !348, file: !257, line: 127, baseType: !233, size: 32, align: 32, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !269, file: !257, line: 128, baseType: !357, size: 192, align: 32)
!357 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 128, size: 192, align: 32, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !357, file: !257, line: 128, baseType: !233, size: 32, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !357, file: !257, line: 128, baseType: !233, size: 32, align: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !357, file: !257, line: 128, baseType: !233, size: 32, align: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !357, file: !257, line: 128, baseType: !233, size: 32, align: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !357, file: !257, line: 128, baseType: !25, size: 32, align: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !357, file: !257, line: 128, baseType: !25, size: 32, align: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !269, file: !257, line: 129, baseType: !366, size: 192, align: 32)
!366 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 129, size: 192, align: 32, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !366, file: !257, line: 129, baseType: !25, size: 32, align: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !366, file: !257, line: 129, baseType: !25, size: 32, align: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !366, file: !257, line: 129, baseType: !25, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !366, file: !257, line: 129, baseType: !233, size: 32, align: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !366, file: !257, line: 129, baseType: !233, size: 32, align: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !366, file: !257, line: 129, baseType: !233, size: 32, align: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !269, file: !257, line: 130, baseType: !375, size: 192, align: 32)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !257, line: 130, size: 192, align: 32, elements: !376)
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !375, file: !257, line: 130, baseType: !344, size: 192, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !258, file: !257, line: 187, baseType: !379, size: 366080, align: 64, offset: 256)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 366080, align: 64, elements: !392)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !257, line: 140, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 135, size: 8320, align: 64, elements: !382)
!382 = !{!383, !384, !388}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !381, file: !257, line: 137, baseType: !25, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !381, file: !257, line: 138, baseType: !385, size: 8192, align: 32, offset: 32)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8192, align: 32, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !381, file: !257, line: 139, baseType: !389, size: 64, align: 64, offset: 8256)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !257, line: 45, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !231, line: 73, baseType: !25)
!392 = !{!393}
!393 = !DISubrange(count: 44)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !252, file: !251, line: 39, baseType: !395, size: 10240, align: 64, offset: 366400)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !11, line: 94, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 75, size: 10240, align: 64, elements: !397)
!397 = !{!398, !399, !417, !419, !420, !421, !422, !423, !424, !425, !436, !444}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !396, file: !11, line: 76, baseType: !25, size: 32, align: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !396, file: !11, line: 77, baseType: !400, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !11, line: 57, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 48, size: 320, align: 32, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !416}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !402, file: !11, line: 49, baseType: !233, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !402, file: !11, line: 49, baseType: !233, size: 32, align: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !402, file: !11, line: 50, baseType: !233, size: 32, align: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !402, file: !11, line: 50, baseType: !233, size: 32, align: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !402, file: !11, line: 51, baseType: !168, size: 16, align: 16, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !402, file: !11, line: 52, baseType: !168, size: 16, align: 16, offset: 144)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !402, file: !11, line: 53, baseType: !25, size: 32, align: 32, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !402, file: !11, line: 54, baseType: !25, size: 32, align: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !402, file: !11, line: 55, baseType: !413, size: 72, align: 8, offset: 224)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 72, align: 8, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 9)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !402, file: !11, line: 56, baseType: !37, size: 8, align: 8, offset: 296)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !396, file: !11, line: 80, baseType: !418, size: 64, align: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !396, file: !11, line: 82, baseType: !418, size: 64, align: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !396, file: !11, line: 84, baseType: !418, size: 64, align: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !396, file: !11, line: 86, baseType: !25, size: 32, align: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !396, file: !11, line: 87, baseType: !418, size: 64, align: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !396, file: !11, line: 89, baseType: !25, size: 32, align: 32, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !396, file: !11, line: 90, baseType: !418, size: 64, align: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !396, file: !11, line: 91, baseType: !426, size: 8448, align: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !427, line: 52, baseType: !428)
!427 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!428 = !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 36, size: 8448, align: 64, elements: !429)
!429 = !{!430, !431, !432, !434, !435}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !428, file: !427, line: 37, baseType: !385, size: 8192, align: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !428, file: !427, line: 43, baseType: !25, size: 32, align: 32, offset: 8192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !428, file: !427, line: 44, baseType: !433, size: 64, align: 64, offset: 8256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !428, file: !427, line: 45, baseType: !25, size: 32, align: 32, offset: 8320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !428, file: !427, line: 46, baseType: !433, size: 64, align: 64, offset: 8384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !396, file: !11, line: 92, baseType: !437, size: 1152, align: 64, offset: 9024)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 1152, align: 64, elements: !414)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !11, line: 73, baseType: !439)
!439 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 70, size: 128, align: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !439, file: !11, line: 71, baseType: !25, size: 32, align: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !439, file: !11, line: 72, baseType: !443, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !396, file: !11, line: 93, baseType: !445, size: 64, align: 64, offset: 10176)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !11, line: 68, baseType: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 59, size: 416, align: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !454, !455, !456, !457}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !447, file: !11, line: 60, baseType: !25, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !447, file: !11, line: 61, baseType: !25, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !447, file: !11, line: 62, baseType: !24, size: 8, align: 8, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !447, file: !11, line: 63, baseType: !453, size: 48, align: 8, offset: 72)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, align: 8, elements: !345)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !447, file: !11, line: 64, baseType: !233, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !447, file: !11, line: 65, baseType: !233, size: 32, align: 32, offset: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !447, file: !11, line: 66, baseType: !25, size: 32, align: 32, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !447, file: !11, line: 67, baseType: !458, size: 192, align: 32, offset: 224)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, align: 32, elements: !345)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !252, file: !251, line: 40, baseType: !460, size: 25344, align: 64, offset: 376640)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 25344, align: 64, elements: !83)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !252, file: !251, line: 41, baseType: !462, size: 128, align: 64, offset: 401984)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !463, line: 46, baseType: !464)
!463 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!464 = !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 42, size: 128, align: 64, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !464, file: !463, line: 44, baseType: !25, size: 32, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !464, file: !463, line: 45, baseType: !468, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !463, line: 40, baseType: !470)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !463, line: 36, size: 192, align: 64, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !470, file: !463, line: 37, baseType: !25, size: 32, align: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !470, file: !463, line: 38, baseType: !246, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !463, line: 39, baseType: !475, size: 64, align: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !478, line: 40, baseType: !479)
!478 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!479 = !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 36, size: 192, align: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !479, file: !478, line: 37, baseType: !25, size: 32, align: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !479, file: !478, line: 37, baseType: !25, size: 32, align: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !479, file: !478, line: 38, baseType: !25, size: 32, align: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !479, file: !478, line: 38, baseType: !25, size: 32, align: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !479, file: !478, line: 39, baseType: !25, size: 32, align: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !479, file: !478, line: 39, baseType: !25, size: 32, align: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !489, line: 51, baseType: !490)
!489 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!490 = !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 40, size: 1408, align: 64, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !490, file: !489, line: 41, baseType: !233, size: 32, align: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !490, file: !489, line: 42, baseType: !25, size: 32, align: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !490, file: !489, line: 43, baseType: !244, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !490, file: !489, line: 43, baseType: !244, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !490, file: !489, line: 43, baseType: !244, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !490, file: !489, line: 43, baseType: !244, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !490, file: !489, line: 44, baseType: !244, size: 64, align: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !490, file: !489, line: 44, baseType: !244, size: 64, align: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !490, file: !489, line: 44, baseType: !244, size: 64, align: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !490, file: !489, line: 45, baseType: !443, size: 64, align: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !490, file: !489, line: 46, baseType: !443, size: 64, align: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !490, file: !489, line: 47, baseType: !443, size: 64, align: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !490, file: !489, line: 47, baseType: !443, size: 64, align: 64, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !490, file: !489, line: 48, baseType: !248, size: 64, align: 64, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !490, file: !489, line: 49, baseType: !248, size: 64, align: 64, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !490, file: !489, line: 49, baseType: !248, size: 64, align: 64, offset: 896)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !490, file: !489, line: 49, baseType: !248, size: 64, align: 64, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !490, file: !489, line: 49, baseType: !248, size: 64, align: 64, offset: 1024)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !490, file: !489, line: 49, baseType: !248, size: 64, align: 64, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !490, file: !489, line: 49, baseType: !248, size: 64, align: 64, offset: 1152)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !490, file: !489, line: 50, baseType: !248, size: 64, align: 64, offset: 1216)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !490, file: !489, line: 50, baseType: !248, size: 64, align: 64, offset: 1280)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !490, file: !489, line: 50, baseType: !248, size: 64, align: 64, offset: 1344)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !218, file: !1, line: 42, type: !31)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 2, scope: !218, file: !1, line: 42, type: !249)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !218, file: !1, line: 42, type: !476)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 4, scope: !218, file: !1, line: 42, type: !487)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !218, file: !1, line: 43, type: !25)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 6, scope: !218, file: !1, line: 43, type: !25)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nstcomm", arg: 7, scope: !218, file: !1, line: 43, type: !25)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vcm", scope: !218, file: !1, line: 45, type: !221)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mass", scope: !218, file: !1, line: 46, type: !244)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !218, file: !1, line: 47, type: !25)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !218, file: !1, line: 47, type: !25)
!527 = !DISubprogram(name: "calc_vcm_grp", scope: !1, file: !1, line: 120, type: !528, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, float*, [3 x float]*, [3 x float]*, %struct.t_vcm*)* @calc_vcm_grp, variables: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !31, !25, !25, !244, !229, !229, !221}
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !527, file: !1, line: 120, type: !31)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !527, file: !1, line: 120, type: !25)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 3, scope: !527, file: !1, line: 120, type: !25)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mass", arg: 4, scope: !527, file: !1, line: 120, type: !244)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !527, file: !1, line: 121, type: !229)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 6, scope: !527, file: !1, line: 121, type: !229)
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vcm", arg: 7, scope: !527, file: !1, line: 121, type: !221)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !527, file: !1, line: 123, type: !25)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !527, file: !1, line: 123, type: !25)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !527, file: !1, line: 123, type: !25)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m0", scope: !527, file: !1, line: 124, type: !233)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xx", scope: !527, file: !1, line: 124, type: !233)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !527, file: !1, line: 124, type: !233)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xz", scope: !527, file: !1, line: 124, type: !233)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yy", scope: !527, file: !1, line: 124, type: !233)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yz", scope: !527, file: !1, line: 124, type: !233)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zz", scope: !527, file: !1, line: 124, type: !233)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !527, file: !1, line: 125, type: !230)
