; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/wman.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_sandr = type { i8*, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_filenm = type { i32, i8*, i8*, i64 }
%struct.t_pargs = type { i8*, i32, i32, %union.anon, i8* }
%union.anon = type { i8* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [5 x i8] c"[TT]\00", align 1
@.str1 = private unnamed_addr constant [6 x i8] c"{\5Ctt \00", align 1
@.str2 = private unnamed_addr constant [5 x i8] c"[tt]\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"}\00", align 1
@.str4 = private unnamed_addr constant [5 x i8] c"[BB]\00", align 1
@.str5 = private unnamed_addr constant [6 x i8] c"{\5Cbf \00", align 1
@.str6 = private unnamed_addr constant [5 x i8] c"[bb]\00", align 1
@.str7 = private unnamed_addr constant [5 x i8] c"[IT]\00", align 1
@.str8 = private unnamed_addr constant [6 x i8] c"{\5Cem \00", align 1
@.str9 = private unnamed_addr constant [5 x i8] c"[it]\00", align 1
@.str10 = private unnamed_addr constant [6 x i8] c"[PAR]\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !24, globals: !344, imports: !379)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/wman.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 83, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/readinp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13}
!6 = !DIEnumerator(name: "etINT", value: 0)
!7 = !DIEnumerator(name: "etREAL", value: 1)
!8 = !DIEnumerator(name: "etTIME", value: 2)
!9 = !DIEnumerator(name: "etSTR", value: 3)
!10 = !DIEnumerator(name: "etBOOL", value: 4)
!11 = !DIEnumerator(name: "etRVEC", value: 5)
!12 = !DIEnumerator(name: "etENUM", value: 6)
!13 = !DIEnumerator(name: "etNR", value: 7)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 121, size: 32, align: 32, elements: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/enums.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "eshellCSH", value: 0)
!18 = !DIEnumerator(name: "eshellBASH", value: 1)
!19 = !DIEnumerator(name: "eshellZSH", value: 2)
!20 = !DIEnumerator(name: "eshellNR", value: 3)
!21 = !{!22, !23}
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !{!25, !93, !99, !104, !107, !113, !116, !128, !135, !189, !205, !215, !223, !238, !251, !276, !293, !310, !319, !330, !337}
!25 = !DISubprogram(name: "__sputc", scope: !26, file: !26, line: 348, type: !27, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !90)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !29, !30}
!29 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 153, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !26, line: 122, size: 1216, align: 64, elements: !33)
!33 = !{!34, !37, !38, !39, !41, !42, !47, !48, !49, !53, !58, !68, !74, !75, !78, !79, !83, !87, !88, !89}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !32, file: !26, line: 123, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !32, file: !26, line: 124, baseType: !29, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !32, file: !26, line: 125, baseType: !29, size: 32, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !26, line: 126, baseType: !40, size: 16, align: 16, offset: 128)
!40 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !32, file: !26, line: 127, baseType: !40, size: 16, align: 16, offset: 144)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !32, file: !26, line: 128, baseType: !43, size: 128, align: 64, offset: 192)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !26, line: 88, size: 128, align: 64, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !43, file: !26, line: 89, baseType: !35, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !43, file: !26, line: 90, baseType: !29, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !32, file: !26, line: 129, baseType: !29, size: 32, align: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !32, file: !26, line: 132, baseType: !23, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !32, file: !26, line: 133, baseType: !50, size: 64, align: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!29, !23}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !32, file: !26, line: 134, baseType: !54, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!29, !23, !57, !29}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !32, file: !26, line: 135, baseType: !59, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !23, !62, !29}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !26, line: 77, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !64, line: 71, baseType: !65)
!64 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !32, file: !26, line: 136, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!29, !23, !72, !29}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !32, file: !26, line: 139, baseType: !43, size: 128, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !32, file: !26, line: 140, baseType: !76, size: 64, align: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !26, line: 94, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !32, file: !26, line: 141, baseType: !29, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !32, file: !26, line: 144, baseType: !80, size: 24, align: 8, offset: 928)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 24, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !32, file: !26, line: 145, baseType: !84, size: 8, align: 8, offset: 952)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !32, file: !26, line: 148, baseType: !43, size: 128, align: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !32, file: !26, line: 151, baseType: !29, size: 32, align: 32, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !26, line: 152, baseType: !62, size: 64, align: 64, offset: 1152)
!90 = !{!91, !92}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !25, file: !26, line: 348, type: !29)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !25, file: !26, line: 348, type: !30)
!93 = !DISubprogram(name: "__sigbits", scope: !94, file: !94, line: 114, type: !95, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !97)
!94 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DISubroutineType(types: !96)
!96 = !{!29, !29}
!97 = !{!98}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !93, file: !94, line: 114, type: !29)
!99 = !DISubprogram(name: "check_tex", scope: !1, file: !1, line: 167, type: !100, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @check_tex, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!57, !57}
!102 = !{!103}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !99, file: !1, line: 167, type: !57)
!104 = !DISubprogram(name: "check_nroff", scope: !1, file: !1, line: 172, type: !100, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @check_nroff, variables: !105)
!105 = !{!106}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !104, file: !1, line: 172, type: !57)
!107 = !DISubprogram(name: "fileopt", scope: !1, file: !1, line: 201, type: !108, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @fileopt, variables: !111)
!108 = !DISubroutineType(types: !109)
!109 = !{!57, !110}
!110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!111 = !{!112}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 1, scope: !107, file: !1, line: 201, type: !110)
!113 = !DISubprogram(name: "check_tty", scope: !1, file: !1, line: 356, type: !100, isLocal: false, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @check_tty, variables: !114)
!114 = !{!115}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !113, file: !1, line: 356, type: !57)
!116 = !DISubprogram(name: "print_tty_formatted", scope: !1, file: !1, line: 361, type: !117, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i8**)* @print_tty_formatted, variables: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !30, !29, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!120 = !{!121, !122, !123, !124, !125, !126, !127}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !116, file: !1, line: 361, type: !30)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nldesc", arg: 2, scope: !116, file: !1, line: 361, type: !29)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 3, scope: !116, file: !1, line: 361, type: !119)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !116, file: !1, line: 363, type: !57)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !116, file: !1, line: 363, type: !57)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !116, file: !1, line: 364, type: !29)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !116, file: !1, line: 364, type: !29)
!128 = !DISubprogram(name: "check_html", scope: !1, file: !1, line: 423, type: !129, isLocal: false, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*)* @check_html, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!57, !57, !57}
!131 = !{!132, !133, !134}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !128, file: !1, line: 423, type: !57)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "program", arg: 2, scope: !128, file: !1, line: 423, type: !57)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !128, file: !1, line: 425, type: !57)
!135 = !DISubprogram(name: "write_man", scope: !1, file: !1, line: 613, type: !136, isLocal: false, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, i8*, i32, i8**, i32, %struct.t_filenm*, i32, %struct.t_pargs*, i32, i8**, i32)* @write_man, variables: !172)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !30, !57, !57, !29, !119, !29, !138, !29, !147, !29, !119, !29}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_filenm", file: !140, line: 62, baseType: !141)
!140 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!141 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 57, size: 256, align: 64, elements: !142)
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ftp", scope: !141, file: !140, line: 58, baseType: !29, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !141, file: !140, line: 59, baseType: !57, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !141, file: !140, line: 60, baseType: !57, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !141, file: !140, line: 61, baseType: !110, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pargs", file: !4, line: 105, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 91, size: 256, align: 64, elements: !150)
!150 = !{!151, !152, !153, !154, !171}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !149, file: !4, line: 92, baseType: !57, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bSet", scope: !149, file: !4, line: 93, baseType: !29, size: 32, align: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !4, line: 94, baseType: !29, size: 32, align: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !149, file: !4, line: 103, baseType: !155, size: 64, align: 64, offset: 128)
!155 = !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !4, line: 95, size: 64, align: 64, elements: !156)
!156 = !{!157, !158, !160, !165, !166, !167}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !155, file: !4, line: 96, baseType: !23, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !155, file: !4, line: 97, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !155, file: !4, line: 98, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !163, line: 87, baseType: !164)
!163 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!164 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !155, file: !4, line: 99, baseType: !119, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !155, file: !4, line: 101, baseType: !159, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !155, file: !4, line: 102, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !163, line: 101, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 96, align: 32, elements: !81)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !149, file: !4, line: 104, baseType: !57, size: 64, align: 64, offset: 192)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !135, file: !1, line: 613, type: !30)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mantp", arg: 2, scope: !135, file: !1, line: 613, type: !57)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "program", arg: 3, scope: !135, file: !1, line: 614, type: !57)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nldesc", arg: 4, scope: !135, file: !1, line: 615, type: !29)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 5, scope: !135, file: !1, line: 615, type: !119)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 6, scope: !135, file: !1, line: 616, type: !29)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 7, scope: !135, file: !1, line: 616, type: !138)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 8, scope: !135, file: !1, line: 617, type: !29)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 9, scope: !135, file: !1, line: 617, type: !147)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbug", arg: 10, scope: !135, file: !1, line: 618, type: !29)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bugs", arg: 11, scope: !135, file: !1, line: 618, type: !119)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bHidden", arg: 12, scope: !135, file: !1, line: 618, type: !29)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pr", scope: !135, file: !1, line: 620, type: !57)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !135, file: !1, line: 621, type: !29)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npar", scope: !135, file: !1, line: 621, type: !29)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !135, file: !1, line: 622, type: !147)
!189 = !DISubprogram(name: "repall", scope: !1, file: !1, line: 135, type: !190, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, %struct.t_sandr*)* @repall, variables: !198)
!190 = !DISubroutineType(types: !191)
!191 = !{!57, !57, !29, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sandr", file: !1, line: 48, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 46, size: 128, align: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !194, file: !1, line: 47, baseType: !57, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "replace", scope: !194, file: !1, line: 47, baseType: !57, size: 64, align: 64, offset: 64)
!198 = !{!199, !200, !201, !202, !203, !204}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !189, file: !1, line: 135, type: !57)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsr", arg: 2, scope: !189, file: !1, line: 135, type: !29)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sa", arg: 3, scope: !189, file: !1, line: 135, type: !192)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !189, file: !1, line: 137, type: !29)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !189, file: !1, line: 138, type: !57)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf2", scope: !189, file: !1, line: 138, type: !57)
!205 = !DISubprogram(name: "html_xref", scope: !1, file: !1, line: 177, type: !129, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, variables: !206)
!206 = !{!207, !208, !209, !213, !214}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !205, file: !1, line: 177, type: !57)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "program", arg: 2, scope: !205, file: !1, line: 177, type: !57)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !205, file: !1, line: 182, type: !210)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, align: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 256)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !205, file: !1, line: 183, type: !29)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !205, file: !1, line: 183, type: !29)
!215 = !DISubprogram(name: "repallww", scope: !1, file: !1, line: 151, type: !190, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, variables: !216)
!216 = !{!217, !218, !219, !220, !221, !222}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !215, file: !1, line: 151, type: !57)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsr", arg: 2, scope: !215, file: !1, line: 151, type: !29)
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sa", arg: 3, scope: !215, file: !1, line: 151, type: !192)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !215, file: !1, line: 153, type: !29)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !215, file: !1, line: 154, type: !57)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf2", scope: !215, file: !1, line: 154, type: !57)
!223 = !DISubprogram(name: "write_texman", scope: !1, file: !1, line: 226, type: !224, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, variables: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !30, !57, !29, !119, !29, !138, !29, !147, !29, !119}
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !223, file: !1, line: 226, type: !30)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "program", arg: 2, scope: !223, file: !1, line: 226, type: !57)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nldesc", arg: 3, scope: !223, file: !1, line: 227, type: !29)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 4, scope: !223, file: !1, line: 227, type: !119)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 5, scope: !223, file: !1, line: 228, type: !29)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 6, scope: !223, file: !1, line: 228, type: !138)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 7, scope: !223, file: !1, line: 229, type: !29)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 8, scope: !223, file: !1, line: 229, type: !147)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbug", arg: 9, scope: !223, file: !1, line: 230, type: !29)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bugs", arg: 10, scope: !223, file: !1, line: 230, type: !119)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !223, file: !1, line: 232, type: !29)
!238 = !DISubprogram(name: "write_nroffman", scope: !1, file: !1, line: 285, type: !224, isLocal: true, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: true, variables: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !238, file: !1, line: 285, type: !30)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "program", arg: 2, scope: !238, file: !1, line: 286, type: !57)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nldesc", arg: 3, scope: !238, file: !1, line: 287, type: !29)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 4, scope: !238, file: !1, line: 287, type: !119)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 5, scope: !238, file: !1, line: 288, type: !29)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 6, scope: !238, file: !1, line: 288, type: !138)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 7, scope: !238, file: !1, line: 289, type: !29)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 8, scope: !238, file: !1, line: 289, type: !147)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbug", arg: 9, scope: !238, file: !1, line: 290, type: !29)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bugs", arg: 10, scope: !238, file: !1, line: 290, type: !119)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !238, file: !1, line: 293, type: !29)
!251 = !DISubprogram(name: "mydate", scope: !1, file: !1, line: 118, type: !252, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @mydate, variables: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{!57}
!254 = !{!255, !260}
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !251, file: !1, line: 123, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !257, line: 30, baseType: !258)
!257 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !66, line: 120, baseType: !259)
!259 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !251, file: !1, line: 125, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !263, line: 73, size: 448, align: 64, elements: !264)
!263 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !262, file: !263, line: 74, baseType: !29, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !262, file: !263, line: 75, baseType: !29, size: 32, align: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !262, file: !263, line: 76, baseType: !29, size: 32, align: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !262, file: !263, line: 77, baseType: !29, size: 32, align: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !262, file: !263, line: 78, baseType: !29, size: 32, align: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !262, file: !263, line: 79, baseType: !29, size: 32, align: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !262, file: !263, line: 80, baseType: !29, size: 32, align: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !262, file: !263, line: 81, baseType: !29, size: 32, align: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !262, file: !263, line: 82, baseType: !29, size: 32, align: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !262, file: !263, line: 83, baseType: !259, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !262, file: !263, line: 84, baseType: !57, size: 64, align: 64, offset: 384)
!276 = !DISubprogram(name: "write_ttyman", scope: !1, file: !1, line: 386, type: !277, isLocal: true, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, i32, i8**, i32, %struct.t_filenm*, i32, %struct.t_pargs*, i32, i8**, i32)* @write_ttyman, variables: !279)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !30, !57, !29, !119, !29, !138, !29, !147, !29, !119, !29}
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !276, file: !1, line: 386, type: !30)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "program", arg: 2, scope: !276, file: !1, line: 387, type: !57)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nldesc", arg: 3, scope: !276, file: !1, line: 388, type: !29)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 4, scope: !276, file: !1, line: 388, type: !119)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 5, scope: !276, file: !1, line: 389, type: !29)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 6, scope: !276, file: !1, line: 389, type: !138)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 7, scope: !276, file: !1, line: 390, type: !29)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 8, scope: !276, file: !1, line: 390, type: !147)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbug", arg: 9, scope: !276, file: !1, line: 391, type: !29)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bugs", arg: 10, scope: !276, file: !1, line: 391, type: !119)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bHeader", arg: 11, scope: !276, file: !1, line: 391, type: !29)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !276, file: !1, line: 393, type: !29)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !276, file: !1, line: 394, type: !57)
!293 = !DISubprogram(name: "write_htmlman", scope: !1, file: !1, line: 433, type: !224, isLocal: true, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: true, variables: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !293, file: !1, line: 433, type: !30)
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "program", arg: 2, scope: !293, file: !1, line: 434, type: !57)
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nldesc", arg: 3, scope: !293, file: !1, line: 435, type: !29)
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 4, scope: !293, file: !1, line: 435, type: !119)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 5, scope: !293, file: !1, line: 436, type: !29)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 6, scope: !293, file: !1, line: 436, type: !138)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npargs", arg: 7, scope: !293, file: !1, line: 437, type: !29)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 8, scope: !293, file: !1, line: 437, type: !147)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbug", arg: 9, scope: !293, file: !1, line: 438, type: !29)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bugs", arg: 10, scope: !293, file: !1, line: 438, type: !119)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !293, file: !1, line: 440, type: !29)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !293, file: !1, line: 441, type: !307)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 80, align: 8, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 10)
