; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/writeps.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_rgb = type { float, float, float }

@.str = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str1 = private unnamed_addr constant [26 x i8] c"%%!PS-Adobe-2.0 EPSF-1.2\0A\00", align 1
@.str2 = private unnamed_addr constant [22 x i8] c"%%%%Creator: GROMACS\0A\00", align 1
@.str3 = private unnamed_addr constant [15 x i8] c"%%%%Title: %s\0A\00", align 1
@.str4 = private unnamed_addr constant [30 x i8] c"%%%%BoundingBox: %g %g %g %g\0A\00", align 1
@.str5 = private unnamed_addr constant [17 x i8] c"%%%%EndComments\0A\00", align 1
@.str6 = private unnamed_addr constant [22 x i8] c"/m {moveto} bind def\0A\00", align 1
@.str7 = private unnamed_addr constant [22 x i8] c"/l {lineto} bind def\0A\00", align 1
@.str8 = private unnamed_addr constant [24 x i8] c"/rm {rmoveto} bind def\0A\00", align 1
@.str9 = private unnamed_addr constant [24 x i8] c"/r  {rlineto} bind def\0A\00", align 1
@.str10 = private unnamed_addr constant [20 x i8] c"/f {fill} bind def\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !24, subprograms: !28, globals: !339, imports: !351)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/writeps.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 52, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/writeps.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "efontTIMES", value: 0)
!7 = !DIEnumerator(name: "efontTIMESITALIC", value: 1)
!8 = !DIEnumerator(name: "efontTIMESBOLD", value: 2)
!9 = !DIEnumerator(name: "efontTIMESBOLDITALIC", value: 3)
!10 = !DIEnumerator(name: "efontHELV", value: 4)
!11 = !DIEnumerator(name: "efontHELVITALIC", value: 5)
!12 = !DIEnumerator(name: "efontHELVBOLD", value: 6)
!13 = !DIEnumerator(name: "efontHELVBOLDITALIC", value: 7)
!14 = !DIEnumerator(name: "efontCOUR", value: 8)
!15 = !DIEnumerator(name: "efontCOURITALIC", value: 9)
!16 = !DIEnumerator(name: "efontCOURBOLD", value: 10)
!17 = !DIEnumerator(name: "efontCOURBOLDITALIC", value: 11)
!18 = !DIEnumerator(name: "efontNR", value: 12)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23}
!21 = !DIEnumerator(name: "eXCenter", value: 0)
!22 = !DIEnumerator(name: "eXLeft", value: 1)
!23 = !DIEnumerator(name: "eXRight", value: 2)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !26, line: 87, baseType: !27)
!26 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !{!29, !36, !109, !115, !123, !137, !144, !152, !157, !161, !166, !171, !176, !181, !190, !197, !204, !214, !222, !233, !242, !248, !255, !262, !270, !274, !283, !288, !293, !296, !299, !305, !309, !314, !323, !332}
!29 = !DISubprogram(name: "__sigbits", scope: !30, file: !30, line: 114, type: !31, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !34)
!30 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !33}
!33 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!34 = !{!35}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !29, file: !30, line: 114, type: !33)
!36 = !DISubprogram(name: "ps_open", scope: !1, file: !1, line: 46, type: !37, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: %struct.__sFILE* (i8*, float, float, float, float)* @ps_open, variables: !102)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !68, !25, !25, !25, !25}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 153, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !41, line: 122, size: 1216, align: 64, elements: !43)
!43 = !{!44, !47, !48, !49, !51, !52, !57, !58, !60, !64, !70, !80, !86, !87, !90, !91, !95, !99, !100, !101}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !42, file: !41, line: 123, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !42, file: !41, line: 124, baseType: !33, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !42, file: !41, line: 125, baseType: !33, size: 32, align: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !41, line: 126, baseType: !50, size: 16, align: 16, offset: 128)
!50 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !42, file: !41, line: 127, baseType: !50, size: 16, align: 16, offset: 144)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !42, file: !41, line: 128, baseType: !53, size: 128, align: 64, offset: 192)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !41, line: 88, size: 128, align: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !53, file: !41, line: 89, baseType: !45, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !53, file: !41, line: 90, baseType: !33, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !42, file: !41, line: 129, baseType: !33, size: 32, align: 32, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !42, file: !41, line: 132, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !42, file: !41, line: 133, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!33, !59}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !42, file: !41, line: 134, baseType: !65, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!33, !59, !68, !33}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !42, file: !41, line: 135, baseType: !71, size: 64, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !59, !74, !33}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !41, line: 77, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !76, line: 71, baseType: !77)
!76 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !78, line: 46, baseType: !79)
!78 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !42, file: !41, line: 136, baseType: !81, size: 64, align: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!33, !59, !84, !33}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !42, file: !41, line: 139, baseType: !53, size: 128, align: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !42, file: !41, line: 140, baseType: !88, size: 64, align: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !41, line: 94, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !42, file: !41, line: 141, baseType: !33, size: 32, align: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !42, file: !41, line: 144, baseType: !92, size: 24, align: 8, offset: 928)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 3)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !42, file: !41, line: 145, baseType: !96, size: 8, align: 8, offset: 952)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !42, file: !41, line: 148, baseType: !53, size: 128, align: 64, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !42, file: !41, line: 151, baseType: !33, size: 32, align: 32, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !41, line: 152, baseType: !74, size: 64, align: 64, offset: 1152)
!102 = !{!103, !104, !105, !106, !107, !108}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !36, file: !1, line: 46, type: !68)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x1", arg: 2, scope: !36, file: !1, line: 46, type: !25)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y1", arg: 3, scope: !36, file: !1, line: 46, type: !25)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x2", arg: 4, scope: !36, file: !1, line: 46, type: !25)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y2", arg: 5, scope: !36, file: !1, line: 46, type: !25)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !36, file: !1, line: 48, type: !39)
!109 = !DISubprogram(name: "ps_linewidth", scope: !1, file: !1, line: 72, type: !110, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32)* @ps_linewidth, variables: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !39, !33}
!112 = !{!113, !114}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !109, file: !1, line: 72, type: !39)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lw", arg: 2, scope: !109, file: !1, line: 72, type: !33)
!115 = !DISubprogram(name: "ps_color", scope: !1, file: !1, line: 122, type: !116, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, float, float, float)* @ps_color, variables: !118)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !39, !25, !25, !25}
!118 = !{!119, !120, !121, !122}
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !115, file: !1, line: 122, type: !39)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 2, scope: !115, file: !1, line: 122, type: !25)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 3, scope: !115, file: !1, line: 122, type: !25)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 4, scope: !115, file: !1, line: 122, type: !25)
!123 = !DISubprogram(name: "ps_rgb", scope: !1, file: !1, line: 127, type: !124, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_rgb*)* @ps_rgb, variables: !134)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !39, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_rgb", file: !128, line: 38, baseType: !129)
!128 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/matrix.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 36, size: 96, align: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !129, file: !128, line: 37, baseType: !25, size: 32, align: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !129, file: !128, line: 37, baseType: !25, size: 32, align: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !129, file: !128, line: 37, baseType: !25, size: 32, align: 32, offset: 64)
!134 = !{!135, !136}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !123, file: !1, line: 127, type: !39)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rgb", arg: 2, scope: !123, file: !1, line: 127, type: !126)
!137 = !DISubprogram(name: "ps_init_rgb_nbox", scope: !1, file: !1, line: 134, type: !138, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, float, float)* @ps_init_rgb_nbox, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !39, !25, !25}
!140 = !{!141, !142, !143}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !137, file: !1, line: 134, type: !39)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xbox", arg: 2, scope: !137, file: !1, line: 134, type: !25)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ybox", arg: 3, scope: !137, file: !1, line: 134, type: !25)
!144 = !DISubprogram(name: "ps_rgb_nbox", scope: !1, file: !1, line: 143, type: !145, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_rgb*, float)* @ps_rgb_nbox, variables: !147)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !39, !126, !25}
!147 = !{!148, !149, !150, !151}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !144, file: !1, line: 143, type: !39)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rgb", arg: 2, scope: !144, file: !1, line: 143, type: !126)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 3, scope: !144, file: !1, line: 143, type: !25)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !144, file: !1, line: 145, type: !33)
!152 = !DISubprogram(name: "ps_init_rgb_box", scope: !1, file: !1, line: 157, type: !138, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, float, float)* @ps_init_rgb_box, variables: !153)
!153 = !{!154, !155, !156}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !152, file: !1, line: 157, type: !39)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xbox", arg: 2, scope: !152, file: !1, line: 157, type: !25)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ybox", arg: 3, scope: !152, file: !1, line: 157, type: !25)
!157 = !DISubprogram(name: "ps_rgb_box", scope: !1, file: !1, line: 165, type: !124, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_rgb*)* @ps_rgb_box, variables: !158)
!158 = !{!159, !160}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !157, file: !1, line: 165, type: !39)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rgb", arg: 2, scope: !157, file: !1, line: 165, type: !126)
!161 = !DISubprogram(name: "ps_lineto", scope: !1, file: !1, line: 171, type: !138, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, float, float)* @ps_lineto, variables: !162)
!162 = !{!163, !164, !165}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !161, file: !1, line: 171, type: !39)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !161, file: !1, line: 171, type: !25)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !161, file: !1, line: 171, type: !25)
!166 = !DISubprogram(name: "ps_linerel", scope: !1, file: !1, line: 176, type: !138, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, float, float)* @ps_linerel, variables: !167)
!167 = !{!168, !169, !170}
