; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/xtcio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }

@debug = external global %struct.__sFILE*
@.str = private unnamed_addr constant [62 x i8] c"\0AXTC error: read/write of %s failed, source file %s, line %d\0A\00", align 1
@.str1 = private unnamed_addr constant [54 x i8] c"XTC read/write of %s failed, source file %s, line %d\0A\00", align 1
@.str2 = private unnamed_addr constant [3 x i8] c"*x\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !12, globals: !358, imports: !358)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/xtcio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !4, line: 119, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmx_system_xdr.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!7 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!8 = !DIEnumerator(name: "XDR_FREE", value: 2)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !{!13, !81, !87, !94, !100, !106, !109, !112, !115, !118, !121, !124, !133, !142, !155, !158, !161, !164, !178, !192, !198, !204, !210, !215, !223, !231, !300, !317, !332, !343, !355}
!13 = !DISubprogram(name: "__sputc", scope: !14, file: !14, line: 348, type: !15, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !78)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !DISubroutineType(types: !16)
!16 = !{!11, !11, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 153, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !14, line: 122, size: 1216, align: 64, elements: !20)
!20 = !{!21, !24, !25, !26, !28, !29, !34, !35, !37, !41, !46, !56, !62, !63, !66, !67, !71, !75, !76, !77}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !19, file: !14, line: 123, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !19, file: !14, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !19, file: !14, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !14, line: 126, baseType: !27, size: 16, align: 16, offset: 128)
!27 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !19, file: !14, line: 127, baseType: !27, size: 16, align: 16, offset: 144)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !19, file: !14, line: 128, baseType: !30, size: 128, align: 64, offset: 192)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !14, line: 88, size: 128, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !30, file: !14, line: 89, baseType: !22, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !30, file: !14, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !19, file: !14, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !19, file: !14, line: 132, baseType: !36, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !19, file: !14, line: 133, baseType: !38, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!11, !36}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !19, file: !14, line: 134, baseType: !42, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!11, !36, !45, !11}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !19, file: !14, line: 135, baseType: !47, size: 64, align: 64, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !36, !50, !11}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !14, line: 77, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !52, line: 71, baseType: !53)
!52 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !19, file: !14, line: 136, baseType: !57, size: 64, align: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!11, !36, !60, !11}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !19, file: !14, line: 139, baseType: !30, size: 128, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !19, file: !14, line: 140, baseType: !64, size: 64, align: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !14, line: 94, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !19, file: !14, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !19, file: !14, line: 144, baseType: !68, size: 24, align: 8, offset: 928)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 24, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 3)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !19, file: !14, line: 145, baseType: !72, size: 8, align: 8, offset: 952)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !19, file: !14, line: 148, baseType: !30, size: 128, align: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !19, file: !14, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !14, line: 152, baseType: !50, size: 64, align: 64, offset: 1152)
!78 = !{!79, !80}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !13, file: !14, line: 348, type: !11)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !13, file: !14, line: 348, type: !17)
!81 = !DISubprogram(name: "__sigbits", scope: !82, file: !82, line: 114, type: !83, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !85)
!82 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DISubroutineType(types: !84)
!84 = !{!11, !11}
!85 = !{!86}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !81, file: !82, line: 114, type: !11)
!87 = !DISubprogram(name: "__inline_isfinitef", scope: !88, file: !88, line: 204, type: !89, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !92)
!88 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DISubroutineType(types: !90)
!90 = !{!11, !91}
!91 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !87, file: !88, line: 204, type: !91)
!94 = !DISubprogram(name: "__inline_isfinited", scope: !88, file: !88, line: 207, type: !95, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!11, !97}
!97 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!98 = !{!99}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !94, file: !88, line: 207, type: !97)
!100 = !DISubprogram(name: "__inline_isfinitel", scope: !88, file: !88, line: 210, type: !101, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !104)
!101 = !DISubroutineType(types: !102)
!102 = !{!11, !103}
!103 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!104 = !{!105}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !100, file: !88, line: 210, type: !103)
!106 = !DISubprogram(name: "__inline_isinff", scope: !88, file: !88, line: 213, type: !89, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !106, file: !88, line: 213, type: !91)
!109 = !DISubprogram(name: "__inline_isinfd", scope: !88, file: !88, line: 216, type: !95, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !110)
!110 = !{!111}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !109, file: !88, line: 216, type: !97)
!112 = !DISubprogram(name: "__inline_isinfl", scope: !88, file: !88, line: 219, type: !101, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !113)
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !112, file: !88, line: 219, type: !103)
!115 = !DISubprogram(name: "__inline_isnanf", scope: !88, file: !88, line: 222, type: !89, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !116)
!116 = !{!117}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !115, file: !88, line: 222, type: !91)
!118 = !DISubprogram(name: "__inline_isnand", scope: !88, file: !88, line: 225, type: !95, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !119)
!119 = !{!120}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !118, file: !88, line: 225, type: !97)
!121 = !DISubprogram(name: "__inline_isnanl", scope: !88, file: !88, line: 228, type: !101, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !122)
!122 = !{!123}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !121, file: !88, line: 228, type: !103)
!124 = !DISubprogram(name: "__inline_signbitf", scope: !88, file: !88, line: 231, type: !89, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !125)
!125 = !{!126, !127}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !124, file: !88, line: 231, type: !91)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !124, file: !88, line: 232, type: !128)
!128 = !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !88, line: 232, size: 32, align: 32, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !128, file: !88, line: 232, baseType: !91, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !128, file: !88, line: 232, baseType: !132, size: 32, align: 32)
!132 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!133 = !DISubprogram(name: "__inline_signbitd", scope: !88, file: !88, line: 236, type: !95, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !134)
!134 = !{!135, !136}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !133, file: !88, line: 236, type: !97)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !133, file: !88, line: 237, type: !137)
!137 = !DICompositeType(tag: DW_TAG_union_type, scope: !133, file: !88, line: 237, size: 64, align: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !137, file: !88, line: 237, baseType: !97, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !137, file: !88, line: 237, baseType: !141, size: 64, align: 64)
!141 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!142 = !DISubprogram(name: "__inline_signbitl", scope: !88, file: !88, line: 242, type: !101, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !143)
!143 = !{!144, !145}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !142, file: !88, line: 242, type: !103)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !142, file: !88, line: 246, type: !146)
!146 = !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !88, line: 243, size: 128, align: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !146, file: !88, line: 244, baseType: !103, size: 128, align: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !146, file: !88, line: 245, baseType: !150, size: 128, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, scope: !146, file: !88, line: 245, size: 128, align: 64, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !150, file: !88, line: 245, baseType: !141, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !150, file: !88, line: 245, baseType: !154, size: 16, align: 16, offset: 64)
!154 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!155 = !DISubprogram(name: "__inline_isnormalf", scope: !88, file: !88, line: 257, type: !89, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !156)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !155, file: !88, line: 257, type: !91)
!158 = !DISubprogram(name: "__inline_isnormald", scope: !88, file: !88, line: 260, type: !95, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !159)
!159 = !{!160}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !158, file: !88, line: 260, type: !97)
!161 = !DISubprogram(name: "__inline_isnormall", scope: !88, file: !88, line: 263, type: !101, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !162)
!162 = !{!163}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !161, file: !88, line: 263, type: !103)
!164 = !DISubprogram(name: "__sincosf", scope: !88, file: !88, line: 642, type: !165, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !168)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !91, !167, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!168 = !{!169, !170, !171, !172}
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !164, file: !88, line: 642, type: !91)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !164, file: !88, line: 642, type: !167)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !164, file: !88, line: 642, type: !167)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !164, file: !88, line: 643, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !88, line: 634, size: 64, align: 32, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !174, file: !88, line: 634, baseType: !91, size: 32, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !174, file: !88, line: 634, baseType: !91, size: 32, align: 32, offset: 32)
!178 = !DISubprogram(name: "__sincos", scope: !88, file: !88, line: 647, type: !179, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !182)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !97, !181, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!182 = !{!183, !184, !185, !186}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !178, file: !88, line: 647, type: !97)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !178, file: !88, line: 647, type: !181)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !178, file: !88, line: 647, type: !181)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !178, file: !88, line: 648, type: !187)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !88, line: 635, size: 128, align: 64, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !188, file: !88, line: 635, baseType: !97, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !188, file: !88, line: 635, baseType: !97, size: 64, align: 64, offset: 64)
!192 = !DISubprogram(name: "__sincospif", scope: !88, file: !88, line: 652, type: !165, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !192, file: !88, line: 652, type: !91)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !192, file: !88, line: 652, type: !167)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !192, file: !88, line: 652, type: !167)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !192, file: !88, line: 653, type: !173)
!198 = !DISubprogram(name: "__sincospi", scope: !88, file: !88, line: 657, type: !179, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !199)
!199 = !{!200, !201, !202, !203}
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !198, file: !88, line: 657, type: !97)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !198, file: !88, line: 657, type: !181)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !198, file: !88, line: 657, type: !181)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !198, file: !88, line: 658, type: !187)
!204 = !DISubprogram(name: "open_xtc", scope: !1, file: !1, line: 45, type: !205, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @open_xtc, variables: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{!11, !45, !45}
!207 = !{!208, !209}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !204, file: !1, line: 45, type: !45)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !204, file: !1, line: 45, type: !45)
!210 = !DISubprogram(name: "close_xtc", scope: !1, file: !1, line: 50, type: !211, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @close_xtc, variables: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !11}
!213 = !{!214}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !210, file: !1, line: 50, type: !11)
!215 = !DISubprogram(name: "xtc_check", scope: !1, file: !1, line: 62, type: !216, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i8*, i32)* @xtc_check, variables: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{!11, !45, !11, !45, !11}
!218 = !{!219, !220, !221, !222}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !215, file: !1, line: 62, type: !45)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bResult", arg: 2, scope: !215, file: !1, line: 62, type: !11)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 3, scope: !215, file: !1, line: 62, type: !45)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 4, scope: !215, file: !1, line: 62, type: !11)
!223 = !DISubprogram(name: "xtc_check_fat_err", scope: !1, file: !1, line: 73, type: !224, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i8*, i32)* @xtc_check_fat_err, variables: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !45, !11, !45, !11}
!226 = !{!227, !228, !229, !230}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !223, file: !1, line: 73, type: !45)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bResult", arg: 2, scope: !223, file: !1, line: 73, type: !11)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 3, scope: !223, file: !1, line: 73, type: !45)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 4, scope: !223, file: !1, line: 73, type: !11)
!231 = !DISubprogram(name: "write_xtc", scope: !1, file: !1, line: 124, type: !232, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, float, [3 x float]*, [3 x float]*, float)* @write_xtc, variables: !240)
!232 = !DISubroutineType(types: !233)
!233 = !{!11, !11, !11, !11, !234, !236, !238, !234}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !235, line: 87, baseType: !91)
!235 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 96, align: 32, elements: !69)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !235, line: 101, baseType: !237)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !299}
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !231, file: !1, line: 124, type: !11)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !231, file: !1, line: 125, type: !11)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 3, scope: !231, file: !1, line: 125, type: !11)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 4, scope: !231, file: !1, line: 125, type: !234)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !231, file: !1, line: 126, type: !236)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !231, file: !1, line: 126, type: !238)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prec", arg: 7, scope: !231, file: !1, line: 126, type: !234)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic_number", scope: !231, file: !1, line: 128, type: !11)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xd", scope: !231, file: !1, line: 129, type: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !4, line: 144, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !4, line: 145, size: 384, align: 64, elements: !253)
!253 = !{!254, !255, !295, !296, !297, !298}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !252, file: !4, line: 147, baseType: !3, size: 32, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !252, file: !4, line: 171, baseType: !256, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !4, line: 148, size: 640, align: 64, elements: !258)
!258 = !{!259, !266, !267, !271, !272, !276, !280, !286, !290, !294}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !257, file: !4, line: 150, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !250, !264}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !4, line: 99, baseType: !11)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !257, file: !4, line: 152, baseType: !260, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !257, file: !4, line: 154, baseType: !268, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!263, !250, !45, !132}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !257, file: !4, line: 156, baseType: !268, size: 64, align: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !257, file: !4, line: 158, baseType: !273, size: 64, align: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!132, !250}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !257, file: !4, line: 160, baseType: !277, size: 64, align: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!263, !250, !132}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !257, file: !4, line: 162, baseType: !281, size: 64, align: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !250, !11}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdr_int32_t", file: !4, line: 106, baseType: !11)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !257, file: !4, line: 164, baseType: !287, size: 64, align: 64, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !250}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !257, file: !4, line: 166, baseType: !291, size: 64, align: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!263, !250, !284}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !257, file: !4, line: 168, baseType: !291, size: 64, align: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !252, file: !4, line: 172, baseType: !45, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !252, file: !4, line: 173, baseType: !45, size: 64, align: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !252, file: !4, line: 174, baseType: !45, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !252, file: !4, line: 175, baseType: !11, size: 32, align: 32, offset: 320)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bDum", scope: !231, file: !1, line: 130, type: !11)
!300 = !DISubprogram(name: "read_first_xtc", scope: !1, file: !1, line: 141, type: !301, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32*, float*, [3 x float]*, [3 x float]**, float*, i32*)* @read_first_xtc, variables: !306)
!301 = !DISubroutineType(types: !302)
!302 = !{!11, !11, !303, !303, !304, !236, !305, !304, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !300, file: !1, line: 141, type: !11)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !300, file: !1, line: 141, type: !303)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 3, scope: !300, file: !1, line: 141, type: !303)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 4, scope: !300, file: !1, line: 141, type: !304)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !300, file: !1, line: 142, type: !236)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !300, file: !1, line: 142, type: !305)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prec", arg: 7, scope: !300, file: !1, line: 142, type: !304)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOK", arg: 8, scope: !300, file: !1, line: 142, type: !303)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic", scope: !300, file: !1, line: 144, type: !11)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xd", scope: !300, file: !1, line: 145, type: !250)
!317 = !DISubprogram(name: "read_next_xtc", scope: !1, file: !1, line: 164, type: !318, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*, float*, [3 x float]*, [3 x float]*, float*, i32*)* @read_next_xtc, variables: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{!11, !11, !11, !303, !304, !236, !238, !304, !303}
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !317, file: !1, line: 164, type: !11)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !317, file: !1, line: 165, type: !11)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 3, scope: !317, file: !1, line: 165, type: !303)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 4, scope: !317, file: !1, line: 165, type: !304)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !317, file: !1, line: 166, type: !236)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !317, file: !1, line: 166, type: !238)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prec", arg: 7, scope: !317, file: !1, line: 166, type: !304)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOK", arg: 8, scope: !317, file: !1, line: 166, type: !303)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic", scope: !317, file: !1, line: 168, type: !11)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !317, file: !1, line: 169, type: !11)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xd", scope: !317, file: !1, line: 170, type: !250)
