; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/445.gobmk/src/interface/gtp.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.gtp_command = type { i8*, i32 (i8*)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [5 x i8] c"%d%n\00", align 1
@current_id = internal global i32 0, align 4
@.str1 = private unnamed_addr constant [7 x i8] c" %s %n\00", align 1
@.str2 = private unnamed_addr constant [16 x i8] c"unknown command\00", align 1
@gtp_boardsize = internal unnamed_addr global i32 -1, align 4
@vertex_transform_input_hook = internal unnamed_addr global void (i32, i32, i32*, i32*)* null, align 8
@vertex_transform_output_hook = internal unnamed_addr global void (i32, i32, i32*, i32*)* null, align 8
@__stdoutp = external global %struct.__sFILE*
@.str3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str4 = private unnamed_addr constant [3 x i8] c"%f\00", align 1
@.str5 = private unnamed_addr constant [6 x i8] c"white\00", align 1
@.str6 = private unnamed_addr constant [6 x i8] c"black\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !253, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/445.gobmk/src/interface/gtp.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{!7, !99, !104, !115, !153, !157, !160, !163, !169, !173, !176, !188, !198, !215, !225, !231, !237}
!7 = !DISubprogram(name: "gtp_main_loop", scope: !1, file: !1, line: 73, type: !8, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.gtp_command*, %struct.__sFILE*)* @gtp_main_loop, variables: !82)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !24}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "gtp_command", file: !12, line: 62, size: 128, align: 64, elements: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/445.gobmk/src/interface/gtp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !{!14, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !12, line: 63, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !11, file: !12, line: 64, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "gtp_fn_ptr", file: !12, line: 56, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!5, !23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 153, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !26, line: 122, size: 1216, align: 64, elements: !28)
!28 = !{!29, !32, !33, !34, !36, !37, !42, !43, !44, !48, !52, !62, !66, !67, !70, !71, !75, !79, !80, !81}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !27, file: !26, line: 123, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !27, file: !26, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !27, file: !26, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !26, line: 126, baseType: !35, size: 16, align: 16, offset: 128)
!35 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !27, file: !26, line: 127, baseType: !35, size: 16, align: 16, offset: 144)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !27, file: !26, line: 128, baseType: !38, size: 128, align: 64, offset: 192)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !26, line: 88, size: 128, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !38, file: !26, line: 89, baseType: !30, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !38, file: !26, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !27, file: !26, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !27, file: !26, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !27, file: !26, line: 133, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!5, !4}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !27, file: !26, line: 134, baseType: !49, size: 64, align: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!5, !4, !23, !5}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !27, file: !26, line: 135, baseType: !53, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !4, !56, !5}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !26, line: 77, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !58, line: 71, baseType: !59)
!58 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !60, line: 46, baseType: !61)
!60 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !27, file: !26, line: 136, baseType: !63, size: 64, align: 64, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!5, !4, !15, !5}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !27, file: !26, line: 139, baseType: !38, size: 128, align: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !27, file: !26, line: 140, baseType: !68, size: 64, align: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !26, line: 94, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !27, file: !26, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !27, file: !26, line: 144, baseType: !72, size: 24, align: 8, offset: 928)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !27, file: !26, line: 145, baseType: !76, size: 8, align: 8, offset: 952)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !27, file: !26, line: 148, baseType: !38, size: 128, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !27, file: !26, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !26, line: 152, baseType: !56, size: 64, align: 64, offset: 1152)
!82 = !{!83, !84, !85, !89, !90, !91, !92, !93, !94}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "commands", arg: 1, scope: !7, file: !1, line: 73, type: !10)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gtp_input", arg: 2, scope: !7, file: !1, line: 73, type: !24)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !7, file: !1, line: 75, type: !86)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8000, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1000)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "command", scope: !7, file: !1, line: 76, type: !86)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !7, file: !1, line: 77, type: !23)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !7, file: !1, line: 78, type: !5)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !7, file: !1, line: 79, type: !5)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !7, file: !1, line: 80, type: !5)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !95, file: !1, line: 89, type: !17)
!95 = distinct !DILexicalBlock(scope: !96, file: !1, line: 88, column: 41)
!96 = distinct !DILexicalBlock(scope: !97, file: !1, line: 88, column: 5)
!97 = distinct !DILexicalBlock(scope: !98, file: !1, line: 88, column: 5)
!98 = distinct !DILexicalBlock(scope: !7, file: !1, line: 82, column: 28)
!99 = !DISubprogram(name: "gtp_internal_set_boardsize", scope: !1, file: !1, line: 140, type: !100, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @gtp_internal_set_boardsize, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !5}
!102 = !{!103}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !99, file: !1, line: 140, type: !5)
!104 = !DISubprogram(name: "gtp_set_vertex_transform_hooks", scope: !1, file: !1, line: 151, type: !105, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, function: void (void (i32, i32, i32*, i32*)*, void (i32, i32, i32*, i32*)*)* @gtp_set_vertex_transform_hooks, variables: !112)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !107}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gtp_transform_ptr", file: !12, line: 59, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !5, !5, !111, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!112 = !{!113, !114}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !104, file: !1, line: 151, type: !107)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 2, scope: !104, file: !1, line: 151, type: !107)
!115 = !DISubprogram(name: "gtp_mprintf", scope: !1, file: !1, line: 164, type: !116, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @gtp_mprintf, variables: !118)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !15, null}
!118 = !{!119, !120, !133, !141, !143, !146, !148, !150, !151}
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 1, scope: !115, file: !1, line: 164, type: !15)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !115, file: !1, line: 166, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !122, line: 30, baseType: !123)
!122 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stdarg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 166, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 192, align: 64, elements: !77)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 166, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 166, size: 192, align: 64, elements: !127)
!127 = !{!128, !130, !131, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !126, file: !1, line: 166, baseType: !129, size: 32, align: 32)
!129 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !126, file: !1, line: 166, baseType: !129, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !126, file: !1, line: 166, baseType: !4, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !126, file: !1, line: 166, baseType: !4, size: 64, align: 64, offset: 128)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !134, file: !1, line: 175, type: !5)
!134 = distinct !DILexicalBlock(scope: !135, file: !1, line: 173, column: 7)
!135 = distinct !DILexicalBlock(scope: !136, file: !1, line: 171, column: 23)
!136 = distinct !DILexicalBlock(scope: !137, file: !1, line: 170, column: 22)
!137 = distinct !DILexicalBlock(scope: !138, file: !1, line: 170, column: 9)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 169, column: 24)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 169, column: 3)
!140 = distinct !DILexicalBlock(scope: !115, file: !1, line: 169, column: 3)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !142, file: !1, line: 181, type: !5)
!142 = distinct !DILexicalBlock(scope: !135, file: !1, line: 180, column: 7)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !144, file: !1, line: 187, type: !145)
!144 = distinct !DILexicalBlock(scope: !135, file: !1, line: 186, column: 7)
!145 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !147, file: !1, line: 193, type: !23)
!147 = distinct !DILexicalBlock(scope: !135, file: !1, line: 192, column: 7)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !149, file: !1, line: 199, type: !5)
!149 = distinct !DILexicalBlock(scope: !135, file: !1, line: 198, column: 7)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !149, file: !1, line: 200, type: !5)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !152, file: !1, line: 206, type: !5)
!152 = distinct !DILexicalBlock(scope: !135, file: !1, line: 205, column: 7)
!153 = !DISubprogram(name: "gtp_printf", scope: !1, file: !1, line: 229, type: !116, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @gtp_printf, variables: !154)
!154 = !{!155, !156}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !153, file: !1, line: 229, type: !15)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !153, file: !1, line: 231, type: !121)
!157 = !DISubprogram(name: "gtp_start_response", scope: !1, file: !1, line: 242, type: !100, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @gtp_start_response, variables: !158)
!158 = !{!159}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !157, file: !1, line: 242, type: !5)
!160 = !DISubprogram(name: "gtp_finish_response", scope: !1, file: !1, line: 258, type: !161, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @gtp_finish_response, variables: !2)
!161 = !DISubroutineType(types: !162)
!162 = !{!5}
!163 = !DISubprogram(name: "gtp_success", scope: !1, file: !1, line: 269, type: !164, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, ...)* @gtp_success, variables: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{!5, !15, null}
!166 = !{!167, !168}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !163, file: !1, line: 269, type: !15)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !163, file: !1, line: 271, type: !121)
!169 = !DISubprogram(name: "gtp_failure", scope: !1, file: !1, line: 282, type: !164, isLocal: false, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, ...)* @gtp_failure, variables: !170)
!170 = !{!171, !172}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !169, file: !1, line: 282, type: !15)
