; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/didxset.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::DIdxSet" = type { %"class.soplex::IdxSet" }
%"class.soplex::IdxSet" = type { i32, i32, i32* }
%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
%"class.std::__1::locale::__imp" = type opaque
%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
%"class.std::__1::ctype" = type <{ %"class.std::__1::locale::facet", i32*, i8, [7 x i8] }>
%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !1704, globals: !1091, imports: !1973)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/didxset.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1280, size: 32, align: 32, elements: !16, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!15 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17}
!17 = !DIEnumerator(name: "__short_mask", value: 1)
!18 = !{!19, !76, !80, !81, !88, !95, !110, !115, !119, !123, !162, !167, !209, !265, !397, !473, !3, !623, !698, !699, !1055, !1090, !1094, !1104, !1159, !1162, !1167, !1172, !1176, !1219, !1223, !1225, !1235, !1240, !1241, !1244, !1247, !1260, !1271, !1278, !1282, !1286, !1323, !1326, !1328, !1329, !1330, !1331, !1333, !1344, !1373, !1394, !1411, !1517, !9, !1518, !1542, !1573, !1579, !1580, !1597, !207, !14, !1600, !1610, !1614, !59, !278, !250, !1615, !1686}
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !21, identifier: "_ZTS7__sFILE")
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !{!22, !25, !27, !28, !30, !31, !32, !33, !35, !39, !45, !55, !61, !62, !64, !65, !69, !73, !74, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !20, line: 123, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !20, line: 124, baseType: !26, size: 32, align: 32, offset: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !20, line: 125, baseType: !26, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !20, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !20, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !20, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !20, line: 129, baseType: !26, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !20, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !20, line: 133, baseType: !36, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!26, !34}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !20, line: 134, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!26, !34, !43, !26}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !20, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !34, !49, !26}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !20, line: 136, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!26, !34, !59, !26}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !20, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !20, line: 140, baseType: !63, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !20, line: 141, baseType: !26, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !20, line: 144, baseType: !66, size: 24, align: 8, offset: 928)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !20, line: 145, baseType: !70, size: 8, align: 8, offset: 952)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !20, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !20, line: 151, baseType: !26, size: 32, align: 32, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !20, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !77, identifier: "_ZTS6__sbuf")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !20, line: 89, baseType: !23, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !20, line: 90, baseType: !26, size: 32, align: 32, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !82, identifier: "_ZTS13__va_list_tag")
!82 = !{!83, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_union_type, file: !53, line: 76, size: 1024, align: 64, elements: !89, identifier: "_ZTS11__mbstate_t")
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !53, line: 77, baseType: !91, size: 1024, align: 8)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !53, line: 78, baseType: !54, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !96, line: 73, size: 448, align: 64, elements: !97, identifier: "_ZTS2tm")
!96 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !96, line: 74, baseType: !26, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !96, line: 75, baseType: !26, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !96, line: 76, baseType: !26, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !96, line: 77, baseType: !26, size: 32, align: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !96, line: 78, baseType: !26, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !96, line: 79, baseType: !26, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !96, line: 80, baseType: !26, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !96, line: 81, baseType: !26, size: 32, align: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !96, line: 82, baseType: !26, size: 32, align: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !96, line: 83, baseType: !108, size: 64, align: 64, offset: 320)
!108 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !96, line: 84, baseType: !43, size: 64, align: 64, offset: 384)
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 82, size: 64, align: 32, elements: !112, identifier: "_ZTS5div_t")
!111 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !111, line: 83, baseType: !26, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !111, line: 84, baseType: !26, size: 32, align: 32, offset: 32)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 87, size: 128, align: 64, elements: !116, identifier: "_ZTS6ldiv_t")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !111, line: 88, baseType: !108, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !111, line: 89, baseType: !108, size: 64, align: 64, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 93, size: 128, align: 64, elements: !120, identifier: "_ZTS7lldiv_t")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !111, line: 94, baseType: !54, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !111, line: 95, baseType: !54, size: 64, align: 64, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "DIdxSet", scope: !125, file: !124, line: 46, size: 128, align: 64, elements: !127, identifier: "_ZTSN6soplex7DIdxSetE")
!124 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/didxset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!125 = !DINamespace(name: "soplex", scope: null, file: !126, line: 28)
!126 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/idxset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !{!128, !129, !133, !138, !143, !144, !145, !146, !147, !152, !156, !159}
!128 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex7DIdxSetE", baseType: !"_ZTSN6soplex6IdxSetE", flags: DIFlagPublic)
!129 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7DIdxSet3addEi", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 50, type: !130, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !132, !26}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!133 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7DIdxSet3addERKNS_6IdxSetE", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 58, type: !134, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !132, !136}
!136 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6IdxSetE")
!138 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7DIdxSet3addEiPKi", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 67, type: !139, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !132, !26, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!143 = !DISubprogram(name: "addIdx", linkageName: "_ZN6soplex7DIdxSet6addIdxEi", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 75, type: !130, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!144 = !DISubprogram(name: "setMax", linkageName: "_ZN6soplex7DIdxSet6setMaxEi", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 87, type: !130, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!145 = !DISubprogram(name: "DIdxSet", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 90, type: !130, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!146 = !DISubprogram(name: "DIdxSet", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 93, type: !134, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!147 = !DISubprogram(name: "DIdxSet", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 96, type: !148, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !132, !150}
!150 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DIdxSetE")
!152 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DIdxSetaSERKNS_6IdxSetE", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 99, type: !153, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !132, !136}
!155 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DIdxSetE")
!156 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DIdxSetaSERKS0_", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 108, type: !157, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!157 = !DISubroutineType(types: !158)
!158 = !{!155, !132, !150}
!159 = !DISubprogram(name: "~DIdxSet", scope: !"_ZTSN6soplex7DIdxSetE", file: !124, line: 118, type: !160, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !132}
!162 = !DICompositeType(tag: DW_TAG_class_type, name: "IdxSet", scope: !125, file: !126, line: 58, size: 128, align: 64, elements: !163, identifier: "_ZTSN6soplex6IdxSetE")
!163 = !{!164, !165, !166, !168, !172, !175, !176, !177, !178, !182, !185, !188, !189, !192, !193, !196, !199, !200, !204, !208}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 61, baseType: !26, size: 32, align: 32, flags: DIFlagProtected)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 62, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 63, baseType: !167, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!168 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex6IdxSet5indexEi", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 67, type: !169, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!169 = !DISubroutineType(types: !170)
!170 = !{!26, !171, !26}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!172 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex6IdxSet4sizeEv", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 73, type: !173, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{!26, !171}
!175 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex6IdxSet3maxEv", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 78, type: !173, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6IdxSet3dimEv", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 84, type: !173, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex6IdxSet6numberEi", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 91, type: !169, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addEi", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 94, type: !179, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !181, !26}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6IdxSetE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!182 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addERKS0_", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 101, type: !183, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !181, !136}
!185 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addEiPKi", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 107, type: !186, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !181, !26, !141}
!188 = !DISubprogram(name: "addIdx", linkageName: "_ZN6soplex6IdxSet6addIdxEi", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 110, type: !179, isLocal: false, isDefinition: false, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex6IdxSet6removeEii", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 116, type: !190, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !181, !26, !26}
!192 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex6IdxSet6removeEi", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 119, type: !179, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!193 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6IdxSet5clearEv", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 127, type: !194, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !181}
!196 = !DISubprogram(name: "IdxSet", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 138, type: !197, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !181, !26, !167, !26}
!199 = !DISubprogram(name: "IdxSet", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 149, type: !194, isLocal: false, isDefinition: false, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6IdxSetaSERKS0_", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 160, type: !201, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !181, !136}
!203 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6IdxSetE")
!204 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6IdxSet12isConsistentEv", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 163, type: !205, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !171}
!207 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!208 = !DISubprogram(name: "IdxSet", scope: !"_ZTSN6soplex6IdxSetE", file: !126, line: 167, type: !183, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !210, file: !15, line: 623, size: 8, align: 8, elements: !213, templateParams: !263, identifier: "_ZTSNSt3__111char_traitsIcEE")
!210 = !DINamespace(name: "__1", scope: !212, file: !211, line: 369)
!211 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!212 = !DINamespace(name: "std", scope: null, file: !211, line: 368)
!213 = !{!214, !221, !224, !225, !233, !236, !239, !243, !244, !247, !251, !254, !257, !260}
!214 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignERcRKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 631, type: !215, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !217, !219}
!217 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 625, baseType: !44)
!219 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!221 = !DISubprogram(name: "eq", linkageName: "_ZNSt3__111char_traitsIcE2eqEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 633, type: !222, isLocal: false, isDefinition: false, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true)
!222 = !DISubroutineType(types: !223)
!223 = !{!207, !218, !218}
!224 = !DISubprogram(name: "lt", linkageName: "_ZNSt3__111char_traitsIcE2ltEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 635, type: !222, isLocal: false, isDefinition: false, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true)
!225 = !DISubprogram(name: "compare", linkageName: "_ZNSt3__111char_traitsIcE7compareEPKcS3_m", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 638, type: !226, isLocal: false, isDefinition: false, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true)
!226 = !DISubroutineType(types: !227)
!227 = !{!26, !228, !228, !229}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !230, line: 30, baseType: !231)
!230 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !53, line: 92, baseType: !232)
!232 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!233 = !DISubprogram(name: "length", linkageName: "_ZNSt3__111char_traitsIcE6lengthEPKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 640, type: !234, isLocal: false, isDefinition: false, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{!229, !228}
!236 = !DISubprogram(name: "find", linkageName: "_ZNSt3__111char_traitsIcE4findEPKcmRS2_", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 641, type: !237, isLocal: false, isDefinition: false, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{!228, !228, !229, !219}
!239 = !DISubprogram(name: "move", linkageName: "_ZNSt3__111char_traitsIcE4moveEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 643, type: !240, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !242, !228, !229}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!243 = !DISubprogram(name: "copy", linkageName: "_ZNSt3__111char_traitsIcE4copyEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 645, type: !240, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true)
!244 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignEPcmc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 650, type: !245, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!242, !242, !229, !218}
!247 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt3__111char_traitsIcE7not_eofEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 653, type: !248, isLocal: false, isDefinition: false, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !250}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 626, baseType: !26)
!251 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt3__111char_traitsIcE12to_char_typeEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 655, type: !252, isLocal: false, isDefinition: false, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true)
!252 = !DISubroutineType(types: !253)
!253 = !{!218, !250}
!254 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt3__111char_traitsIcE11to_int_typeEc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 657, type: !255, isLocal: false, isDefinition: false, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{!250, !218}
!257 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt3__111char_traitsIcE11eq_int_typeEii", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 659, type: !258, isLocal: false, isDefinition: false, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{!207, !250, !250}
!260 = !DISubprogram(name: "eof", linkageName: "_ZNSt3__111char_traitsIcE3eofEv", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 661, type: !261, isLocal: false, isDefinition: false, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DISubroutineType(types: !262)
!262 = !{!250}
!263 = !{!264}
!264 = !DITemplateTypeParameter(name: "_CharT", type: !44)
!265 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ostream<char, std::__1::char_traits<char> >", scope: !210, file: !266, line: 1108, size: 1280, align: 64, elements: !267, vtableHolder: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", templateParams: !395, identifier: "_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!266 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ostream", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!267 = !{!268, !269, !274, !279, !282, !286, !291, !294, !300, !307, !314, !317, !320, !324, !327, !330, !333, !336, !339, !343, !347, !351, !355, !360, !363, !367, !375, !378, !385, !388, !394}
!268 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", offset: 24, flags: DIFlagPublic | DIFlagVirtual)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$basic_ostream", scope: !266, file: !266, baseType: !270, size: 64, flags: DIFlagArtificial)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!26}
!274 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 163, type: !275, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !277, !278}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__115basic_streambufIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!279 = !DISubprogram(name: "~basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 164, type: !280, isLocal: false, isDefinition: false, scopeLine: 164, containingType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !277}
!282 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 176, type: !283, isLocal: false, isDefinition: false, scopeLine: 176, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !277, !285}
!285 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!286 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 182, type: !287, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !277, !289}
!289 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!291 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEEaSERKS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 183, type: !292, isLocal: false, isDefinition: false, scopeLine: 183, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{!285, !277, !289}
!294 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRS3_S4_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 191, type: !295, isLocal: false, isDefinition: false, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!285, !277, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!285, !285}
!300 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_9basic_iosIcS2_EES6_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 192, type: !301, isLocal: false, isDefinition: false, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubroutineType(types: !302)
!302 = !{!285, !277, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !306}
!306 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!307 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_8ios_baseES5_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 194, type: !308, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!308 = !DISubroutineType(types: !309)
!309 = !{!285, !277, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !313}
!313 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__18ios_baseE")
!314 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEb", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 195, type: !315, isLocal: false, isDefinition: false, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!315 = !DISubroutineType(types: !316)
!316 = !{!285, !277, !207}
!317 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEs", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 196, type: !318, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{!285, !277, !29}
!320 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEt", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 197, type: !321, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{!285, !277, !323}
!323 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!324 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEi", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 198, type: !325, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!325 = !DISubroutineType(types: !326)
!326 = !{!285, !277, !26}
!327 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEj", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 199, type: !328, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!328 = !DISubroutineType(types: !329)
!329 = !{!285, !277, !84}
!330 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 200, type: !331, isLocal: false, isDefinition: false, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!285, !277, !108}
!333 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEm", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 201, type: !334, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{!285, !277, !232}
!336 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEx", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 202, type: !337, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{!285, !277, !54}
!339 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEy", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 203, type: !340, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{!285, !277, !342}
!342 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!343 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEf", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 204, type: !344, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{!285, !277, !346}
!346 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!347 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEd", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 205, type: !348, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{!285, !277, !350}
!350 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!351 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEe", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 206, type: !352, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{!285, !277, !354}
!354 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!355 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPKv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 207, type: !356, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!285, !277, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!360 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 208, type: !361, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!361 = !DISubroutineType(types: !362)
!362 = !{!285, !277, !278}
!363 = !DISubprogram(name: "put", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE3putEc", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 211, type: !364, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubroutineType(types: !365)
!365 = !{!285, !277, !366}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 156, baseType: !44)
!367 = !DISubprogram(name: "write", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5writeEPKcl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 212, type: !368, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubroutineType(types: !369)
!369 = !{!285, !277, !370, !372}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !210, file: !4, line: 229, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !374, line: 51, baseType: !108)
!374 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!375 = !DISubprogram(name: "flush", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5flushEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 213, type: !376, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!285, !277}
!378 = !DISubprogram(name: "tellp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5tellpEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 216, type: !379, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !277}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 159, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 628, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "streampos", scope: !210, file: !384, line: 176, baseType: !"_ZTSNSt3__14fposI11__mbstate_tEE")
!384 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!385 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpENS_4fposI11__mbstate_tEE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 217, type: !386, isLocal: false, isDefinition: false, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{!285, !277, !381}
!388 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpExNS_8ios_base7seekdirE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 218, type: !389, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!389 = !DISubroutineType(types: !390)
!390 = !{!285, !277, !391, !"_ZTSNSt3__18ios_base7seekdirE"}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 160, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 627, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamoff", scope: !210, file: !384, line: 187, baseType: !54)
!394 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !266, line: 222, type: !280, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!395 = !{!264, !396}
!396 = !DITemplateTypeParameter(name: "_Traits", type: !"_ZTSNSt3__111char_traitsIcEE")
!397 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ios<char, std::__1::char_traits<char> >", scope: !210, file: !398, line: 570, size: 1216, align: 64, elements: !399, vtableHolder: !"_ZTSNSt3__18ios_baseE", templateParams: !395, identifier: "_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!398 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/streambuf", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!399 = !{!400, !401, !403, !405, !410, !411, !415, !419, !420, !421, !422, !423, !424, !425, !426, !429, !432, !435, !438, !441, !444, !448, !452, !455, !460, !463, !466, !467, !468, !471, !472}
!400 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__18ios_baseE", flags: DIFlagPublic)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__tie_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 647, baseType: !402, size: 64, align: 64, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__fill_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 648, baseType: !404, size: 32, align: 32, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 579, baseType: !250)
!405 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEcvbEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 585, type: !406, isLocal: false, isDefinition: false, scopeLine: 585, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!406 = !DISubroutineType(types: !407)
!407 = !{!207, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!410 = !DISubprogram(name: "operator!", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEntEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 586, type: !406, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE7rdstateEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 587, type: !412, isLocal: false, isDefinition: false, scopeLine: 587, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !408}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "iostate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 256, baseType: !84)
!415 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5clearEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 588, type: !416, isLocal: false, isDefinition: false, scopeLine: 588, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418, !414}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!419 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE8setstateEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 589, type: !416, isLocal: false, isDefinition: false, scopeLine: 589, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!420 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4goodEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 590, type: !406, isLocal: false, isDefinition: false, scopeLine: 590, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!421 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3eofEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 591, type: !406, isLocal: false, isDefinition: false, scopeLine: 591, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4failEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 592, type: !406, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3badEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 593, type: !406, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 595, type: !412, isLocal: false, isDefinition: false, scopeLine: 595, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!425 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 596, type: !416, isLocal: false, isDefinition: false, scopeLine: 596, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 600, type: !427, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !418, !278}
!429 = !DISubprogram(name: "~basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 601, type: !430, isLocal: false, isDefinition: false, scopeLine: 601, containingType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !418}
!432 = !DISubprogram(name: "tie", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 605, type: !433, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!433 = !DISubroutineType(types: !434)
!434 = !{!402, !408}
!435 = !DISubprogram(name: "tie", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEPNS_13basic_ostreamIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 607, type: !436, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{!402, !418, !402}
!438 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 610, type: !439, isLocal: false, isDefinition: false, scopeLine: 610, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{!278, !408}
!441 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 612, type: !442, isLocal: false, isDefinition: false, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!442 = !DISubroutineType(types: !443)
!443 = !{!278, !418, !278}
!444 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE7copyfmtERKS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 614, type: !445, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!445 = !DISubroutineType(types: !446)
!446 = !{!306, !418, !447}
!447 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !409)
!448 = !DISubprogram(name: "fill", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 617, type: !449, isLocal: false, isDefinition: false, scopeLine: 617, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !408}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 576, baseType: !44)
!452 = !DISubprogram(name: "fill", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 619, type: !453, isLocal: false, isDefinition: false, scopeLine: 619, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{!451, !418, !451}
!455 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5imbueERKNS_6localeE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 622, type: !456, isLocal: false, isDefinition: false, scopeLine: 622, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!"_ZTSNSt3__16localeE", !418, !458}
!458 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16localeE")
!460 = !DISubprogram(name: "narrow", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE6narrowEcc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 625, type: !461, isLocal: false, isDefinition: false, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!44, !408, !451, !44}
!463 = !DISubprogram(name: "widen", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5widenEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 627, type: !464, isLocal: false, isDefinition: false, scopeLine: 627, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!464 = !DISubroutineType(types: !465)
!465 = !{!451, !408, !44}
!466 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 631, type: !430, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!467 = !DISubprogram(name: "init", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4initEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 634, type: !427, isLocal: false, isDefinition: false, scopeLine: 634, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!468 = !DISubprogram(name: "move", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4moveERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 637, type: !469, isLocal: false, isDefinition: false, scopeLine: 637, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !418, !306}
!471 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 643, type: !469, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!472 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE9set_rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 645, type: !427, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!473 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !210, file: !4, line: 231, size: 1088, align: 64, elements: !474, vtableHolder: !"_ZTSNSt3__18ios_baseE", identifier: "_ZTSNSt3__18ios_baseE")
!474 = !{!475, !476, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500, !501, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !522, !523, !524, !525, !526, !528, !529, !530, !532, !533, !534, !539, !543, !544, !547, !550, !553, !556, !557, !558, !561, !564, !565, !569, !573, !576, !579, !583, !586, !589, !592, !595, !596, !599, !600, !601, !602, !603, !604, !605, !606, !607, !610, !613, !614, !617, !618, !621, !622}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ios_base", scope: !4, file: !4, baseType: !270, size: 64, flags: DIFlagArtificial)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "boolalpha", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 237, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmtflags", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 236, baseType: !84)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 238, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 239, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hex", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 240, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 241, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 242, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "oct", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 243, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 244, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scientific", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 245, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "showbase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 246, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "showpoint", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 247, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1024)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "showpos", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 248, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2048)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "skipws", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 249, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4096)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "unitbuf", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 250, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "uppercase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 251, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "adjustfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 252, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "basefield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 253, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 74)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "floatfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 254, baseType: !477, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 260)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "badbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 258, baseType: !497, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "eofbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 259, baseType: !497, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "failbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 260, baseType: !497, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "goodbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 261, baseType: !497, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 265, baseType: !502, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "openmode", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 263, baseType: !84)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 266, baseType: !502, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 267, baseType: !502, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 268, baseType: !502, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 269, baseType: !502, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "trunc", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 270, baseType: !502, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__fmtflags_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 359, baseType: !478, size: 32, align: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__precision_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 360, baseType: !372, size: 64, align: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__width_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 361, baseType: !372, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__rdstate_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 362, baseType: !414, size: 32, align: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__exceptions_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 363, baseType: !414, size: 32, align: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__rdbuf_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 364, baseType: !34, size: 64, align: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__loc_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 365, baseType: !34, size: 64, align: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__fn_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 366, baseType: !517, size: 64, align: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_callback", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 306, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !"_ZTSNSt3__18ios_base5eventE", !313, !26}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__index_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 367, baseType: !167, size: 64, align: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__event_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 368, baseType: !229, size: 64, align: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__event_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 369, baseType: !229, size: 64, align: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__xindex_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 373, baseType: !26, flags: DIFlagStaticMember)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 375, baseType: !527, size: 64, align: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 376, baseType: !229, size: 64, align: 64, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 377, baseType: !229, size: 64, align: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 378, baseType: !531, size: 64, align: 64, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 379, baseType: !229, size: 64, align: 64, offset: 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 380, baseType: !229, size: 64, align: 64, offset: 1024)
!534 = !DISubprogram(name: "flags", linkageName: "_ZNKSt3__18ios_base5flagsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 281, type: !535, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubroutineType(types: !536)
!536 = !{!478, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__18ios_baseE")
!539 = !DISubprogram(name: "flags", linkageName: "_ZNSt3__18ios_base5flagsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 282, type: !540, isLocal: false, isDefinition: false, scopeLine: 282, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{!478, !542, !478}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__18ios_baseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!543 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 283, type: !540, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!544 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEjj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 284, type: !545, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{!478, !542, !478, !478}
!547 = !DISubprogram(name: "unsetf", linkageName: "_ZNSt3__18ios_base6unsetfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 285, type: !548, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !542, !478}
!550 = !DISubprogram(name: "precision", linkageName: "_ZNKSt3__18ios_base9precisionEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 287, type: !551, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{!372, !537}
!553 = !DISubprogram(name: "precision", linkageName: "_ZNSt3__18ios_base9precisionEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 288, type: !554, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{!372, !542, !372}
!556 = !DISubprogram(name: "width", linkageName: "_ZNKSt3__18ios_base5widthEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 289, type: !551, isLocal: false, isDefinition: false, scopeLine: 289, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!557 = !DISubprogram(name: "width", linkageName: "_ZNSt3__18ios_base5widthEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 290, type: !554, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__18ios_base5imbueERKNS_6localeE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 293, type: !559, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{!"_ZTSNSt3__16localeE", !542, !458}
!561 = !DISubprogram(name: "getloc", linkageName: "_ZNKSt3__18ios_base6getlocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 294, type: !562, isLocal: false, isDefinition: false, scopeLine: 294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{!"_ZTSNSt3__16localeE", !537}
!564 = !DISubprogram(name: "xalloc", linkageName: "_ZNSt3__18ios_base6xallocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 297, type: !272, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubprogram(name: "iword", linkageName: "_ZNSt3__18ios_base5iwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 298, type: !566, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{!568, !542, !26}
!568 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108)
!569 = !DISubprogram(name: "pword", linkageName: "_ZNSt3__18ios_base5pwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 299, type: !570, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubroutineType(types: !571)
!571 = !{!572, !542, !26}
!572 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!573 = !DISubprogram(name: "~ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 302, type: !574, isLocal: false, isDefinition: false, scopeLine: 302, containingType: !"_ZTSNSt3__18ios_baseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !542}
!576 = !DISubprogram(name: "register_callback", linkageName: "_ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 307, type: !577, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !542, !518, !26}
!579 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 310, type: !580, isLocal: false, isDefinition: false, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !542, !582}
!582 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !538)
!583 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__18ios_baseaSERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 311, type: !584, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true)
!584 = !DISubroutineType(types: !585)
!585 = !{!313, !542, !582}
!586 = !DISubprogram(name: "sync_with_stdio", linkageName: "_ZNSt3__18ios_base15sync_with_stdioEb", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 314, type: !587, isLocal: false, isDefinition: false, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubroutineType(types: !588)
!588 = !{!207, !207}
!589 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__18ios_base7rdstateEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 316, type: !590, isLocal: false, isDefinition: false, scopeLine: 316, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{!414, !537}
!592 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__18ios_base5clearEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 317, type: !593, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !542, !414}
!595 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__18ios_base8setstateEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 318, type: !593, isLocal: false, isDefinition: false, scopeLine: 318, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__18ios_base4goodEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 320, type: !597, isLocal: false, isDefinition: false, scopeLine: 320, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubroutineType(types: !598)
!598 = !{!207, !537}
!599 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__18ios_base3eofEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 321, type: !597, isLocal: false, isDefinition: false, scopeLine: 321, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__18ios_base4failEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 322, type: !597, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__18ios_base3badEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 323, type: !597, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__18ios_base10exceptionsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 325, type: !590, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__18ios_base10exceptionsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 326, type: !593, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "__set_badbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 328, type: !574, isLocal: false, isDefinition: false, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "__set_failbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 329, type: !574, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 333, type: !574, isLocal: false, isDefinition: false, scopeLine: 333, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!607 = !DISubprogram(name: "init", linkageName: "_ZNSt3__18ios_base4initEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 336, type: !608, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !542, !34}
!610 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__18ios_base5rdbufEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 337, type: !611, isLocal: false, isDefinition: false, scopeLine: 337, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!611 = !DISubroutineType(types: !612)
!612 = !{!34, !537}
!613 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__18ios_base5rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 340, type: !608, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!614 = !DISubprogram(name: "__call_callbacks", linkageName: "_ZNSt3__18ios_base16__call_callbacksENS0_5eventE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 346, type: !615, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !542, !"_ZTSNSt3__18ios_base5eventE"}
!617 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__18ios_base7copyfmtERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 347, type: !580, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!618 = !DISubprogram(name: "move", linkageName: "_ZNSt3__18ios_base4moveERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 348, type: !619, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !542, !313}
!621 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__18ios_base4swapERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 349, type: !619, isLocal: false, isDefinition: false, scopeLine: 349, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!622 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__18ios_base9set_rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 352, type: !608, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!623 = !DICompositeType(tag: DW_TAG_class_type, name: "locale", scope: !210, file: !624, line: 60, size: 64, align: 64, elements: !625, identifier: "_ZTSNSt3__16localeE")
!624 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__locale", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!625 = !{!626, !629, !630, !631, !632, !633, !634, !635, !636, !638, !642, !645, !648, !654, !657, !660, !663, !664, !667, !671, !674, !675, !678, !681, !685, !689, !693}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "none", scope: !"_ZTSNSt3__16localeE", file: !624, line: 69, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "category", scope: !"_ZTSNSt3__16localeE", file: !624, line: 67, baseType: !26)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !"_ZTSNSt3__16localeE", file: !624, line: 70, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !"_ZTSNSt3__16localeE", file: !624, line: 71, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "monetary", scope: !"_ZTSNSt3__16localeE", file: !624, line: 72, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !"_ZTSNSt3__16localeE", file: !624, line: 73, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !"_ZTSNSt3__16localeE", file: !624, line: 74, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "messages", scope: !"_ZTSNSt3__16localeE", file: !624, line: 75, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !"_ZTSNSt3__16localeE", file: !624, line: 76, baseType: !627, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 63)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__locale_", scope: !"_ZTSNSt3__16localeE", file: !624, line: 109, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5__impE", size: 64, align: 64)
!638 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 79, type: !639, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16localeE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!642 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 80, type: !643, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !641, !458}
!645 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 81, type: !646, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !641, !59}
!648 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 82, type: !649, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !641, !651}
!651 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !210, file: !384, line: 194, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!654 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 83, type: !655, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !641, !458, !59, !628}
!657 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 84, type: !658, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !641, !458, !651, !628}
!660 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 87, type: !661, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !641, !458, !458, !628}
!663 = !DISubprogram(name: "~locale", scope: !"_ZTSNSt3__16localeE", file: !624, line: 89, type: !639, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__16localeaSERKS0_", scope: !"_ZTSNSt3__16localeE", file: !624, line: 91, type: !665, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!665 = !DISubroutineType(types: !666)
!666 = !{!458, !641, !458}
!667 = !DISubprogram(name: "name", linkageName: "_ZNKSt3__16locale4nameEv", scope: !"_ZTSNSt3__16localeE", file: !624, line: 96, type: !668, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{!653, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!671 = !DISubprogram(name: "operator==", linkageName: "_ZNKSt3__16localeeqERKS0_", scope: !"_ZTSNSt3__16localeE", file: !624, line: 97, type: !672, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{!207, !670, !458}
!674 = !DISubprogram(name: "operator!=", linkageName: "_ZNKSt3__16localeneERKS0_", scope: !"_ZTSNSt3__16localeE", file: !624, line: 98, type: !672, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubprogram(name: "global", linkageName: "_ZNSt3__16locale6globalERKS0_", scope: !"_ZTSNSt3__16localeE", file: !624, line: 104, type: !676, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!676 = !DISubroutineType(types: !677)
!677 = !{!"_ZTSNSt3__16localeE", !458}
!678 = !DISubprogram(name: "classic", linkageName: "_ZNSt3__16locale7classicEv", scope: !"_ZTSNSt3__16localeE", file: !624, line: 105, type: !679, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!458}
!681 = !DISubprogram(name: "__install_ctor", linkageName: "_ZNSt3__16locale14__install_ctorERKS0_PNS0_5facetEl", scope: !"_ZTSNSt3__16localeE", file: !624, line: 111, type: !682, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !641, !458, !684, !108}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5facetE", size: 64, align: 64)
!685 = !DISubprogram(name: "__global", linkageName: "_ZNSt3__16locale8__globalEv", scope: !"_ZTSNSt3__16localeE", file: !624, line: 112, type: !686, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true)
!686 = !DISubroutineType(types: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16localeE")
!689 = !DISubprogram(name: "has_facet", linkageName: "_ZNKSt3__16locale9has_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !624, line: 113, type: !690, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{!207, !670, !692}
!692 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16locale2idE")
!693 = !DISubprogram(name: "use_facet", linkageName: "_ZNKSt3__16locale9use_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !624, line: 114, type: !694, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true)
!694 = !DISubroutineType(types: !695)
!695 = !{!696, !670, !692}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16locale5facetE")
!698 = !DICompositeType(tag: DW_TAG_class_type, name: "__imp", scope: !"_ZTSNSt3__16localeE", file: !624, line: 108, flags: DIFlagFwdDecl, identifier: "_ZTSNSt3__16locale5__impE")
!699 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >", scope: !210, file: !15, line: 4243, size: 192, align: 64, elements: !700, templateParams: !1053, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!700 = !{!701, !702, !703, !710, !714, !720, !725, !728, !734, !737, !740, !743, !746, !749, !752, !753, !757, !760, !763, !767, !772, !773, !774, !778, !782, !783, !784, !785, !786, !787, !788, !791, !792, !793, !794, !795, !798, !799, !800, !801, !804, !809, !814, !815, !816, !817, !818, !819, !820, !823, !826, !827, !830, !833, !834, !837, !840, !841, !842, !843, !844, !845, !846, !847, !850, !853, !856, !859, !862, !865, !868, !871, !874, !877, !880, !883, !886, !889, !892, !895, !898, !901, !904, !908, !911, !914, !917, !918, !921, !924, !927, !930, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !956, !959, !962, !965, !968, !971, !972, !973, !977, !980, !981, !982, !983, !984, !985, !986, !987, !995, !998, !1005, !1006, !1007, !1008, !1009, !1010, !1013, !1016, !1017, !1018, !1021, !1024, !1025, !1026, !1031, !1035, !1036, !1039, !1042, !1045, !1048, !1051, !1052}
!701 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", baseType: !"_ZTSNSt3__121__basic_string_commonILb1EEE")
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__r_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1318, baseType: !"_ZTSNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE", size: 192, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "npos", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1321, baseType: !704, flags: DIFlagPublic | DIFlagStaticMember, extraData: i64 -1)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1213, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__116allocator_traitsINS_9allocatorIcEEEE", file: !707, line: 1417, baseType: !708)
!707 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/memory", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !"_ZTSNSt3__111__size_typeINS_9allocatorIcEElLb1EEE", file: !707, line: 1074, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__19allocatorIcEE", file: !707, line: 1643, baseType: !229)
!710 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1323, type: !711, isLocal: false, isDefinition: false, scopeLine: 1323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!714 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1325, type: !715, isLocal: false, isDefinition: false, scopeLine: 1325, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !713, !717}
!717 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1211, baseType: !"_ZTSNSt3__19allocatorIcEE")
!720 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1326, type: !721, isLocal: false, isDefinition: false, scopeLine: 1326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !713, !723}
!723 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!725 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1327, type: !726, isLocal: false, isDefinition: false, scopeLine: 1327, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !713, !723, !717}
!728 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1335, type: !729, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !713, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1210, baseType: !218)
!734 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1337, type: !735, isLocal: false, isDefinition: false, scopeLine: 1337, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !713, !731, !717}
!737 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1339, type: !738, isLocal: false, isDefinition: false, scopeLine: 1339, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !713, !731, !705}
!740 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1341, type: !741, isLocal: false, isDefinition: false, scopeLine: 1341, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !713, !731, !705, !717}
!743 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1343, type: !744, isLocal: false, isDefinition: false, scopeLine: 1343, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !713, !705, !733}
!746 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1345, type: !747, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !713, !705, !733, !717}
