; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dvector.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::DVector" = type { %"class.soplex::Vector", i32, double* }
%"class.soplex::Vector" = type { i32, double* }
%"class.soplex::SVector" = type { %"struct.soplex::SVector::Element"* }
%"struct.soplex::SVector::Element" = type { double, i32 }
%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
%"class.std::__1::locale::__imp" = type opaque
%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
%"class.std::__1::ctype" = type <{ %"class.std::__1::locale::facet", i32*, i8, [7 x i8] }>
%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !1998, globals: !1283, imports: !2386)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dvector.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1280, size: 32, align: 32, elements: !16, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!15 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17}
!17 = !DIEnumerator(name: "__short_mask", value: 1)
!18 = !{!19, !76, !80, !81, !88, !95, !110, !115, !119, !123, !183, !264, !359, !363, !26, !364, !538, !588, !664, !3, !813, !888, !889, !1245, !1282, !1286, !1296, !1351, !1354, !1359, !1364, !1368, !1411, !1415, !1417, !1427, !1432, !1433, !1436, !1439, !1452, !1463, !1470, !1474, !1478, !1515, !1518, !1520, !1521, !1522, !1523, !1525, !1536, !1565, !1586, !1603, !1705, !1810, !9, !1811, !1812, !1836, !1867, !1873, !1874, !1891, !166, !14, !1894, !1904, !1908, !59, !384, !480, !1909, !1980, !544}
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !21, identifier: "_ZTS7__sFILE")
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !{!22, !25, !27, !28, !30, !31, !32, !33, !35, !39, !45, !55, !61, !62, !64, !65, !69, !73, !74, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !20, line: 123, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !20, line: 124, baseType: !26, size: 32, align: 32, offset: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !20, line: 125, baseType: !26, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !20, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !20, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !20, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !20, line: 129, baseType: !26, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !20, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !20, line: 133, baseType: !36, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!26, !34}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !20, line: 134, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!26, !34, !43, !26}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !20, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !34, !49, !26}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !20, line: 136, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!26, !34, !59, !26}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !20, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !20, line: 140, baseType: !63, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !20, line: 141, baseType: !26, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !20, line: 144, baseType: !66, size: 24, align: 8, offset: 928)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !20, line: 145, baseType: !70, size: 8, align: 8, offset: 952)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !20, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !20, line: 151, baseType: !26, size: 32, align: 32, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !20, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !77, identifier: "_ZTS6__sbuf")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !20, line: 89, baseType: !23, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !20, line: 90, baseType: !26, size: 32, align: 32, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !82, identifier: "_ZTS13__va_list_tag")
!82 = !{!83, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_union_type, file: !53, line: 76, size: 1024, align: 64, elements: !89, identifier: "_ZTS11__mbstate_t")
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !53, line: 77, baseType: !91, size: 1024, align: 8)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !53, line: 78, baseType: !54, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !96, line: 73, size: 448, align: 64, elements: !97, identifier: "_ZTS2tm")
!96 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !96, line: 74, baseType: !26, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !96, line: 75, baseType: !26, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !96, line: 76, baseType: !26, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !96, line: 77, baseType: !26, size: 32, align: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !96, line: 78, baseType: !26, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !96, line: 79, baseType: !26, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !96, line: 80, baseType: !26, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !96, line: 81, baseType: !26, size: 32, align: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !96, line: 82, baseType: !26, size: 32, align: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !96, line: 83, baseType: !108, size: 64, align: 64, offset: 320)
!108 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !96, line: 84, baseType: !43, size: 64, align: 64, offset: 384)
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 82, size: 64, align: 32, elements: !112, identifier: "_ZTS5div_t")
!111 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !111, line: 83, baseType: !26, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !111, line: 84, baseType: !26, size: 32, align: 32, offset: 32)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 87, size: 128, align: 64, elements: !116, identifier: "_ZTS6ldiv_t")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !111, line: 88, baseType: !108, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !111, line: 89, baseType: !108, size: 64, align: 64, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 93, size: 128, align: 64, elements: !120, identifier: "_ZTS7lldiv_t")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !111, line: 94, baseType: !54, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !111, line: 95, baseType: !54, size: 64, align: 64, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "DVector", scope: !125, file: !124, line: 55, size: 256, align: 64, elements: !127, identifier: "_ZTSN6soplex7DVectorE")
!124 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!125 = !DINamespace(name: "soplex", scope: null, file: !126, line: 49)
!126 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !{!128, !129, !130, !134, !141, !146, !147, !148, !151, !154, !155, !158, !163, !167, !168, !171, !175, !176, !179, !180}
!128 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex7DVectorE", baseType: !"_ZTSN6soplex6VectorE", flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "memsize", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 57, baseType: !26, size: 32, align: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 58, baseType: !131, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !125, file: !126, line: 127, baseType: !133)
!133 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!134 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 92, type: !135, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DVectorE")
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!139 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!141 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 98, type: !142, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubroutineType(types: !143)
!143 = !{!137, !138, !144}
!144 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!146 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 105, type: !135, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!147 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 111, type: !142, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!148 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7DVectormLEd", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 118, type: !149, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{!137, !138, !132}
!151 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex7DVector5reDimEi", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 125, type: !152, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !138, !26}
!154 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEi", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 128, type: !152, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!155 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEii", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 131, type: !156, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !138, !26, !26}
!158 = !DISubprogram(name: "memSize", linkageName: "_ZNK6soplex7DVector7memSizeEv", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 134, type: !159, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!159 = !DISubroutineType(types: !160)
!160 = !{!26, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DVectorE")
!163 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7DVector12isConsistentEv", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 140, type: !164, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !161}
!166 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!167 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 143, type: !152, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!168 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 146, type: !169, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !138, !139}
!171 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 148, type: !172, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !138, !174}
!174 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !162)
!175 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 151, type: !135, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKS0_", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 159, type: !177, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{!137, !138, !174}
!179 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 170, type: !142, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubprogram(name: "~DVector", scope: !"_ZTSN6soplex7DVectorE", file: !124, line: 180, type: !181, isLocal: false, isDefinition: false, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !138}
!183 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !125, file: !184, line: 82, size: 128, align: 64, elements: !185, identifier: "_ZTSN6soplex6VectorE")
!184 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!185 = !{!186, !187, !188, !192, !196, !199, !204, !205, !206, !210, !214, !217, !218, !219, !220, !221, !222, !223, !226, !229, !232, !235, !238, !239, !240, !243, !246, !249, !252, !257, !260, !263}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 90, baseType: !26, size: 32, align: 32, flags: DIFlagProtected)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 96, baseType: !131, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!188 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 107, type: !189, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191, !26, !131}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!192 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 114, type: !193, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !191, !139}
!195 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!196 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 121, type: !197, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{!195, !191, !144}
!199 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 128, type: !200, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{!195, !191, !202}
!202 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!204 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 134, type: !197, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 140, type: !200, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 146, type: !207, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{!26, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!210 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 151, type: !211, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !191, !26}
!213 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !132)
!214 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 158, type: !215, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{!132, !209, !26}
!217 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 168, type: !193, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 170, type: !197, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 172, type: !200, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!220 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 175, type: !193, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!221 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 177, type: !197, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!222 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 179, type: !200, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!223 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex6VectormLEd", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 182, type: !224, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubroutineType(types: !225)
!225 = !{!195, !191, !132}
!226 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 185, type: !227, isLocal: false, isDefinition: false, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!227 = !DISubroutineType(types: !228)
!228 = !{!132, !209, !202}
!229 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 187, type: !230, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!132, !209, !144}
!232 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 189, type: !233, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{!132, !209, !139}
!235 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex6Vector6maxAbsEv", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 199, type: !236, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!236 = !DISubroutineType(types: !237)
!237 = !{!132, !209}
!238 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex6Vector6lengthEv", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 201, type: !236, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex6Vector7length2Ev", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 203, type: !236, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!240 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 206, type: !241, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!241 = !DISubroutineType(types: !242)
!242 = !{!195, !191, !132, !144}
!243 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 208, type: !244, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!244 = !DISubroutineType(types: !245)
!245 = !{!195, !191, !132, !202}
!246 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKS0_", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 210, type: !247, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubroutineType(types: !248)
!248 = !{!195, !191, !132, !139}
!249 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex6Vector7get_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 229, type: !250, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{!131, !191}
!252 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex6Vector13get_const_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 237, type: !253, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !209}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!257 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6Vector12isConsistentEv", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 245, type: !258, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{!166, !209}
!260 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6Vector5clearEv", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 248, type: !261, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !191}
!263 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !184, line: 256, type: !261, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!264 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !125, file: !265, line: 98, size: 64, align: 64, elements: !266, identifier: "_ZTSN6soplex7SVectorE")
!265 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!266 = !{!267, !269, !273, !276, !281, !286, !289, !292, !295, !296, !300, !301, !302, !305, !308, !312, !316, !320, !321, !324, !325, !328, !329, !330, !331, !335, !338, !341, !344, !347, !350, !353, !356, !357, !358}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 120, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!269 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 127, type: !270, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !272, !26, !132}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!273 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 138, type: !274, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !272, !144}
!276 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 144, type: !277, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !272, !26, !279, !255}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!281 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 147, type: !282, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !272, !26, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!286 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 150, type: !287, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !272, !26, !26}
!289 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 153, type: !290, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !272, !26}
!292 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 160, type: !293, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !272}
!295 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 165, type: !293, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!296 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 172, type: !297, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{!26, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!300 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 181, type: !297, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 190, type: !297, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!302 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 197, type: !303, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{!26, !299, !26}
!305 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 214, type: !306, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{!132, !299, !26}
!308 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 223, type: !309, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !272, !26}
!311 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!312 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 230, type: !313, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !299, !26}
!315 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !285)
!316 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 237, type: !317, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !272, !26}
!319 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !26)
!320 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 244, type: !303, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 251, type: !322, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{!213, !272, !26}
!324 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 258, type: !306, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!325 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 269, type: !326, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubroutineType(types: !327)
!327 = !{!132, !299}
!328 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 272, type: !326, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 275, type: !326, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!330 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 281, type: !326, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 284, type: !332, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !272, !132}
!334 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!335 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 287, type: !336, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!336 = !DISubroutineType(types: !337)
!337 = !{!132, !299, !139}
!338 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 305, type: !339, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!339 = !DISubroutineType(types: !340)
!340 = !{!334, !272, !202}
!341 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 307, type: !342, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{!334, !272, !144}
!344 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 309, type: !345, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{!334, !272, !139}
!347 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 312, type: !348, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{!166, !299}
!350 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 324, type: !351, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !272, !26, !268}
!353 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 329, type: !354, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{!268, !299}
!356 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 334, type: !290, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!357 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 340, type: !290, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 346, type: !351, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !265, line: 109, size: 128, align: 64, elements: !360, identifier: "_ZTSN6soplex7SVector7ElementE")
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !265, line: 111, baseType: !132, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !265, line: 112, baseType: !26, size: 32, align: 32, offset: 64)
!363 = !DICompositeType(tag: DW_TAG_class_type, name: "SSVector", scope: !125, file: !184, line: 35, flags: DIFlagFwdDecl, identifier: "_ZTSN6soplex8SSVectorE")
!364 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_istream<char, std::__1::char_traits<char> >", scope: !366, file: !365, line: 1726, size: 1344, align: 64, elements: !369, vtableHolder: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", templateParams: !535, identifier: "_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!365 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/istream", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!366 = !DINamespace(name: "__1", scope: !368, file: !367, line: 369)
!367 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!368 = !DINamespace(name: "std", scope: null, file: !367, line: 368)
!369 = !{!370, !371, !376, !380, !385, !388, !392, !398, !405, !412, !415, !419, !423, !428, !431, !435, !439, !444, !448, !453, !458, !462, !467, !471, !476, !481, !486, !490, !493, !497, !500, !501, !502, !505, !506, !507, !510, !513, !516, !519, !526, !529}
!370 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", offset: 24, flags: DIFlagPublic | DIFlagVirtual)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$basic_istream", scope: !365, file: !365, baseType: !372, size: 64, flags: DIFlagArtificial)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!26}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__gc_", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 177, baseType: !377, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !366, file: !4, line: 229, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !379, line: 51, baseType: !108)
!379 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!380 = !DISubprogram(name: "basic_istream", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 187, type: !381, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383, !384}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__115basic_streambufIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!385 = !DISubprogram(name: "~basic_istream", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 188, type: !386, isLocal: false, isDefinition: false, scopeLine: 188, containingType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !383}
!388 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 199, type: !389, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !383, !391}
!391 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!392 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsEPFRS3_S4_E", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 216, type: !393, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{!391, !383, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!391, !391}
!398 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsEPFRNS_9basic_iosIcS2_EES6_E", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 217, type: !399, isLocal: false, isDefinition: false, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!391, !383, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !404}
!404 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!405 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsEPFRNS_8ios_baseES5_E", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 219, type: !406, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!406 = !DISubroutineType(types: !407)
!407 = !{!391, !383, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !411}
!411 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__18ios_baseE")
!412 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 220, type: !413, isLocal: false, isDefinition: false, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!391, !383, !384}
!415 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERb", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 221, type: !416, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{!391, !383, !418}
!418 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !166)
!419 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERs", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 222, type: !420, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!420 = !DISubroutineType(types: !421)
!421 = !{!391, !383, !422}
!422 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !29)
!423 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERt", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 223, type: !424, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{!391, !383, !426}
!426 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !427)
!427 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!428 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERi", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 224, type: !429, isLocal: false, isDefinition: false, scopeLine: 224, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{!391, !383, !319}
!431 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERj", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 225, type: !432, isLocal: false, isDefinition: false, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!391, !383, !434}
!434 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !84)
!435 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERl", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 226, type: !436, isLocal: false, isDefinition: false, scopeLine: 226, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{!391, !383, !438}
!438 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108)
!439 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERm", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 227, type: !440, isLocal: false, isDefinition: false, scopeLine: 227, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!440 = !DISubroutineType(types: !441)
!441 = !{!391, !383, !442}
!442 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !443)
!443 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!444 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERx", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 228, type: !445, isLocal: false, isDefinition: false, scopeLine: 228, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!445 = !DISubroutineType(types: !446)
!446 = !{!391, !383, !447}
!447 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !54)
!448 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERy", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 229, type: !449, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!391, !383, !451}
!451 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !452)
!452 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!453 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERf", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 230, type: !454, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{!391, !383, !456}
!456 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !457)
!457 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!458 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERd", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 231, type: !459, isLocal: false, isDefinition: false, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!459 = !DISubroutineType(types: !460)
!460 = !{!391, !383, !461}
!461 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !133)
!462 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERe", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 232, type: !463, isLocal: false, isDefinition: false, scopeLine: 232, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!463 = !DISubroutineType(types: !464)
!464 = !{!391, !383, !465}
!465 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !466)
!466 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!467 = !DISubprogram(name: "operator>>", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEErsERPv", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 233, type: !468, isLocal: false, isDefinition: false, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{!391, !383, !470}
!470 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!471 = !DISubprogram(name: "gcount", linkageName: "_ZNKSt3__113basic_istreamIcNS_11char_traitsIcEEE6gcountEv", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 237, type: !472, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{!377, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!476 = !DISubprogram(name: "get", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE3getEv", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 238, type: !477, isLocal: false, isDefinition: false, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !383}
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 182, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 626, baseType: !26)
!481 = !DISubprogram(name: "get", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE3getERc", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 239, type: !482, isLocal: false, isDefinition: false, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{!391, !383, !484}
!484 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 180, baseType: !44)
!486 = !DISubprogram(name: "get", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE3getEPcl", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 240, type: !487, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!487 = !DISubroutineType(types: !488)
!488 = !{!391, !383, !489, !377}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!490 = !DISubprogram(name: "get", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE3getEPclc", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 241, type: !491, isLocal: false, isDefinition: false, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{!391, !383, !489, !377, !485}
!493 = !DISubprogram(name: "get", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE3getERNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 242, type: !494, isLocal: false, isDefinition: false, scopeLine: 242, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{!391, !383, !496}
!496 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__115basic_streambufIcNS_11char_traitsIcEEEE")
!497 = !DISubprogram(name: "get", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE3getERNS_15basic_streambufIcS2_EEc", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 243, type: !498, isLocal: false, isDefinition: false, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{!391, !383, !496, !485}
!500 = !DISubprogram(name: "getline", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE7getlineEPcl", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 245, type: !487, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!501 = !DISubprogram(name: "getline", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE7getlineEPclc", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 246, type: !491, isLocal: false, isDefinition: false, scopeLine: 246, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubprogram(name: "ignore", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE6ignoreEli", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 248, type: !503, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!503 = !DISubroutineType(types: !504)
!504 = !{!391, !383, !377, !479}
!505 = !DISubprogram(name: "peek", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE4peekEv", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 249, type: !477, isLocal: false, isDefinition: false, scopeLine: 249, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubprogram(name: "read", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE4readEPcl", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 250, type: !487, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubprogram(name: "readsome", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE8readsomeEPcl", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 251, type: !508, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{!377, !383, !489, !377}
!510 = !DISubprogram(name: "putback", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE7putbackEc", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 253, type: !511, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubroutineType(types: !512)
!512 = !{!391, !383, !485}
!513 = !DISubprogram(name: "unget", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE5ungetEv", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 254, type: !514, isLocal: false, isDefinition: false, scopeLine: 254, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{!391, !383}
!516 = !DISubprogram(name: "sync", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE4syncEv", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 255, type: !517, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubroutineType(types: !518)
!518 = !{!26, !383}
!519 = !DISubprogram(name: "tellg", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE5tellgEv", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 257, type: !520, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubroutineType(types: !521)
!521 = !{!522, !383}
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 183, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 628, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "streampos", scope: !366, file: !525, line: 176, baseType: !"_ZTSNSt3__14fposI11__mbstate_tEE")
!525 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!526 = !DISubprogram(name: "seekg", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE5seekgENS_4fposI11__mbstate_tEE", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 258, type: !527, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{!391, !383, !522}
!529 = !DISubprogram(name: "seekg", linkageName: "_ZNSt3__113basic_istreamIcNS_11char_traitsIcEEE5seekgExNS_8ios_base7seekdirE", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 259, type: !530, isLocal: false, isDefinition: false, scopeLine: 259, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{!391, !383, !532, !"_ZTSNSt3__18ios_base7seekdirE"}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE", file: !365, line: 184, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 627, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamoff", scope: !366, file: !525, line: 187, baseType: !54)
!535 = !{!536, !537}
!536 = !DITemplateTypeParameter(name: "_CharT", type: !44)
!537 = !DITemplateTypeParameter(name: "_Traits", type: !"_ZTSNSt3__111char_traitsIcEE")
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !366, file: !15, line: 623, size: 8, align: 8, elements: !539, templateParams: !587, identifier: "_ZTSNSt3__111char_traitsIcEE")
!539 = !{!540, !547, !550, !551, !558, !561, !564, !568, !569, !572, !575, !578, !581, !584}
!540 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignERcRKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 631, type: !541, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543, !545}
!543 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 625, baseType: !44)
!545 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!547 = !DISubprogram(name: "eq", linkageName: "_ZNSt3__111char_traitsIcE2eqEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 633, type: !548, isLocal: false, isDefinition: false, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true)
!548 = !DISubroutineType(types: !549)
!549 = !{!166, !544, !544}
!550 = !DISubprogram(name: "lt", linkageName: "_ZNSt3__111char_traitsIcE2ltEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 635, type: !548, isLocal: false, isDefinition: false, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true)
!551 = !DISubprogram(name: "compare", linkageName: "_ZNSt3__111char_traitsIcE7compareEPKcS3_m", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 638, type: !552, isLocal: false, isDefinition: false, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true)
!552 = !DISubroutineType(types: !553)
!553 = !{!26, !554, !554, !555}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !556, line: 30, baseType: !557)
!556 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !53, line: 92, baseType: !443)
!558 = !DISubprogram(name: "length", linkageName: "_ZNSt3__111char_traitsIcE6lengthEPKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 640, type: !559, isLocal: false, isDefinition: false, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{!555, !554}
!561 = !DISubprogram(name: "find", linkageName: "_ZNSt3__111char_traitsIcE4findEPKcmRS2_", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 641, type: !562, isLocal: false, isDefinition: false, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{!554, !554, !555, !545}
!564 = !DISubprogram(name: "move", linkageName: "_ZNSt3__111char_traitsIcE4moveEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 643, type: !565, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !567, !554, !555}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!568 = !DISubprogram(name: "copy", linkageName: "_ZNSt3__111char_traitsIcE4copyEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 645, type: !565, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true)
!569 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignEPcmc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 650, type: !570, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true)
!570 = !DISubroutineType(types: !571)
!571 = !{!567, !567, !555, !544}
!572 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt3__111char_traitsIcE7not_eofEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 653, type: !573, isLocal: false, isDefinition: false, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{!480, !480}
!575 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt3__111char_traitsIcE12to_char_typeEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 655, type: !576, isLocal: false, isDefinition: false, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true)
!576 = !DISubroutineType(types: !577)
!577 = !{!544, !480}
!578 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt3__111char_traitsIcE11to_int_typeEc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 657, type: !579, isLocal: false, isDefinition: false, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{!480, !544}
!581 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt3__111char_traitsIcE11eq_int_typeEii", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 659, type: !582, isLocal: false, isDefinition: false, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{!166, !480, !480}
!584 = !DISubprogram(name: "eof", linkageName: "_ZNSt3__111char_traitsIcE3eofEv", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 661, type: !585, isLocal: false, isDefinition: false, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{!480}
!587 = !{!536}
!588 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ios<char, std::__1::char_traits<char> >", scope: !366, file: !589, line: 570, size: 1216, align: 64, elements: !590, vtableHolder: !"_ZTSNSt3__18ios_baseE", templateParams: !535, identifier: "_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!589 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/streambuf", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!590 = !{!591, !592, !594, !596, !601, !602, !606, !610, !611, !612, !613, !614, !615, !616, !617, !620, !623, !626, !629, !632, !635, !639, !643, !646, !651, !654, !657, !658, !659, !662, !663}
!591 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__18ios_baseE", flags: DIFlagPublic)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__tie_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 647, baseType: !593, size: 64, align: 64, offset: 1088)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__fill_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 648, baseType: !595, size: 32, align: 32, offset: 1152)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 579, baseType: !480)
!596 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEcvbEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 585, type: !597, isLocal: false, isDefinition: false, scopeLine: 585, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubroutineType(types: !598)
!598 = !{!166, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!601 = !DISubprogram(name: "operator!", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEntEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 586, type: !597, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE7rdstateEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 587, type: !603, isLocal: false, isDefinition: false, scopeLine: 587, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !599}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "iostate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 256, baseType: !84)
!606 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5clearEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 588, type: !607, isLocal: false, isDefinition: false, scopeLine: 588, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609, !605}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!610 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE8setstateEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 589, type: !607, isLocal: false, isDefinition: false, scopeLine: 589, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!611 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4goodEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 590, type: !597, isLocal: false, isDefinition: false, scopeLine: 590, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3eofEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 591, type: !597, isLocal: false, isDefinition: false, scopeLine: 591, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4failEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 592, type: !597, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3badEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 593, type: !597, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 595, type: !603, isLocal: false, isDefinition: false, scopeLine: 595, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 596, type: !607, isLocal: false, isDefinition: false, scopeLine: 596, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 600, type: !618, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !609, !384}
!620 = !DISubprogram(name: "~basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 601, type: !621, isLocal: false, isDefinition: false, scopeLine: 601, containingType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !609}
!623 = !DISubprogram(name: "tie", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 605, type: !624, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubroutineType(types: !625)
!625 = !{!593, !599}
!626 = !DISubprogram(name: "tie", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEPNS_13basic_ostreamIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 607, type: !627, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubroutineType(types: !628)
!628 = !{!593, !609, !593}
!629 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 610, type: !630, isLocal: false, isDefinition: false, scopeLine: 610, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!630 = !DISubroutineType(types: !631)
!631 = !{!384, !599}
!632 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 612, type: !633, isLocal: false, isDefinition: false, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubroutineType(types: !634)
!634 = !{!384, !609, !384}
!635 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE7copyfmtERKS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 614, type: !636, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!636 = !DISubroutineType(types: !637)
!637 = !{!404, !609, !638}
!638 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !600)
!639 = !DISubprogram(name: "fill", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 617, type: !640, isLocal: false, isDefinition: false, scopeLine: 617, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !599}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 576, baseType: !44)
!643 = !DISubprogram(name: "fill", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 619, type: !644, isLocal: false, isDefinition: false, scopeLine: 619, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!644 = !DISubroutineType(types: !645)
!645 = !{!642, !609, !642}
!646 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5imbueERKNS_6localeE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 622, type: !647, isLocal: false, isDefinition: false, scopeLine: 622, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{!"_ZTSNSt3__16localeE", !609, !649}
!649 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16localeE")
!651 = !DISubprogram(name: "narrow", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE6narrowEcc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 625, type: !652, isLocal: false, isDefinition: false, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{!44, !599, !642, !44}
!654 = !DISubprogram(name: "widen", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5widenEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 627, type: !655, isLocal: false, isDefinition: false, scopeLine: 627, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{!642, !599, !44}
!657 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 631, type: !621, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!658 = !DISubprogram(name: "init", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4initEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 634, type: !618, isLocal: false, isDefinition: false, scopeLine: 634, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!659 = !DISubprogram(name: "move", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4moveERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 637, type: !660, isLocal: false, isDefinition: false, scopeLine: 637, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !609, !404}
!662 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 643, type: !660, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!663 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE9set_rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 645, type: !618, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!664 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !366, file: !4, line: 231, size: 1088, align: 64, elements: !665, vtableHolder: !"_ZTSNSt3__18ios_baseE", identifier: "_ZTSNSt3__18ios_baseE")
!665 = !{!666, !667, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !689, !690, !691, !692, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !713, !715, !716, !717, !718, !720, !721, !722, !724, !725, !726, !731, !735, !736, !739, !742, !745, !748, !749, !750, !753, !756, !757, !760, !763, !766, !769, !773, !776, !779, !782, !785, !786, !789, !790, !791, !792, !793, !794, !795, !796, !797, !800, !803, !804, !807, !808, !811, !812}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ios_base", scope: !4, file: !4, baseType: !372, size: 64, flags: DIFlagArtificial)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "boolalpha", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 237, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmtflags", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 236, baseType: !84)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 238, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 239, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "hex", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 240, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 241, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 242, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "oct", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 243, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 244, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scientific", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 245, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "showbase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 246, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "showpoint", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 247, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "showpos", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 248, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2048)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "skipws", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 249, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4096)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "unitbuf", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 250, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "uppercase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 251, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "adjustfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 252, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 176)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "basefield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 253, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 74)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "floatfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 254, baseType: !668, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 260)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "badbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 258, baseType: !688, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "eofbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 259, baseType: !688, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "failbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 260, baseType: !688, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "goodbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 261, baseType: !688, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 265, baseType: !693, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "openmode", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 263, baseType: !84)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 266, baseType: !693, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 267, baseType: !693, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 268, baseType: !693, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 269, baseType: !693, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "trunc", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 270, baseType: !693, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__fmtflags_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 359, baseType: !669, size: 32, align: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__precision_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 360, baseType: !377, size: 64, align: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__width_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 361, baseType: !377, size: 64, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__rdstate_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 362, baseType: !605, size: 32, align: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__exceptions_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 363, baseType: !605, size: 32, align: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__rdbuf_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 364, baseType: !34, size: 64, align: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__loc_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 365, baseType: !34, size: 64, align: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__fn_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 366, baseType: !708, size: 64, align: 64, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_callback", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 306, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !"_ZTSNSt3__18ios_base5eventE", !411, !26}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__index_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 367, baseType: !714, size: 64, align: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__event_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 368, baseType: !555, size: 64, align: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__event_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 369, baseType: !555, size: 64, align: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__xindex_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 373, baseType: !26, flags: DIFlagStaticMember)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 375, baseType: !719, size: 64, align: 64, offset: 704)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 376, baseType: !555, size: 64, align: 64, offset: 768)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 377, baseType: !555, size: 64, align: 64, offset: 832)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 378, baseType: !723, size: 64, align: 64, offset: 896)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 379, baseType: !555, size: 64, align: 64, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 380, baseType: !555, size: 64, align: 64, offset: 1024)
!726 = !DISubprogram(name: "flags", linkageName: "_ZNKSt3__18ios_base5flagsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 281, type: !727, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!727 = !DISubroutineType(types: !728)
!728 = !{!669, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__18ios_baseE")
!731 = !DISubprogram(name: "flags", linkageName: "_ZNSt3__18ios_base5flagsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 282, type: !732, isLocal: false, isDefinition: false, scopeLine: 282, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!732 = !DISubroutineType(types: !733)
!733 = !{!669, !734, !669}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__18ios_baseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!735 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 283, type: !732, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!736 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEjj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 284, type: !737, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!737 = !DISubroutineType(types: !738)
!738 = !{!669, !734, !669, !669}
!739 = !DISubprogram(name: "unsetf", linkageName: "_ZNSt3__18ios_base6unsetfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 285, type: !740, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !734, !669}
!742 = !DISubprogram(name: "precision", linkageName: "_ZNKSt3__18ios_base9precisionEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 287, type: !743, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!743 = !DISubroutineType(types: !744)
!744 = !{!377, !729}
!745 = !DISubprogram(name: "precision", linkageName: "_ZNSt3__18ios_base9precisionEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 288, type: !746, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!746 = !DISubroutineType(types: !747)
!747 = !{!377, !734, !377}
!748 = !DISubprogram(name: "width", linkageName: "_ZNKSt3__18ios_base5widthEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 289, type: !743, isLocal: false, isDefinition: false, scopeLine: 289, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!749 = !DISubprogram(name: "width", linkageName: "_ZNSt3__18ios_base5widthEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 290, type: !746, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!750 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__18ios_base5imbueERKNS_6localeE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 293, type: !751, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!751 = !DISubroutineType(types: !752)
!752 = !{!"_ZTSNSt3__16localeE", !734, !649}
!753 = !DISubprogram(name: "getloc", linkageName: "_ZNKSt3__18ios_base6getlocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 294, type: !754, isLocal: false, isDefinition: false, scopeLine: 294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!754 = !DISubroutineType(types: !755)
!755 = !{!"_ZTSNSt3__16localeE", !729}
