; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/forest.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::CLUFactor" = type { i32, i32, i32, double, double, double, double, double, %"struct.soplex::CLUFactor::Perm", %"struct.soplex::CLUFactor::Perm", %"struct.soplex::CLUFactor::L", double*, %"struct.soplex::CLUFactor::U", double*, double*, i32, %"class.soplex::CLUFactor::Temp" }
%"struct.soplex::CLUFactor::Perm" = type { i32*, i32* }
%"struct.soplex::CLUFactor::L" = type { i32, double*, i32*, i32, i32, i32, i32*, i32*, i32, double*, i32*, i32*, i32*, i32* }
%"struct.soplex::CLUFactor::U" = type { %"struct.soplex::CLUFactor::U::Row", %"struct.soplex::CLUFactor::U::Col", i32, i32 }
%"struct.soplex::CLUFactor::U::Row" = type { %"struct.soplex::CLUFactor::Dring", %"struct.soplex::CLUFactor::Dring"*, i32, i32, double*, i32*, i32*, i32*, i32* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !26, subprograms: !2421, globals: !2757, imports: !2759)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/forest.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !3, !11, !17, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 50, size: 32, align: 32, elements: !5, identifier: "_ZTSN6soplex10SLinSolver6StatusE")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slinsolver.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "OK", value: 0)
!7 = !DIEnumerator(name: "INSTABLE", value: 1)
!8 = !DIEnumerator(name: "SINGULAR", value: 2)
!9 = !DIEnumerator(name: "UNLOADED", value: 4)
!10 = !DIEnumerator(name: "ERROR", value: 8)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !12, line: 305, size: 32, align: 32, elements: !13, identifier: "_ZTSNSt3__18ios_base5eventE")
!12 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "erase_event", value: 0)
!15 = !DIEnumerator(name: "imbue_event", value: 1)
!16 = !DIEnumerator(name: "copyfmt_event", value: 2)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !12, line: 272, size: 32, align: 32, elements: !18, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "beg", value: 0)
!20 = !DIEnumerator(name: "cur", value: 1)
!21 = !DIEnumerator(name: "end", value: 2)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !23, line: 1280, size: 32, align: 32, elements: !24, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!23 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!24 = !{!25}
!25 = !DIEnumerator(name: "__short_mask", value: 1)
!26 = !{!27, !84, !88, !89, !96, !103, !118, !123, !127, !131, !336, !3, !416, !511, !515, !590, !713, !763, !808, !809, !813, !829, !835, !847, !852, !863, !893, !34, !913, !163, !930, !986, !1113, !1189, !11, !1339, !1414, !1415, !1771, !1806, !1810, !1820, !1875, !1878, !1883, !1888, !1892, !1935, !1939, !1941, !1951, !1956, !1957, !1960, !1963, !1976, !1987, !1994, !1998, !2002, !2039, !2042, !2044, !2045, !2046, !2047, !2049, !2060, !2089, !2110, !2127, !2233, !17, !2234, !2258, !2289, !2295, !2296, !2313, !335, !22, !2316, !2326, !2330, !67, !995, !971, !2331, !2402, !2420}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !28, line: 122, size: 1216, align: 64, elements: !29, identifier: "_ZTS7__sFILE")
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !{!30, !33, !35, !36, !38, !39, !40, !41, !43, !47, !53, !63, !69, !70, !72, !73, !77, !81, !82, !83}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !28, line: 123, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !28, line: 124, baseType: !34, size: 32, align: 32, offset: 64)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !28, line: 125, baseType: !34, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !28, line: 126, baseType: !37, size: 16, align: 16, offset: 128)
!37 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !28, line: 127, baseType: !37, size: 16, align: 16, offset: 144)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !28, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !28, line: 129, baseType: !34, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !28, line: 132, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !28, line: 133, baseType: !44, size: 64, align: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!34, !42}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !28, line: 134, baseType: !48, size: 64, align: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!34, !42, !51, !34}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !28, line: 135, baseType: !54, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !42, !57, !34}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !28, line: 77, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !28, line: 136, baseType: !64, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!34, !42, !67, !34}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !28, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !28, line: 140, baseType: !71, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !28, line: 141, baseType: !34, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !28, line: 144, baseType: !74, size: 24, align: 8, offset: 928)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 24, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !28, line: 145, baseType: !78, size: 8, align: 8, offset: 952)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !28, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !28, line: 151, baseType: !34, size: 32, align: 32, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !28, line: 152, baseType: !57, size: 64, align: 64, offset: 1152)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !28, line: 88, size: 128, align: 64, elements: !85, identifier: "_ZTS6__sbuf")
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !28, line: 89, baseType: !31, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !28, line: 90, baseType: !34, size: 32, align: 32, offset: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !28, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !90, identifier: "_ZTS13__va_list_tag")
!90 = !{!91, !93, !94, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !92, size: 32, align: 32)
!92 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !92, size: 32, align: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !42, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !42, size: 64, align: 64, offset: 128)
!96 = !DICompositeType(tag: DW_TAG_union_type, file: !61, line: 76, size: 1024, align: 64, elements: !97, identifier: "_ZTS11__mbstate_t")
!97 = !{!98, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !61, line: 77, baseType: !99, size: 1024, align: 8)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 1024, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !61, line: 78, baseType: !62, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !104, line: 73, size: 448, align: 64, elements: !105, identifier: "_ZTS2tm")
!104 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !117}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !104, line: 74, baseType: !34, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !104, line: 75, baseType: !34, size: 32, align: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !104, line: 76, baseType: !34, size: 32, align: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !104, line: 77, baseType: !34, size: 32, align: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !104, line: 78, baseType: !34, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !104, line: 79, baseType: !34, size: 32, align: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !104, line: 80, baseType: !34, size: 32, align: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !104, line: 81, baseType: !34, size: 32, align: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !104, line: 82, baseType: !34, size: 32, align: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !104, line: 83, baseType: !116, size: 64, align: 64, offset: 320)
!116 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !104, line: 84, baseType: !51, size: 64, align: 64, offset: 384)
!118 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 82, size: 64, align: 32, elements: !120, identifier: "_ZTS5div_t")
!119 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !119, line: 83, baseType: !34, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !119, line: 84, baseType: !34, size: 32, align: 32, offset: 32)
!123 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 87, size: 128, align: 64, elements: !124, identifier: "_ZTS6ldiv_t")
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !119, line: 88, baseType: !116, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !119, line: 89, baseType: !116, size: 64, align: 64, offset: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 93, size: 128, align: 64, elements: !128, identifier: "_ZTS7lldiv_t")
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !119, line: 94, baseType: !62, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !119, line: 95, baseType: !62, size: 64, align: 64, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_class_type, name: "CLUFactor", scope: !133, file: !132, line: 36, size: 3904, align: 64, elements: !135, identifier: "_ZTSN6soplex9CLUFactorE")
!132 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/clufactor.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!133 = !DINamespace(name: "soplex", scope: null, file: !134, line: 49)
!134 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!135 = !{!136, !137, !138, !139, !142, !143, !144, !145, !146, !147, !148, !149, !151, !152, !153, !154, !155, !156, !160, !164, !167, !170, !171, !174, !175, !176, !177, !180, !183, !186, !187, !188, !189, !190, !193, !196, !199, !202, !205, !206, !209, !212, !215, !218, !219, !220, !221, !222, !225, !228, !231, !232, !238, !239, !243, !244, !245, !246, !247, !250, !251, !252, !253, !256, !259, !262, !265, !266, !267, !268, !269, !270, !271, !274, !279, !283, !284, !285, !288, !289, !292, !293, !294, !297, !300, !303, !306, !309, !310, !311, !314, !317, !321, !325, !328, !332}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 164, baseType: !"_ZTSN6soplex10SLinSolver6StatusE", size: 32, align: 32, flags: DIFlagProtected)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "thedim", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 166, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nzCnt", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 167, baseType: !34, size: 32, align: 32, offset: 64, flags: DIFlagProtected)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "initMaxabs", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 168, baseType: !140, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !133, file: !134, line: 127, baseType: !141)
!141 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "maxabs", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 169, baseType: !140, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rowMemMult", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 171, baseType: !140, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "colMemMult", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 172, baseType: !140, size: 64, align: 64, offset: 320, flags: DIFlagProtected)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lMemMult", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 173, baseType: !140, size: 64, align: 64, offset: 384, flags: DIFlagProtected)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 175, baseType: !"_ZTSN6soplex9CLUFactor4PermE", size: 128, align: 64, offset: 448, flags: DIFlagProtected)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 176, baseType: !"_ZTSN6soplex9CLUFactor4PermE", size: 128, align: 64, offset: 576, flags: DIFlagProtected)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 178, baseType: !"_ZTSN6soplex9CLUFactor1LE", size: 832, align: 64, offset: 704, flags: DIFlagProtected)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 179, baseType: !150, size: 64, align: 64, offset: 1536, flags: DIFlagProtected)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 180, baseType: !"_ZTSN6soplex9CLUFactor1UE", size: 1344, align: 64, offset: 1600, flags: DIFlagProtected)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 182, baseType: !150, size: 64, align: 64, offset: 2944, flags: DIFlagProtected)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "work2", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 183, baseType: !150, size: 64, align: 64, offset: 3008, flags: DIFlagProtected)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "factorCount", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 185, baseType: !34, size: 32, align: 32, offset: 3072, flags: DIFlagProtected)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 188, baseType: !"_ZTSN6soplex9CLUFactor4TempE", size: 768, align: 64, offset: 3136)
!156 = !DISubprogram(name: "solveUright", linkageName: "_ZN6soplex9CLUFactor11solveUrightEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 192, type: !157, isLocal: false, isDefinition: false, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !159, !150, !150}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9CLUFactorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!160 = !DISubprogram(name: "solveUrightEps", linkageName: "_ZN6soplex9CLUFactor14solveUrightEpsEPdPidS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 194, type: !161, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true)
!161 = !DISubroutineType(types: !162)
!162 = !{!34, !159, !150, !163, !140, !150}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!164 = !DISubprogram(name: "solveUright2", linkageName: "_ZN6soplex9CLUFactor12solveUright2EPdS1_S1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 196, type: !165, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !159, !150, !150, !150, !150}
!167 = !DISubprogram(name: "solveUright2eps", linkageName: "_ZN6soplex9CLUFactor15solveUright2epsEPdS1_S1_S1_Pid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 198, type: !168, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true)
!168 = !DISubroutineType(types: !169)
!169 = !{!34, !159, !150, !150, !150, !150, !163, !140}
!170 = !DISubprogram(name: "solveLright2", linkageName: "_ZN6soplex9CLUFactor12solveLright2EPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 201, type: !157, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true)
!171 = !DISubprogram(name: "solveUpdateRight", linkageName: "_ZN6soplex9CLUFactor16solveUpdateRightEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 203, type: !172, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !159, !150}
!174 = !DISubprogram(name: "solveUpdateRight2", linkageName: "_ZN6soplex9CLUFactor17solveUpdateRight2EPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 205, type: !157, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true)
!175 = !DISubprogram(name: "solveUleft", linkageName: "_ZN6soplex9CLUFactor10solveUleftEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 207, type: !157, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true)
!176 = !DISubprogram(name: "solveUleft2", linkageName: "_ZN6soplex9CLUFactor11solveUleft2EPdS1_S1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 209, type: !165, isLocal: false, isDefinition: false, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true)
!177 = !DISubprogram(name: "solveLleft2forest", linkageName: "_ZN6soplex9CLUFactor17solveLleft2forestEPdPiS1_d", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 212, type: !178, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{!34, !159, !150, !163, !150, !140}
!180 = !DISubprogram(name: "solveLleft2", linkageName: "_ZN6soplex9CLUFactor11solveLleft2EPdPiS1_d", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 215, type: !181, isLocal: false, isDefinition: false, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !159, !150, !163, !150, !140}
!183 = !DISubprogram(name: "solveLleftForest", linkageName: "_ZN6soplex9CLUFactor16solveLleftForestEPdPid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 218, type: !184, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true)
!184 = !DISubroutineType(types: !185)
!185 = !{!34, !159, !150, !163, !140}
!186 = !DISubprogram(name: "solveLleft", linkageName: "_ZN6soplex9CLUFactor10solveLleftEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 220, type: !172, isLocal: false, isDefinition: false, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: true)
!187 = !DISubprogram(name: "solveLleftEps", linkageName: "_ZN6soplex9CLUFactor13solveLleftEpsEPdPid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 222, type: !184, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true)
!188 = !DISubprogram(name: "solveUpdateLeft", linkageName: "_ZN6soplex9CLUFactor15solveUpdateLeftEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 224, type: !172, isLocal: false, isDefinition: false, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true)
!189 = !DISubprogram(name: "solveUpdateLeft2", linkageName: "_ZN6soplex9CLUFactor16solveUpdateLeft2EPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 226, type: !157, isLocal: false, isDefinition: false, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true)
!190 = !DISubprogram(name: "vSolveLright", linkageName: "_ZN6soplex9CLUFactor12vSolveLrightEPdPiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 230, type: !191, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true)
!191 = !DISubroutineType(types: !192)
!192 = !{!34, !159, !150, !163, !34, !140}
!193 = !DISubprogram(name: "vSolveLright2", linkageName: "_ZN6soplex9CLUFactor13vSolveLright2EPdPiS2_dS1_S2_S2_d", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 231, type: !194, isLocal: false, isDefinition: false, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !159, !150, !163, !163, !140, !150, !163, !163, !140}
!196 = !DISubprogram(name: "vSolveUright", linkageName: "_ZN6soplex9CLUFactor12vSolveUrightEPdPiS1_S2_id", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 234, type: !197, isLocal: false, isDefinition: false, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{!34, !159, !150, !163, !150, !163, !34, !140}
!199 = !DISubprogram(name: "vSolveUrightNoNZ", linkageName: "_ZN6soplex9CLUFactor16vSolveUrightNoNZEPdS1_Piid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 237, type: !200, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !159, !150, !150, !163, !34, !140}
!202 = !DISubprogram(name: "vSolveUright2", linkageName: "_ZN6soplex9CLUFactor13vSolveUright2EPdPiS1_S2_idS1_S1_S2_id", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 240, type: !203, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{!34, !159, !150, !163, !150, !163, !34, !140, !150, !150, !163, !34, !140}
!205 = !DISubprogram(name: "vSolveUpdateRight", linkageName: "_ZN6soplex9CLUFactor17vSolveUpdateRightEPdPiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 244, type: !191, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true)
!206 = !DISubprogram(name: "vSolveUpdateRightNoNZ", linkageName: "_ZN6soplex9CLUFactor21vSolveUpdateRightNoNZEPdd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 246, type: !207, isLocal: false, isDefinition: false, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !159, !150, !140}
!209 = !DISubprogram(name: "solveUleft", linkageName: "_ZN6soplex9CLUFactor10solveUleftEdPdPiS1_S2_i", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 248, type: !210, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true)
!210 = !DISubroutineType(types: !211)
!211 = !{!34, !159, !140, !150, !163, !150, !163, !34}
!212 = !DISubprogram(name: "solveUleftNoNZ", linkageName: "_ZN6soplex9CLUFactor14solveUleftNoNZEdPdS1_Pii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 251, type: !213, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: true)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !159, !140, !150, !150, !163, !34}
!215 = !DISubprogram(name: "solveLleftForest", linkageName: "_ZN6soplex9CLUFactor16solveLleftForestEdPdPii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 254, type: !216, isLocal: false, isDefinition: false, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!34, !159, !140, !150, !163, !34}
!218 = !DISubprogram(name: "solveLleftForestNoNZ", linkageName: "_ZN6soplex9CLUFactor20solveLleftForestNoNZEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 256, type: !172, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!219 = !DISubprogram(name: "solveLleft", linkageName: "_ZN6soplex9CLUFactor10solveLleftEdPdPii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 258, type: !216, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true)
!220 = !DISubprogram(name: "solveLleftNoNZ", linkageName: "_ZN6soplex9CLUFactor14solveLleftNoNZEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 260, type: !172, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true)
!221 = !DISubprogram(name: "solveUpdateLeft", linkageName: "_ZN6soplex9CLUFactor15solveUpdateLeftEdPdPii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 262, type: !216, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true)
!222 = !DISubprogram(name: "forestPackColumns", linkageName: "_ZN6soplex9CLUFactor17forestPackColumnsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 266, type: !223, isLocal: false, isDefinition: false, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !159}
!225 = !DISubprogram(name: "forestMinColMem", linkageName: "_ZN6soplex9CLUFactor15forestMinColMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 268, type: !226, isLocal: false, isDefinition: false, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !159, !34}
!228 = !DISubprogram(name: "forestReMaxCol", linkageName: "_ZN6soplex9CLUFactor14forestReMaxColEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 270, type: !229, isLocal: false, isDefinition: false, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !159, !34, !34}
!231 = !DISubprogram(name: "initPerm", linkageName: "_ZN6soplex9CLUFactor8initPermEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 274, type: !223, isLocal: false, isDefinition: false, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true)
!232 = !DISubprogram(name: "initFactorMatrix", linkageName: "_ZN6soplex9CLUFactor16initFactorMatrixEPPNS_7SVectorEd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 276, type: !233, isLocal: false, isDefinition: false, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !159, !235, !237}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!238 = !DISubprogram(name: "minLMem", linkageName: "_ZN6soplex9CLUFactor7minLMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 278, type: !226, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: true)
!239 = !DISubprogram(name: "setPivot", linkageName: "_ZN6soplex9CLUFactor8setPivotEiiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 280, type: !240, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !159, !242, !242, !242, !237}
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!243 = !DISubprogram(name: "colSingletons", linkageName: "_ZN6soplex9CLUFactor13colSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 283, type: !223, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true)
!244 = !DISubprogram(name: "rowSingletons", linkageName: "_ZN6soplex9CLUFactor13rowSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 285, type: !223, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubprogram(name: "initFactorRings", linkageName: "_ZN6soplex9CLUFactor15initFactorRingsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 288, type: !223, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: true)
!246 = !DISubprogram(name: "freeFactorRings", linkageName: "_ZN6soplex9CLUFactor15freeFactorRingsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 290, type: !223, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true)
!247 = !DISubprogram(name: "setupColVals", linkageName: "_ZN6soplex9CLUFactor12setupColValsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 293, type: !248, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!34, !159}
!250 = !DISubprogram(name: "setupRowVals", linkageName: "_ZN6soplex9CLUFactor12setupRowValsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 295, type: !223, isLocal: false, isDefinition: false, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true)
!251 = !DISubprogram(name: "eliminateRowSingletons", linkageName: "_ZN6soplex9CLUFactor22eliminateRowSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 298, type: !223, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true)
!252 = !DISubprogram(name: "eliminateColSingletons", linkageName: "_ZN6soplex9CLUFactor22eliminateColSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 300, type: !223, isLocal: false, isDefinition: false, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true)
!253 = !DISubprogram(name: "selectPivots", linkageName: "_ZN6soplex9CLUFactor12selectPivotsEd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 302, type: !254, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !159, !140}
!256 = !DISubprogram(name: "updateRow", linkageName: "_ZN6soplex9CLUFactor9updateRowEiiiidd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 304, type: !257, isLocal: false, isDefinition: false, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true)
!257 = !DISubroutineType(types: !258)
!258 = !{!34, !159, !34, !34, !34, !34, !140, !140}
!259 = !DISubprogram(name: "eliminatePivot", linkageName: "_ZN6soplex9CLUFactor14eliminatePivotEiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 307, type: !260, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !159, !34, !34, !140}
!262 = !DISubprogram(name: "eliminateNucleus", linkageName: "_ZN6soplex9CLUFactor16eliminateNucleusEdd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 309, type: !263, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !159, !237, !237}
!265 = !DISubprogram(name: "minRowMem", linkageName: "_ZN6soplex9CLUFactor9minRowMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 311, type: !226, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true)
!266 = !DISubprogram(name: "minColMem", linkageName: "_ZN6soplex9CLUFactor9minColMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 313, type: !226, isLocal: false, isDefinition: false, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true)
!267 = !DISubprogram(name: "remaxCol", linkageName: "_ZN6soplex9CLUFactor8remaxColEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 315, type: !229, isLocal: false, isDefinition: false, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true)
!268 = !DISubprogram(name: "packRows", linkageName: "_ZN6soplex9CLUFactor8packRowsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 317, type: !223, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true)
!269 = !DISubprogram(name: "packColumns", linkageName: "_ZN6soplex9CLUFactor11packColumnsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 319, type: !223, isLocal: false, isDefinition: false, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true)
!270 = !DISubprogram(name: "remaxRow", linkageName: "_ZN6soplex9CLUFactor8remaxRowEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 321, type: !229, isLocal: false, isDefinition: false, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: true)
!271 = !DISubprogram(name: "makeLvec", linkageName: "_ZN6soplex9CLUFactor8makeLvecEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 323, type: !272, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{!34, !159, !34, !34}
!274 = !DISubprogram(name: "CLUFactor", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 326, type: !275, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !159, !277}
!277 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9CLUFactorE")
!279 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex9CLUFactoraSERKS0_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 328, type: !280, isLocal: false, isDefinition: false, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !159, !277}
!282 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex9CLUFactorE")
!283 = !DISubprogram(name: "CLUFactor", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 335, type: !223, isLocal: false, isDefinition: false, scopeLine: 335, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!284 = !DISubprogram(name: "solveLright", linkageName: "_ZN6soplex9CLUFactor11solveLrightEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 340, type: !172, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!285 = !DISubprogram(name: "solveRight4update", linkageName: "_ZN6soplex9CLUFactor17solveRight4updateEPdPidS1_S1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 342, type: !286, isLocal: false, isDefinition: false, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!286 = !DISubroutineType(types: !287)
!287 = !{!34, !159, !150, !163, !140, !150, !150, !163, !163}
!288 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex9CLUFactor10solveRightEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 345, type: !157, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!289 = !DISubprogram(name: "solveRight2update", linkageName: "_ZN6soplex9CLUFactor17solveRight2updateEPdS1_S1_S1_PidS1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 347, type: !290, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{!34, !159, !150, !150, !150, !150, !163, !140, !150, !163, !163}
!292 = !DISubprogram(name: "solveRight2", linkageName: "_ZN6soplex9CLUFactor11solveRight2EPdS1_S1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 351, type: !165, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!293 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex9CLUFactor9solveLeftEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 353, type: !157, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubprogram(name: "solveLeftEps", linkageName: "_ZN6soplex9CLUFactor12solveLeftEpsEPdS1_Pid", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 355, type: !295, isLocal: false, isDefinition: false, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!34, !159, !150, !150, !163, !140}
!297 = !DISubprogram(name: "solveLeft2", linkageName: "_ZN6soplex9CLUFactor10solveLeft2EPdPiS1_dS1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 357, type: !298, isLocal: false, isDefinition: false, scopeLine: 357, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{!34, !159, !150, !163, !150, !140, !150, !150}
!300 = !DISubprogram(name: "vSolveRight4update", linkageName: "_ZN6soplex9CLUFactor18vSolveRight4updateEdPdPiS1_S2_iS1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 362, type: !301, isLocal: false, isDefinition: false, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubroutineType(types: !302)
!302 = !{!34, !159, !140, !150, !163, !150, !163, !34, !150, !163, !163}
!303 = !DISubprogram(name: "vSolveRight4update2", linkageName: "_ZN6soplex9CLUFactor19vSolveRight4update2EdPdPiS1_S2_iS1_dS1_S2_iS1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 366, type: !304, isLocal: false, isDefinition: false, scopeLine: 366, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!34, !159, !140, !150, !163, !150, !163, !34, !150, !140, !150, !163, !34, !150, !163, !163}
!306 = !DISubprogram(name: "vSolveRightNoNZ", linkageName: "_ZN6soplex9CLUFactor15vSolveRightNoNZEPddS1_Pii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 373, type: !307, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !159, !150, !140, !150, !163, !34}
!309 = !DISubprogram(name: "vSolveLeft", linkageName: "_ZN6soplex9CLUFactor10vSolveLeftEdPdPiS1_S2_i", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 376, type: !210, isLocal: false, isDefinition: false, scopeLine: 376, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!310 = !DISubprogram(name: "vSolveLeftNoNZ", linkageName: "_ZN6soplex9CLUFactor14vSolveLeftNoNZEdPdS1_Pii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 380, type: !213, isLocal: false, isDefinition: false, scopeLine: 380, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!311 = !DISubprogram(name: "vSolveLeft2", linkageName: "_ZN6soplex9CLUFactor11vSolveLeft2EdPdPiS1_S2_iS1_S1_S2_i", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 384, type: !312, isLocal: false, isDefinition: false, scopeLine: 384, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{!34, !159, !140, !150, !163, !150, !163, !34, !150, !150, !163, !34}
!314 = !DISubprogram(name: "forestUpdate", linkageName: "_ZN6soplex9CLUFactor12forestUpdateEiPdiPi", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 391, type: !315, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !159, !34, !150, !34, !163}
!317 = !DISubprogram(name: "update", linkageName: "_ZN6soplex9CLUFactor6updateEiPdPKii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 394, type: !318, isLocal: false, isDefinition: false, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !159, !34, !150, !320, !34}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!321 = !DISubprogram(name: "updateNoClear", linkageName: "_ZN6soplex9CLUFactor13updateNoClearEiPKdPKii", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 395, type: !322, isLocal: false, isDefinition: false, scopeLine: 395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !159, !34, !324, !320, !34}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!325 = !DISubprogram(name: "factor", linkageName: "_ZN6soplex9CLUFactor6factorEPPNS_7SVectorEdd", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 401, type: !326, isLocal: false, isDefinition: false, scopeLine: 401, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !159, !235, !140, !140}
!328 = !DISubprogram(name: "dump", linkageName: "_ZNK6soplex9CLUFactor4dumpEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 406, type: !329, isLocal: false, isDefinition: false, scopeLine: 406, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!332 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9CLUFactor12isConsistentEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !132, line: 408, type: !333, isLocal: false, isDefinition: false, scopeLine: 408, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !331}
!335 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!336 = !DICompositeType(tag: DW_TAG_class_type, name: "SLinSolver", scope: !133, file: !4, line: 46, size: 64, align: 64, elements: !337, vtableHolder: !"_ZTSN6soplex10SLinSolverE", identifier: "_ZTSN6soplex10SLinSolverE")
!337 = !{!338, !343, !348, !352, !355, !356, !362, !365, !371, !374, !378, !382, !385, !388, !393, !396, !399, !402, !403, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SLinSolver", scope: !4, file: !4, baseType: !339, size: 64, flags: DIFlagArtificial)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!34}
!343 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex10SLinSolver6statusEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 69, type: !344, isLocal: false, isDefinition: false, scopeLine: 69, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SLinSolverE")
!348 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex10SLinSolver5clearEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 72, type: !349, isLocal: false, isDefinition: false, scopeLine: 72, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!352 = !DISubprogram(name: "memory", linkageName: "_ZNK6soplex10SLinSolver6memoryEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 75, type: !353, isLocal: false, isDefinition: false, scopeLine: 75, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!34, !346}
!355 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex10SLinSolver3dimEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 78, type: !353, isLocal: false, isDefinition: false, scopeLine: 78, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubprogram(name: "load", linkageName: "_ZN6soplex10SLinSolver4loadEPPKNS_7SVectorEi", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 84, type: !357, isLocal: false, isDefinition: false, scopeLine: 84, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!357 = !DISubroutineType(types: !358)
!358 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !351, !359, !34}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!362 = !DISubprogram(name: "stability", linkageName: "_ZNK6soplex10SLinSolver9stabilityEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 90, type: !363, isLocal: false, isDefinition: false, scopeLine: 90, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{!140, !346}
!365 = !DISubprogram(name: "change", linkageName: "_ZN6soplex10SLinSolver6changeEiRKNS_7SVectorEPKNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 98, type: !366, isLocal: false, isDefinition: false, scopeLine: 98, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !351, !34, !368, !369}
!368 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !361)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!371 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex10SLinSolver12isConsistentEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 102, type: !372, isLocal: false, isDefinition: false, scopeLine: 102, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!335, !346}
!374 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_6VectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 130, type: !375, isLocal: false, isDefinition: false, scopeLine: 130, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !351, !377, !377}
!377 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!378 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 132, type: !379, isLocal: false, isDefinition: false, scopeLine: 132, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !351, !377, !381}
!381 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!382 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 134, type: !383, isLocal: false, isDefinition: false, scopeLine: 134, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !351, !381, !377}
!385 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_8SSVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 136, type: !386, isLocal: false, isDefinition: false, scopeLine: 136, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !351, !381, !381}
!388 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_6VectorERKS1_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 139, type: !389, isLocal: false, isDefinition: false, scopeLine: 139, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !351, !377, !391}
!391 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!393 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 141, type: !394, isLocal: false, isDefinition: false, scopeLine: 141, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !351, !377, !368}
!396 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 143, type: !397, isLocal: false, isDefinition: false, scopeLine: 143, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !351, !381, !391}
!399 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 145, type: !400, isLocal: false, isDefinition: false, scopeLine: 145, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !351, !381, !368}
!402 = !DISubprogram(name: "solveRight4update", linkageName: "_ZN6soplex10SLinSolver17solveRight4updateERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 152, type: !400, isLocal: false, isDefinition: false, scopeLine: 152, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!403 = !DISubprogram(name: "solve2right4update", linkageName: "_ZN6soplex10SLinSolver18solve2right4updateERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 155, type: !404, isLocal: false, isDefinition: false, scopeLine: 155, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !351, !381, !377, !368, !381}
!406 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_6VectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 161, type: !375, isLocal: false, isDefinition: false, scopeLine: 161, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!407 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 163, type: !379, isLocal: false, isDefinition: false, scopeLine: 163, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 165, type: !383, isLocal: false, isDefinition: false, scopeLine: 165, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!409 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_8SSVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 167, type: !386, isLocal: false, isDefinition: false, scopeLine: 167, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!410 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 170, type: !394, isLocal: false, isDefinition: false, scopeLine: 170, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_6VectorERKS1_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 172, type: !389, isLocal: false, isDefinition: false, scopeLine: 172, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!412 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 174, type: !400, isLocal: false, isDefinition: false, scopeLine: 174, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 24, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 176, type: !397, isLocal: false, isDefinition: false, scopeLine: 176, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!414 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 179, type: !404, isLocal: false, isDefinition: false, scopeLine: 179, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!415 = !DISubprogram(name: "~SLinSolver", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 189, type: !349, isLocal: false, isDefinition: false, scopeLine: 189, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !133, file: !417, line: 98, size: 64, align: 64, elements: !418, identifier: "_ZTSN6soplex7SVectorE")
!417 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!418 = !{!419, !421, !425, !428, !431, !436, !439, !442, !445, !446, !450, !451, !452, !455, !458, !462, !466, !470, !471, !475, !476, !479, !480, !481, !482, !486, !489, !493, !496, !499, !502, !505, !508, !509, !510}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 120, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!421 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 127, type: !422, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !424, !34, !140}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!425 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 138, type: !426, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !424, !368}
!428 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 144, type: !429, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !424, !34, !320, !324}
!431 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 147, type: !432, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !424, !34, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!436 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 150, type: !437, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !424, !34, !34}
!439 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 153, type: !440, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !424, !34}
!442 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 160, type: !443, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !424}
!445 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 165, type: !443, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 172, type: !447, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!447 = !DISubroutineType(types: !448)
!448 = !{!34, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!450 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 181, type: !447, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 190, type: !447, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!452 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 197, type: !453, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{!34, !449, !34}
!455 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 214, type: !456, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!140, !449, !34}
!458 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 223, type: !459, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !424, !34}
!461 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!462 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 230, type: !463, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!463 = !DISubroutineType(types: !464)
!464 = !{!465, !449, !34}
!465 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !435)
!466 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 237, type: !467, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !424, !34}
!469 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!470 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 244, type: !453, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!471 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 251, type: !472, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{!474, !424, !34}
!474 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !140)
!475 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 258, type: !456, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 269, type: !477, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubroutineType(types: !478)
!478 = !{!140, !449}
!479 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 272, type: !477, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 275, type: !477, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 281, type: !477, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 284, type: !483, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !424, !140}
!485 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!486 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 287, type: !487, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!487 = !DISubroutineType(types: !488)
!488 = !{!140, !449, !391}
!489 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 305, type: !490, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!490 = !DISubroutineType(types: !491)
!491 = !{!485, !424, !492}
!492 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !370)
!493 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 307, type: !494, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{!485, !424, !368}
!496 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 309, type: !497, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!497 = !DISubroutineType(types: !498)
!498 = !{!485, !424, !391}
!499 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 312, type: !500, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!500 = !DISubroutineType(types: !501)
!501 = !{!335, !449}
!502 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 324, type: !503, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !424, !34, !420}
!505 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 329, type: !506, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{!420, !449}
!508 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 334, type: !440, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!509 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 340, type: !440, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 346, type: !503, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !417, line: 109, size: 128, align: 64, elements: !512, identifier: "_ZTSN6soplex7SVector7ElementE")
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !417, line: 111, baseType: !140, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !417, line: 112, baseType: !34, size: 32, align: 32, offset: 64)
!515 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !133, file: !516, line: 82, size: 128, align: 64, elements: !517, identifier: "_ZTSN6soplex6VectorE")
!516 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!517 = !{!518, !519, !520, !524, !527, !530, !533, !534, !535, !539, !542, !545, !546, !547, !548, !549, !550, !551, !554, !557, !560, !563, !566, !567, !568, !571, !574, !577, !580, !583, !586, !589}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 90, baseType: !34, size: 32, align: 32, flags: DIFlagProtected)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 96, baseType: !150, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!520 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 107, type: !521, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !523, !34, !150}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!524 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 114, type: !525, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{!377, !523, !391}
!527 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 121, type: !528, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubroutineType(types: !529)
!529 = !{!377, !523, !368}
!530 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 128, type: !531, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{!377, !523, !492}
!533 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 134, type: !528, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 140, type: !531, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 146, type: !536, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubroutineType(types: !537)
!537 = !{!34, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!539 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 151, type: !540, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{!474, !523, !34}
!542 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 158, type: !543, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{!140, !538, !34}
!545 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 168, type: !525, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 170, type: !528, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!547 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 172, type: !531, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 175, type: !525, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 177, type: !528, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!550 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 179, type: !531, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex6VectormLEd", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 182, type: !552, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!552 = !DISubroutineType(types: !553)
!553 = !{!377, !523, !140}
!554 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 185, type: !555, isLocal: false, isDefinition: false, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{!140, !538, !492}
!557 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 187, type: !558, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubroutineType(types: !559)
!559 = !{!140, !538, !368}
!560 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 189, type: !561, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!561 = !DISubroutineType(types: !562)
!562 = !{!140, !538, !391}
!563 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex6Vector6maxAbsEv", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 199, type: !564, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!564 = !DISubroutineType(types: !565)
!565 = !{!140, !538}
!566 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex6Vector6lengthEv", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 201, type: !564, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!567 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex6Vector7length2Ev", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 203, type: !564, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 206, type: !569, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{!377, !523, !140, !368}
!571 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 208, type: !572, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!572 = !DISubroutineType(types: !573)
!573 = !{!377, !523, !140, !492}
!574 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKS0_", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 210, type: !575, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubroutineType(types: !576)
!576 = !{!377, !523, !140, !391}
!577 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex6Vector7get_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 229, type: !578, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubroutineType(types: !579)
!579 = !{!150, !523}
!580 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex6Vector13get_const_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 237, type: !581, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!581 = !DISubroutineType(types: !582)
!582 = !{!324, !538}
!583 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6Vector12isConsistentEv", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 245, type: !584, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!584 = !DISubroutineType(types: !585)
!585 = !{!335, !538}
!586 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6Vector5clearEv", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 248, type: !587, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !523}
!589 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !516, line: 256, type: !587, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!590 = !DICompositeType(tag: DW_TAG_class_type, name: "SSVector", scope: !133, file: !591, line: 50, size: 512, align: 64, elements: !592, identifier: "_ZTSN6soplex8SSVectorE")
!591 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!592 = !{!593, !594, !595, !596, !597, !601, !604, !608, !611, !612, !613, !616, !619, !620, !623, !626, !627, !628, !629, !630, !633, !636, !641, !644, !645, !649, !652, !655, !658, !659, !660, !661, !664, !667, !670, !673, !678, !681, !684, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !699, !702, !705, !706, !707, !708, !709, !710, !711, !712}
!593 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex7DVectorE", flags: DIFlagProtected)
!594 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex6IdxSetE", offset: 256, flags: DIFlagProtected)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "setupStatus", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 53, baseType: !335, size: 8, align: 8, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 64, baseType: !140, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!597 = !DISubprogram(name: "setMax", linkageName: "_ZN6soplex8SSVector6setMaxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 59, type: !598, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600, !34}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!601 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex8SSVector7get_ptrEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 85, type: !602, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubroutineType(types: !603)
!603 = !{!150, !600}
!604 = !DISubprogram(name: "isSetup", linkageName: "_ZNK6soplex8SSVector7isSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 91, type: !605, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubroutineType(types: !606)
!606 = !{!335, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!608 = !DISubprogram(name: "unSetup", linkageName: "_ZN6soplex8SSVector7unSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 97, type: !609, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !600}
!611 = !DISubprogram(name: "setup", linkageName: "_ZN6soplex8SSVector5setupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 106, type: !609, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubprogram(name: "forceSetup", linkageName: "_ZN6soplex8SSVector10forceSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 109, type: !609, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex8SSVector5indexEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 119, type: !614, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubroutineType(types: !615)
!615 = !{!34, !607, !34}
!616 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex8SSVector5valueEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 126, type: !617, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubroutineType(types: !618)
!618 = !{!140, !607, !34}
!619 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex8SSVector6numberEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 134, type: !614, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!620 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex8SSVector4sizeEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 141, type: !621, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubroutineType(types: !622)
!622 = !{!34, !607}
!623 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8SSVector3addEid", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 150, type: !624, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !600, !34, !140}
!626 = !DISubprogram(name: "setValue", linkageName: "_ZN6soplex8SSVector8setValueEid", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 159, type: !624, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubprogram(name: "clearIdx", linkageName: "_ZN6soplex8SSVector8clearIdxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 162, type: !598, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!628 = !DISubprogram(name: "clearNum", linkageName: "_ZN6soplex8SSVector8clearNumEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 174, type: !598, isLocal: false, isDefinition: false, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!629 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex8SSVectorixEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 187, type: !617, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!630 = !DISubprogram(name: "indexMem", linkageName: "_ZNK6soplex8SSVector8indexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 193, type: !631, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!631 = !DISubroutineType(types: !632)
!632 = !{!320, !607}
!633 = !DISubprogram(name: "values", linkageName: "_ZNK6soplex8SSVector6valuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 199, type: !634, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!634 = !DISubroutineType(types: !635)
!635 = !{!324, !607}
!636 = !DISubprogram(name: "indices", linkageName: "_ZNK6soplex8SSVector7indicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 205, type: !637, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !607}
!639 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6IdxSetE")
!641 = !DISubprogram(name: "altIndexMem", linkageName: "_ZN6soplex8SSVector11altIndexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 211, type: !642, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{!163, !600}
!644 = !DISubprogram(name: "altValues", linkageName: "_ZN6soplex8SSVector9altValuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 218, type: !602, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubprogram(name: "altIndices", linkageName: "_ZN6soplex8SSVector10altIndicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 225, type: !646, isLocal: false, isDefinition: false, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{!648, !600}
!648 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6IdxSetE")
!649 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 236, type: !650, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{!381, !600, !391}
!652 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 238, type: !653, isLocal: false, isDefinition: false, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!653 = !DISubroutineType(types: !654)
!654 = !{!381, !600, !368}
!655 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 240, type: !656, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!656 = !DISubroutineType(types: !657)
!657 = !{!381, !600, !492}
!658 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 243, type: !650, isLocal: false, isDefinition: false, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 245, type: !653, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!660 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 247, type: !656, isLocal: false, isDefinition: false, scopeLine: 247, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex8SSVectormLEd", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 250, type: !662, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!662 = !DISubroutineType(types: !663)
!663 = !{!381, !600, !140}
!664 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 253, type: !665, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!665 = !DISubroutineType(types: !666)
!666 = !{!381, !600, !140, !492}
!667 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 255, type: !668, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{!381, !600, !140, !368}
!670 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 257, type: !671, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{!381, !600, !140, !391}
!673 = !DISubprogram(name: "assign2product", linkageName: "_ZN6soplex8SSVector14assign2productERKS0_RKNS_5SVSetE", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 260, type: !674, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{!381, !600, !492, !676}
!676 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!678 = !DISubprogram(name: "assign2product4setup", linkageName: "_ZN6soplex8SSVector20assign2product4setupERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 262, type: !679, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!381, !600, !676, !492}
!681 = !DISubprogram(name: "assign2productAndSetup", linkageName: "_ZN6soplex8SSVector22assign2productAndSetupERKNS_5SVSetERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 264, type: !682, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{!381, !600, !676, !381}
!684 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex8SSVector6maxAbsEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 267, type: !685, isLocal: false, isDefinition: false, scopeLine: 267, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{!140, !607}
!687 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex8SSVector6lengthEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 269, type: !685, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!688 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex8SSVector7length2Ev", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 271, type: !685, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex8SSVector3dimEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 278, type: !621, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!690 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SSVector5reDimEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 284, type: !598, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!691 = !DISubprogram(name: "setSize", linkageName: "_ZN6soplex8SSVector7setSizeEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 287, type: !598, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubprogram(name: "reMem", linkageName: "_ZN6soplex8SSVector5reMemEi", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 296, type: !598, isLocal: false, isDefinition: false, scopeLine: 296, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex8SSVector5clearEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 299, type: !609, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!694 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SSVector12isConsistentEv", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 302, type: !605, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 309, type: !624, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !591, line: 322, type: !697, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
