; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/lpcolset.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::LPColSet" = type { %"class.soplex::SVSet", %"class.soplex::DVector", %"class.soplex::DVector", %"class.soplex::DVector" }
%"class.soplex::SVSet" = type { %"class.soplex::DataArray", %"class.soplex::DataSet", %"class.soplex::IdList", double, double* }
%"class.soplex::DataArray" = type { i32, i32, %"struct.soplex::SVector::Element"*, double }
%"struct.soplex::SVector::Element" = type { double, i32 }
%"class.soplex::DataSet" = type { %"struct.soplex::DataSet<soplex::SVSet::DLPSV>::Item"*, %"class.soplex::DataKey"*, i32, i32, i32, i32 }
%"struct.soplex::DataSet<soplex::SVSet::DLPSV>::Item" = type <{ %"class.soplex::SVSet::DLPSV", i32, [4 x i8] }>

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !2727, globals: !2114, imports: !3115)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/lpcolset.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1280, size: 32, align: 32, elements: !16, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!15 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17}
!17 = !DIEnumerator(name: "__short_mask", value: 1)
!18 = !{!19, !76, !80, !81, !88, !95, !110, !115, !119, !123, !274, !404, !487, !576, !580, !655, !777, !827, !872, !988, !1015, !1019, !1046, !1088, !1145, !1182, !26, !43, !410, !1235, !1291, !1420, !1496, !3, !1646, !1721, !1722, !2078, !2113, !2117, !2127, !2182, !2185, !2190, !2195, !2199, !2242, !2246, !2248, !2258, !2263, !2264, !2267, !2270, !2283, !2294, !2301, !2305, !2309, !2346, !2349, !2351, !2352, !2353, !2354, !2356, !2367, !2396, !2417, !2434, !2540, !9, !2541, !2565, !2596, !2602, !2603, !2620, !268, !14, !2623, !2633, !2637, !59, !1304, !1276, !2638, !2709}
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !21, identifier: "_ZTS7__sFILE")
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !{!22, !25, !27, !28, !30, !31, !32, !33, !35, !39, !45, !55, !61, !62, !64, !65, !69, !73, !74, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !20, line: 123, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !20, line: 124, baseType: !26, size: 32, align: 32, offset: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !20, line: 125, baseType: !26, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !20, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !20, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !20, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !20, line: 129, baseType: !26, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !20, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !20, line: 133, baseType: !36, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!26, !34}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !20, line: 134, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!26, !34, !43, !26}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !20, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !34, !49, !26}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !20, line: 136, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!26, !34, !59, !26}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !20, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !20, line: 140, baseType: !63, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !20, line: 141, baseType: !26, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !20, line: 144, baseType: !66, size: 24, align: 8, offset: 928)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !20, line: 145, baseType: !70, size: 8, align: 8, offset: 952)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !20, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !20, line: 151, baseType: !26, size: 32, align: 32, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !20, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !77, identifier: "_ZTS6__sbuf")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !20, line: 89, baseType: !23, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !20, line: 90, baseType: !26, size: 32, align: 32, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !82, identifier: "_ZTS13__va_list_tag")
!82 = !{!83, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_union_type, file: !53, line: 76, size: 1024, align: 64, elements: !89, identifier: "_ZTS11__mbstate_t")
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !53, line: 77, baseType: !91, size: 1024, align: 8)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !53, line: 78, baseType: !54, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !96, line: 73, size: 448, align: 64, elements: !97, identifier: "_ZTS2tm")
!96 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !96, line: 74, baseType: !26, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !96, line: 75, baseType: !26, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !96, line: 76, baseType: !26, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !96, line: 77, baseType: !26, size: 32, align: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !96, line: 78, baseType: !26, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !96, line: 79, baseType: !26, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !96, line: 80, baseType: !26, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !96, line: 81, baseType: !26, size: 32, align: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !96, line: 82, baseType: !26, size: 32, align: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !96, line: 83, baseType: !108, size: 64, align: 64, offset: 320)
!108 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !96, line: 84, baseType: !43, size: 64, align: 64, offset: 384)
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 82, size: 64, align: 32, elements: !112, identifier: "_ZTS5div_t")
!111 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !111, line: 83, baseType: !26, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !111, line: 84, baseType: !26, size: 32, align: 32, offset: 32)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 87, size: 128, align: 64, elements: !116, identifier: "_ZTS6ldiv_t")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !111, line: 88, baseType: !108, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !111, line: 89, baseType: !108, size: 64, align: 64, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 93, size: 128, align: 64, elements: !120, identifier: "_ZTS7lldiv_t")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !111, line: 94, baseType: !54, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !111, line: 95, baseType: !54, size: 64, align: 64, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "LPColSet", scope: !125, file: !124, line: 50, size: 1472, align: 64, elements: !127, identifier: "_ZTSN6soplex8LPColSetE")
!124 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/lpcolset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!125 = !DINamespace(name: "soplex", scope: null, file: !126, line: 49)
!126 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !{!128, !129, !130, !131, !132, !137, !138, !143, !148, !153, !157, !162, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !181, !186, !189, !192, !195, !198, !199, !204, !208, !211, !214, !218, !222, !225, !228, !233, !236, !239, !242, !245, !248, !251, !254, !257, !260, !261, !262, !263, !264, !265, !269, !270}
!128 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8LPColSetE", baseType: !"_ZTSN6soplex5SVSetE", flags: DIFlagProtected)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 53, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 54, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 55, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 1216)
!132 = !DISubprogram(name: "num", linkageName: "_ZNK6soplex8LPColSet3numEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 62, type: !133, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!133 = !DISubroutineType(types: !134)
!134 = !{!26, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8LPColSetE")
!137 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex8LPColSet3maxEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 68, type: !133, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubprogram(name: "obj", linkageName: "_ZNK6soplex8LPColSet3objEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 74, type: !139, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !135}
!141 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!143 = !DISubprogram(name: "obj", linkageName: "_ZN6soplex8LPColSet3objEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 79, type: !144, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8LPColSetE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!148 = !DISubprogram(name: "obj", linkageName: "_ZNK6soplex8LPColSet3objEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 85, type: !149, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !135, !26}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !125, file: !126, line: 127, baseType: !152)
!152 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!153 = !DISubprogram(name: "obj", linkageName: "_ZN6soplex8LPColSet3objEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 90, type: !154, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !147, !26}
!156 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !151)
!157 = !DISubprogram(name: "obj", linkageName: "_ZNK6soplex8LPColSet3objERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 96, type: !158, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!158 = !DISubroutineType(types: !159)
!159 = !{!151, !135, !160}
!160 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DataKeyE")
!162 = !DISubprogram(name: "obj", linkageName: "_ZN6soplex8LPColSet3objERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 101, type: !163, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{!156, !147, !160}
!165 = !DISubprogram(name: "lower", linkageName: "_ZNK6soplex8LPColSet5lowerEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 107, type: !139, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubprogram(name: "lower", linkageName: "_ZN6soplex8LPColSet5lowerEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 112, type: !144, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!167 = !DISubprogram(name: "lower", linkageName: "_ZNK6soplex8LPColSet5lowerEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 118, type: !149, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!168 = !DISubprogram(name: "lower", linkageName: "_ZN6soplex8LPColSet5lowerEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 123, type: !154, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!169 = !DISubprogram(name: "lower", linkageName: "_ZNK6soplex8LPColSet5lowerERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 129, type: !158, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubprogram(name: "lower", linkageName: "_ZN6soplex8LPColSet5lowerERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 134, type: !163, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubprogram(name: "upper", linkageName: "_ZNK6soplex8LPColSet5upperEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 140, type: !139, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!172 = !DISubprogram(name: "upper", linkageName: "_ZN6soplex8LPColSet5upperEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 145, type: !144, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!173 = !DISubprogram(name: "upper", linkageName: "_ZNK6soplex8LPColSet5upperEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 151, type: !149, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!174 = !DISubprogram(name: "upper", linkageName: "_ZN6soplex8LPColSet5upperEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 156, type: !154, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!175 = !DISubprogram(name: "upper", linkageName: "_ZNK6soplex8LPColSet5upperERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 162, type: !158, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubprogram(name: "upper", linkageName: "_ZN6soplex8LPColSet5upperERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 167, type: !163, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubprogram(name: "colVector_w", linkageName: "_ZN6soplex8LPColSet11colVector_wEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 173, type: !178, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !147, !26}
!180 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!181 = !DISubprogram(name: "colVector", linkageName: "_ZNK6soplex8LPColSet9colVectorEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 178, type: !182, isLocal: false, isDefinition: false, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !135, !26}
!184 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!186 = !DISubprogram(name: "colVector_w", linkageName: "_ZN6soplex8LPColSet11colVector_wERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 184, type: !187, isLocal: false, isDefinition: false, scopeLine: 184, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!187 = !DISubroutineType(types: !188)
!188 = !{!180, !147, !160}
!189 = !DISubprogram(name: "colVector", linkageName: "_ZNK6soplex8LPColSet9colVectorERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 190, type: !190, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{!184, !135, !160}
!192 = !DISubprogram(name: "key", linkageName: "_ZNK6soplex8LPColSet3keyEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 196, type: !193, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!193 = !DISubroutineType(types: !194)
!194 = !{!"_ZTSN6soplex7DataKeyE", !135, !26}
!195 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex8LPColSet6numberERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 202, type: !196, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubroutineType(types: !197)
!197 = !{!26, !135, !160}
!198 = !DISubprogram(name: "has", linkageName: "_ZNK6soplex8LPColSet3hasERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 208, type: !196, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8LPColSet3addERKNS_5LPColE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 223, type: !200, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !147, !202}
!202 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!204 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8LPColSet3addERNS_7DataKeyERKNS_5LPColE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 229, type: !205, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !147, !207, !202}
!207 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DataKeyE")
!208 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8LPColSet3addEddRKNS_7SVectorEd", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 236, type: !209, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !147, !151, !151, !184, !151}
!211 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8LPColSet3addERNS_7DataKeyEddRKNS_7SVectorEd", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 242, type: !212, isLocal: false, isDefinition: false, scopeLine: 242, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !147, !207, !151, !151, !184, !151}
!214 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8LPColSet3addERKS0_", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 249, type: !215, isLocal: false, isDefinition: false, scopeLine: 249, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !147, !217}
!217 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !136)
!218 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8LPColSet3addEPNS_7DataKeyERKS0_", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 251, type: !219, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !147, !221, !217}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DataKeyE", size: 64, align: 64)
!222 = !DISubprogram(name: "xtend", linkageName: "_ZN6soplex8LPColSet5xtendEii", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 254, type: !223, isLocal: false, isDefinition: false, scopeLine: 254, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !147, !26, !26}
!225 = !DISubprogram(name: "xtend", linkageName: "_ZN6soplex8LPColSet5xtendERKNS_7DataKeyEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 260, type: !226, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !147, !160, !26}
!228 = !DISubprogram(name: "add2", linkageName: "_ZN6soplex8LPColSet4add2ERKNS_7DataKeyEiPiPd", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 266, type: !229, isLocal: false, isDefinition: false, scopeLine: 266, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !147, !160, !26, !231, !232}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!233 = !DISubprogram(name: "add2", linkageName: "_ZN6soplex8LPColSet4add2EiiPiPd", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 271, type: !234, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !147, !26, !26, !231, !232}
!236 = !DISubprogram(name: "create", linkageName: "_ZN6soplex8LPColSet6createEiddd", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 277, type: !237, isLocal: false, isDefinition: false, scopeLine: 277, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{!180, !147, !26, !151, !151, !151}
!239 = !DISubprogram(name: "create", linkageName: "_ZN6soplex8LPColSet6createERNS_7DataKeyEiddd", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 283, type: !240, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!240 = !DISubroutineType(types: !241)
!241 = !{!180, !147, !207, !26, !151, !151, !151}
!242 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex8LPColSet6removeEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 293, type: !243, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !147, !26}
!245 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex8LPColSet6removeERKNS_7DataKeyE", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 296, type: !246, isLocal: false, isDefinition: false, scopeLine: 296, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !147, !160}
!248 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex8LPColSet6removeEPi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 302, type: !249, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !147, !231}
!251 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex8LPColSet6removeEPii", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 305, type: !252, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !147, !231, !26}
!254 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex8LPColSet6removeEPiiS1_", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 311, type: !255, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !147, !231, !26, !231}
!257 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex8LPColSet5clearEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 314, type: !258, isLocal: false, isDefinition: false, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !147}
!260 = !DISubprogram(name: "reMax", linkageName: "_ZN6soplex8LPColSet5reMaxEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 323, type: !243, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!261 = !DISubprogram(name: "memSize", linkageName: "_ZNK6soplex8LPColSet7memSizeEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 332, type: !133, isLocal: false, isDefinition: false, scopeLine: 332, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!262 = !DISubprogram(name: "memMax", linkageName: "_ZNK6soplex8LPColSet6memMaxEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 338, type: !133, isLocal: false, isDefinition: false, scopeLine: 338, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubprogram(name: "memRemax", linkageName: "_ZN6soplex8LPColSet8memRemaxEi", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 344, type: !243, isLocal: false, isDefinition: false, scopeLine: 344, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubprogram(name: "memPack", linkageName: "_ZN6soplex8LPColSet7memPackEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 350, type: !258, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8LPColSet12isConsistentEv", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 359, type: !266, isLocal: false, isDefinition: false, scopeLine: 359, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !135}
!268 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!269 = !DISubprogram(name: "LPColSet", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 371, type: !223, isLocal: false, isDefinition: false, scopeLine: 371, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8LPColSetaSERKS0_", scope: !"_ZTSN6soplex8LPColSetE", file: !124, line: 376, type: !271, isLocal: false, isDefinition: false, scopeLine: 376, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !147, !217}
!273 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8LPColSetE")
!274 = !DICompositeType(tag: DW_TAG_class_type, name: "SVSet", scope: !125, file: !275, line: 69, size: 704, align: 64, elements: !276, identifier: "_ZTSN6soplex5SVSetE")
!275 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!276 = !{!277, !279, !280, !281, !282, !283, !287, !288, !291, !294, !298, !301, !306, !309, !313, !316, !319, !322, !329, !332, !333, !336, !339, !342, !345, !348, !351, !354, !357, !361, !364, !367, !370, !371, !374, !377, !380, !383, !384, !387, !388, !389, !390, !391, !392, !393, !396, !400, !401}
!277 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex5SVSetE", baseType: !278, flags: DIFlagProtected)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "SVSetBase", scope: !125, file: !275, line: 38, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 129, baseType: !"_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEEE", size: 256, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 130, baseType: !"_ZTSN6soplex6IdListINS_5SVSet5DLPSVEEE", size: 128, align: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 155, baseType: !151, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "memFactor", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 162, baseType: !156, size: 64, align: 64, offset: 640, flags: DIFlagPublic)
!283 = !DISubprogram(name: "ensurePSVec", linkageName: "_ZN6soplex5SVSet11ensurePSVecEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 133, type: !284, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !286, !26}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex5SVSetE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!287 = !DISubprogram(name: "ensureMem", linkageName: "_ZN6soplex5SVSet9ensureMemEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 143, type: !284, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true)
!288 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addERKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 173, type: !289, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !286, !184}
!291 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addERNS_7DataKeyERKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 188, type: !292, isLocal: false, isDefinition: false, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !286, !207, !184}
!294 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addEPKNS_7SVectorEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 198, type: !295, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !286, !297, !26}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!298 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addEPNS_7DataKeyEPKNS_7SVectorEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 207, type: !299, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !286, !221, !297, !26}
!301 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addERKS0_", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 210, type: !302, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !286, !304}
!304 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!306 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addEPNS_7DataKeyERKS0_", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 219, type: !307, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !286, !221, !304}
!309 = !DISubprogram(name: "create", linkageName: "_ZN6soplex5SVSet6createEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 224, type: !310, isLocal: false, isDefinition: false, scopeLine: 224, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !286, !26}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64)
!313 = !DISubprogram(name: "create", linkageName: "_ZN6soplex5SVSet6createERNS_7DataKeyEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 231, type: !314, isLocal: false, isDefinition: false, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{!312, !286, !207, !26}
!316 = !DISubprogram(name: "xtend", linkageName: "_ZN6soplex5SVSet5xtendERNS_7SVectorEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 236, type: !317, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !286, !180, !26}
!319 = !DISubprogram(name: "add2", linkageName: "_ZN6soplex5SVSet4add2ERNS_7SVectorEid", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 244, type: !320, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !286, !180, !26, !151}
!322 = !DISubprogram(name: "add2", linkageName: "_ZN6soplex5SVSet4add2ERNS_7SVectorEiPKiPKd", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 252, type: !323, isLocal: false, isDefinition: false, scopeLine: 252, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !286, !180, !26, !325, !327}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!329 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeENS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 260, type: !330, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !286, !"_ZTSN6soplex7DataKeyE"}
!332 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 264, type: !284, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!333 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 271, type: !334, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !286, !312}
!336 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 284, type: !337, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !286, !231}
!339 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPNS_7DataKeyEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 290, type: !340, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !286, !221, !26}
!342 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPii", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 300, type: !343, isLocal: false, isDefinition: false, scopeLine: 300, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !286, !231, !26}
!345 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPNS_7DataKeyEiPi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 307, type: !346, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !286, !221, !26, !231}
!348 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPiiS1_", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 317, type: !349, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !286, !231, !26, !231}
!351 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex5SVSet5clearEv", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 320, type: !352, isLocal: false, isDefinition: false, scopeLine: 320, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !286}
!354 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex5SVSetixEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 333, type: !355, isLocal: false, isDefinition: false, scopeLine: 333, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{!180, !286, !26}
!357 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex5SVSetixEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 339, type: !358, isLocal: false, isDefinition: false, scopeLine: 339, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubroutineType(types: !359)
!359 = !{!184, !360, !26}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex5SVSetixERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 345, type: !362, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!362 = !DISubroutineType(types: !363)
!363 = !{!180, !286, !160}
!364 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex5SVSetixERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 351, type: !365, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{!184, !360, !160}
!367 = !DISubprogram(name: "num", linkageName: "_ZNK6soplex5SVSet3numEv", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 361, type: !368, isLocal: false, isDefinition: false, scopeLine: 361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubroutineType(types: !369)
!369 = !{!26, !360}
!370 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex5SVSet3maxEv", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 367, type: !368, isLocal: false, isDefinition: false, scopeLine: 367, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!371 = !DISubprogram(name: "key", linkageName: "_ZNK6soplex5SVSet3keyEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 373, type: !372, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!"_ZTSN6soplex7DataKeyE", !360, !26}
!374 = !DISubprogram(name: "key", linkageName: "_ZNK6soplex5SVSet3keyEPKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 379, type: !375, isLocal: false, isDefinition: false, scopeLine: 379, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!375 = !DISubroutineType(types: !376)
!376 = !{!"_ZTSN6soplex7DataKeyE", !360, !297}
!377 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex5SVSet6numberERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 385, type: !378, isLocal: false, isDefinition: false, scopeLine: 385, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!378 = !DISubroutineType(types: !379)
!379 = !{!26, !360, !160}
!380 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex5SVSet6numberEPKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 391, type: !381, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!26, !360, !297}
!383 = !DISubprogram(name: "has", linkageName: "_ZNK6soplex5SVSet3hasERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 397, type: !378, isLocal: false, isDefinition: false, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DISubprogram(name: "has", linkageName: "_ZNK6soplex5SVSet3hasEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 403, type: !385, isLocal: false, isDefinition: false, scopeLine: 403, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{!26, !360, !26}
!387 = !DISubprogram(name: "has", linkageName: "_ZNK6soplex5SVSet3hasEPKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 409, type: !381, isLocal: false, isDefinition: false, scopeLine: 409, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubprogram(name: "memSize", linkageName: "_ZNK6soplex5SVSet7memSizeEv", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 418, type: !368, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!389 = !DISubprogram(name: "memMax", linkageName: "_ZNK6soplex5SVSet6memMaxEv", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 424, type: !368, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!390 = !DISubprogram(name: "memRemax", linkageName: "_ZN6soplex5SVSet8memRemaxEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 430, type: !284, isLocal: false, isDefinition: false, scopeLine: 430, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!391 = !DISubprogram(name: "memPack", linkageName: "_ZN6soplex5SVSet7memPackEv", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 433, type: !352, isLocal: false, isDefinition: false, scopeLine: 433, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!392 = !DISubprogram(name: "reMax", linkageName: "_ZN6soplex5SVSet5reMaxEi", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 440, type: !284, isLocal: false, isDefinition: false, scopeLine: 440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex5SVSet12isConsistentEv", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 443, type: !394, isLocal: false, isDefinition: false, scopeLine: 443, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{!268, !360}
!396 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex5SVSetaSERKS0_", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 446, type: !397, isLocal: false, isDefinition: false, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubroutineType(types: !398)
!398 = !{!399, !286, !304}
!399 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SVSetE")
!400 = !DISubprogram(name: "SVSet", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 449, type: !302, isLocal: false, isDefinition: false, scopeLine: 449, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!401 = !DISubprogram(name: "SVSet", scope: !"_ZTSN6soplex5SVSetE", file: !275, line: 452, type: !402, isLocal: false, isDefinition: false, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !286, !26, !26, !151, !151}
!404 = !DICompositeType(tag: DW_TAG_class_type, name: "DataArray<soplex::SVector::Element>", scope: !125, file: !405, line: 68, size: 192, align: 64, elements: !406, templateParams: !485, identifier: "_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!405 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dataarray.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!406 = !{!407, !408, !409, !411, !412, !417, !424, !427, !430, !433, !437, !440, !443, !447, !450, !453, !456, !457, !460, !463, !466, !467, !468, !473, !477, !480, !481, !484}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "thesize", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 71, baseType: !26, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "themax", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 72, baseType: !26, size: 32, align: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 73, baseType: !410, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "memFactor", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 82, baseType: !151, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!412 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEEixEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 87, type: !413, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !416, !26}
!415 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!417 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEEixEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 94, type: !418, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{!420, !422, !26}
!420 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!424 = !DISubprogram(name: "last", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE4lastEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 102, type: !425, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!425 = !DISubroutineType(types: !426)
!426 = !{!415, !416}
!427 = !DISubprogram(name: "last", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE4lastEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 108, type: !428, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{!420, !422}
!430 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE7get_ptrEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 115, type: !431, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{!410, !416}
!433 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE13get_const_ptrEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 120, type: !434, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !422}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!437 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6appendERKS2_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 126, type: !438, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !416, !420}
!440 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6appendEiPKS2_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 131, type: !441, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !416, !26, !436}
!443 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6appendERKS3_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 136, type: !444, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !416, !446}
!446 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !423)
!447 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6insertEii", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 142, type: !448, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !416, !26, !26}
!450 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6insertEiiPKS2_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 151, type: !451, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !416, !26, !26, !436}
!453 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6insertEiRKS3_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 161, type: !454, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !416, !26, !446}
!456 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6removeEii", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 171, type: !448, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubprogram(name: "removeLast", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE10removeLastEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 181, type: !458, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !416, !26}
!460 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE5clearEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 187, type: !461, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !416}
!463 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE4sizeEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 193, type: !464, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!464 = !DISubroutineType(types: !465)
!465 = !{!26, !422}
!466 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6reSizeEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 205, type: !458, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE3maxEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 221, type: !464, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubprogram(name: "reMax", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE5reMaxEii", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 239, type: !469, isLocal: false, isDefinition: false, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !416, !26, !26}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !472, line: 51, baseType: !108)
!472 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!473 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEEaSERKS3_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 262, type: !474, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !416, !446}
!476 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!477 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE12isConsistentEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 273, type: !478, isLocal: false, isDefinition: false, scopeLine: 273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubroutineType(types: !479)
!479 = !{!268, !422}
!480 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 286, type: !444, isLocal: false, isDefinition: false, scopeLine: 286, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 309, type: !482, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !416, !26, !26, !151}
!484 = !DISubprogram(name: "~DataArray", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !405, line: 325, type: !461, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !{!486}
!486 = !DITemplateTypeParameter(name: "T", type: !"_ZTSN6soplex7SVector7ElementE")
!487 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !125, file: !488, line: 98, size: 64, align: 64, elements: !489, identifier: "_ZTSN6soplex7SVectorE")
!488 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!489 = !{!490, !491, !495, !498, !501, !504, !507, !510, !513, !514, !518, !519, !520, !523, !526, !529, !532, !536, !537, !540, !541, !544, !545, !546, !547, !550, !553, !558, !561, !564, !567, !570, !573, !574, !575}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 120, baseType: !410, size: 64, align: 64)
!491 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 127, type: !492, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !494, !26, !151}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!495 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 138, type: !496, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !494, !184}
!498 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 144, type: !499, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !494, !26, !325, !327}
!501 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 147, type: !502, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !494, !26, !436}
!504 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 150, type: !505, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !494, !26, !26}
!507 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 153, type: !508, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !494, !26}
!510 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 160, type: !511, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !494}
!513 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 165, type: !511, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 172, type: !515, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubroutineType(types: !516)
!516 = !{!26, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!518 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 181, type: !515, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 190, type: !515, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 197, type: !521, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{!26, !517, !26}
!523 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 214, type: !524, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!524 = !DISubroutineType(types: !525)
!525 = !{!151, !517, !26}
!526 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 223, type: !527, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{!415, !494, !26}
!529 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 230, type: !530, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{!420, !517, !26}
!532 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 237, type: !533, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !494, !26}
!535 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !26)
!536 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 244, type: !521, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 251, type: !538, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{!156, !494, !26}
!540 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 258, type: !524, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!541 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 269, type: !542, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{!151, !517}
!544 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 272, type: !542, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!545 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 275, type: !542, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 281, type: !542, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!547 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 284, type: !548, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubroutineType(types: !549)
!549 = !{!180, !494, !151}
!550 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 287, type: !551, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{!151, !517, !141}
!553 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 305, type: !554, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{!180, !494, !556}
!556 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!558 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 307, type: !559, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{!180, !494, !184}
!561 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 309, type: !562, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{!180, !494, !141}
!564 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 312, type: !565, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!268, !517}
!567 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 324, type: !568, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !494, !26, !410}
!570 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 329, type: !571, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{!410, !517}
!573 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 334, type: !508, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 340, type: !508, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 346, type: !568, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !488, line: 109, size: 128, align: 64, elements: !577, identifier: "_ZTSN6soplex7SVector7ElementE")
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !488, line: 111, baseType: !151, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !488, line: 112, baseType: !26, size: 32, align: 32, offset: 64)
!580 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !125, file: !581, line: 82, size: 128, align: 64, elements: !582, identifier: "_ZTSN6soplex6VectorE")
!581 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!582 = !{!583, !584, !585, !589, !592, !595, !598, !599, !600, !604, !607, !610, !611, !612, !613, !614, !615, !616, !619, !622, !625, !628, !631, !632, !633, !636, !639, !642, !645, !648, !651, !654}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 90, baseType: !26, size: 32, align: 32, flags: DIFlagProtected)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 96, baseType: !232, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!585 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 107, type: !586, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !588, !26, !232}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!589 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 114, type: !590, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{!146, !588, !141}
!592 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 121, type: !593, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{!146, !588, !184}
!595 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 128, type: !596, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubroutineType(types: !597)
!597 = !{!146, !588, !556}
!598 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 134, type: !593, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 140, type: !596, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 146, type: !601, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubroutineType(types: !602)
!602 = !{!26, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!604 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 151, type: !605, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubroutineType(types: !606)
!606 = !{!156, !588, !26}
!607 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 158, type: !608, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!608 = !DISubroutineType(types: !609)
!609 = !{!151, !603, !26}
!610 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 168, type: !590, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!611 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 170, type: !593, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 172, type: !596, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 175, type: !590, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 177, type: !593, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 179, type: !596, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex6VectormLEd", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 182, type: !617, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubroutineType(types: !618)
!618 = !{!146, !588, !151}
!619 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 185, type: !620, isLocal: false, isDefinition: false, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!620 = !DISubroutineType(types: !621)
!621 = !{!151, !603, !556}
!622 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 187, type: !623, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubroutineType(types: !624)
!624 = !{!151, !603, !184}
!625 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 189, type: !626, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{!151, !603, !141}
!628 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex6Vector6maxAbsEv", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 199, type: !629, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!629 = !DISubroutineType(types: !630)
!630 = !{!151, !603}
!631 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex6Vector6lengthEv", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 201, type: !629, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex6Vector7length2Ev", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 203, type: !629, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 206, type: !634, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!634 = !DISubroutineType(types: !635)
!635 = !{!146, !588, !151, !184}
!636 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 208, type: !637, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{!146, !588, !151, !556}
!639 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKS0_", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 210, type: !640, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!640 = !DISubroutineType(types: !641)
!641 = !{!146, !588, !151, !141}
!642 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex6Vector7get_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 229, type: !643, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{!232, !588}
!645 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex6Vector13get_const_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 237, type: !646, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{!327, !603}
!648 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6Vector12isConsistentEv", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 245, type: !649, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{!268, !603}
!651 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6Vector5clearEv", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 248, type: !652, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !588}
!654 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !581, line: 256, type: !652, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!655 = !DICompositeType(tag: DW_TAG_class_type, name: "SSVector", scope: !125, file: !656, line: 50, size: 512, align: 64, elements: !657, identifier: "_ZTSN6soplex8SSVectorE")
!656 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!657 = !{!658, !659, !660, !661, !662, !666, !669, !673, !676, !677, !678, !681, !684, !685, !688, !691, !692, !693, !694, !695, !698, !701, !706, !709, !710, !714, !718, !721, !724, !725, !726, !727, !730, !733, !736, !739, !742, !745, !748, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !763, !766, !769, !770, !771, !772, !773, !774, !775, !776}
!658 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex7DVectorE", flags: DIFlagProtected)
!659 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex6IdxSetE", offset: 256, flags: DIFlagProtected)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "setupStatus", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 53, baseType: !268, size: 8, align: 8, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 64, baseType: !151, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!662 = !DISubprogram(name: "setMax", linkageName: "_ZN6soplex8SSVector6setMaxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 59, type: !663, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !665, !26}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!666 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex8SSVector7get_ptrEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 85, type: !667, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!667 = !DISubroutineType(types: !668)
!668 = !{!232, !665}
!669 = !DISubprogram(name: "isSetup", linkageName: "_ZNK6soplex8SSVector7isSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 91, type: !670, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!670 = !DISubroutineType(types: !671)
!671 = !{!268, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!673 = !DISubprogram(name: "unSetup", linkageName: "_ZN6soplex8SSVector7unSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 97, type: !674, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !665}
!676 = !DISubprogram(name: "setup", linkageName: "_ZN6soplex8SSVector5setupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 106, type: !674, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!677 = !DISubprogram(name: "forceSetup", linkageName: "_ZN6soplex8SSVector10forceSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 109, type: !674, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex8SSVector5indexEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 119, type: !679, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!26, !672, !26}
!681 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex8SSVector5valueEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 126, type: !682, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{!151, !672, !26}
!684 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex8SSVector6numberEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 134, type: !679, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex8SSVector4sizeEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 141, type: !686, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!686 = !DISubroutineType(types: !687)
!687 = !{!26, !672}
!688 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8SSVector3addEid", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 150, type: !689, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !665, !26, !151}
!691 = !DISubprogram(name: "setValue", linkageName: "_ZN6soplex8SSVector8setValueEid", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 159, type: !689, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubprogram(name: "clearIdx", linkageName: "_ZN6soplex8SSVector8clearIdxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 162, type: !663, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubprogram(name: "clearNum", linkageName: "_ZN6soplex8SSVector8clearNumEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 174, type: !663, isLocal: false, isDefinition: false, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!694 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex8SSVectorixEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 187, type: !682, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubprogram(name: "indexMem", linkageName: "_ZNK6soplex8SSVector8indexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 193, type: !696, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubroutineType(types: !697)
!697 = !{!325, !672}
!698 = !DISubprogram(name: "values", linkageName: "_ZNK6soplex8SSVector6valuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 199, type: !699, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!699 = !DISubroutineType(types: !700)
!700 = !{!327, !672}
!701 = !DISubprogram(name: "indices", linkageName: "_ZNK6soplex8SSVector7indicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 205, type: !702, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !672}
!704 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6IdxSetE")
!706 = !DISubprogram(name: "altIndexMem", linkageName: "_ZN6soplex8SSVector11altIndexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 211, type: !707, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!707 = !DISubroutineType(types: !708)
!708 = !{!231, !665}
!709 = !DISubprogram(name: "altValues", linkageName: "_ZN6soplex8SSVector9altValuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 218, type: !667, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!710 = !DISubprogram(name: "altIndices", linkageName: "_ZN6soplex8SSVector10altIndicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 225, type: !711, isLocal: false, isDefinition: false, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!711 = !DISubroutineType(types: !712)
!712 = !{!713, !665}
!713 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6IdxSetE")
!714 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 236, type: !715, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !665, !141}
!717 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!718 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 238, type: !719, isLocal: false, isDefinition: false, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!719 = !DISubroutineType(types: !720)
!720 = !{!717, !665, !184}
!721 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 240, type: !722, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!722 = !DISubroutineType(types: !723)
!723 = !{!717, !665, !556}
!724 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 243, type: !715, isLocal: false, isDefinition: false, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!725 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 245, type: !719, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!726 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 247, type: !722, isLocal: false, isDefinition: false, scopeLine: 247, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!727 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex8SSVectormLEd", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 250, type: !728, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!728 = !DISubroutineType(types: !729)
!729 = !{!717, !665, !151}
!730 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 253, type: !731, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!731 = !DISubroutineType(types: !732)
!732 = !{!717, !665, !151, !556}
!733 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 255, type: !734, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!734 = !DISubroutineType(types: !735)
!735 = !{!717, !665, !151, !184}
!736 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 257, type: !737, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!737 = !DISubroutineType(types: !738)
!738 = !{!717, !665, !151, !141}
!739 = !DISubprogram(name: "assign2product", linkageName: "_ZN6soplex8SSVector14assign2productERKS0_RKNS_5SVSetE", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 260, type: !740, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!740 = !DISubroutineType(types: !741)
!741 = !{!717, !665, !556, !304}
!742 = !DISubprogram(name: "assign2product4setup", linkageName: "_ZN6soplex8SSVector20assign2product4setupERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 262, type: !743, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!743 = !DISubroutineType(types: !744)
!744 = !{!717, !665, !304, !556}
!745 = !DISubprogram(name: "assign2productAndSetup", linkageName: "_ZN6soplex8SSVector22assign2productAndSetupERKNS_5SVSetERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 264, type: !746, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!746 = !DISubroutineType(types: !747)
!747 = !{!717, !665, !304, !717}
!748 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex8SSVector6maxAbsEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 267, type: !749, isLocal: false, isDefinition: false, scopeLine: 267, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!749 = !DISubroutineType(types: !750)
!750 = !{!151, !672}
!751 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex8SSVector6lengthEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 269, type: !749, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!752 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex8SSVector7length2Ev", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 271, type: !749, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!753 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex8SSVector3dimEv", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 278, type: !686, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!754 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SSVector5reDimEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 284, type: !663, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!755 = !DISubprogram(name: "setSize", linkageName: "_ZN6soplex8SSVector7setSizeEi", scope: !"_ZTSN6soplex8SSVectorE", file: !656, line: 287, type: !663, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
