; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/message.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
%"class.std::__1::locale::__imp" = type opaque
%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
%"class.std::__1::ctype" = type <{ %"class.std::__1::locale::facet", i32*, i8, [7 x i8] }>
%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !1620, globals: !1007, imports: !1835)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/message.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1280, size: 32, align: 32, elements: !16, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!15 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17}
!17 = !DIEnumerator(name: "__short_mask", value: 1)
!18 = !{!19, !76, !80, !81, !88, !95, !110, !115, !119, !123, !180, !312, !388, !3, !539, !614, !615, !971, !1006, !1010, !1020, !1075, !1078, !1083, !1088, !1092, !1135, !1139, !1141, !1151, !1156, !1157, !1160, !1163, !1176, !1187, !1194, !1198, !1202, !1239, !1242, !1244, !1245, !1246, !1247, !1249, !1260, !1289, !1310, !1327, !1433, !9, !1434, !1458, !1489, !1495, !1496, !1513, !138, !14, !1516, !1526, !1530, !59, !193, !165, !1531, !1602}
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !21, identifier: "_ZTS7__sFILE")
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !{!22, !25, !27, !28, !30, !31, !32, !33, !35, !39, !45, !55, !61, !62, !64, !65, !69, !73, !74, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !20, line: 123, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !20, line: 124, baseType: !26, size: 32, align: 32, offset: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !20, line: 125, baseType: !26, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !20, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !20, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !20, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !20, line: 129, baseType: !26, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !20, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !20, line: 133, baseType: !36, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!26, !34}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !20, line: 134, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!26, !34, !43, !26}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !20, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !34, !49, !26}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !20, line: 136, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!26, !34, !59, !26}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !20, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !20, line: 140, baseType: !63, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !20, line: 141, baseType: !26, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !20, line: 144, baseType: !66, size: 24, align: 8, offset: 928)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !20, line: 145, baseType: !70, size: 8, align: 8, offset: 952)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !20, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !20, line: 151, baseType: !26, size: 32, align: 32, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !20, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !77, identifier: "_ZTS6__sbuf")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !20, line: 89, baseType: !23, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !20, line: 90, baseType: !26, size: 32, align: 32, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !82, identifier: "_ZTS13__va_list_tag")
!82 = !{!83, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_union_type, file: !53, line: 76, size: 1024, align: 64, elements: !89, identifier: "_ZTS11__mbstate_t")
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !53, line: 77, baseType: !91, size: 1024, align: 8)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !53, line: 78, baseType: !54, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !96, line: 73, size: 448, align: 64, elements: !97, identifier: "_ZTS2tm")
!96 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !96, line: 74, baseType: !26, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !96, line: 75, baseType: !26, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !96, line: 76, baseType: !26, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !96, line: 77, baseType: !26, size: 32, align: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !96, line: 78, baseType: !26, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !96, line: 79, baseType: !26, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !96, line: 80, baseType: !26, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !96, line: 81, baseType: !26, size: 32, align: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !96, line: 82, baseType: !26, size: 32, align: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !96, line: 83, baseType: !108, size: 64, align: 64, offset: 320)
!108 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !96, line: 84, baseType: !43, size: 64, align: 64, offset: 384)
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 82, size: 64, align: 32, elements: !112, identifier: "_ZTS5div_t")
!111 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !111, line: 83, baseType: !26, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !111, line: 84, baseType: !26, size: 32, align: 32, offset: 32)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 87, size: 128, align: 64, elements: !116, identifier: "_ZTS6ldiv_t")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !111, line: 88, baseType: !108, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !111, line: 89, baseType: !108, size: 64, align: 64, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 93, size: 128, align: 64, elements: !120, identifier: "_ZTS7lldiv_t")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !111, line: 94, baseType: !54, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !111, line: 95, baseType: !54, size: 64, align: 64, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !124, file: !15, line: 623, size: 8, align: 8, elements: !127, templateParams: !178, identifier: "_ZTSNSt3__111char_traitsIcEE")
!124 = !DINamespace(name: "__1", scope: !126, file: !125, line: 369)
!125 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!126 = !DINamespace(name: "std", scope: null, file: !125, line: 368)
!127 = !{!128, !135, !139, !140, !148, !151, !154, !158, !159, !162, !166, !169, !172, !175}
!128 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignERcRKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 631, type: !129, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131, !133}
!131 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 625, baseType: !44)
!133 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!135 = !DISubprogram(name: "eq", linkageName: "_ZNSt3__111char_traitsIcE2eqEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 633, type: !136, isLocal: false, isDefinition: false, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !132, !132}
!138 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!139 = !DISubprogram(name: "lt", linkageName: "_ZNSt3__111char_traitsIcE2ltEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 635, type: !136, isLocal: false, isDefinition: false, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true)
!140 = !DISubprogram(name: "compare", linkageName: "_ZNSt3__111char_traitsIcE7compareEPKcS3_m", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 638, type: !141, isLocal: false, isDefinition: false, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true)
!141 = !DISubroutineType(types: !142)
!142 = !{!26, !143, !143, !144}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 30, baseType: !146)
!145 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !53, line: 92, baseType: !147)
!147 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!148 = !DISubprogram(name: "length", linkageName: "_ZNSt3__111char_traitsIcE6lengthEPKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 640, type: !149, isLocal: false, isDefinition: false, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{!144, !143}
!151 = !DISubprogram(name: "find", linkageName: "_ZNSt3__111char_traitsIcE4findEPKcmRS2_", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 641, type: !152, isLocal: false, isDefinition: false, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true)
!152 = !DISubroutineType(types: !153)
!153 = !{!143, !143, !144, !133}
!154 = !DISubprogram(name: "move", linkageName: "_ZNSt3__111char_traitsIcE4moveEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 643, type: !155, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !157, !143, !144}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!158 = !DISubprogram(name: "copy", linkageName: "_ZNSt3__111char_traitsIcE4copyEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 645, type: !155, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true)
!159 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignEPcmc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 650, type: !160, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true)
!160 = !DISubroutineType(types: !161)
!161 = !{!157, !157, !144, !132}
!162 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt3__111char_traitsIcE7not_eofEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 653, type: !163, isLocal: false, isDefinition: false, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !165}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 626, baseType: !26)
!166 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt3__111char_traitsIcE12to_char_typeEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 655, type: !167, isLocal: false, isDefinition: false, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true)
!167 = !DISubroutineType(types: !168)
!168 = !{!132, !165}
!169 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt3__111char_traitsIcE11to_int_typeEc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 657, type: !170, isLocal: false, isDefinition: false, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true)
!170 = !DISubroutineType(types: !171)
!171 = !{!165, !132}
!172 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt3__111char_traitsIcE11eq_int_typeEii", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 659, type: !173, isLocal: false, isDefinition: false, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{!138, !165, !165}
!175 = !DISubprogram(name: "eof", linkageName: "_ZNSt3__111char_traitsIcE3eofEv", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 661, type: !176, isLocal: false, isDefinition: false, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!165}
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "_CharT", type: !44)
!180 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ostream<char, std::__1::char_traits<char> >", scope: !124, file: !181, line: 1108, size: 1280, align: 64, elements: !182, vtableHolder: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", templateParams: !310, identifier: "_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!181 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ostream", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!182 = !{!183, !184, !189, !194, !197, !201, !206, !209, !215, !222, !229, !232, !235, !239, !242, !245, !248, !251, !254, !258, !262, !266, !270, !275, !278, !282, !290, !293, !300, !303, !309}
!183 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", offset: 24, flags: DIFlagPublic | DIFlagVirtual)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$basic_ostream", scope: !181, file: !181, baseType: !185, size: 64, flags: DIFlagArtificial)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!26}
!189 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 163, type: !190, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !192, !193}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__115basic_streambufIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!194 = !DISubprogram(name: "~basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 164, type: !195, isLocal: false, isDefinition: false, scopeLine: 164, containingType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !192}
!197 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 176, type: !198, isLocal: false, isDefinition: false, scopeLine: 176, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !192, !200}
!200 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!201 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 182, type: !202, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !192, !204}
!204 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!206 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEEaSERKS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 183, type: !207, isLocal: false, isDefinition: false, scopeLine: 183, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{!200, !192, !204}
!209 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRS3_S4_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 191, type: !210, isLocal: false, isDefinition: false, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubroutineType(types: !211)
!211 = !{!200, !192, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!200, !200}
!215 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_9basic_iosIcS2_EES6_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 192, type: !216, isLocal: false, isDefinition: false, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!200, !192, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !221}
!221 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!222 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_8ios_baseES5_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 194, type: !223, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!223 = !DISubroutineType(types: !224)
!224 = !{!200, !192, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !228}
!228 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__18ios_baseE")
!229 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEb", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 195, type: !230, isLocal: false, isDefinition: false, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!200, !192, !138}
!232 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEs", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 196, type: !233, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{!200, !192, !29}
!235 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEt", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 197, type: !236, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!236 = !DISubroutineType(types: !237)
!237 = !{!200, !192, !238}
!238 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!239 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEi", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 198, type: !240, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!240 = !DISubroutineType(types: !241)
!241 = !{!200, !192, !26}
!242 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEj", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 199, type: !243, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubroutineType(types: !244)
!244 = !{!200, !192, !84}
!245 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 200, type: !246, isLocal: false, isDefinition: false, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{!200, !192, !108}
!248 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEm", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 201, type: !249, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!249 = !DISubroutineType(types: !250)
!250 = !{!200, !192, !147}
!251 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEx", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 202, type: !252, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!252 = !DISubroutineType(types: !253)
!253 = !{!200, !192, !54}
!254 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEy", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 203, type: !255, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{!200, !192, !257}
!257 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!258 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEf", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 204, type: !259, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubroutineType(types: !260)
!260 = !{!200, !192, !261}
!261 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!262 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEd", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 205, type: !263, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!200, !192, !265}
!265 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!266 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEe", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 206, type: !267, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{!200, !192, !269}
!269 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!270 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPKv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 207, type: !271, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{!200, !192, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!275 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 208, type: !276, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!276 = !DISubroutineType(types: !277)
!277 = !{!200, !192, !193}
!278 = !DISubprogram(name: "put", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE3putEc", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 211, type: !279, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!279 = !DISubroutineType(types: !280)
!280 = !{!200, !192, !281}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 156, baseType: !44)
!282 = !DISubprogram(name: "write", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5writeEPKcl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 212, type: !283, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!283 = !DISubroutineType(types: !284)
!284 = !{!200, !192, !285, !287}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !124, file: !4, line: 229, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !289, line: 51, baseType: !108)
!289 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!290 = !DISubprogram(name: "flush", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5flushEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 213, type: !291, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{!200, !192}
!293 = !DISubprogram(name: "tellp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5tellpEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 216, type: !294, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{!296, !192}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 159, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 628, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "streampos", scope: !124, file: !299, line: 176, baseType: !"_ZTSNSt3__14fposI11__mbstate_tEE")
!299 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!300 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpENS_4fposI11__mbstate_tEE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 217, type: !301, isLocal: false, isDefinition: false, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubroutineType(types: !302)
!302 = !{!200, !192, !296}
!303 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpExNS_8ios_base7seekdirE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 218, type: !304, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!200, !192, !306, !"_ZTSNSt3__18ios_base7seekdirE"}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 160, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !15, line: 627, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamoff", scope: !124, file: !299, line: 187, baseType: !54)
!309 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !181, line: 222, type: !195, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!310 = !{!179, !311}
!311 = !DITemplateTypeParameter(name: "_Traits", type: !"_ZTSNSt3__111char_traitsIcEE")
!312 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ios<char, std::__1::char_traits<char> >", scope: !124, file: !313, line: 570, size: 1216, align: 64, elements: !314, vtableHolder: !"_ZTSNSt3__18ios_baseE", templateParams: !310, identifier: "_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!313 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/streambuf", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!314 = !{!315, !316, !318, !320, !325, !326, !330, !334, !335, !336, !337, !338, !339, !340, !341, !344, !347, !350, !353, !356, !359, !363, !367, !370, !375, !378, !381, !382, !383, !386, !387}
!315 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__18ios_baseE", flags: DIFlagPublic)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__tie_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 647, baseType: !317, size: 64, align: 64, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__fill_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 648, baseType: !319, size: 32, align: 32, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 579, baseType: !165)
!320 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEcvbEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 585, type: !321, isLocal: false, isDefinition: false, scopeLine: 585, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{!138, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!325 = !DISubprogram(name: "operator!", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEntEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 586, type: !321, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE7rdstateEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 587, type: !327, isLocal: false, isDefinition: false, scopeLine: 587, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !323}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "iostate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 256, baseType: !84)
!330 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5clearEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 588, type: !331, isLocal: false, isDefinition: false, scopeLine: 588, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !329}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!334 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE8setstateEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 589, type: !331, isLocal: false, isDefinition: false, scopeLine: 589, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4goodEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 590, type: !321, isLocal: false, isDefinition: false, scopeLine: 590, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!336 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3eofEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 591, type: !321, isLocal: false, isDefinition: false, scopeLine: 591, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4failEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 592, type: !321, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3badEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 593, type: !321, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!339 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 595, type: !327, isLocal: false, isDefinition: false, scopeLine: 595, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 596, type: !331, isLocal: false, isDefinition: false, scopeLine: 596, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 600, type: !342, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !333, !193}
!344 = !DISubprogram(name: "~basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 601, type: !345, isLocal: false, isDefinition: false, scopeLine: 601, containingType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !333}
!347 = !DISubprogram(name: "tie", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 605, type: !348, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{!317, !323}
!350 = !DISubprogram(name: "tie", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEPNS_13basic_ostreamIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 607, type: !351, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{!317, !333, !317}
!353 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 610, type: !354, isLocal: false, isDefinition: false, scopeLine: 610, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{!193, !323}
!356 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 612, type: !357, isLocal: false, isDefinition: false, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!357 = !DISubroutineType(types: !358)
!358 = !{!193, !333, !193}
!359 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE7copyfmtERKS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 614, type: !360, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{!221, !333, !362}
!362 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !324)
!363 = !DISubprogram(name: "fill", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 617, type: !364, isLocal: false, isDefinition: false, scopeLine: 617, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !323}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 576, baseType: !44)
!367 = !DISubprogram(name: "fill", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 619, type: !368, isLocal: false, isDefinition: false, scopeLine: 619, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubroutineType(types: !369)
!369 = !{!366, !333, !366}
!370 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5imbueERKNS_6localeE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 622, type: !371, isLocal: false, isDefinition: false, scopeLine: 622, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!371 = !DISubroutineType(types: !372)
!372 = !{!"_ZTSNSt3__16localeE", !333, !373}
!373 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16localeE")
!375 = !DISubprogram(name: "narrow", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE6narrowEcc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 625, type: !376, isLocal: false, isDefinition: false, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!44, !323, !366, !44}
!378 = !DISubprogram(name: "widen", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5widenEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 627, type: !379, isLocal: false, isDefinition: false, scopeLine: 627, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!366, !323, !44}
!381 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 631, type: !345, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!382 = !DISubprogram(name: "init", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4initEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 634, type: !342, isLocal: false, isDefinition: false, scopeLine: 634, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!383 = !DISubprogram(name: "move", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4moveERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 637, type: !384, isLocal: false, isDefinition: false, scopeLine: 637, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !333, !221}
!386 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 643, type: !384, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!387 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE9set_rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 645, type: !342, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!388 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !124, file: !4, line: 231, size: 1088, align: 64, elements: !389, vtableHolder: !"_ZTSNSt3__18ios_baseE", identifier: "_ZTSNSt3__18ios_baseE")
!389 = !{!390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !413, !414, !415, !416, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !437, !439, !440, !441, !442, !444, !445, !446, !448, !449, !450, !455, !459, !460, !463, !466, !469, !472, !473, !474, !477, !480, !481, !485, !489, !492, !495, !499, !502, !505, !508, !511, !512, !515, !516, !517, !518, !519, !520, !521, !522, !523, !526, !529, !530, !533, !534, !537, !538}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ios_base", scope: !4, file: !4, baseType: !185, size: 64, flags: DIFlagArtificial)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "boolalpha", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 237, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmtflags", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 236, baseType: !84)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 238, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 239, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "hex", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 240, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 241, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 242, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "oct", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 243, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 244, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "scientific", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 245, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "showbase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 246, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "showpoint", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 247, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "showpos", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 248, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2048)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "skipws", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 249, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4096)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "unitbuf", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 250, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "uppercase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 251, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "adjustfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 252, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 176)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "basefield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 253, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 74)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "floatfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 254, baseType: !392, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 260)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "badbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 258, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "eofbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 259, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "failbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 260, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "goodbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 261, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 265, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "openmode", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 263, baseType: !84)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 266, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 267, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 268, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 269, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "trunc", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 270, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__fmtflags_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 359, baseType: !393, size: 32, align: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__precision_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 360, baseType: !287, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__width_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 361, baseType: !287, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__rdstate_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 362, baseType: !329, size: 32, align: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__exceptions_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 363, baseType: !329, size: 32, align: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__rdbuf_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 364, baseType: !34, size: 64, align: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__loc_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 365, baseType: !34, size: 64, align: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__fn_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 366, baseType: !432, size: 64, align: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_callback", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 306, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !"_ZTSNSt3__18ios_base5eventE", !228, !26}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__index_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 367, baseType: !438, size: 64, align: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__event_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 368, baseType: !144, size: 64, align: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__event_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 369, baseType: !144, size: 64, align: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__xindex_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 373, baseType: !26, flags: DIFlagStaticMember)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 375, baseType: !443, size: 64, align: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 376, baseType: !144, size: 64, align: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 377, baseType: !144, size: 64, align: 64, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 378, baseType: !447, size: 64, align: 64, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 379, baseType: !144, size: 64, align: 64, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 380, baseType: !144, size: 64, align: 64, offset: 1024)
!450 = !DISubprogram(name: "flags", linkageName: "_ZNKSt3__18ios_base5flagsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 281, type: !451, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubroutineType(types: !452)
!452 = !{!393, !453}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__18ios_baseE")
!455 = !DISubprogram(name: "flags", linkageName: "_ZNSt3__18ios_base5flagsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 282, type: !456, isLocal: false, isDefinition: false, scopeLine: 282, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!393, !458, !393}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__18ios_baseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!459 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 283, type: !456, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!460 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEjj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 284, type: !461, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!393, !458, !393, !393}
!463 = !DISubprogram(name: "unsetf", linkageName: "_ZNSt3__18ios_base6unsetfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 285, type: !464, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !458, !393}
!466 = !DISubprogram(name: "precision", linkageName: "_ZNKSt3__18ios_base9precisionEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 287, type: !467, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubroutineType(types: !468)
!468 = !{!287, !453}
!469 = !DISubprogram(name: "precision", linkageName: "_ZNSt3__18ios_base9precisionEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 288, type: !470, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!470 = !DISubroutineType(types: !471)
!471 = !{!287, !458, !287}
!472 = !DISubprogram(name: "width", linkageName: "_ZNKSt3__18ios_base5widthEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 289, type: !467, isLocal: false, isDefinition: false, scopeLine: 289, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!473 = !DISubprogram(name: "width", linkageName: "_ZNSt3__18ios_base5widthEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 290, type: !470, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__18ios_base5imbueERKNS_6localeE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 293, type: !475, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!"_ZTSNSt3__16localeE", !458, !373}
!477 = !DISubprogram(name: "getloc", linkageName: "_ZNKSt3__18ios_base6getlocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 294, type: !478, isLocal: false, isDefinition: false, scopeLine: 294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubroutineType(types: !479)
!479 = !{!"_ZTSNSt3__16localeE", !453}
!480 = !DISubprogram(name: "xalloc", linkageName: "_ZNSt3__18ios_base6xallocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 297, type: !187, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubprogram(name: "iword", linkageName: "_ZNSt3__18ios_base5iwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 298, type: !482, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{!484, !458, !26}
!484 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108)
!485 = !DISubprogram(name: "pword", linkageName: "_ZNSt3__18ios_base5pwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 299, type: !486, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !458, !26}
!488 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!489 = !DISubprogram(name: "~ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 302, type: !490, isLocal: false, isDefinition: false, scopeLine: 302, containingType: !"_ZTSNSt3__18ios_baseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !458}
!492 = !DISubprogram(name: "register_callback", linkageName: "_ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 307, type: !493, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !458, !433, !26}
!495 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 310, type: !496, isLocal: false, isDefinition: false, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !458, !498}
!498 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !454)
!499 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__18ios_baseaSERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 311, type: !500, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true)
!500 = !DISubroutineType(types: !501)
!501 = !{!228, !458, !498}
!502 = !DISubprogram(name: "sync_with_stdio", linkageName: "_ZNSt3__18ios_base15sync_with_stdioEb", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 314, type: !503, isLocal: false, isDefinition: false, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!503 = !DISubroutineType(types: !504)
!504 = !{!138, !138}
!505 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__18ios_base7rdstateEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 316, type: !506, isLocal: false, isDefinition: false, scopeLine: 316, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{!329, !453}
!508 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__18ios_base5clearEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 317, type: !509, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !458, !329}
!511 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__18ios_base8setstateEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 318, type: !509, isLocal: false, isDefinition: false, scopeLine: 318, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__18ios_base4goodEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 320, type: !513, isLocal: false, isDefinition: false, scopeLine: 320, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubroutineType(types: !514)
!514 = !{!138, !453}
!515 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__18ios_base3eofEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 321, type: !513, isLocal: false, isDefinition: false, scopeLine: 321, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__18ios_base4failEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 322, type: !513, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__18ios_base3badEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 323, type: !513, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__18ios_base10exceptionsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 325, type: !506, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__18ios_base10exceptionsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 326, type: !509, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubprogram(name: "__set_badbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 328, type: !490, isLocal: false, isDefinition: false, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubprogram(name: "__set_failbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 329, type: !490, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 333, type: !490, isLocal: false, isDefinition: false, scopeLine: 333, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!523 = !DISubprogram(name: "init", linkageName: "_ZNSt3__18ios_base4initEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 336, type: !524, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !458, !34}
!526 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__18ios_base5rdbufEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 337, type: !527, isLocal: false, isDefinition: false, scopeLine: 337, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{!34, !453}
!529 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__18ios_base5rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 340, type: !524, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!530 = !DISubprogram(name: "__call_callbacks", linkageName: "_ZNSt3__18ios_base16__call_callbacksENS0_5eventE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 346, type: !531, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !458, !"_ZTSNSt3__18ios_base5eventE"}
!533 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__18ios_base7copyfmtERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 347, type: !496, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!534 = !DISubprogram(name: "move", linkageName: "_ZNSt3__18ios_base4moveERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 348, type: !535, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !458, !228}
!537 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__18ios_base4swapERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 349, type: !535, isLocal: false, isDefinition: false, scopeLine: 349, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!538 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__18ios_base9set_rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 352, type: !524, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!539 = !DICompositeType(tag: DW_TAG_class_type, name: "locale", scope: !124, file: !540, line: 60, size: 64, align: 64, elements: !541, identifier: "_ZTSNSt3__16localeE")
!540 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__locale", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!541 = !{!542, !545, !546, !547, !548, !549, !550, !551, !552, !554, !558, !561, !564, !570, !573, !576, !579, !580, !583, !587, !590, !591, !594, !597, !601, !605, !609}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "none", scope: !"_ZTSNSt3__16localeE", file: !540, line: 69, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "category", scope: !"_ZTSNSt3__16localeE", file: !540, line: 67, baseType: !26)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !"_ZTSNSt3__16localeE", file: !540, line: 70, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !"_ZTSNSt3__16localeE", file: !540, line: 71, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "monetary", scope: !"_ZTSNSt3__16localeE", file: !540, line: 72, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !"_ZTSNSt3__16localeE", file: !540, line: 73, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !"_ZTSNSt3__16localeE", file: !540, line: 74, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "messages", scope: !"_ZTSNSt3__16localeE", file: !540, line: 75, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !"_ZTSNSt3__16localeE", file: !540, line: 76, baseType: !543, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 63)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__locale_", scope: !"_ZTSNSt3__16localeE", file: !540, line: 109, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5__impE", size: 64, align: 64)
!554 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 79, type: !555, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16localeE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!558 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 80, type: !559, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !557, !373}
!561 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 81, type: !562, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !557, !59}
!564 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 82, type: !565, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !557, !567}
!567 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !124, file: !299, line: 194, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!570 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 83, type: !571, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !557, !373, !59, !544}
!573 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 84, type: !574, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !557, !373, !567, !544}
!576 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 87, type: !577, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !557, !373, !373, !544}
!579 = !DISubprogram(name: "~locale", scope: !"_ZTSNSt3__16localeE", file: !540, line: 89, type: !555, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!580 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__16localeaSERKS0_", scope: !"_ZTSNSt3__16localeE", file: !540, line: 91, type: !581, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!581 = !DISubroutineType(types: !582)
!582 = !{!373, !557, !373}
!583 = !DISubprogram(name: "name", linkageName: "_ZNKSt3__16locale4nameEv", scope: !"_ZTSNSt3__16localeE", file: !540, line: 96, type: !584, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!584 = !DISubroutineType(types: !585)
!585 = !{!569, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!587 = !DISubprogram(name: "operator==", linkageName: "_ZNKSt3__16localeeqERKS0_", scope: !"_ZTSNSt3__16localeE", file: !540, line: 97, type: !588, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubroutineType(types: !589)
!589 = !{!138, !586, !373}
!590 = !DISubprogram(name: "operator!=", linkageName: "_ZNKSt3__16localeneERKS0_", scope: !"_ZTSNSt3__16localeE", file: !540, line: 98, type: !588, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!591 = !DISubprogram(name: "global", linkageName: "_ZNSt3__16locale6globalERKS0_", scope: !"_ZTSNSt3__16localeE", file: !540, line: 104, type: !592, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!592 = !DISubroutineType(types: !593)
!593 = !{!"_ZTSNSt3__16localeE", !373}
!594 = !DISubprogram(name: "classic", linkageName: "_ZNSt3__16locale7classicEv", scope: !"_ZTSNSt3__16localeE", file: !540, line: 105, type: !595, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubroutineType(types: !596)
!596 = !{!373}
!597 = !DISubprogram(name: "__install_ctor", linkageName: "_ZNSt3__16locale14__install_ctorERKS0_PNS0_5facetEl", scope: !"_ZTSNSt3__16localeE", file: !540, line: 111, type: !598, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !557, !373, !600, !108}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5facetE", size: 64, align: 64)
!601 = !DISubprogram(name: "__global", linkageName: "_ZNSt3__16locale8__globalEv", scope: !"_ZTSNSt3__16localeE", file: !540, line: 112, type: !602, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true)
!602 = !DISubroutineType(types: !603)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16localeE")
!605 = !DISubprogram(name: "has_facet", linkageName: "_ZNKSt3__16locale9has_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !540, line: 113, type: !606, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{!138, !586, !608}
!608 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16locale2idE")
!609 = !DISubprogram(name: "use_facet", linkageName: "_ZNKSt3__16locale9use_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !540, line: 114, type: !610, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true)
!610 = !DISubroutineType(types: !611)
!611 = !{!612, !586, !608}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16locale5facetE")
!614 = !DICompositeType(tag: DW_TAG_class_type, name: "__imp", scope: !"_ZTSNSt3__16localeE", file: !540, line: 108, flags: DIFlagFwdDecl, identifier: "_ZTSNSt3__16locale5__impE")
!615 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >", scope: !124, file: !15, line: 4243, size: 192, align: 64, elements: !616, templateParams: !969, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!616 = !{!617, !618, !619, !626, !630, !636, !641, !644, !650, !653, !656, !659, !662, !665, !668, !669, !673, !676, !679, !683, !688, !689, !690, !694, !698, !699, !700, !701, !702, !703, !704, !707, !708, !709, !710, !711, !714, !715, !716, !717, !720, !725, !730, !731, !732, !733, !734, !735, !736, !739, !742, !743, !746, !749, !750, !753, !756, !757, !758, !759, !760, !761, !762, !763, !766, !769, !772, !775, !778, !781, !784, !787, !790, !793, !796, !799, !802, !805, !808, !811, !814, !817, !820, !824, !827, !830, !833, !834, !837, !840, !843, !846, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !872, !875, !878, !881, !884, !887, !888, !889, !893, !896, !897, !898, !899, !900, !901, !902, !903, !911, !914, !921, !922, !923, !924, !925, !926, !929, !932, !933, !934, !937, !940, !941, !942, !947, !951, !952, !955, !958, !961, !964, !967, !968}
!617 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", baseType: !"_ZTSNSt3__121__basic_string_commonILb1EEE")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__r_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1318, baseType: !"_ZTSNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE", size: 192, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "npos", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1321, baseType: !620, flags: DIFlagPublic | DIFlagStaticMember, extraData: i64 -1)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1213, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__116allocator_traitsINS_9allocatorIcEEEE", file: !623, line: 1417, baseType: !624)
!623 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/memory", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !"_ZTSNSt3__111__size_typeINS_9allocatorIcEElLb1EEE", file: !623, line: 1074, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__19allocatorIcEE", file: !623, line: 1643, baseType: !144)
!626 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1323, type: !627, isLocal: false, isDefinition: false, scopeLine: 1323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!630 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1325, type: !631, isLocal: false, isDefinition: false, scopeLine: 1325, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !629, !633}
!633 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1211, baseType: !"_ZTSNSt3__19allocatorIcEE")
!636 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1326, type: !637, isLocal: false, isDefinition: false, scopeLine: 1326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !629, !639}
!639 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!641 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1327, type: !642, isLocal: false, isDefinition: false, scopeLine: 1327, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !629, !639, !633}
!644 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1335, type: !645, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !629, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1210, baseType: !132)
!650 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1337, type: !651, isLocal: false, isDefinition: false, scopeLine: 1337, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !629, !647, !633}
!653 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1339, type: !654, isLocal: false, isDefinition: false, scopeLine: 1339, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !629, !647, !621}
!656 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1341, type: !657, isLocal: false, isDefinition: false, scopeLine: 1341, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !629, !647, !621, !633}
!659 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1343, type: !660, isLocal: false, isDefinition: false, scopeLine: 1343, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !629, !621, !649}
!662 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1345, type: !663, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !629, !621, !649, !633}
!665 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1346, type: !666, isLocal: false, isDefinition: false, scopeLine: 1346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !629, !639, !621, !621, !633}
!668 = !DISubprogram(name: "~basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1361, type: !627, isLocal: false, isDefinition: false, scopeLine: 1361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!669 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSERKS5_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1363, type: !670, isLocal: false, isDefinition: false, scopeLine: 1363, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !629, !639}
!672 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!673 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEPKc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1370, type: !674, isLocal: false, isDefinition: false, scopeLine: 1370, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{!672, !629, !647}
!676 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1371, type: !677, isLocal: false, isDefinition: false, scopeLine: 1371, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!677 = !DISubroutineType(types: !678)
!678 = !{!672, !629, !649}
!679 = !DISubprogram(name: "begin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1392, type: !680, isLocal: false, isDefinition: false, scopeLine: 1392, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!680 = !DISubroutineType(types: !681)
!681 = !{!682, !629}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1229, baseType: !"_ZTSNSt3__111__wrap_iterIPcEE")
!683 = !DISubprogram(name: "begin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1395, type: !684, isLocal: false, isDefinition: false, scopeLine: 1395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1230, baseType: !"_ZTSNSt3__111__wrap_iterIPKcEE")
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!688 = !DISubprogram(name: "end", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1398, type: !680, isLocal: false, isDefinition: false, scopeLine: 1398, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubprogram(name: "end", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1401, type: !684, isLocal: false, isDefinition: false, scopeLine: 1401, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!690 = !DISubprogram(name: "rbegin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1405, type: !691, isLocal: false, isDefinition: false, scopeLine: 1405, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!691 = !DISubroutineType(types: !692)
!692 = !{!693, !629}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1232, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPcEEEE")
!694 = !DISubprogram(name: "rbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1408, type: !695, isLocal: false, isDefinition: false, scopeLine: 1408, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !687}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1233, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPKcEEEE")
!698 = !DISubprogram(name: "rend", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1411, type: !691, isLocal: false, isDefinition: false, scopeLine: 1411, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!699 = !DISubprogram(name: "rend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1414, type: !695, isLocal: false, isDefinition: false, scopeLine: 1414, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubprogram(name: "cbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6cbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1418, type: !684, isLocal: false, isDefinition: false, scopeLine: 1418, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!701 = !DISubprogram(name: "cend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4cendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1421, type: !684, isLocal: false, isDefinition: false, scopeLine: 1421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!702 = !DISubprogram(name: "crbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7crbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1424, type: !695, isLocal: false, isDefinition: false, scopeLine: 1424, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!703 = !DISubprogram(name: "crend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5crendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1427, type: !695, isLocal: false, isDefinition: false, scopeLine: 1427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubprogram(name: "size", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4sizeEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1430, type: !705, isLocal: false, isDefinition: false, scopeLine: 1430, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubroutineType(types: !706)
!706 = !{!621, !687}
!707 = !DISubprogram(name: "length", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6lengthEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1432, type: !705, isLocal: false, isDefinition: false, scopeLine: 1432, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubprogram(name: "max_size", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE8max_sizeEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1433, type: !705, isLocal: false, isDefinition: false, scopeLine: 1433, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubprogram(name: "capacity", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE8capacityEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1434, type: !705, isLocal: false, isDefinition: false, scopeLine: 1434, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!710 = !DISubprogram(name: "resize", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEmc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1437, type: !660, isLocal: false, isDefinition: false, scopeLine: 1437, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!711 = !DISubprogram(name: "resize", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEm", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1438, type: !712, isLocal: false, isDefinition: false, scopeLine: 1438, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !629, !621}
!714 = !DISubprogram(name: "reserve", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7reserveEm", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1440, type: !712, isLocal: false, isDefinition: false, scopeLine: 1440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!715 = !DISubprogram(name: "shrink_to_fit", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE13shrink_to_fitEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1442, type: !627, isLocal: false, isDefinition: false, scopeLine: 1442, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!716 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5clearEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1444, type: !627, isLocal: false, isDefinition: false, scopeLine: 1444, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
