; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slufactor.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::SLUFactor" = type { %"class.soplex::SLinSolver", %"class.soplex::CLUFactor", %"class.soplex::DVector", %"class.soplex::SSVector", i32, i32, %"class.soplex::SSVector", %"class.soplex::SSVector", double, double, double, double }
%"class.soplex::SLinSolver" = type { i32 (...)** }
%"class.soplex::CLUFactor" = type { i32, i32, i32, double, double, double, double, double, %"struct.soplex::CLUFactor::Perm", %"struct.soplex::CLUFactor::Perm", %"struct.soplex::CLUFactor::L", double*, %"struct.soplex::CLUFactor::U", double*, double*, i32, %"class.soplex::CLUFactor::Temp" }
%"struct.soplex::CLUFactor::Perm" = type { i32*, i32* }
%"struct.soplex::CLUFactor::L" = type { i32, double*, i32*, i32, i32, i32, i32*, i32*, i32, double*, i32*, i32*, i32*, i32* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !2530, globals: !1916, imports: !3088)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slufactor.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !11, !16, !22, !27}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 50, size: 32, align: 32, elements: !5, identifier: "_ZTSN6soplex10SLinSolver6StatusE")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slinsolver.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "OK", value: 0)
!7 = !DIEnumerator(name: "INSTABLE", value: 1)
!8 = !DIEnumerator(name: "SINGULAR", value: 2)
!9 = !DIEnumerator(name: "UNLOADED", value: 4)
!10 = !DIEnumerator(name: "ERROR", value: 8)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UpdateType", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 51, size: 32, align: 32, elements: !13, identifier: "_ZTSN6soplex9SLUFactor10UpdateTypeE")
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slufactor.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "ETA", value: 0)
!15 = !DIEnumerator(name: "FOREST_TOMLIN", value: 1)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !17, line: 305, size: 32, align: 32, elements: !18, identifier: "_ZTSNSt3__18ios_base5eventE")
!17 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "erase_event", value: 0)
!20 = !DIEnumerator(name: "imbue_event", value: 1)
!21 = !DIEnumerator(name: "copyfmt_event", value: 2)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !17, line: 272, size: 32, align: 32, elements: !23, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "beg", value: 0)
!25 = !DIEnumerator(name: "cur", value: 1)
!26 = !DIEnumerator(name: "end", value: 2)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !28, line: 1280, size: 32, align: 32, elements: !29, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!28 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !{!30}
!30 = !DIEnumerator(name: "__short_mask", value: 1)
!31 = !{!32, !89, !93, !94, !101, !108, !123, !128, !132, !136, !255, !3, !325, !424, !428, !504, !628, !678, !723, !724, !918, !922, !938, !944, !956, !961, !972, !1002, !11, !822, !179, !1022, !558, !1039, !1095, !1222, !1298, !16, !1448, !1523, !1524, !1880, !1915, !1919, !1929, !1984, !1987, !1992, !1997, !2001, !2044, !2048, !2050, !2060, !2065, !2066, !2069, !2072, !2085, !2096, !2103, !2107, !2111, !2148, !2151, !2153, !2154, !2155, !2156, !2158, !2169, !2198, !2219, !2236, !2342, !22, !2343, !2367, !2398, !2404, !2405, !2422, !244, !27, !2425, !2435, !2439, !72, !1104, !1080, !2440, !2511, !2529, !948}
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !33, line: 122, size: 1216, align: 64, elements: !34, identifier: "_ZTS7__sFILE")
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !{!35, !38, !40, !41, !43, !44, !45, !46, !48, !52, !58, !68, !74, !75, !77, !78, !82, !86, !87, !88}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !33, line: 123, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !33, line: 124, baseType: !39, size: 32, align: 32, offset: 64)
!39 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !33, line: 125, baseType: !39, size: 32, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !33, line: 126, baseType: !42, size: 16, align: 16, offset: 128)
!42 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !33, line: 127, baseType: !42, size: 16, align: 16, offset: 144)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !33, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !33, line: 129, baseType: !39, size: 32, align: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !33, line: 132, baseType: !47, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !33, line: 133, baseType: !49, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!39, !47}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !33, line: 134, baseType: !53, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!39, !47, !56, !39}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !33, line: 135, baseType: !59, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !47, !62, !39}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !33, line: 77, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !64, line: 71, baseType: !65)
!64 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !33, line: 136, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!39, !47, !72, !39}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !33, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !33, line: 140, baseType: !76, size: 64, align: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !33, line: 141, baseType: !39, size: 32, align: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !33, line: 144, baseType: !79, size: 24, align: 8, offset: 928)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 3)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !33, line: 145, baseType: !83, size: 8, align: 8, offset: 952)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !33, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !33, line: 151, baseType: !39, size: 32, align: 32, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !33, line: 152, baseType: !62, size: 64, align: 64, offset: 1152)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !33, line: 88, size: 128, align: 64, elements: !90, identifier: "_ZTS6__sbuf")
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !33, line: 89, baseType: !36, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !33, line: 90, baseType: !39, size: 32, align: 32, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !33, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !95, identifier: "_ZTS13__va_list_tag")
!95 = !{!96, !98, !99, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !97, size: 32, align: 32)
!97 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !97, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !47, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !47, size: 64, align: 64, offset: 128)
!101 = !DICompositeType(tag: DW_TAG_union_type, file: !66, line: 76, size: 1024, align: 64, elements: !102, identifier: "_ZTS11__mbstate_t")
!102 = !{!103, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !66, line: 77, baseType: !104, size: 1024, align: 8)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, align: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !66, line: 78, baseType: !67, size: 64, align: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !109, line: 73, size: 448, align: 64, elements: !110, identifier: "_ZTS2tm")
!109 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !122}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !109, line: 74, baseType: !39, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !109, line: 75, baseType: !39, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !109, line: 76, baseType: !39, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !109, line: 77, baseType: !39, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !109, line: 78, baseType: !39, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !109, line: 79, baseType: !39, size: 32, align: 32, offset: 160)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !109, line: 80, baseType: !39, size: 32, align: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !109, line: 81, baseType: !39, size: 32, align: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !109, line: 82, baseType: !39, size: 32, align: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !109, line: 83, baseType: !121, size: 64, align: 64, offset: 320)
!121 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !109, line: 84, baseType: !56, size: 64, align: 64, offset: 384)
!123 = !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 82, size: 64, align: 32, elements: !125, identifier: "_ZTS5div_t")
!124 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !124, line: 83, baseType: !39, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !124, line: 84, baseType: !39, size: 32, align: 32, offset: 32)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 87, size: 128, align: 64, elements: !129, identifier: "_ZTS6ldiv_t")
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !124, line: 88, baseType: !121, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !124, line: 89, baseType: !121, size: 64, align: 64, offset: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 93, size: 128, align: 64, elements: !133, identifier: "_ZTS7lldiv_t")
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !124, line: 94, baseType: !67, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !124, line: 95, baseType: !67, size: 64, align: 64, offset: 64)
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "SLUFactor", scope: !137, file: !12, line: 46, size: 6080, align: 64, elements: !139, vtableHolder: !"_ZTSN6soplex10SLinSolverE", identifier: "_ZTSN6soplex9SLUFactorE")
!137 = !DINamespace(name: "soplex", scope: null, file: !138, line: 49)
!138 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !151, !152, !153, !154, !158, !162, !165, !170, !173, !174, !175, !176, !180, !183, !189, !193, !196, !199, !202, !207, !211, !214, !217, !218, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !235, !238, !241, !245, !246, !247, !252}
!140 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex9SLUFactorE", baseType: !"_ZTSN6soplex10SLinSolverE", flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex9SLUFactorE", baseType: !"_ZTSN6soplex9CLUFactorE", offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 62, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 3968, flags: DIFlagProtected)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ssvec", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 63, baseType: !"_ZTSN6soplex8SSVectorE", size: 512, align: 64, offset: 4224, flags: DIFlagProtected)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "usetup", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 65, baseType: !39, size: 32, align: 32, offset: 4736, flags: DIFlagProtected)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "uptype", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 66, baseType: !"_ZTSN6soplex9SLUFactor10UpdateTypeE", size: 32, align: 32, offset: 4768, flags: DIFlagProtected)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "eta", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 67, baseType: !"_ZTSN6soplex8SSVectorE", size: 512, align: 64, offset: 4800, flags: DIFlagProtected)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "forest", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 68, baseType: !"_ZTSN6soplex8SSVectorE", size: 512, align: 64, offset: 5312, flags: DIFlagProtected)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lastThreshold", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 69, baseType: !149, size: 64, align: 64, offset: 5824, flags: DIFlagProtected)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !137, file: !138, line: 127, baseType: !150)
!150 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "minThreshold", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 77, baseType: !149, size: 64, align: 64, offset: 5888, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 80, baseType: !149, size: 64, align: 64, offset: 5952, flags: DIFlagPublic)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "minStability", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 83, baseType: !149, size: 64, align: 64, offset: 6016, flags: DIFlagPublic)
!154 = !DISubprogram(name: "freeAll", linkageName: "_ZN6soplex9SLUFactor7freeAllEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 59, type: !155, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SLUFactorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!158 = !DISubprogram(name: "changeEta", linkageName: "_ZN6soplex9SLUFactor9changeEtaEiRNS_8SSVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 60, type: !159, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !157, !39, !161}
!161 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!162 = !DISubprogram(name: "utype", linkageName: "_ZN6soplex9SLUFactor5utypeEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 86, type: !163, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{!"_ZTSN6soplex9SLUFactor10UpdateTypeE", !157}
!165 = !DISubprogram(name: "getFactorCount", linkageName: "_ZNK6soplex9SLUFactor14getFactorCountEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 91, type: !166, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubroutineType(types: !167)
!167 = !{!39, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9SLUFactorE")
!170 = !DISubprogram(name: "setUtype", linkageName: "_ZN6soplex9SLUFactor8setUtypeENS0_10UpdateTypeE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 99, type: !171, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !157, !"_ZTSN6soplex9SLUFactor10UpdateTypeE"}
!173 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex9SLUFactor5clearEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 112, type: !155, isLocal: false, isDefinition: false, scopeLine: 112, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!174 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex9SLUFactor3dimEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 114, type: !166, isLocal: false, isDefinition: false, scopeLine: 114, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!175 = !DISubprogram(name: "memory", linkageName: "_ZNK6soplex9SLUFactor6memoryEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 119, type: !166, isLocal: false, isDefinition: false, scopeLine: 119, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex9SLUFactor6statusEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 124, type: !177, isLocal: false, isDefinition: false, scopeLine: 124, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !168}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "Status", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 72, baseType: !"_ZTSN6soplex10SLinSolver6StatusE")
!180 = !DISubprogram(name: "stability", linkageName: "_ZNK6soplex9SLUFactor9stabilityEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 129, type: !181, isLocal: false, isDefinition: false, scopeLine: 129, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{!149, !168}
!183 = !DISubprogram(name: "load", linkageName: "_ZN6soplex9SLUFactor4loadEPPKNS_7SVectorEi", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 132, type: !184, isLocal: false, isDefinition: false, scopeLine: 132, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!184 = !DISubroutineType(types: !185)
!185 = !{!179, !157, !186, !39}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!189 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex9SLUFactor11solve2rightERNS_6VectorES2_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 135, type: !190, isLocal: false, isDefinition: false, scopeLine: 135, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !157, !192, !192}
!192 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!193 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex9SLUFactor11solve2rightERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 137, type: !194, isLocal: false, isDefinition: false, scopeLine: 137, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !157, !192, !161}
!196 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex9SLUFactor11solve2rightERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 139, type: !197, isLocal: false, isDefinition: false, scopeLine: 139, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !157, !161, !192}
!199 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex9SLUFactor11solve2rightERNS_8SSVectorES2_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 141, type: !200, isLocal: false, isDefinition: false, scopeLine: 141, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !157, !161, !161}
!202 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex9SLUFactor10solveRightERNS_6VectorERKS1_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 144, type: !203, isLocal: false, isDefinition: false, scopeLine: 144, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !157, !192, !205}
!205 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!207 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex9SLUFactor10solveRightERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 147, type: !208, isLocal: false, isDefinition: false, scopeLine: 147, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !157, !192, !210}
!210 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !188)
!211 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex9SLUFactor10solveRightERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 150, type: !212, isLocal: false, isDefinition: false, scopeLine: 150, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !157, !161, !205}
!214 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex9SLUFactor10solveRightERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 153, type: !215, isLocal: false, isDefinition: false, scopeLine: 153, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !157, !161, !210}
!217 = !DISubprogram(name: "solveRight4update", linkageName: "_ZN6soplex9SLUFactor17solveRight4updateERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 157, type: !215, isLocal: false, isDefinition: false, scopeLine: 157, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubprogram(name: "solve2right4update", linkageName: "_ZN6soplex9SLUFactor18solve2right4updateERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 160, type: !219, isLocal: false, isDefinition: false, scopeLine: 160, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !157, !161, !192, !210, !161}
!221 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex9SLUFactor10solve2leftERNS_6VectorES2_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 166, type: !190, isLocal: false, isDefinition: false, scopeLine: 166, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!222 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex9SLUFactor10solve2leftERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 168, type: !194, isLocal: false, isDefinition: false, scopeLine: 168, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!223 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex9SLUFactor10solve2leftERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 170, type: !197, isLocal: false, isDefinition: false, scopeLine: 170, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex9SLUFactor10solve2leftERNS_8SSVectorES2_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 172, type: !200, isLocal: false, isDefinition: false, scopeLine: 172, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!225 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex9SLUFactor9solveLeftERNS_6VectorERKS1_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 175, type: !203, isLocal: false, isDefinition: false, scopeLine: 175, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!226 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex9SLUFactor9solveLeftERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 178, type: !208, isLocal: false, isDefinition: false, scopeLine: 178, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!227 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex9SLUFactor9solveLeftERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 181, type: !212, isLocal: false, isDefinition: false, scopeLine: 181, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!228 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex9SLUFactor9solveLeftERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 184, type: !215, isLocal: false, isDefinition: false, scopeLine: 184, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 24, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex9SLUFactor9solveLeftERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 188, type: !219, isLocal: false, isDefinition: false, scopeLine: 188, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubprogram(name: "change", linkageName: "_ZN6soplex9SLUFactor6changeEiRKNS_7SVectorEPKNS_8SSVectorE", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 194, type: !231, isLocal: false, isDefinition: false, scopeLine: 194, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{!179, !157, !39, !210, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!235 = !DISubprogram(name: "zeroVec", linkageName: "_ZN6soplex9SLUFactor7zeroVecEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 205, type: !236, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!236 = !DISubroutineType(types: !237)
!237 = !{!192, !157}
!238 = !DISubprogram(name: "dump", linkageName: "_ZNK6soplex9SLUFactor4dumpEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 211, type: !239, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !168}
!241 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9SLUFactor12isConsistentEv", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 214, type: !242, isLocal: false, isDefinition: false, scopeLine: 214, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !168}
!244 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!245 = !DISubprogram(name: "SLUFactor", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 220, type: !155, isLocal: false, isDefinition: false, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubprogram(name: "~SLUFactor", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 223, type: !155, isLocal: false, isDefinition: false, scopeLine: 223, containingType: !"_ZTSN6soplex9SLUFactorE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex9SLUFactoraSERKS0_", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 227, type: !248, isLocal: false, isDefinition: false, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !157, !251}
!250 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex9SLUFactorE")
!251 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !169)
!252 = !DISubprogram(name: "SLUFactor", scope: !"_ZTSN6soplex9SLUFactorE", file: !12, line: 229, type: !253, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !157, !251}
!255 = !DICompositeType(tag: DW_TAG_class_type, name: "SLinSolver", scope: !137, file: !4, line: 46, size: 64, align: 64, elements: !256, vtableHolder: !"_ZTSN6soplex10SLinSolverE", identifier: "_ZTSN6soplex10SLinSolverE")
!256 = !{!257, !262, !267, !271, !274, !275, !278, !281, !284, !287, !290, !293, !296, !299, !302, !305, !308, !311, !312, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SLinSolver", scope: !4, file: !4, baseType: !258, size: 64, flags: DIFlagArtificial)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!39}
!262 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex10SLinSolver6statusEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 69, type: !263, isLocal: false, isDefinition: false, scopeLine: 69, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SLinSolverE")
!267 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex10SLinSolver5clearEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 72, type: !268, isLocal: false, isDefinition: false, scopeLine: 72, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!271 = !DISubprogram(name: "memory", linkageName: "_ZNK6soplex10SLinSolver6memoryEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 75, type: !272, isLocal: false, isDefinition: false, scopeLine: 75, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{!39, !265}
!274 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex10SLinSolver3dimEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 78, type: !272, isLocal: false, isDefinition: false, scopeLine: 78, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!275 = !DISubprogram(name: "load", linkageName: "_ZN6soplex10SLinSolver4loadEPPKNS_7SVectorEi", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 84, type: !276, isLocal: false, isDefinition: false, scopeLine: 84, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!276 = !DISubroutineType(types: !277)
!277 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !270, !186, !39}
!278 = !DISubprogram(name: "stability", linkageName: "_ZNK6soplex10SLinSolver9stabilityEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 90, type: !279, isLocal: false, isDefinition: false, scopeLine: 90, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!279 = !DISubroutineType(types: !280)
!280 = !{!149, !265}
!281 = !DISubprogram(name: "change", linkageName: "_ZN6soplex10SLinSolver6changeEiRKNS_7SVectorEPKNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 98, type: !282, isLocal: false, isDefinition: false, scopeLine: 98, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!282 = !DISubroutineType(types: !283)
!283 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !270, !39, !210, !233}
!284 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex10SLinSolver12isConsistentEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 102, type: !285, isLocal: false, isDefinition: false, scopeLine: 102, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!285 = !DISubroutineType(types: !286)
!286 = !{!244, !265}
!287 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_6VectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 130, type: !288, isLocal: false, isDefinition: false, scopeLine: 130, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !270, !192, !192}
!290 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 132, type: !291, isLocal: false, isDefinition: false, scopeLine: 132, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !270, !192, !161}
!293 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 134, type: !294, isLocal: false, isDefinition: false, scopeLine: 134, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !270, !161, !192}
!296 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_8SSVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 136, type: !297, isLocal: false, isDefinition: false, scopeLine: 136, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !270, !161, !161}
!299 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_6VectorERKS1_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 139, type: !300, isLocal: false, isDefinition: false, scopeLine: 139, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !270, !192, !205}
!302 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 141, type: !303, isLocal: false, isDefinition: false, scopeLine: 141, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !270, !192, !210}
!305 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 143, type: !306, isLocal: false, isDefinition: false, scopeLine: 143, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !270, !161, !205}
!308 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 145, type: !309, isLocal: false, isDefinition: false, scopeLine: 145, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !270, !161, !210}
!311 = !DISubprogram(name: "solveRight4update", linkageName: "_ZN6soplex10SLinSolver17solveRight4updateERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 152, type: !309, isLocal: false, isDefinition: false, scopeLine: 152, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!312 = !DISubprogram(name: "solve2right4update", linkageName: "_ZN6soplex10SLinSolver18solve2right4updateERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 155, type: !313, isLocal: false, isDefinition: false, scopeLine: 155, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !270, !161, !192, !210, !161}
!315 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_6VectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 161, type: !288, isLocal: false, isDefinition: false, scopeLine: 161, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!316 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 163, type: !291, isLocal: false, isDefinition: false, scopeLine: 163, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 165, type: !294, isLocal: false, isDefinition: false, scopeLine: 165, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!318 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_8SSVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 167, type: !297, isLocal: false, isDefinition: false, scopeLine: 167, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!319 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 170, type: !303, isLocal: false, isDefinition: false, scopeLine: 170, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_6VectorERKS1_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 172, type: !300, isLocal: false, isDefinition: false, scopeLine: 172, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 174, type: !309, isLocal: false, isDefinition: false, scopeLine: 174, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 24, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 176, type: !306, isLocal: false, isDefinition: false, scopeLine: 176, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!323 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 179, type: !313, isLocal: false, isDefinition: false, scopeLine: 179, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!324 = !DISubprogram(name: "~SLinSolver", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 189, type: !268, isLocal: false, isDefinition: false, scopeLine: 189, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!325 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !137, file: !326, line: 98, size: 64, align: 64, elements: !327, identifier: "_ZTSN6soplex7SVectorE")
!326 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!327 = !{!328, !330, !334, !337, !344, !349, !352, !355, !358, !359, !363, !364, !365, !368, !371, !375, !379, !383, !384, !388, !389, !392, !393, !394, !395, !399, !402, !406, !409, !412, !415, !418, !421, !422, !423}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 120, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!330 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 127, type: !331, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !39, !149}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!334 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 138, type: !335, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !333, !210}
!337 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 144, type: !338, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !333, !39, !340, !342}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!344 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 147, type: !345, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !333, !39, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!349 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 150, type: !350, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !333, !39, !39}
!352 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 153, type: !353, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !333, !39}
!355 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 160, type: !356, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !333}
!358 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 165, type: !356, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 172, type: !360, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{!39, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!363 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 181, type: !360, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 190, type: !360, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 197, type: !366, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!39, !362, !39}
!368 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 214, type: !369, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{!149, !362, !39}
!371 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 223, type: !372, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!374, !333, !39}
!374 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!375 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 230, type: !376, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !362, !39}
!378 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !348)
!379 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 237, type: !380, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!380 = !DISubroutineType(types: !381)
!381 = !{!382, !333, !39}
!382 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39)
!383 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 244, type: !366, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 251, type: !385, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !333, !39}
!387 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !149)
!388 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 258, type: !369, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!389 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 269, type: !390, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{!149, !362}
!392 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 272, type: !390, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 275, type: !390, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 281, type: !390, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!395 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 284, type: !396, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !333, !149}
!398 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!399 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 287, type: !400, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!400 = !DISubroutineType(types: !401)
!401 = !{!149, !362, !205}
!402 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 305, type: !403, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{!398, !333, !405}
!405 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !234)
!406 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 307, type: !407, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!407 = !DISubroutineType(types: !408)
!408 = !{!398, !333, !210}
!409 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 309, type: !410, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!410 = !DISubroutineType(types: !411)
!411 = !{!398, !333, !205}
!412 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 312, type: !413, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!244, !362}
!415 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 324, type: !416, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !333, !39, !329}
!418 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 329, type: !419, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{!329, !362}
!421 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 334, type: !353, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 340, type: !353, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 346, type: !416, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !326, line: 109, size: 128, align: 64, elements: !425, identifier: "_ZTSN6soplex7SVector7ElementE")
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !326, line: 111, baseType: !149, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !326, line: 112, baseType: !39, size: 32, align: 32, offset: 64)
!428 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !137, file: !429, line: 82, size: 128, align: 64, elements: !430, identifier: "_ZTSN6soplex6VectorE")
!429 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!430 = !{!431, !432, !434, !438, !441, !444, !447, !448, !449, !453, !456, !459, !460, !461, !462, !463, !464, !465, !468, !471, !474, !477, !480, !481, !482, !485, !488, !491, !494, !497, !500, !503}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 90, baseType: !39, size: 32, align: 32, flags: DIFlagProtected)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 96, baseType: !433, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!434 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 107, type: !435, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437, !39, !433}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!438 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 114, type: !439, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{!192, !437, !205}
!441 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 121, type: !442, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!442 = !DISubroutineType(types: !443)
!443 = !{!192, !437, !210}
!444 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 128, type: !445, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!445 = !DISubroutineType(types: !446)
!446 = !{!192, !437, !405}
!447 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 134, type: !442, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 140, type: !445, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!449 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 146, type: !450, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{!39, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!453 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 151, type: !454, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{!387, !437, !39}
!456 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 158, type: !457, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!149, !452, !39}
!459 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 168, type: !439, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!460 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 170, type: !442, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 172, type: !445, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!462 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 175, type: !439, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!463 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 177, type: !442, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!464 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 179, type: !445, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex6VectormLEd", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 182, type: !466, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DISubroutineType(types: !467)
!467 = !{!192, !437, !149}
!468 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 185, type: !469, isLocal: false, isDefinition: false, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{!149, !452, !405}
!471 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 187, type: !472, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{!149, !452, !210}
!474 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 189, type: !475, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!149, !452, !205}
!477 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex6Vector6maxAbsEv", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 199, type: !478, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubroutineType(types: !479)
!479 = !{!149, !452}
!480 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex6Vector6lengthEv", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 201, type: !478, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex6Vector7length2Ev", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 203, type: !478, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 206, type: !483, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!483 = !DISubroutineType(types: !484)
!484 = !{!192, !437, !149, !210}
!485 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 208, type: !486, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{!192, !437, !149, !405}
!488 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKS0_", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 210, type: !489, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!489 = !DISubroutineType(types: !490)
!490 = !{!192, !437, !149, !205}
!491 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex6Vector7get_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 229, type: !492, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!492 = !DISubroutineType(types: !493)
!493 = !{!433, !437}
!494 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex6Vector13get_const_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 237, type: !495, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!495 = !DISubroutineType(types: !496)
!496 = !{!342, !452}
!497 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6Vector12isConsistentEv", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 245, type: !498, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{!244, !452}
!500 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6Vector5clearEv", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 248, type: !501, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !437}
!503 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !429, line: 256, type: !501, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DICompositeType(tag: DW_TAG_class_type, name: "SSVector", scope: !137, file: !505, line: 50, size: 512, align: 64, elements: !506, identifier: "_ZTSN6soplex8SSVectorE")
!505 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!506 = !{!507, !508, !509, !510, !511, !515, !518, !522, !525, !526, !527, !530, !533, !534, !537, !540, !541, !542, !543, !544, !547, !550, !555, !559, !560, !564, !567, !570, !573, !574, !575, !576, !579, !582, !585, !588, !593, !596, !599, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !614, !617, !620, !621, !622, !623, !624, !625, !626, !627}
!507 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex7DVectorE", flags: DIFlagProtected)
!508 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex6IdxSetE", offset: 256, flags: DIFlagProtected)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "setupStatus", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 53, baseType: !244, size: 8, align: 8, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 64, baseType: !149, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!511 = !DISubprogram(name: "setMax", linkageName: "_ZN6soplex8SSVector6setMaxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 59, type: !512, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !514, !39}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!515 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex8SSVector7get_ptrEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 85, type: !516, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubroutineType(types: !517)
!517 = !{!433, !514}
!518 = !DISubprogram(name: "isSetup", linkageName: "_ZNK6soplex8SSVector7isSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 91, type: !519, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubroutineType(types: !520)
!520 = !{!244, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!522 = !DISubprogram(name: "unSetup", linkageName: "_ZN6soplex8SSVector7unSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 97, type: !523, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !514}
!525 = !DISubprogram(name: "setup", linkageName: "_ZN6soplex8SSVector5setupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 106, type: !523, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubprogram(name: "forceSetup", linkageName: "_ZN6soplex8SSVector10forceSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 109, type: !523, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex8SSVector5indexEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 119, type: !528, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubroutineType(types: !529)
!529 = !{!39, !521, !39}
!530 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex8SSVector5valueEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 126, type: !531, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{!149, !521, !39}
!533 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex8SSVector6numberEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 134, type: !528, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex8SSVector4sizeEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 141, type: !535, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubroutineType(types: !536)
!536 = !{!39, !521}
!537 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8SSVector3addEid", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 150, type: !538, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !514, !39, !149}
!540 = !DISubprogram(name: "setValue", linkageName: "_ZN6soplex8SSVector8setValueEid", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 159, type: !538, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!541 = !DISubprogram(name: "clearIdx", linkageName: "_ZN6soplex8SSVector8clearIdxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 162, type: !512, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubprogram(name: "clearNum", linkageName: "_ZN6soplex8SSVector8clearNumEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 174, type: !512, isLocal: false, isDefinition: false, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex8SSVectorixEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 187, type: !531, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!544 = !DISubprogram(name: "indexMem", linkageName: "_ZNK6soplex8SSVector8indexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 193, type: !545, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{!340, !521}
!547 = !DISubprogram(name: "values", linkageName: "_ZNK6soplex8SSVector6valuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 199, type: !548, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubroutineType(types: !549)
!549 = !{!342, !521}
!550 = !DISubprogram(name: "indices", linkageName: "_ZNK6soplex8SSVector7indicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 205, type: !551, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !521}
!553 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6IdxSetE")
!555 = !DISubprogram(name: "altIndexMem", linkageName: "_ZN6soplex8SSVector11altIndexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 211, type: !556, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!556 = !DISubroutineType(types: !557)
!557 = !{!558, !514}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!559 = !DISubprogram(name: "altValues", linkageName: "_ZN6soplex8SSVector9altValuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 218, type: !516, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubprogram(name: "altIndices", linkageName: "_ZN6soplex8SSVector10altIndicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 225, type: !561, isLocal: false, isDefinition: false, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !514}
!563 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6IdxSetE")
!564 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 236, type: !565, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!161, !514, !205}
!567 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 238, type: !568, isLocal: false, isDefinition: false, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubroutineType(types: !569)
!569 = !{!161, !514, !210}
!570 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 240, type: !571, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{!161, !514, !405}
!573 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 243, type: !565, isLocal: false, isDefinition: false, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 245, type: !568, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 247, type: !571, isLocal: false, isDefinition: false, scopeLine: 247, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex8SSVectormLEd", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 250, type: !577, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!577 = !DISubroutineType(types: !578)
!578 = !{!161, !514, !149}
!579 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 253, type: !580, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!580 = !DISubroutineType(types: !581)
!581 = !{!161, !514, !149, !405}
!582 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 255, type: !583, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{!161, !514, !149, !210}
!585 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 257, type: !586, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{!161, !514, !149, !205}
!588 = !DISubprogram(name: "assign2product", linkageName: "_ZN6soplex8SSVector14assign2productERKS0_RKNS_5SVSetE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 260, type: !589, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{!161, !514, !405, !591}
!591 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!593 = !DISubprogram(name: "assign2product4setup", linkageName: "_ZN6soplex8SSVector20assign2product4setupERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 262, type: !594, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubroutineType(types: !595)
!595 = !{!161, !514, !591, !405}
!596 = !DISubprogram(name: "assign2productAndSetup", linkageName: "_ZN6soplex8SSVector22assign2productAndSetupERKNS_5SVSetERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 264, type: !597, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubroutineType(types: !598)
!598 = !{!161, !514, !591, !161}
!599 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex8SSVector6maxAbsEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 267, type: !600, isLocal: false, isDefinition: false, scopeLine: 267, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubroutineType(types: !601)
!601 = !{!149, !521}
!602 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex8SSVector6lengthEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 269, type: !600, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex8SSVector7length2Ev", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 271, type: !600, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex8SSVector3dimEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 278, type: !535, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SSVector5reDimEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 284, type: !512, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubprogram(name: "setSize", linkageName: "_ZN6soplex8SSVector7setSizeEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 287, type: !512, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!607 = !DISubprogram(name: "reMem", linkageName: "_ZN6soplex8SSVector5reMemEi", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 296, type: !512, isLocal: false, isDefinition: false, scopeLine: 296, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!608 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex8SSVector5clearEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 299, type: !523, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SSVector12isConsistentEv", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 302, type: !519, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!610 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 309, type: !538, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!611 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 322, type: !612, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !514, !405}
!614 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 334, type: !615, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !514, !205, !149}
!617 = !DISubprogram(name: "setup_and_assign", linkageName: "_ZN6soplex8SSVector16setup_and_assignERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 345, type: !618, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !514, !161}
!620 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex8SSVector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 348, type: !568, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 351, type: !571, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 353, type: !568, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 355, type: !565, isLocal: false, isDefinition: false, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubprogram(name: "~SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 362, type: !523, isLocal: false, isDefinition: false, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubprogram(name: "assign2product1", linkageName: "_ZN6soplex8SSVector15assign2product1ERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 371, type: !594, isLocal: false, isDefinition: false, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true)
!626 = !DISubprogram(name: "assign2productShort", linkageName: "_ZN6soplex8SSVector19assign2productShortERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 372, type: !594, isLocal: false, isDefinition: false, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: true)
!627 = !DISubprogram(name: "assign2productFull", linkageName: "_ZN6soplex8SSVector18assign2productFullERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !505, line: 373, type: !594, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPrototyped, isOptimized: true)
!628 = !DICompositeType(tag: DW_TAG_class_type, name: "DVector", scope: !137, file: !629, line: 55, size: 256, align: 64, elements: !630, identifier: "_ZTSN6soplex7DVectorE")
!629 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!630 = !{!631, !632, !633, !634, !639, !642, !643, !644, !647, !650, !651, !654, !659, !662, !663, !666, !670, !671, !674, !675}
!631 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex7DVectorE", baseType: !"_ZTSN6soplex6VectorE", flags: DIFlagPublic)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "memsize", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 57, baseType: !39, size: 32, align: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 58, baseType: !433, size: 64, align: 64, offset: 192)
!634 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 92, type: !635, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{!637, !638, !205}
!637 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DVectorE")
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!639 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 98, type: !640, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!640 = !DISubroutineType(types: !641)
!641 = !{!637, !638, !210}
!642 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 105, type: !635, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 111, type: !640, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!644 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7DVectormLEd", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 118, type: !645, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubroutineType(types: !646)
!646 = !{!637, !638, !149}
!647 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex7DVector5reDimEi", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 125, type: !648, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !638, !39}
!650 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEi", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 128, type: !648, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!651 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEii", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 131, type: !652, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !638, !39, !39}
!654 = !DISubprogram(name: "memSize", linkageName: "_ZNK6soplex7DVector7memSizeEv", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 134, type: !655, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{!39, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DVectorE")
!659 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7DVector12isConsistentEv", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 140, type: !660, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!660 = !DISubroutineType(types: !661)
!661 = !{!244, !657}
!662 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 143, type: !648, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!663 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 146, type: !664, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !638, !205}
!666 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 148, type: !667, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !638, !669}
!669 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !658)
!670 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 151, type: !635, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKS0_", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 159, type: !672, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{!637, !638, !669}
!674 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 170, type: !640, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubprogram(name: "~DVector", scope: !"_ZTSN6soplex7DVectorE", file: !629, line: 180, type: !676, isLocal: false, isDefinition: false, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !638}
!678 = !DICompositeType(tag: DW_TAG_class_type, name: "IdxSet", scope: !137, file: !679, line: 58, size: 128, align: 64, elements: !680, identifier: "_ZTSN6soplex6IdxSetE")
!679 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/idxset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!680 = !{!681, !682, !683, !684, !688, !691, !692, !693, !694, !698, !701, !704, !705, !708, !709, !712, !715, !716, !719, !722}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTSN6soplex6IdxSetE", file: !679, line: 61, baseType: !39, size: 32, align: 32, flags: DIFlagProtected)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !"_ZTSN6soplex6IdxSetE", file: !679, line: 62, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex6IdxSetE", file: !679, line: 63, baseType: !558, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!684 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex6IdxSet5indexEi", scope: !"_ZTSN6soplex6IdxSetE", file: !679, line: 67, type: !685, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{!39, !687, !39}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!688 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex6IdxSet4sizeEv", scope: !"_ZTSN6soplex6IdxSetE", file: !679, line: 73, type: !689, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubroutineType(types: !690)
!690 = !{!39, !687}
