; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxbasis.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::SPxBasis" = type { i32 (...)**, %"class.soplex::SoPlex"*, %"class.soplex::DataArray", %"class.soplex::DataArray.0", i8, %"class.soplex::SLinSolver"*, i8, i32, double, i32, i32, i32, double, double, %"class.soplex::SPxId", %"class.soplex::SPxId", i32, i32, %"class.soplex::SPxBasis::Desc" }

!70 = !DIEnumerator(name: "INSTABLE", value: 1)
!71 = !DIEnumerator(name: "SINGULAR", value: 2)
!72 = !DIEnumerator(name: "UNLOADED", value: 4)
!73 = !DIEnumerator(name: "ERROR", value: 8)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex8SPxBasis4DescE", file: !75, line: 170, size: 32, align: 32, elements: !76, identifier: "_ZTSN6soplex8SPxBasis4Desc6StatusE")
!75 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxbasis.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85}
!77 = !DIEnumerator(name: "P_ON_LOWER", value: -4)
!78 = !DIEnumerator(name: "P_ON_UPPER", value: -2)
!79 = !DIEnumerator(name: "P_FREE", value: -1)
!80 = !DIEnumerator(name: "P_FIXED", value: -6)
!81 = !DIEnumerator(name: "D_FREE", value: 1)
!82 = !DIEnumerator(name: "D_ON_UPPER", value: 2)
!83 = !DIEnumerator(name: "D_ON_LOWER", value: 4)
!84 = !DIEnumerator(name: "D_ON_BOTH", value: 6)
!85 = !DIEnumerator(name: "D_UNDEFINED", value: 8)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VarStatus", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 165, size: 32, align: 32, elements: !87, identifier: "_ZTSN6soplex6SoPlex9VarStatusE")
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIEnumerator(name: "ON_UPPER", value: 0)
!89 = !DIEnumerator(name: "ON_LOWER", value: 1)
!90 = !DIEnumerator(name: "FIXED", value: 2)
!91 = !DIEnumerator(name: "ZERO", value: 3)
!92 = !DIEnumerator(name: "BASIC", value: 4)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SPxStatus", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 79, size: 32, align: 32, elements: !94, identifier: "_ZTSN6soplex8SPxBasis9SPxStatusE")
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102}
!95 = !DIEnumerator(name: "NO_PROBLEM", value: -2)
!96 = !DIEnumerator(name: "SINGULAR", value: -1)
!97 = !DIEnumerator(name: "REGULAR", value: 0)
!98 = !DIEnumerator(name: "DUAL", value: 1)
!99 = !DIEnumerator(name: "PRIMAL", value: 2)
!100 = !DIEnumerator(name: "OPTIMAL", value: 3)
!101 = !DIEnumerator(name: "UNBOUNDED", value: 4)
!102 = !DIEnumerator(name: "INFEASIBLE", value: 5)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Section", scope: !"_ZTSN6soplex8MPSInputE", file: !104, line: 34, size: 32, align: 32, elements: !105, identifier: "_ZTSN6soplex8MPSInput7SectionE")
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/mpsinput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIEnumerator(name: "NAME", value: 0)
!107 = !DIEnumerator(name: "OBJSEN", value: 1)
!108 = !DIEnumerator(name: "OBJNAME", value: 2)
!109 = !DIEnumerator(name: "ROWS", value: 3)
!110 = !DIEnumerator(name: "COLUMNS", value: 4)
!111 = !DIEnumerator(name: "RHS", value: 5)
!112 = !DIEnumerator(name: "RANGES", value: 6)
!113 = !DIEnumerator(name: "BOUNDS", value: 7)
!114 = !DIEnumerator(name: "ENDATA", value: 8)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !116, line: 87, size: 32, align: 32, elements: !117, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "FREE", value: 0)
!119 = !DIEnumerator(name: "RELEASED", value: 1)
!120 = !DIEnumerator(name: "USED", value: 2)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !122, line: 1280, size: 32, align: 32, elements: !123, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!122 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!123 = !{!124}
!124 = !DIEnumerator(name: "__short_mask", value: 1)
!125 = !{!126, !183, !187, !188, !195, !202, !217, !222, !226, !230, !435, !980, !1254, !1390, !1516, !1599, !1686, !1690, !1765, !1886, !1936, !1981, !2097, !2124, !2128, !2155, !2197, !2254, !2299, !3, !2350, !2478, !10, !2515, !2528, !15, !2567, !2580, !2743, !2793, !2869, !21, !3017, !3092, !3093, !3449, !3486, !3490, !3500, !3555, !3558, !3563, !3568, !3572, !3615, !3619, !3621, !3631, !3636, !3637, !3640, !3643, !3656, !3667, !3674, !3678, !3682, !3719, !3722, !3724, !3725, !3726, !3727, !3729, !3740, !3769, !3790, !3807, !3909, !4014, !27, !4015, !4103, !4214, !4218, !4279, !4297, !4377, !4385, !32, !37, !41, !4417, !45, !51, !4456, !4514, !4537, !4580, !4581, !4582, !4583, !4584, !4585, !66, !4651, !4693, !74, !86, !4770, !4847, !93, !4926, !4927, !103, !250, !4998, !115, !133, !150, !4698, !4999, !5023, !5054, !5060, !5061, !5078, !244, !121, !5081, !5091, !5095, !166, !2591, !2686, !5096, !5167, !4775, !4603}
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !127, line: 122, size: 1216, align: 64, elements: !128, identifier: "_ZTS7__sFILE")
!127 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!128 = !{!129, !132, !134, !135, !137, !138, !139, !140, !142, !146, !152, !162, !168, !169, !171, !172, !176, !180, !181, !182}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !127, line: 123, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !127, line: 124, baseType: !133, size: 32, align: 32, offset: 64)
!133 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !127, line: 125, baseType: !133, size: 32, align: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !127, line: 126, baseType: !136, size: 16, align: 16, offset: 128)
!136 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !127, line: 127, baseType: !136, size: 16, align: 16, offset: 144)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !127, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !127, line: 129, baseType: !133, size: 32, align: 32, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !127, line: 132, baseType: !141, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !127, line: 133, baseType: !143, size: 64, align: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!133, !141}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !127, line: 134, baseType: !147, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!133, !141, !150, !133}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !127, line: 135, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !141, !156, !133}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !127, line: 77, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !158, line: 71, baseType: !159)
!158 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !160, line: 46, baseType: !161)
!160 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !127, line: 136, baseType: !163, size: 64, align: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!133, !141, !166, !133}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !127, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !127, line: 140, baseType: !170, size: 64, align: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !127, line: 141, baseType: !133, size: 32, align: 32, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !127, line: 144, baseType: !173, size: 24, align: 8, offset: 928)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 24, align: 8, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 3)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !127, line: 145, baseType: !177, size: 8, align: 8, offset: 952)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 8, align: 8, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 1)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !127, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !127, line: 151, baseType: !133, size: 32, align: 32, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !127, line: 152, baseType: !156, size: 64, align: 64, offset: 1152)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !127, line: 88, size: 128, align: 64, elements: !184, identifier: "_ZTS6__sbuf")
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !127, line: 89, baseType: !130, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !127, line: 90, baseType: !133, size: 32, align: 32, offset: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !127, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !189, identifier: "_ZTS13__va_list_tag")
!189 = !{!190, !192, !193, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !191, size: 32, align: 32)
!191 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !191, size: 32, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !141, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !141, size: 64, align: 64, offset: 128)
!195 = !DICompositeType(tag: DW_TAG_union_type, file: !160, line: 76, size: 1024, align: 64, elements: !196, identifier: "_ZTS11__mbstate_t")
!196 = !{!197, !201}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !160, line: 77, baseType: !198, size: 1024, align: 8)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 1024, align: 8, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !160, line: 78, baseType: !161, size: 64, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !203, line: 73, size: 448, align: 64, elements: !204, identifier: "_ZTS2tm")
!203 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !216}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !203, line: 74, baseType: !133, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !203, line: 75, baseType: !133, size: 32, align: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !203, line: 76, baseType: !133, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !203, line: 77, baseType: !133, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !203, line: 78, baseType: !133, size: 32, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !203, line: 79, baseType: !133, size: 32, align: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !203, line: 80, baseType: !133, size: 32, align: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !203, line: 81, baseType: !133, size: 32, align: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !203, line: 82, baseType: !133, size: 32, align: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !203, line: 83, baseType: !215, size: 64, align: 64, offset: 320)
!215 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !203, line: 84, baseType: !150, size: 64, align: 64, offset: 384)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 82, size: 64, align: 32, elements: !219, identifier: "_ZTS5div_t")
!218 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !218, line: 83, baseType: !133, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !218, line: 84, baseType: !133, size: 32, align: 32, offset: 32)
!222 = !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 87, size: 128, align: 64, elements: !223, identifier: "_ZTS6ldiv_t")
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !218, line: 88, baseType: !215, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !218, line: 89, baseType: !215, size: 64, align: 64, offset: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 93, size: 128, align: 64, elements: !227, identifier: "_ZTS7lldiv_t")
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !218, line: 94, baseType: !161, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !218, line: 95, baseType: !161, size: 64, align: 64, offset: 64)
!230 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxBasis", scope: !231, file: !75, line: 71, size: 1664, align: 64, elements: !233, vtableHolder: !"_ZTSN6soplex8SPxBasisE", identifier: "_ZTSN6soplex8SPxBasisE")
!231 = !DINamespace(name: "soplex", scope: null, file: !232, line: 49)
!232 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!233 = !{!234, !239, !241, !242, !243, !245, !247, !248, !249, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !267, !271, !276, !280, !283, !288, !289, !294, !299, !303, !306, !311, !314, !315, !318, !319, !320, !323, !327, !328, !331, !334, !338, !341, !344, !349, !352, !355, !358, !359, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !374, !375, !379, !380, !381, !382, !383, !384, !387, !393, !404, !409, !412, !415, !418, !421, !422, !423, !426, !427, !428, !429, !430, !433, !434}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxBasis", scope: !75, file: !75, baseType: !235, size: 64, flags: DIFlagArtificial)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!133}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "theLP", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 296, baseType: !240, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "theBaseId", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 307, baseType: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", size: 192, align: 64, offset: 128, flags: DIFlagProtected)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 310, baseType: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", size: 192, align: 64, offset: 320, flags: DIFlagProtected)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "matrixIsSetup", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 313, baseType: !244, size: 8, align: 8, offset: 512, flags: DIFlagProtected)
!244 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 318, baseType: !246, size: 64, align: 64, offset: 576, flags: DIFlagProtected)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "factorized", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 319, baseType: !244, size: 8, align: 8, offset: 640, flags: DIFlagProtected)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "maxUpdates", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 328, baseType: !133, size: 32, align: 32, offset: 672, flags: DIFlagProtected)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nonzeroFactor", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 335, baseType: !250, size: 64, align: 64, offset: 704, flags: DIFlagProtected)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !231, file: !232, line: 127, baseType: !251)
!251 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "iterCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 341, baseType: !133, size: 32, align: 32, offset: 768, flags: DIFlagProtected)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "updateCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 342, baseType: !133, size: 32, align: 32, offset: 800, flags: DIFlagProtected)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nzCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 343, baseType: !133, size: 32, align: 32, offset: 832, flags: DIFlagProtected)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nzFac", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 344, baseType: !250, size: 64, align: 64, offset: 896, flags: DIFlagProtected)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lastFill", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 345, baseType: !250, size: 64, align: 64, offset: 960, flags: DIFlagProtected)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lastin", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 347, baseType: !"_ZTSN6soplex5SPxIdE", size: 32, align: 32, offset: 1024, flags: DIFlagProtected)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lastout", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 348, baseType: !"_ZTSN6soplex5SPxIdE", size: 32, align: 32, offset: 1056, flags: DIFlagProtected)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 349, baseType: !133, size: 32, align: 32, offset: 1088, flags: DIFlagProtected)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "thestatus", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 352, baseType: !"_ZTSN6soplex8SPxBasis9SPxStatusE", size: 32, align: 32, offset: 1120)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "thedesc", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 353, baseType: !"_ZTSN6soplex8SPxBasis4DescE", size: 512, align: 64, offset: 1152)
!262 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex8SPxBasis6statusEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 359, type: !263, isLocal: false, isDefinition: false, scopeLine: 359, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!"_ZTSN6soplex8SPxBasis9SPxStatusE", !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!267 = !DISubprogram(name: "setStatus", linkageName: "_ZN6soplex8SPxBasis9setStatusENS0_9SPxStatusE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 365, type: !268, isLocal: false, isDefinition: false, scopeLine: 365, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !270, !"_ZTSN6soplex8SPxBasis9SPxStatusE"}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SPxBasisE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!271 = !DISubprogram(name: "desc", linkageName: "_ZNK6soplex8SPxBasis4descEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 377, type: !272, isLocal: false, isDefinition: false, scopeLine: 377, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !265}
!274 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!276 = !DISubprogram(name: "desc", linkageName: "_ZN6soplex8SPxBasis4descEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 382, type: !277, isLocal: false, isDefinition: false, scopeLine: 382, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !270}
!279 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!280 = !DISubprogram(name: "dualColStatus", linkageName: "_ZNK6soplex8SPxBasis13dualColStatusEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 388, type: !281, isLocal: false, isDefinition: false, scopeLine: 388, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !265, !133}
!283 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_8SPxColIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 391, type: !284, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !265, !286}
!286 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!288 = !DISubprogram(name: "dualRowStatus", linkageName: "_ZNK6soplex8SPxBasis13dualRowStatusEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 394, type: !281, isLocal: false, isDefinition: false, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!289 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 397, type: !290, isLocal: false, isDefinition: false, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !265, !292}
!292 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!294 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_5SPxIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 404, type: !295, isLocal: false, isDefinition: false, scopeLine: 404, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !265, !297}
!297 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!299 = !DISubprogram(name: "baseId", linkageName: "_ZN6soplex8SPxBasis6baseIdEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 416, type: !300, isLocal: false, isDefinition: false, scopeLine: 416, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !270, !133}
!302 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SPxIdE")
!303 = !DISubprogram(name: "baseId", linkageName: "_ZNK6soplex8SPxBasis6baseIdEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 421, type: !304, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!"_ZTSN6soplex5SPxIdE", !265, !133}
!306 = !DISubprogram(name: "baseVec", linkageName: "_ZNK6soplex8SPxBasis7baseVecEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 427, type: !307, isLocal: false, isDefinition: false, scopeLine: 427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !265, !133}
!309 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!311 = !DISubprogram(name: "lastEntered", linkageName: "_ZNK6soplex8SPxBasis11lastEnteredEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 434, type: !312, isLocal: false, isDefinition: false, scopeLine: 434, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{!"_ZTSN6soplex5SPxIdE", !265}
!314 = !DISubprogram(name: "lastLeft", linkageName: "_ZNK6soplex8SPxBasis8lastLeftEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 440, type: !312, isLocal: false, isDefinition: false, scopeLine: 440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!315 = !DISubprogram(name: "lastIndex", linkageName: "_ZNK6soplex8SPxBasis9lastIndexEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 446, type: !316, isLocal: false, isDefinition: false, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!316 = !DISubroutineType(types: !317)
!317 = !{!133, !265}
!318 = !DISubprogram(name: "lastUpdate", linkageName: "_ZNK6soplex8SPxBasis10lastUpdateEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 452, type: !316, isLocal: false, isDefinition: false, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!319 = !DISubprogram(name: "iteration", linkageName: "_ZNK6soplex8SPxBasis9iterationEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 458, type: !316, isLocal: false, isDefinition: false, scopeLine: 458, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubprogram(name: "solver", linkageName: "_ZNK6soplex8SPxBasis6solverEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 464, type: !321, isLocal: false, isDefinition: false, scopeLine: 464, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{!240, !265}
!323 = !DISubprogram(name: "multBaseWith", linkageName: "_ZNK6soplex8SPxBasis12multBaseWithERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 481, type: !324, isLocal: false, isDefinition: false, scopeLine: 481, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !265, !326}
!326 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!327 = !DISubprogram(name: "multWithBase", linkageName: "_ZNK6soplex8SPxBasis12multWithBaseERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 492, type: !324, isLocal: false, isDefinition: false, scopeLine: 492, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!328 = !DISubprogram(name: "stability", linkageName: "_ZNK6soplex8SPxBasis9stabilityEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 495, type: !329, isLocal: false, isDefinition: false, scopeLine: 495, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{!250, !265}
!331 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_6VectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 502, type: !332, isLocal: false, isDefinition: false, scopeLine: 502, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !270, !326, !326}
!334 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 509, type: !335, isLocal: false, isDefinition: false, scopeLine: 509, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !270, !326, !337}
!337 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!338 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 516, type: !339, isLocal: false, isDefinition: false, scopeLine: 516, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !270, !337, !326}
!341 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_8SSVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 523, type: !342, isLocal: false, isDefinition: false, scopeLine: 523, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !270, !337, !337}
!344 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_6VectorERKS1_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 530, type: !345, isLocal: false, isDefinition: false, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !270, !326, !347}
!347 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!349 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 537, type: !350, isLocal: false, isDefinition: false, scopeLine: 537, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !270, !326, !309}
!352 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 544, type: !353, isLocal: false, isDefinition: false, scopeLine: 544, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !270, !337, !309}
!355 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 551, type: !356, isLocal: false, isDefinition: false, scopeLine: 551, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !270, !337, !347}
!358 = !DISubprogram(name: "solve4update", linkageName: "_ZN6soplex8SPxBasis12solve4updateERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 567, type: !353, isLocal: false, isDefinition: false, scopeLine: 567, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubprogram(name: "solve4update", linkageName: "_ZN6soplex8SPxBasis12solve4updateERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 574, type: !360, isLocal: false, isDefinition: false, scopeLine: 574, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !270, !337, !326, !309, !337}
!362 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_6VectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 586, type: !332, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 593, type: !335, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 600, type: !339, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_8SSVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 607, type: !342, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_6VectorERKS1_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 614, type: !345, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!367 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 621, type: !350, isLocal: false, isDefinition: false, scopeLine: 621, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 628, type: !353, isLocal: false, isDefinition: false, scopeLine: 628, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 648, type: !356, isLocal: false, isDefinition: false, scopeLine: 648, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!370 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 656, type: !360, isLocal: false, isDefinition: false, scopeLine: 656, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!371 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex8SPxBasis9addedRowsEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 671, type: !372, isLocal: false, isDefinition: false, scopeLine: 671, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !270, !133}
!374 = !DISubprogram(name: "removedRow", linkageName: "_ZN6soplex8SPxBasis10removedRowEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 673, type: !372, isLocal: false, isDefinition: false, scopeLine: 673, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!375 = !DISubprogram(name: "removedRows", linkageName: "_ZN6soplex8SPxBasis11removedRowsEPi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 676, type: !376, isLocal: false, isDefinition: false, scopeLine: 676, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !270, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!379 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex8SPxBasis9addedColsEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 678, type: !372, isLocal: false, isDefinition: false, scopeLine: 678, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!380 = !DISubprogram(name: "removedCol", linkageName: "_ZN6soplex8SPxBasis10removedColEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 680, type: !372, isLocal: false, isDefinition: false, scopeLine: 680, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!381 = !DISubprogram(name: "removedCols", linkageName: "_ZN6soplex8SPxBasis11removedColsEPi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 683, type: !376, isLocal: false, isDefinition: false, scopeLine: 683, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubprogram(name: "changedRow", linkageName: "_ZN6soplex8SPxBasis10changedRowEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 685, type: !372, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!383 = !DISubprogram(name: "changedCol", linkageName: "_ZN6soplex8SPxBasis10changedColEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 687, type: !372, isLocal: false, isDefinition: false, scopeLine: 687, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DISubprogram(name: "changedElement", linkageName: "_ZN6soplex8SPxBasis14changedElementEii", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 689, type: !385, isLocal: false, isDefinition: false, scopeLine: 689, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !270, !133, !133}
!387 = !DISubprogram(name: "change", linkageName: "_ZN6soplex8SPxBasis6changeEiRNS_5SPxIdEPKNS_7SVectorEPKNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 723, type: !388, isLocal: false, isDefinition: false, scopeLine: 723, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !270, !133, !302, !390, !391}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!393 = !DISubprogram(name: "readBasis", linkageName: "_ZN6soplex8SPxBasis9readBasisERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEERKNS_7NameSetES9_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 727, type: !394, isLocal: false, isDefinition: false, scopeLine: 727, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{!244, !270, !396, !402, !402}
!396 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !399, file: !398, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!398 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!399 = !DINamespace(name: "__1", scope: !401, file: !400, line: 369)
!400 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!401 = !DINamespace(name: "std", scope: null, file: !400, line: 368)
!402 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!404 = !DISubprogram(name: "writeBasis", linkageName: "_ZN6soplex8SPxBasis10writeBasisERNSt3__113basic_ostreamIcNS1_11char_traitsIcEEEERKNS_7NameSetES9_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 731, type: !405, isLocal: false, isDefinition: false, scopeLine: 731, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !270, !407, !402, !402}
!407 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ostream", scope: !399, file: !398, line: 147, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!409 = !DISubprogram(name: "loadDesc", linkageName: "_ZN6soplex8SPxBasis8loadDescERKNS0_4DescE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 739, type: !410, isLocal: false, isDefinition: false, scopeLine: 739, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !270, !274}
!412 = !DISubprogram(name: "loadSolver", linkageName: "_ZN6soplex8SPxBasis10loadSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 742, type: !413, isLocal: false, isDefinition: false, scopeLine: 742, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !270, !246}
!415 = !DISubprogram(name: "load", linkageName: "_ZN6soplex8SPxBasis4loadEPNS_6SoPlexE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 748, type: !416, isLocal: false, isDefinition: false, scopeLine: 748, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !270, !240}
!418 = !DISubprogram(name: "unLoad", linkageName: "_ZN6soplex8SPxBasis6unLoadEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 751, type: !419, isLocal: false, isDefinition: false, scopeLine: 751, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !270}
!421 = !DISubprogram(name: "invalidate", linkageName: "_ZN6soplex8SPxBasis10invalidateEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 762, type: !419, isLocal: false, isDefinition: false, scopeLine: 762, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubprogram(name: "dump", linkageName: "_ZN6soplex8SPxBasis4dumpEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 765, type: !419, isLocal: false, isDefinition: false, scopeLine: 765, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SPxBasis12isConsistentEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 768, type: !424, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{!244, !265}
!426 = !DISubprogram(name: "SPxBasis", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 775, type: !419, isLocal: false, isDefinition: false, scopeLine: 775, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!427 = !DISubprogram(name: "~SPxBasis", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 778, type: !419, isLocal: false, isDefinition: false, scopeLine: 778, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubprogram(name: "loadMatrixVecs", linkageName: "_ZN6soplex8SPxBasis14loadMatrixVecsEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 788, type: !419, isLocal: false, isDefinition: false, scopeLine: 788, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!429 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SPxBasis5reDimEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 796, type: !419, isLocal: false, isDefinition: false, scopeLine: 796, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!430 = !DISubprogram(name: "doFactorize", linkageName: "_ZN6soplex8SPxBasis11doFactorizeEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 799, type: !431, isLocal: false, isDefinition: false, scopeLine: 799, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{!133, !270}
!433 = !DISubprogram(name: "factorize", linkageName: "_ZN6soplex8SPxBasis9factorizeEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 802, type: !419, isLocal: false, isDefinition: false, scopeLine: 802, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!434 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex8SPxBasis6setRepEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 805, type: !419, isLocal: false, isDefinition: false, scopeLine: 805, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!435 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !231, file: !33, line: 77, size: 12416, align: 64, elements: !436, vtableHolder: !"_ZTSN6soplex5SPxLPE", identifier: "_ZTSN6soplex6SoPlexE")
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !455, !457, !458, !459, !460, !461, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !480, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !497, !499, !501, !503, !505, !510, !513, !516, !519, !525, !530, !533, !536, !539, !542, !545, !548, !551, !554, !557, !560, !563, !566, !569, !570, !573, !576, !579, !582, !585, !586, !587, !588, !589, !592, !593, !594, !597, !598, !599, !602, !603, !604, !605, !606, !609, !610, !611, !614, !617, !620, !621, !622, !623, !624, !625, !626, !629, !632, !635, !636, !637, !640, !641, !642, !643, !644, !645, !648, !653, !656, !661, !664, !667, !670, !673, !674, !675, !678, !679, !682, !683, !686, !689, !692, !695, !696, !697, !698, !699, !700, !703, !704, !707, !708, !711, !714, !717, !718, !719, !720, !724, !727, !728, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !764, !765, !766, !770, !771, !772, !773, !774, !775, !780, !781, !786, !787, !790, !791, !792, !796, !800, !805, !810, !815, !820, !825, !826, !829, !832, !835, !836, !837, !838, !839, !840, !841, !844, !845, !846, !847, !848, !849, !850, !851, !852, !855, !856, !857, !858, !859, !860, !863, !869, !872, !875, !878, !881, !884, !887, !888, !889, !890, !891, !892, !893, !894, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !917, !920, !923, !924, !927, !928, !932, !937, !938, !939, !944, !949, !952, !953, !954, !955, !958, !959, !960, !961, !964, !967, !970, !971, !976, !979}
!437 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex5SPxLPE", flags: DIFlagPublic)
!438 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex8SPxBasisE", offset: 2816, flags: DIFlagProtected)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "theType", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 196, baseType: !"_ZTSN6soplex6SoPlex4TypeE", size: 32, align: 32, offset: 4480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "thePricing", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 197, baseType: !"_ZTSN6soplex6SoPlex7PricingE", size: 32, align: 32, offset: 4512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "therep", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 198, baseType: !"_ZTSN6soplex6SoPlex14RepresentationE", size: 32, align: 32, offset: 4544)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "theTime", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 199, baseType: !"_ZTSN6soplex5TimerE", size: 448, align: 64, offset: 4608)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "maxIters", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 200, baseType: !133, size: 32, align: 32, offset: 5056)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 201, baseType: !250, size: 64, align: 64, offset: 5120)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 202, baseType: !250, size: 64, align: 64, offset: 5184)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "m_status", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 203, baseType: !"_ZTSN6soplex6SoPlex6StatusE", size: 32, align: 32, offset: 5248)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 205, baseType: !250, size: 64, align: 64, offset: 5312)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "theShift", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 206, baseType: !250, size: 64, align: 64, offset: 5376)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lastShift", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 207, baseType: !250, size: 64, align: 64, offset: 5440)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 208, baseType: !133, size: 32, align: 32, offset: 5504)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "m_numCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 209, baseType: !133, size: 32, align: 32, offset: 5536)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 210, baseType: !244, size: 8, align: 8, offset: 5568)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 212, baseType: !454, size: 64, align: 64, offset: 5632)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 213, baseType: !456, size: 64, align: 64, offset: 5696)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 214, baseType: !454, size: 64, align: 64, offset: 5760)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 215, baseType: !456, size: 64, align: 64, offset: 5824)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cacheProductFactor", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 217, baseType: !250, size: 64, align: 64, offset: 5888)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "unitVecs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 220, baseType: !"_ZTSN6soplex5ArrayINS_10UnitVectorEEE", size: 128, align: 64, offset: 5952, flags: DIFlagProtected)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "thevectors", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 221, baseType: !462, size: 64, align: 64, offset: 6080, flags: DIFlagProtected)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thecovectors", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 222, baseType: !462, size: 64, align: 64, offset: 6144, flags: DIFlagProtected)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nNZEs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 224, baseType: !133, size: 32, align: 32, offset: 6208, flags: DIFlagProtected)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "coVecDim", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 225, baseType: !133, size: 32, align: 32, offset: 6240, flags: DIFlagProtected)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "primRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 227, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 6272, flags: DIFlagProtected)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "primVec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 228, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 6528, flags: DIFlagProtected)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dualRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 229, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 7360, flags: DIFlagProtected)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dualVec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 230, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 7616, flags: DIFlagProtected)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "addVec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 231, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 8448, flags: DIFlagProtected)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "theURbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 233, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9280, flags: DIFlagProtected)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "theLRbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 234, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9536, flags: DIFlagProtected)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "theUCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 235, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9792, flags: DIFlagProtected)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "theLCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 236, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10048, flags: DIFlagProtected)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "theUBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 243, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10304, flags: DIFlagProtected)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "theLBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 244, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10560, flags: DIFlagProtected)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "theFrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 246, baseType: !479, size: 64, align: 64, offset: 10816, flags: DIFlagProtected)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "theFvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 247, baseType: !481, size: 64, align: 64, offset: 10880, flags: DIFlagProtected)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 249, baseType: !479, size: 64, align: 64, offset: 10944, flags: DIFlagProtected)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 250, baseType: !481, size: 64, align: 64, offset: 11008, flags: DIFlagProtected)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "thePvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 251, baseType: !481, size: 64, align: 64, offset: 11072, flags: DIFlagProtected)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "theRPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 254, baseType: !481, size: 64, align: 64, offset: 11136, flags: DIFlagProtected)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "theCPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 256, baseType: !481, size: 64, align: 64, offset: 11200, flags: DIFlagProtected)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "theUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 260, baseType: !479, size: 64, align: 64, offset: 11264, flags: DIFlagProtected)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "theLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 261, baseType: !479, size: 64, align: 64, offset: 11328, flags: DIFlagProtected)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "theCoUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 262, baseType: !479, size: 64, align: 64, offset: 11392, flags: DIFlagProtected)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "theCoLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 263, baseType: !479, size: 64, align: 64, offset: 11456, flags: DIFlagProtected)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "theCoTest", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 266, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11520, flags: DIFlagProtected)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "theTest", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 267, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11776, flags: DIFlagProtected)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "leaveCount", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 269, baseType: !133, size: 32, align: 32, offset: 12032, flags: DIFlagProtected)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "enterCount", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 270, baseType: !133, size: 32, align: 32, offset: 12064, flags: DIFlagProtected)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "thepricer", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 272, baseType: !496, size: 64, align: 64, offset: 12096, flags: DIFlagProtected)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "theratiotester", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 273, baseType: !498, size: 64, align: 64, offset: 12160, flags: DIFlagProtected)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "thestarter", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 274, baseType: !500, size: 64, align: 64, offset: 12224, flags: DIFlagProtected)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "thescaler", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 275, baseType: !502, size: 64, align: 64, offset: 12288, flags: DIFlagProtected)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxScalerE", size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "thesimplifier", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 276, baseType: !504, size: 64, align: 64, offset: 12352, flags: DIFlagProtected)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex13SPxSimplifierE", size: 64, align: 64)
!505 = !DISubprogram(name: "version", linkageName: "_ZNK6soplex6SoPlex7versionEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 280, type: !506, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{!133, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6SoPlexE")
!510 = !DISubprogram(name: "rep", linkageName: "_ZNK6soplex6SoPlex3repEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 285, type: !511, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubroutineType(types: !512)
!512 = !{!"_ZTSN6soplex6SoPlex14RepresentationE", !508}
!513 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex6SoPlex4typeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 291, type: !514, isLocal: false, isDefinition: false, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{!"_ZTSN6soplex6SoPlex4TypeE", !508}
!516 = !DISubprogram(name: "pricing", linkageName: "_ZNK6soplex6SoPlex7pricingEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 297, type: !517, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubroutineType(types: !518)
!518 = !{!"_ZTSN6soplex6SoPlex7PricingE", !508}
!519 = !DISubprogram(name: "read", linkageName: "_ZN6soplex6SoPlex4readERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEEPNS_7NameSetES8_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 329, type: !520, isLocal: false, isDefinition: false, scopeLine: 329, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubroutineType(types: !521)
!521 = !{!244, !522, !396, !523, !523, !524}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7NameSetE", size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64)
!525 = !DISubprogram(name: "loadLP", linkageName: "_ZN6soplex6SoPlex6loadLPERKNS_5SPxLPE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 333, type: !526, isLocal: false, isDefinition: false, scopeLine: 333, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !522, !528}
!528 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxLPE")
!530 = !DISubprogram(name: "setSolver", linkageName: "_ZN6soplex6SoPlex9setSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 335, type: !531, isLocal: false, isDefinition: false, scopeLine: 335, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !522, !246}
!533 = !DISubprogram(name: "setPricer", linkageName: "_ZN6soplex6SoPlex9setPricerEPNS_9SPxPricerE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 337, type: !534, isLocal: false, isDefinition: false, scopeLine: 337, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !522, !496}
!536 = !DISubprogram(name: "setTester", linkageName: "_ZN6soplex6SoPlex9setTesterEPNS_14SPxRatioTesterE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 339, type: !537, isLocal: false, isDefinition: false, scopeLine: 339, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !522, !498}
!539 = !DISubprogram(name: "setStarter", linkageName: "_ZN6soplex6SoPlex10setStarterEPNS_10SPxStarterE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 341, type: !540, isLocal: false, isDefinition: false, scopeLine: 341, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !522, !500}
!542 = !DISubprogram(name: "setScaler", linkageName: "_ZN6soplex6SoPlex9setScalerEPNS_9SPxScalerE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 343, type: !543, isLocal: false, isDefinition: false, scopeLine: 343, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !522, !502}
!545 = !DISubprogram(name: "setSimplifier", linkageName: "_ZN6soplex6SoPlex13setSimplifierEPNS_13SPxSimplifierE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 345, type: !546, isLocal: false, isDefinition: false, scopeLine: 345, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !522, !504}
!548 = !DISubprogram(name: "loadBasis", linkageName: "_ZN6soplex6SoPlex9loadBasisERKNS_8SPxBasis4DescE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 347, type: !549, isLocal: false, isDefinition: false, scopeLine: 347, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !522, !274}
!551 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex6SoPlex6setRepENS0_14RepresentationE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 350, type: !552, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !522, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!554 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex6SoPlex7setTypeENS0_4TypeE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 352, type: !555, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !522, !"_ZTSN6soplex6SoPlex4TypeE"}
!557 = !DISubprogram(name: "setPricing", linkageName: "_ZN6soplex6SoPlex10setPricingENS0_7PricingE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 354, type: !558, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !522, !"_ZTSN6soplex6SoPlex7PricingE"}
!560 = !DISubprogram(name: "reLoad", linkageName: "_ZN6soplex6SoPlex6reLoadEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 357, type: !561, isLocal: false, isDefinition: false, scopeLine: 357, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !522}
!563 = !DISubprogram(name: "readFile", linkageName: "_ZN6soplex6SoPlex8readFileEPKcPNS_7NameSetES4_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 360, type: !564, isLocal: false, isDefinition: false, scopeLine: 360, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!564 = !DISubroutineType(types: !565)
!565 = !{!244, !522, !166, !523, !523, !524}
!566 = !DISubprogram(name: "dumpFile", linkageName: "_ZNK6soplex6SoPlex8dumpFileEPKc", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 364, type: !567, isLocal: false, isDefinition: false, scopeLine: 364, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !508, !166}
!569 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6SoPlex5clearEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 367, type: !561, isLocal: false, isDefinition: false, scopeLine: 367, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubprogram(name: "readBasisFile", linkageName: "_ZN6soplex6SoPlex13readBasisFileEPKcRKNS_7NameSetES5_", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 370, type: !571, isLocal: false, isDefinition: false, scopeLine: 370, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{!244, !522, !166, !402, !402}
!573 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex6SoPlex5solveEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 383, type: !574, isLocal: false, isDefinition: false, scopeLine: 383, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubroutineType(types: !575)
!575 = !{!"_ZTSN6soplex6SoPlex6StatusE", !522}
!576 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex6SoPlex6statusEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 386, type: !577, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!577 = !DISubroutineType(types: !578)
!578 = !{!"_ZTSN6soplex6SoPlex6StatusE", !508}
!579 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex6SoPlex5valueEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 392, type: !580, isLocal: false, isDefinition: false, scopeLine: 392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!580 = !DISubroutineType(types: !581)
!581 = !{!250, !508}
!582 = !DISubprogram(name: "getPrimal", linkageName: "_ZNK6soplex6SoPlex9getPrimalERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 401, type: !583, isLocal: false, isDefinition: false, scopeLine: 401, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{!"_ZTSN6soplex6SoPlex6StatusE", !508, !326}
!585 = !DISubprogram(name: "getPrimalUnscaled", linkageName: "_ZNK6soplex6SoPlex17getPrimalUnscaledERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 406, type: !583, isLocal: false, isDefinition: false, scopeLine: 406, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubprogram(name: "getSlacks", linkageName: "_ZNK6soplex6SoPlex9getSlacksERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 421, type: !583, isLocal: false, isDefinition: false, scopeLine: 421, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubprogram(name: "getDual", linkageName: "_ZNK6soplex6SoPlex7getDualERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 447, type: !583, isLocal: false, isDefinition: false, scopeLine: 447, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubprogram(name: "getRdCost", linkageName: "_ZNK6soplex6SoPlex9getRdCostERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 460, type: !583, isLocal: false, isDefinition: false, scopeLine: 460, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubprogram(name: "terminate", linkageName: "_ZN6soplex6SoPlex9terminateEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 478, type: !590, isLocal: false, isDefinition: false, scopeLine: 478, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{!244, !522}
!592 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex6SoPlex7epsilonEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 487, type: !580, isLocal: false, isDefinition: false, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex6SoPlex5deltaEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 496, type: !580, isLocal: false, isDefinition: false, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubprogram(name: "setDelta", linkageName: "_ZN6soplex6SoPlex8setDeltaEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 501, type: !595, isLocal: false, isDefinition: false, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !522, !250}
!597 = !DISubprogram(name: "maxCycle", linkageName: "_ZNK6soplex6SoPlex8maxCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 514, type: !506, isLocal: false, isDefinition: false, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubprogram(name: "numCycle", linkageName: "_ZNK6soplex6SoPlex8numCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 519, type: !506, isLocal: false, isDefinition: false, scopeLine: 519, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "localAddRows", linkageName: "_ZN6soplex6SoPlex12localAddRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 533, type: !600, isLocal: false, isDefinition: false, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !522, !133}
!602 = !DISubprogram(name: "localAddCols", linkageName: "_ZN6soplex6SoPlex12localAddColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 535, type: !600, isLocal: false, isDefinition: false, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex6SoPlex9addedRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 539, type: !600, isLocal: false, isDefinition: false, scopeLine: 539, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 57, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex6SoPlex9addedColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 541, type: !600, isLocal: false, isDefinition: false, scopeLine: 541, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 58, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "doRemoveRow", linkageName: "_ZN6soplex6SoPlex11doRemoveRowEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 544, type: !600, isLocal: false, isDefinition: false, scopeLine: 544, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 53, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!606 = !DISubprogram(name: "doRemoveRows", linkageName: "_ZN6soplex6SoPlex12doRemoveRowsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 546, type: !607, isLocal: false, isDefinition: false, scopeLine: 546, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 55, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !522, !378}
!609 = !DISubprogram(name: "doRemoveCol", linkageName: "_ZN6soplex6SoPlex11doRemoveColEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 548, type: !600, isLocal: false, isDefinition: false, scopeLine: 548, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 56, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!610 = !DISubprogram(name: "doRemoveCols", linkageName: "_ZN6soplex6SoPlex12doRemoveColsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 550, type: !607, isLocal: false, isDefinition: false, scopeLine: 550, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 54, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!611 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 554, type: !612, isLocal: false, isDefinition: false, scopeLine: 554, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !522, !347}
!614 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 556, type: !615, isLocal: false, isDefinition: false, scopeLine: 556, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !522, !133, !250}
!617 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 558, type: !618, isLocal: false, isDefinition: false, scopeLine: 558, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !522, !"_ZTSN6soplex8SPxColIdE", !250}
!620 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 563, type: !612, isLocal: false, isDefinition: false, scopeLine: 563, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 565, type: !615, isLocal: false, isDefinition: false, scopeLine: 565, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 567, type: !618, isLocal: false, isDefinition: false, scopeLine: 567, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 572, type: !612, isLocal: false, isDefinition: false, scopeLine: 572, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 574, type: !615, isLocal: false, isDefinition: false, scopeLine: 574, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 32, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 576, type: !618, isLocal: false, isDefinition: false, scopeLine: 576, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!626 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 581, type: !627, isLocal: false, isDefinition: false, scopeLine: 581, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !522, !347, !347}
!629 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 583, type: !630, isLocal: false, isDefinition: false, scopeLine: 583, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !522, !133, !250, !250}
!632 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsENS_8SPxColIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 585, type: !633, isLocal: false, isDefinition: false, scopeLine: 585, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !522, !"_ZTSN6soplex8SPxColIdE", !250, !250}
!635 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 591, type: !612, isLocal: false, isDefinition: false, scopeLine: 591, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!636 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 593, type: !615, isLocal: false, isDefinition: false, scopeLine: 593, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 595, type: !638, isLocal: false, isDefinition: false, scopeLine: 595, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !522, !"_ZTSN6soplex8SPxRowIdE", !250}
!640 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 600, type: !612, isLocal: false, isDefinition: false, scopeLine: 600, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 40, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!641 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 602, type: !615, isLocal: false, isDefinition: false, scopeLine: 602, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 604, type: !638, isLocal: false, isDefinition: false, scopeLine: 604, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 42, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 609, type: !627, isLocal: false, isDefinition: false, scopeLine: 609, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!644 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 611, type: !630, isLocal: false, isDefinition: false, scopeLine: 611, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeENS_8SPxRowIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 613, type: !646, isLocal: false, isDefinition: false, scopeLine: 613, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !522, !"_ZTSN6soplex8SPxRowIdE", !250, !250}
!648 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowEiRKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 619, type: !649, isLocal: false, isDefinition: false, scopeLine: 619, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !522, !133, !651}
!651 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPRowE")
!653 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowENS_8SPxRowIdERKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 621, type: !654, isLocal: false, isDefinition: false, scopeLine: 621, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !522, !"_ZTSN6soplex8SPxRowIdE", !651}
!656 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColEiRKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 626, type: !657, isLocal: false, isDefinition: false, scopeLine: 626, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !522, !133, !659}
!659 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!661 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColENS_8SPxColIdERKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 628, type: !662, isLocal: false, isDefinition: false, scopeLine: 628, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !522, !"_ZTSN6soplex8SPxColIdE", !659}
!664 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementEiid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 633, type: !665, isLocal: false, isDefinition: false, scopeLine: 633, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !522, !133, !133, !250}
!667 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementENS_8SPxRowIdENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 635, type: !668, isLocal: false, isDefinition: false, scopeLine: 635, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !522, !"_ZTSN6soplex8SPxRowIdE", !"_ZTSN6soplex8SPxColIdE", !250}
!670 = !DISubprogram(name: "changeSense", linkageName: "_ZN6soplex6SoPlex11changeSenseENS_5SPxLP8SPxSenseE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 641, type: !671, isLocal: false, isDefinition: false, scopeLine: 641, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !522, !"_ZTSN6soplex5SPxLP8SPxSenseE"}
!673 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6SoPlex3dimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 645, type: !506, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubprogram(name: "coDim", linkageName: "_ZNK6soplex6SoPlex5coDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 650, type: !506, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubprogram(name: "id", linkageName: "_ZNK6soplex6SoPlex2idEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 666, type: !676, isLocal: false, isDefinition: false, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!676 = !DISubroutineType(types: !677)
!677 = !{!"_ZTSN6soplex5SPxIdE", !508, !133}
!678 = !DISubprogram(name: "coId", linkageName: "_ZNK6soplex6SoPlex4coIdEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 685, type: !676, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubprogram(name: "isId", linkageName: "_ZNK6soplex6SoPlex4isIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 703, type: !680, isLocal: false, isDefinition: false, scopeLine: 703, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!680 = !DISubroutineType(types: !681)
!681 = !{!133, !508, !"_ZTSN6soplex5SPxIdE"}
!682 = !DISubprogram(name: "isCoId", linkageName: "_ZNK6soplex6SoPlex6isCoIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 712, type: !680, isLocal: false, isDefinition: false, scopeLine: 712, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!683 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 724, type: !684, isLocal: false, isDefinition: false, scopeLine: 724, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubroutineType(types: !685)
!685 = !{!309, !508, !133}
!686 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 730, type: !687, isLocal: false, isDefinition: false, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!687 = !DISubroutineType(types: !688)
!688 = !{!309, !508, !292}
!689 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 738, type: !690, isLocal: false, isDefinition: false, scopeLine: 738, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{!309, !508, !286}
!692 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 755, type: !693, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubroutineType(types: !694)
!694 = !{!309, !508, !297}
!695 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 768, type: !684, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 773, type: !687, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!697 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 781, type: !690, isLocal: false, isDefinition: false, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!698 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 795, type: !693, isLocal: false, isDefinition: false, scopeLine: 795, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!699 = !DISubprogram(name: "unitVector", linkageName: "_ZNK6soplex6SoPlex10unitVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 803, type: !684, isLocal: false, isDefinition: false, scopeLine: 803, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubprogram(name: "varStatus", linkageName: "_ZNK6soplex6SoPlex9varStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 816, type: !701, isLocal: false, isDefinition: false, scopeLine: 816, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!701 = !DISubroutineType(types: !702)
!702 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !508, !133}
!703 = !DISubprogram(name: "covarStatus", linkageName: "_ZNK6soplex6SoPlex11covarStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 822, type: !701, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 828, type: !705, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubroutineType(types: !706)
!706 = !{!133, !508, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!707 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 834, type: !680, isLocal: false, isDefinition: false, scopeLine: 834, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 843, type: !709, isLocal: false, isDefinition: false, scopeLine: 843, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{!133, !508, !"_ZTSN6soplex8SPxRowIdE"}
!711 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 849, type: !712, isLocal: false, isDefinition: false, scopeLine: 849, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!712 = !DISubroutineType(types: !713)
!713 = !{!133, !508, !"_ZTSN6soplex8SPxColIdE"}
!714 = !DISubprogram(name: "isRowBasic", linkageName: "_ZNK6soplex6SoPlex10isRowBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 855, type: !715, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!715 = !DISubroutineType(types: !716)
!716 = !{!133, !508, !133}
!717 = !DISubprogram(name: "isColBasic", linkageName: "_ZNK6soplex6SoPlex10isColBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 861, type: !715, isLocal: false, isDefinition: false, scopeLine: 861, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!718 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 867, type: !715, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!719 = !DISubprogram(name: "isCoBasic", linkageName: "_ZNK6soplex6SoPlex9isCoBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 873, type: !715, isLocal: false, isDefinition: false, scopeLine: 873, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!720 = !DISubprogram(name: "fVec", linkageName: "_ZNK6soplex6SoPlex4fVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 888, type: !721, isLocal: false, isDefinition: false, scopeLine: 888, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !508}
!723 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!724 = !DISubprogram(name: "fRhs", linkageName: "_ZNK6soplex6SoPlex4fRhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 901, type: !725, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!725 = !DISubroutineType(types: !726)
!726 = !{!347, !508}
!727 = !DISubprogram(name: "ubBound", linkageName: "_ZNK6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 906, type: !725, isLocal: false, isDefinition: false, scopeLine: 906, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
