; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxchangebasis.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::SPxBasis" = type { i32 (...)**, %"class.soplex::SoPlex"*, %"class.soplex::DataArray", %"class.soplex::DataArray.0", i8, %"class.soplex::SLinSolver"*, i8, i32, double, i32, i32, i32, double, double, %"class.soplex::SPxId", %"class.soplex::SPxId", i32, i32, %"class.soplex::SPxBasis::Desc" }

!57 = !DIEnumerator(name: "ABORT_VALUE", value: -5)
!58 = !DIEnumerator(name: "SINGULAR", value: -4)
!59 = !DIEnumerator(name: "NO_PROBLEM", value: -3)
!60 = !DIEnumerator(name: "REGULAR", value: -2)
!61 = !DIEnumerator(name: "RUNNING", value: -1)
!62 = !DIEnumerator(name: "UNKNOWN", value: 0)
!63 = !DIEnumerator(name: "OPTIMAL", value: 1)
!64 = !DIEnumerator(name: "UNBOUNDED", value: 2)
!65 = !DIEnumerator(name: "INFEASIBLE", value: 3)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex10SLinSolverE", file: !67, line: 50, size: 32, align: 32, elements: !68, identifier: "_ZTSN6soplex10SLinSolver6StatusE")
!67 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slinsolver.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !{!69, !70, !71, !72, !73}
!69 = !DIEnumerator(name: "OK", value: 0)
!70 = !DIEnumerator(name: "INSTABLE", value: 1)
!71 = !DIEnumerator(name: "SINGULAR", value: 2)
!72 = !DIEnumerator(name: "UNLOADED", value: 4)
!73 = !DIEnumerator(name: "ERROR", value: 8)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex8SPxBasis4DescE", file: !75, line: 170, size: 32, align: 32, elements: !76, identifier: "_ZTSN6soplex8SPxBasis4Desc6StatusE")
!75 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxbasis.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85}
!77 = !DIEnumerator(name: "P_ON_LOWER", value: -4)
!78 = !DIEnumerator(name: "P_ON_UPPER", value: -2)
!79 = !DIEnumerator(name: "P_FREE", value: -1)
!80 = !DIEnumerator(name: "P_FIXED", value: -6)
!81 = !DIEnumerator(name: "D_FREE", value: 1)
!82 = !DIEnumerator(name: "D_ON_UPPER", value: 2)
!83 = !DIEnumerator(name: "D_ON_LOWER", value: 4)
!84 = !DIEnumerator(name: "D_ON_BOTH", value: 6)
!85 = !DIEnumerator(name: "D_UNDEFINED", value: 8)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VarStatus", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 165, size: 32, align: 32, elements: !87, identifier: "_ZTSN6soplex6SoPlex9VarStatusE")
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIEnumerator(name: "ON_UPPER", value: 0)
!89 = !DIEnumerator(name: "ON_LOWER", value: 1)
!90 = !DIEnumerator(name: "FIXED", value: 2)
!91 = !DIEnumerator(name: "ZERO", value: 3)
!92 = !DIEnumerator(name: "BASIC", value: 4)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SPxStatus", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 79, size: 32, align: 32, elements: !94, identifier: "_ZTSN6soplex8SPxBasis9SPxStatusE")
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102}
!95 = !DIEnumerator(name: "NO_PROBLEM", value: -2)
!96 = !DIEnumerator(name: "SINGULAR", value: -1)
!97 = !DIEnumerator(name: "REGULAR", value: 0)
!98 = !DIEnumerator(name: "DUAL", value: 1)
!99 = !DIEnumerator(name: "PRIMAL", value: 2)
!100 = !DIEnumerator(name: "OPTIMAL", value: 3)
!101 = !DIEnumerator(name: "UNBOUNDED", value: 4)
!102 = !DIEnumerator(name: "INFEASIBLE", value: 5)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !104, line: 87, size: 32, align: 32, elements: !105, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "FREE", value: 0)
!107 = !DIEnumerator(name: "RELEASED", value: 1)
!108 = !DIEnumerator(name: "USED", value: 2)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !110, line: 1280, size: 32, align: 32, elements: !111, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!110 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !{!112}
!112 = !DIEnumerator(name: "__short_mask", value: 1)
!113 = !{!114, !171, !175, !176, !183, !190, !205, !210, !214, !218, !423, !968, !1242, !1378, !1504, !1587, !1674, !1678, !1753, !1874, !1924, !1969, !2085, !2112, !2116, !2143, !2185, !2242, !2287, !3, !2338, !2466, !10, !2503, !2516, !15, !2555, !2568, !2731, !2781, !2857, !21, !3005, !3080, !3081, !3437, !3474, !3478, !3488, !3543, !3546, !3551, !3556, !3560, !3603, !3607, !3609, !3619, !3624, !3625, !3628, !3631, !3644, !3655, !3662, !3666, !3670, !3707, !3710, !3712, !3713, !3714, !3715, !3717, !3728, !3757, !3778, !3795, !3897, !4002, !27, !4003, !4091, !4202, !4206, !4267, !4285, !4365, !4373, !32, !37, !41, !4405, !45, !51, !4444, !4502, !4525, !4568, !4569, !4570, !4571, !4572, !4573, !66, !4639, !4681, !74, !86, !4758, !4835, !93, !103, !4914, !4938, !4969, !4975, !4976, !4993, !232, !109, !4996, !5006, !5010, !154, !2579, !2674, !5011, !5082, !121, !138, !4591, !4763}
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !115, line: 122, size: 1216, align: 64, elements: !116, identifier: "_ZTS7__sFILE")
!115 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!116 = !{!117, !120, !122, !123, !125, !126, !127, !128, !130, !134, !140, !150, !156, !157, !159, !160, !164, !168, !169, !170}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !115, line: 123, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !115, line: 124, baseType: !121, size: 32, align: 32, offset: 64)
!121 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !115, line: 125, baseType: !121, size: 32, align: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !115, line: 126, baseType: !124, size: 16, align: 16, offset: 128)
!124 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !115, line: 127, baseType: !124, size: 16, align: 16, offset: 144)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !115, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !115, line: 129, baseType: !121, size: 32, align: 32, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !115, line: 132, baseType: !129, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !115, line: 133, baseType: !131, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!121, !129}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !115, line: 134, baseType: !135, size: 64, align: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!121, !129, !138, !121}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !115, line: 135, baseType: !141, size: 64, align: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !129, !144, !121}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !115, line: 77, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !146, line: 71, baseType: !147)
!146 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 46, baseType: !149)
!148 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!149 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !115, line: 136, baseType: !151, size: 64, align: 64, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!121, !129, !154, !121}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !115, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !115, line: 140, baseType: !158, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !115, line: 141, baseType: !121, size: 32, align: 32, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !115, line: 144, baseType: !161, size: 24, align: 8, offset: 928)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 24, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !115, line: 145, baseType: !165, size: 8, align: 8, offset: 952)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !115, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !115, line: 151, baseType: !121, size: 32, align: 32, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !115, line: 152, baseType: !144, size: 64, align: 64, offset: 1152)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !115, line: 88, size: 128, align: 64, elements: !172, identifier: "_ZTS6__sbuf")
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !115, line: 89, baseType: !118, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !115, line: 90, baseType: !121, size: 32, align: 32, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !115, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !177, identifier: "_ZTS13__va_list_tag")
!177 = !{!178, !180, !181, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !179, size: 32, align: 32)
!179 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !179, size: 32, align: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !129, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !129, size: 64, align: 64, offset: 128)
!183 = !DICompositeType(tag: DW_TAG_union_type, file: !148, line: 76, size: 1024, align: 64, elements: !184, identifier: "_ZTS11__mbstate_t")
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !148, line: 77, baseType: !186, size: 1024, align: 8)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 1024, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !148, line: 78, baseType: !149, size: 64, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !191, line: 73, size: 448, align: 64, elements: !192, identifier: "_ZTS2tm")
!191 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !191, line: 74, baseType: !121, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !191, line: 75, baseType: !121, size: 32, align: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !191, line: 76, baseType: !121, size: 32, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !191, line: 77, baseType: !121, size: 32, align: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !191, line: 78, baseType: !121, size: 32, align: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !191, line: 79, baseType: !121, size: 32, align: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !191, line: 80, baseType: !121, size: 32, align: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !191, line: 81, baseType: !121, size: 32, align: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !191, line: 82, baseType: !121, size: 32, align: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !191, line: 83, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !191, line: 84, baseType: !138, size: 64, align: 64, offset: 384)
!205 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 82, size: 64, align: 32, elements: !207, identifier: "_ZTS5div_t")
!206 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !206, line: 83, baseType: !121, size: 32, align: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !206, line: 84, baseType: !121, size: 32, align: 32, offset: 32)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 87, size: 128, align: 64, elements: !211, identifier: "_ZTS6ldiv_t")
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !206, line: 88, baseType: !203, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !206, line: 89, baseType: !203, size: 64, align: 64, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 93, size: 128, align: 64, elements: !215, identifier: "_ZTS7lldiv_t")
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !206, line: 94, baseType: !149, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !206, line: 95, baseType: !149, size: 64, align: 64, offset: 64)
!218 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxBasis", scope: !219, file: !75, line: 71, size: 1664, align: 64, elements: !221, vtableHolder: !"_ZTSN6soplex8SPxBasisE", identifier: "_ZTSN6soplex8SPxBasisE")
!219 = !DINamespace(name: "soplex", scope: null, file: !220, line: 49)
!220 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!221 = !{!222, !227, !229, !230, !231, !233, !235, !236, !237, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !255, !259, !264, !268, !271, !276, !277, !282, !287, !291, !294, !299, !302, !303, !306, !307, !308, !311, !315, !316, !319, !322, !326, !329, !332, !337, !340, !343, !346, !347, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !362, !363, !367, !368, !369, !370, !371, !372, !375, !381, !392, !397, !400, !403, !406, !409, !410, !411, !414, !415, !416, !417, !418, !421, !422}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxBasis", scope: !75, file: !75, baseType: !223, size: 64, flags: DIFlagArtificial)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!121}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "theLP", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 296, baseType: !228, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "theBaseId", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 307, baseType: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", size: 192, align: 64, offset: 128, flags: DIFlagProtected)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 310, baseType: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", size: 192, align: 64, offset: 320, flags: DIFlagProtected)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "matrixIsSetup", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 313, baseType: !232, size: 8, align: 8, offset: 512, flags: DIFlagProtected)
!232 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 318, baseType: !234, size: 64, align: 64, offset: 576, flags: DIFlagProtected)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "factorized", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 319, baseType: !232, size: 8, align: 8, offset: 640, flags: DIFlagProtected)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "maxUpdates", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 328, baseType: !121, size: 32, align: 32, offset: 672, flags: DIFlagProtected)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nonzeroFactor", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 335, baseType: !238, size: 64, align: 64, offset: 704, flags: DIFlagProtected)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !219, file: !220, line: 127, baseType: !239)
!239 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "iterCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 341, baseType: !121, size: 32, align: 32, offset: 768, flags: DIFlagProtected)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "updateCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 342, baseType: !121, size: 32, align: 32, offset: 800, flags: DIFlagProtected)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nzCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 343, baseType: !121, size: 32, align: 32, offset: 832, flags: DIFlagProtected)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nzFac", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 344, baseType: !238, size: 64, align: 64, offset: 896, flags: DIFlagProtected)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lastFill", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 345, baseType: !238, size: 64, align: 64, offset: 960, flags: DIFlagProtected)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lastin", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 347, baseType: !"_ZTSN6soplex5SPxIdE", size: 32, align: 32, offset: 1024, flags: DIFlagProtected)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lastout", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 348, baseType: !"_ZTSN6soplex5SPxIdE", size: 32, align: 32, offset: 1056, flags: DIFlagProtected)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 349, baseType: !121, size: 32, align: 32, offset: 1088, flags: DIFlagProtected)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "thestatus", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 352, baseType: !"_ZTSN6soplex8SPxBasis9SPxStatusE", size: 32, align: 32, offset: 1120)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "thedesc", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 353, baseType: !"_ZTSN6soplex8SPxBasis4DescE", size: 512, align: 64, offset: 1152)
!250 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex8SPxBasis6statusEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 359, type: !251, isLocal: false, isDefinition: false, scopeLine: 359, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!"_ZTSN6soplex8SPxBasis9SPxStatusE", !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!255 = !DISubprogram(name: "setStatus", linkageName: "_ZN6soplex8SPxBasis9setStatusENS0_9SPxStatusE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 365, type: !256, isLocal: false, isDefinition: false, scopeLine: 365, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258, !"_ZTSN6soplex8SPxBasis9SPxStatusE"}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SPxBasisE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!259 = !DISubprogram(name: "desc", linkageName: "_ZNK6soplex8SPxBasis4descEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 377, type: !260, isLocal: false, isDefinition: false, scopeLine: 377, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !253}
!262 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!264 = !DISubprogram(name: "desc", linkageName: "_ZN6soplex8SPxBasis4descEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 382, type: !265, isLocal: false, isDefinition: false, scopeLine: 382, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !258}
!267 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!268 = !DISubprogram(name: "dualColStatus", linkageName: "_ZNK6soplex8SPxBasis13dualColStatusEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 388, type: !269, isLocal: false, isDefinition: false, scopeLine: 388, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!269 = !DISubroutineType(types: !270)
!270 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !253, !121}
!271 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_8SPxColIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 391, type: !272, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !253, !274}
!274 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!276 = !DISubprogram(name: "dualRowStatus", linkageName: "_ZNK6soplex8SPxBasis13dualRowStatusEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 394, type: !269, isLocal: false, isDefinition: false, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 397, type: !278, isLocal: false, isDefinition: false, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !253, !280}
!280 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!282 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_5SPxIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 404, type: !283, isLocal: false, isDefinition: false, scopeLine: 404, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!283 = !DISubroutineType(types: !284)
!284 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !253, !285}
!285 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!287 = !DISubprogram(name: "baseId", linkageName: "_ZN6soplex8SPxBasis6baseIdEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 416, type: !288, isLocal: false, isDefinition: false, scopeLine: 416, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !258, !121}
!290 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SPxIdE")
!291 = !DISubprogram(name: "baseId", linkageName: "_ZNK6soplex8SPxBasis6baseIdEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 421, type: !292, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{!"_ZTSN6soplex5SPxIdE", !253, !121}
!294 = !DISubprogram(name: "baseVec", linkageName: "_ZNK6soplex8SPxBasis7baseVecEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 427, type: !295, isLocal: false, isDefinition: false, scopeLine: 427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !253, !121}
!297 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!299 = !DISubprogram(name: "lastEntered", linkageName: "_ZNK6soplex8SPxBasis11lastEnteredEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 434, type: !300, isLocal: false, isDefinition: false, scopeLine: 434, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{!"_ZTSN6soplex5SPxIdE", !253}
!302 = !DISubprogram(name: "lastLeft", linkageName: "_ZNK6soplex8SPxBasis8lastLeftEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 440, type: !300, isLocal: false, isDefinition: false, scopeLine: 440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubprogram(name: "lastIndex", linkageName: "_ZNK6soplex8SPxBasis9lastIndexEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 446, type: !304, isLocal: false, isDefinition: false, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!121, !253}
!306 = !DISubprogram(name: "lastUpdate", linkageName: "_ZNK6soplex8SPxBasis10lastUpdateEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 452, type: !304, isLocal: false, isDefinition: false, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubprogram(name: "iteration", linkageName: "_ZNK6soplex8SPxBasis9iterationEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 458, type: !304, isLocal: false, isDefinition: false, scopeLine: 458, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!308 = !DISubprogram(name: "solver", linkageName: "_ZNK6soplex8SPxBasis6solverEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 464, type: !309, isLocal: false, isDefinition: false, scopeLine: 464, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{!228, !253}
!311 = !DISubprogram(name: "multBaseWith", linkageName: "_ZNK6soplex8SPxBasis12multBaseWithERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 481, type: !312, isLocal: false, isDefinition: false, scopeLine: 481, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{!314, !253, !314}
!314 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!315 = !DISubprogram(name: "multWithBase", linkageName: "_ZNK6soplex8SPxBasis12multWithBaseERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 492, type: !312, isLocal: false, isDefinition: false, scopeLine: 492, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!316 = !DISubprogram(name: "stability", linkageName: "_ZNK6soplex8SPxBasis9stabilityEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 495, type: !317, isLocal: false, isDefinition: false, scopeLine: 495, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!238, !253}
!319 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_6VectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 502, type: !320, isLocal: false, isDefinition: false, scopeLine: 502, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !258, !314, !314}
!322 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 509, type: !323, isLocal: false, isDefinition: false, scopeLine: 509, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !258, !314, !325}
!325 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!326 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 516, type: !327, isLocal: false, isDefinition: false, scopeLine: 516, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !258, !325, !314}
!329 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_8SSVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 523, type: !330, isLocal: false, isDefinition: false, scopeLine: 523, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !258, !325, !325}
!332 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_6VectorERKS1_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 530, type: !333, isLocal: false, isDefinition: false, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !258, !314, !335}
!335 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!337 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 537, type: !338, isLocal: false, isDefinition: false, scopeLine: 537, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !258, !314, !297}
!340 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 544, type: !341, isLocal: false, isDefinition: false, scopeLine: 544, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !258, !325, !297}
!343 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 551, type: !344, isLocal: false, isDefinition: false, scopeLine: 551, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !258, !325, !335}
!346 = !DISubprogram(name: "solve4update", linkageName: "_ZN6soplex8SPxBasis12solve4updateERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 567, type: !341, isLocal: false, isDefinition: false, scopeLine: 567, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubprogram(name: "solve4update", linkageName: "_ZN6soplex8SPxBasis12solve4updateERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 574, type: !348, isLocal: false, isDefinition: false, scopeLine: 574, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !258, !325, !314, !297, !325}
!350 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_6VectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 586, type: !320, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 593, type: !323, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 600, type: !327, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_8SSVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 607, type: !330, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!354 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_6VectorERKS1_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 614, type: !333, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 621, type: !338, isLocal: false, isDefinition: false, scopeLine: 621, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 628, type: !341, isLocal: false, isDefinition: false, scopeLine: 628, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!357 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 648, type: !344, isLocal: false, isDefinition: false, scopeLine: 648, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 656, type: !348, isLocal: false, isDefinition: false, scopeLine: 656, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex8SPxBasis9addedRowsEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 671, type: !360, isLocal: false, isDefinition: false, scopeLine: 671, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !258, !121}
!362 = !DISubprogram(name: "removedRow", linkageName: "_ZN6soplex8SPxBasis10removedRowEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 673, type: !360, isLocal: false, isDefinition: false, scopeLine: 673, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubprogram(name: "removedRows", linkageName: "_ZN6soplex8SPxBasis11removedRowsEPi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 676, type: !364, isLocal: false, isDefinition: false, scopeLine: 676, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !258, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!367 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex8SPxBasis9addedColsEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 678, type: !360, isLocal: false, isDefinition: false, scopeLine: 678, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubprogram(name: "removedCol", linkageName: "_ZN6soplex8SPxBasis10removedColEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 680, type: !360, isLocal: false, isDefinition: false, scopeLine: 680, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubprogram(name: "removedCols", linkageName: "_ZN6soplex8SPxBasis11removedColsEPi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 683, type: !364, isLocal: false, isDefinition: false, scopeLine: 683, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!370 = !DISubprogram(name: "changedRow", linkageName: "_ZN6soplex8SPxBasis10changedRowEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 685, type: !360, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!371 = !DISubprogram(name: "changedCol", linkageName: "_ZN6soplex8SPxBasis10changedColEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 687, type: !360, isLocal: false, isDefinition: false, scopeLine: 687, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubprogram(name: "changedElement", linkageName: "_ZN6soplex8SPxBasis14changedElementEii", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 689, type: !373, isLocal: false, isDefinition: false, scopeLine: 689, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !258, !121, !121}
!375 = !DISubprogram(name: "change", linkageName: "_ZN6soplex8SPxBasis6changeEiRNS_5SPxIdEPKNS_7SVectorEPKNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 723, type: !376, isLocal: false, isDefinition: false, scopeLine: 723, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !258, !121, !290, !378, !379}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!381 = !DISubprogram(name: "readBasis", linkageName: "_ZN6soplex8SPxBasis9readBasisERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEERKNS_7NameSetES9_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 727, type: !382, isLocal: false, isDefinition: false, scopeLine: 727, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{!232, !258, !384, !390, !390}
!384 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !387, file: !386, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!386 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!387 = !DINamespace(name: "__1", scope: !389, file: !388, line: 369)
!388 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!389 = !DINamespace(name: "std", scope: null, file: !388, line: 368)
!390 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!392 = !DISubprogram(name: "writeBasis", linkageName: "_ZN6soplex8SPxBasis10writeBasisERNSt3__113basic_ostreamIcNS1_11char_traitsIcEEEERKNS_7NameSetES9_", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 731, type: !393, isLocal: false, isDefinition: false, scopeLine: 731, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !258, !395, !390, !390}
!395 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ostream", scope: !387, file: !386, line: 147, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!397 = !DISubprogram(name: "loadDesc", linkageName: "_ZN6soplex8SPxBasis8loadDescERKNS0_4DescE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 739, type: !398, isLocal: false, isDefinition: false, scopeLine: 739, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !258, !262}
!400 = !DISubprogram(name: "loadSolver", linkageName: "_ZN6soplex8SPxBasis10loadSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 742, type: !401, isLocal: false, isDefinition: false, scopeLine: 742, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !258, !234}
!403 = !DISubprogram(name: "load", linkageName: "_ZN6soplex8SPxBasis4loadEPNS_6SoPlexE", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 748, type: !404, isLocal: false, isDefinition: false, scopeLine: 748, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !258, !228}
!406 = !DISubprogram(name: "unLoad", linkageName: "_ZN6soplex8SPxBasis6unLoadEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 751, type: !407, isLocal: false, isDefinition: false, scopeLine: 751, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !258}
!409 = !DISubprogram(name: "invalidate", linkageName: "_ZN6soplex8SPxBasis10invalidateEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 762, type: !407, isLocal: false, isDefinition: false, scopeLine: 762, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!410 = !DISubprogram(name: "dump", linkageName: "_ZN6soplex8SPxBasis4dumpEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 765, type: !407, isLocal: false, isDefinition: false, scopeLine: 765, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SPxBasis12isConsistentEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 768, type: !412, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{!232, !253}
!414 = !DISubprogram(name: "SPxBasis", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 775, type: !407, isLocal: false, isDefinition: false, scopeLine: 775, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!415 = !DISubprogram(name: "~SPxBasis", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 778, type: !407, isLocal: false, isDefinition: false, scopeLine: 778, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubprogram(name: "loadMatrixVecs", linkageName: "_ZN6soplex8SPxBasis14loadMatrixVecsEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 788, type: !407, isLocal: false, isDefinition: false, scopeLine: 788, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!417 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SPxBasis5reDimEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 796, type: !407, isLocal: false, isDefinition: false, scopeLine: 796, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!418 = !DISubprogram(name: "doFactorize", linkageName: "_ZN6soplex8SPxBasis11doFactorizeEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 799, type: !419, isLocal: false, isDefinition: false, scopeLine: 799, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{!121, !258}
!421 = !DISubprogram(name: "factorize", linkageName: "_ZN6soplex8SPxBasis9factorizeEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 802, type: !407, isLocal: false, isDefinition: false, scopeLine: 802, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!422 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex8SPxBasis6setRepEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !75, line: 805, type: !407, isLocal: false, isDefinition: false, scopeLine: 805, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!423 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !219, file: !33, line: 77, size: 12416, align: 64, elements: !424, vtableHolder: !"_ZTSN6soplex5SPxLPE", identifier: "_ZTSN6soplex6SoPlexE")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !443, !445, !446, !447, !448, !449, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !468, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !485, !487, !489, !491, !493, !498, !501, !504, !507, !513, !518, !521, !524, !527, !530, !533, !536, !539, !542, !545, !548, !551, !554, !557, !558, !561, !564, !567, !570, !573, !574, !575, !576, !577, !580, !581, !582, !585, !586, !587, !590, !591, !592, !593, !594, !597, !598, !599, !602, !605, !608, !609, !610, !611, !612, !613, !614, !617, !620, !623, !624, !625, !628, !629, !630, !631, !632, !633, !636, !641, !644, !649, !652, !655, !658, !661, !662, !663, !666, !667, !670, !671, !674, !677, !680, !683, !684, !685, !686, !687, !688, !691, !692, !695, !696, !699, !702, !705, !706, !707, !708, !712, !715, !716, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !752, !753, !754, !758, !759, !760, !761, !762, !763, !768, !769, !774, !775, !778, !779, !780, !784, !788, !793, !798, !803, !808, !813, !814, !817, !820, !823, !824, !825, !826, !827, !828, !829, !832, !833, !834, !835, !836, !837, !838, !839, !840, !843, !844, !845, !846, !847, !848, !851, !857, !860, !863, !866, !869, !872, !875, !876, !877, !878, !879, !880, !881, !882, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !905, !908, !911, !912, !915, !916, !920, !925, !926, !927, !932, !937, !940, !941, !942, !943, !946, !947, !948, !949, !952, !955, !958, !959, !964, !967}
!425 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex5SPxLPE", flags: DIFlagPublic)
!426 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex8SPxBasisE", offset: 2816, flags: DIFlagProtected)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "theType", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 196, baseType: !"_ZTSN6soplex6SoPlex4TypeE", size: 32, align: 32, offset: 4480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "thePricing", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 197, baseType: !"_ZTSN6soplex6SoPlex7PricingE", size: 32, align: 32, offset: 4512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "therep", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 198, baseType: !"_ZTSN6soplex6SoPlex14RepresentationE", size: 32, align: 32, offset: 4544)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "theTime", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 199, baseType: !"_ZTSN6soplex5TimerE", size: 448, align: 64, offset: 4608)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "maxIters", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 200, baseType: !121, size: 32, align: 32, offset: 5056)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 201, baseType: !238, size: 64, align: 64, offset: 5120)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 202, baseType: !238, size: 64, align: 64, offset: 5184)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "m_status", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 203, baseType: !"_ZTSN6soplex6SoPlex6StatusE", size: 32, align: 32, offset: 5248)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 205, baseType: !238, size: 64, align: 64, offset: 5312)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "theShift", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 206, baseType: !238, size: 64, align: 64, offset: 5376)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lastShift", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 207, baseType: !238, size: 64, align: 64, offset: 5440)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 208, baseType: !121, size: 32, align: 32, offset: 5504)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "m_numCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 209, baseType: !121, size: 32, align: 32, offset: 5536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 210, baseType: !232, size: 8, align: 8, offset: 5568)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 212, baseType: !442, size: 64, align: 64, offset: 5632)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 213, baseType: !444, size: 64, align: 64, offset: 5696)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 214, baseType: !442, size: 64, align: 64, offset: 5760)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 215, baseType: !444, size: 64, align: 64, offset: 5824)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cacheProductFactor", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 217, baseType: !238, size: 64, align: 64, offset: 5888)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "unitVecs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 220, baseType: !"_ZTSN6soplex5ArrayINS_10UnitVectorEEE", size: 128, align: 64, offset: 5952, flags: DIFlagProtected)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "thevectors", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 221, baseType: !450, size: 64, align: 64, offset: 6080, flags: DIFlagProtected)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "thecovectors", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 222, baseType: !450, size: 64, align: 64, offset: 6144, flags: DIFlagProtected)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nNZEs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 224, baseType: !121, size: 32, align: 32, offset: 6208, flags: DIFlagProtected)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "coVecDim", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 225, baseType: !121, size: 32, align: 32, offset: 6240, flags: DIFlagProtected)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "primRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 227, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 6272, flags: DIFlagProtected)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "primVec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 228, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 6528, flags: DIFlagProtected)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dualRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 229, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 7360, flags: DIFlagProtected)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dualVec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 230, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 7616, flags: DIFlagProtected)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "addVec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 231, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 8448, flags: DIFlagProtected)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "theURbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 233, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9280, flags: DIFlagProtected)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "theLRbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 234, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9536, flags: DIFlagProtected)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "theUCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 235, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9792, flags: DIFlagProtected)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "theLCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 236, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10048, flags: DIFlagProtected)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "theUBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 243, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10304, flags: DIFlagProtected)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "theLBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 244, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10560, flags: DIFlagProtected)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "theFrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 246, baseType: !467, size: 64, align: 64, offset: 10816, flags: DIFlagProtected)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "theFvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 247, baseType: !469, size: 64, align: 64, offset: 10880, flags: DIFlagProtected)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 249, baseType: !467, size: 64, align: 64, offset: 10944, flags: DIFlagProtected)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 250, baseType: !469, size: 64, align: 64, offset: 11008, flags: DIFlagProtected)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "thePvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 251, baseType: !469, size: 64, align: 64, offset: 11072, flags: DIFlagProtected)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "theRPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 254, baseType: !469, size: 64, align: 64, offset: 11136, flags: DIFlagProtected)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "theCPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 256, baseType: !469, size: 64, align: 64, offset: 11200, flags: DIFlagProtected)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "theUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 260, baseType: !467, size: 64, align: 64, offset: 11264, flags: DIFlagProtected)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "theLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 261, baseType: !467, size: 64, align: 64, offset: 11328, flags: DIFlagProtected)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "theCoUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 262, baseType: !467, size: 64, align: 64, offset: 11392, flags: DIFlagProtected)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "theCoLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 263, baseType: !467, size: 64, align: 64, offset: 11456, flags: DIFlagProtected)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "theCoTest", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 266, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11520, flags: DIFlagProtected)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "theTest", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 267, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11776, flags: DIFlagProtected)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "leaveCount", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 269, baseType: !121, size: 32, align: 32, offset: 12032, flags: DIFlagProtected)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "enterCount", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 270, baseType: !121, size: 32, align: 32, offset: 12064, flags: DIFlagProtected)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "thepricer", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 272, baseType: !484, size: 64, align: 64, offset: 12096, flags: DIFlagProtected)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "theratiotester", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 273, baseType: !486, size: 64, align: 64, offset: 12160, flags: DIFlagProtected)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thestarter", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 274, baseType: !488, size: 64, align: 64, offset: 12224, flags: DIFlagProtected)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "thescaler", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 275, baseType: !490, size: 64, align: 64, offset: 12288, flags: DIFlagProtected)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxScalerE", size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "thesimplifier", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 276, baseType: !492, size: 64, align: 64, offset: 12352, flags: DIFlagProtected)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex13SPxSimplifierE", size: 64, align: 64)
!493 = !DISubprogram(name: "version", linkageName: "_ZNK6soplex6SoPlex7versionEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 280, type: !494, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{!121, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6SoPlexE")
!498 = !DISubprogram(name: "rep", linkageName: "_ZNK6soplex6SoPlex3repEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 285, type: !499, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{!"_ZTSN6soplex6SoPlex14RepresentationE", !496}
!501 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex6SoPlex4typeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 291, type: !502, isLocal: false, isDefinition: false, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{!"_ZTSN6soplex6SoPlex4TypeE", !496}
!504 = !DISubprogram(name: "pricing", linkageName: "_ZNK6soplex6SoPlex7pricingEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 297, type: !505, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{!"_ZTSN6soplex6SoPlex7PricingE", !496}
!507 = !DISubprogram(name: "read", linkageName: "_ZN6soplex6SoPlex4readERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEEPNS_7NameSetES8_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 329, type: !508, isLocal: false, isDefinition: false, scopeLine: 329, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{!232, !510, !384, !511, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7NameSetE", size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64)
!513 = !DISubprogram(name: "loadLP", linkageName: "_ZN6soplex6SoPlex6loadLPERKNS_5SPxLPE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 333, type: !514, isLocal: false, isDefinition: false, scopeLine: 333, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !510, !516}
!516 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxLPE")
!518 = !DISubprogram(name: "setSolver", linkageName: "_ZN6soplex6SoPlex9setSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 335, type: !519, isLocal: false, isDefinition: false, scopeLine: 335, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !510, !234}
!521 = !DISubprogram(name: "setPricer", linkageName: "_ZN6soplex6SoPlex9setPricerEPNS_9SPxPricerE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 337, type: !522, isLocal: false, isDefinition: false, scopeLine: 337, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !510, !484}
!524 = !DISubprogram(name: "setTester", linkageName: "_ZN6soplex6SoPlex9setTesterEPNS_14SPxRatioTesterE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 339, type: !525, isLocal: false, isDefinition: false, scopeLine: 339, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !510, !486}
!527 = !DISubprogram(name: "setStarter", linkageName: "_ZN6soplex6SoPlex10setStarterEPNS_10SPxStarterE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 341, type: !528, isLocal: false, isDefinition: false, scopeLine: 341, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !510, !488}
!530 = !DISubprogram(name: "setScaler", linkageName: "_ZN6soplex6SoPlex9setScalerEPNS_9SPxScalerE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 343, type: !531, isLocal: false, isDefinition: false, scopeLine: 343, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !510, !490}
!533 = !DISubprogram(name: "setSimplifier", linkageName: "_ZN6soplex6SoPlex13setSimplifierEPNS_13SPxSimplifierE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 345, type: !534, isLocal: false, isDefinition: false, scopeLine: 345, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !510, !492}
!536 = !DISubprogram(name: "loadBasis", linkageName: "_ZN6soplex6SoPlex9loadBasisERKNS_8SPxBasis4DescE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 347, type: !537, isLocal: false, isDefinition: false, scopeLine: 347, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !510, !262}
!539 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex6SoPlex6setRepENS0_14RepresentationE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 350, type: !540, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !510, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!542 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex6SoPlex7setTypeENS0_4TypeE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 352, type: !543, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !510, !"_ZTSN6soplex6SoPlex4TypeE"}
!545 = !DISubprogram(name: "setPricing", linkageName: "_ZN6soplex6SoPlex10setPricingENS0_7PricingE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 354, type: !546, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !510, !"_ZTSN6soplex6SoPlex7PricingE"}
!548 = !DISubprogram(name: "reLoad", linkageName: "_ZN6soplex6SoPlex6reLoadEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 357, type: !549, isLocal: false, isDefinition: false, scopeLine: 357, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !510}
!551 = !DISubprogram(name: "readFile", linkageName: "_ZN6soplex6SoPlex8readFileEPKcPNS_7NameSetES4_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 360, type: !552, isLocal: false, isDefinition: false, scopeLine: 360, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!552 = !DISubroutineType(types: !553)
!553 = !{!232, !510, !154, !511, !511, !512}
!554 = !DISubprogram(name: "dumpFile", linkageName: "_ZNK6soplex6SoPlex8dumpFileEPKc", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 364, type: !555, isLocal: false, isDefinition: false, scopeLine: 364, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !496, !154}
!557 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6SoPlex5clearEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 367, type: !549, isLocal: false, isDefinition: false, scopeLine: 367, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubprogram(name: "readBasisFile", linkageName: "_ZN6soplex6SoPlex13readBasisFileEPKcRKNS_7NameSetES5_", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 370, type: !559, isLocal: false, isDefinition: false, scopeLine: 370, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{!232, !510, !154, !390, !390}
!561 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex6SoPlex5solveEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 383, type: !562, isLocal: false, isDefinition: false, scopeLine: 383, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{!"_ZTSN6soplex6SoPlex6StatusE", !510}
!564 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex6SoPlex6statusEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 386, type: !565, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!"_ZTSN6soplex6SoPlex6StatusE", !496}
!567 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex6SoPlex5valueEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 392, type: !568, isLocal: false, isDefinition: false, scopeLine: 392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubroutineType(types: !569)
!569 = !{!238, !496}
!570 = !DISubprogram(name: "getPrimal", linkageName: "_ZNK6soplex6SoPlex9getPrimalERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 401, type: !571, isLocal: false, isDefinition: false, scopeLine: 401, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{!"_ZTSN6soplex6SoPlex6StatusE", !496, !314}
!573 = !DISubprogram(name: "getPrimalUnscaled", linkageName: "_ZNK6soplex6SoPlex17getPrimalUnscaledERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 406, type: !571, isLocal: false, isDefinition: false, scopeLine: 406, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubprogram(name: "getSlacks", linkageName: "_ZNK6soplex6SoPlex9getSlacksERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 421, type: !571, isLocal: false, isDefinition: false, scopeLine: 421, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubprogram(name: "getDual", linkageName: "_ZNK6soplex6SoPlex7getDualERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 447, type: !571, isLocal: false, isDefinition: false, scopeLine: 447, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubprogram(name: "getRdCost", linkageName: "_ZNK6soplex6SoPlex9getRdCostERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 460, type: !571, isLocal: false, isDefinition: false, scopeLine: 460, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!577 = !DISubprogram(name: "terminate", linkageName: "_ZN6soplex6SoPlex9terminateEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 478, type: !578, isLocal: false, isDefinition: false, scopeLine: 478, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubroutineType(types: !579)
!579 = !{!232, !510}
!580 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex6SoPlex7epsilonEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 487, type: !568, isLocal: false, isDefinition: false, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!581 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex6SoPlex5deltaEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 496, type: !568, isLocal: false, isDefinition: false, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubprogram(name: "setDelta", linkageName: "_ZN6soplex6SoPlex8setDeltaEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 501, type: !583, isLocal: false, isDefinition: false, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !510, !238}
!585 = !DISubprogram(name: "maxCycle", linkageName: "_ZNK6soplex6SoPlex8maxCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 514, type: !494, isLocal: false, isDefinition: false, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubprogram(name: "numCycle", linkageName: "_ZNK6soplex6SoPlex8numCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 519, type: !494, isLocal: false, isDefinition: false, scopeLine: 519, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubprogram(name: "localAddRows", linkageName: "_ZN6soplex6SoPlex12localAddRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 533, type: !588, isLocal: false, isDefinition: false, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !510, !121}
!590 = !DISubprogram(name: "localAddCols", linkageName: "_ZN6soplex6SoPlex12localAddColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 535, type: !588, isLocal: false, isDefinition: false, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true)
!591 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex6SoPlex9addedRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 539, type: !588, isLocal: false, isDefinition: false, scopeLine: 539, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 57, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!592 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex6SoPlex9addedColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 541, type: !588, isLocal: false, isDefinition: false, scopeLine: 541, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 58, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!593 = !DISubprogram(name: "doRemoveRow", linkageName: "_ZN6soplex6SoPlex11doRemoveRowEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 544, type: !588, isLocal: false, isDefinition: false, scopeLine: 544, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 53, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!594 = !DISubprogram(name: "doRemoveRows", linkageName: "_ZN6soplex6SoPlex12doRemoveRowsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 546, type: !595, isLocal: false, isDefinition: false, scopeLine: 546, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 55, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !510, !366}
!597 = !DISubprogram(name: "doRemoveCol", linkageName: "_ZN6soplex6SoPlex11doRemoveColEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 548, type: !588, isLocal: false, isDefinition: false, scopeLine: 548, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 56, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!598 = !DISubprogram(name: "doRemoveCols", linkageName: "_ZN6soplex6SoPlex12doRemoveColsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 550, type: !595, isLocal: false, isDefinition: false, scopeLine: 550, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 54, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 554, type: !600, isLocal: false, isDefinition: false, scopeLine: 554, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !510, !335}
!602 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 556, type: !603, isLocal: false, isDefinition: false, scopeLine: 556, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !510, !121, !238}
!605 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 558, type: !606, isLocal: false, isDefinition: false, scopeLine: 558, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !510, !"_ZTSN6soplex8SPxColIdE", !238}
!608 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 563, type: !600, isLocal: false, isDefinition: false, scopeLine: 563, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 565, type: !603, isLocal: false, isDefinition: false, scopeLine: 565, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!610 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 567, type: !606, isLocal: false, isDefinition: false, scopeLine: 567, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!611 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 572, type: !600, isLocal: false, isDefinition: false, scopeLine: 572, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 574, type: !603, isLocal: false, isDefinition: false, scopeLine: 574, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 32, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 576, type: !606, isLocal: false, isDefinition: false, scopeLine: 576, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 581, type: !615, isLocal: false, isDefinition: false, scopeLine: 581, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !510, !335, !335}
!617 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 583, type: !618, isLocal: false, isDefinition: false, scopeLine: 583, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !510, !121, !238, !238}
!620 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsENS_8SPxColIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 585, type: !621, isLocal: false, isDefinition: false, scopeLine: 585, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !510, !"_ZTSN6soplex8SPxColIdE", !238, !238}
!623 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 591, type: !600, isLocal: false, isDefinition: false, scopeLine: 591, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 593, type: !603, isLocal: false, isDefinition: false, scopeLine: 593, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 595, type: !626, isLocal: false, isDefinition: false, scopeLine: 595, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !510, !"_ZTSN6soplex8SPxRowIdE", !238}
!628 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 600, type: !600, isLocal: false, isDefinition: false, scopeLine: 600, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 40, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!629 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 602, type: !603, isLocal: false, isDefinition: false, scopeLine: 602, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!630 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 604, type: !626, isLocal: false, isDefinition: false, scopeLine: 604, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 42, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!631 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 609, type: !615, isLocal: false, isDefinition: false, scopeLine: 609, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 611, type: !618, isLocal: false, isDefinition: false, scopeLine: 611, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeENS_8SPxRowIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 613, type: !634, isLocal: false, isDefinition: false, scopeLine: 613, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !510, !"_ZTSN6soplex8SPxRowIdE", !238, !238}
!636 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowEiRKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 619, type: !637, isLocal: false, isDefinition: false, scopeLine: 619, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !510, !121, !639}
!639 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPRowE")
!641 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowENS_8SPxRowIdERKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 621, type: !642, isLocal: false, isDefinition: false, scopeLine: 621, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !510, !"_ZTSN6soplex8SPxRowIdE", !639}
!644 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColEiRKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 626, type: !645, isLocal: false, isDefinition: false, scopeLine: 626, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !510, !121, !647}
!647 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!649 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColENS_8SPxColIdERKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 628, type: !650, isLocal: false, isDefinition: false, scopeLine: 628, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !510, !"_ZTSN6soplex8SPxColIdE", !647}
!652 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementEiid", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 633, type: !653, isLocal: false, isDefinition: false, scopeLine: 633, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !510, !121, !121, !238}
!655 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementENS_8SPxRowIdENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 635, type: !656, isLocal: false, isDefinition: false, scopeLine: 635, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !510, !"_ZTSN6soplex8SPxRowIdE", !"_ZTSN6soplex8SPxColIdE", !238}
!658 = !DISubprogram(name: "changeSense", linkageName: "_ZN6soplex6SoPlex11changeSenseENS_5SPxLP8SPxSenseE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 641, type: !659, isLocal: false, isDefinition: false, scopeLine: 641, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !510, !"_ZTSN6soplex5SPxLP8SPxSenseE"}
!661 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6SoPlex3dimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 645, type: !494, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!662 = !DISubprogram(name: "coDim", linkageName: "_ZNK6soplex6SoPlex5coDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 650, type: !494, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!663 = !DISubprogram(name: "id", linkageName: "_ZNK6soplex6SoPlex2idEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 666, type: !664, isLocal: false, isDefinition: false, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{!"_ZTSN6soplex5SPxIdE", !496, !121}
!666 = !DISubprogram(name: "coId", linkageName: "_ZNK6soplex6SoPlex4coIdEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 685, type: !664, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!667 = !DISubprogram(name: "isId", linkageName: "_ZNK6soplex6SoPlex4isIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 703, type: !668, isLocal: false, isDefinition: false, scopeLine: 703, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{!121, !496, !"_ZTSN6soplex5SPxIdE"}
!670 = !DISubprogram(name: "isCoId", linkageName: "_ZNK6soplex6SoPlex6isCoIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 712, type: !668, isLocal: false, isDefinition: false, scopeLine: 712, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 724, type: !672, isLocal: false, isDefinition: false, scopeLine: 724, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{!297, !496, !121}
!674 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 730, type: !675, isLocal: false, isDefinition: false, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubroutineType(types: !676)
!676 = !{!297, !496, !280}
!677 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 738, type: !678, isLocal: false, isDefinition: false, scopeLine: 738, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubroutineType(types: !679)
!679 = !{!297, !496, !274}
!680 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 755, type: !681, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!681 = !DISubroutineType(types: !682)
!682 = !{!297, !496, !285}
!683 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 768, type: !672, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 773, type: !675, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 781, type: !678, isLocal: false, isDefinition: false, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!686 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 795, type: !681, isLocal: false, isDefinition: false, scopeLine: 795, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!687 = !DISubprogram(name: "unitVector", linkageName: "_ZNK6soplex6SoPlex10unitVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 803, type: !672, isLocal: false, isDefinition: false, scopeLine: 803, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!688 = !DISubprogram(name: "varStatus", linkageName: "_ZNK6soplex6SoPlex9varStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 816, type: !689, isLocal: false, isDefinition: false, scopeLine: 816, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubroutineType(types: !690)
!690 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !496, !121}
!691 = !DISubprogram(name: "covarStatus", linkageName: "_ZNK6soplex6SoPlex11covarStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 822, type: !689, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 828, type: !693, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubroutineType(types: !694)
!694 = !{!121, !496, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!695 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 834, type: !668, isLocal: false, isDefinition: false, scopeLine: 834, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 843, type: !697, isLocal: false, isDefinition: false, scopeLine: 843, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!697 = !DISubroutineType(types: !698)
!698 = !{!121, !496, !"_ZTSN6soplex8SPxRowIdE"}
!699 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 849, type: !700, isLocal: false, isDefinition: false, scopeLine: 849, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubroutineType(types: !701)
!701 = !{!121, !496, !"_ZTSN6soplex8SPxColIdE"}
!702 = !DISubprogram(name: "isRowBasic", linkageName: "_ZNK6soplex6SoPlex10isRowBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 855, type: !703, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!703 = !DISubroutineType(types: !704)
!704 = !{!121, !496, !121}
!705 = !DISubprogram(name: "isColBasic", linkageName: "_ZNK6soplex6SoPlex10isColBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 861, type: !703, isLocal: false, isDefinition: false, scopeLine: 861, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!706 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 867, type: !703, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!707 = !DISubprogram(name: "isCoBasic", linkageName: "_ZNK6soplex6SoPlex9isCoBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 873, type: !703, isLocal: false, isDefinition: false, scopeLine: 873, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubprogram(name: "fVec", linkageName: "_ZNK6soplex6SoPlex4fVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 888, type: !709, isLocal: false, isDefinition: false, scopeLine: 888, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !496}
!711 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!712 = !DISubprogram(name: "fRhs", linkageName: "_ZNK6soplex6SoPlex4fRhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 901, type: !713, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!713 = !DISubroutineType(types: !714)
!714 = !{!335, !496}
!715 = !DISubprogram(name: "ubBound", linkageName: "_ZNK6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !33, line: 906, type: !713, isLocal: false, isDefinition: false, scopeLine: 906, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
