; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefaultpr.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.soplex::SPxDefaultPR" = type { %"class.soplex::SPxPricer" }
%"class.soplex::SPxPricer" = type { i32 (...)**, i8*, %"class.soplex::SoPlex"*, double }

!50 = !DIEnumerator(name: "INFEASIBLE", value: 5)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex8SPxBasis4DescE", file: !41, line: 170, size: 32, align: 32, elements: !52, identifier: "_ZTSN6soplex8SPxBasis4Desc6StatusE")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIEnumerator(name: "P_ON_LOWER", value: -4)
!54 = !DIEnumerator(name: "P_ON_UPPER", value: -2)
!55 = !DIEnumerator(name: "P_FREE", value: -1)
!56 = !DIEnumerator(name: "P_FIXED", value: -6)
!57 = !DIEnumerator(name: "D_FREE", value: 1)
!58 = !DIEnumerator(name: "D_ON_UPPER", value: 2)
!59 = !DIEnumerator(name: "D_ON_LOWER", value: 4)
!60 = !DIEnumerator(name: "D_ON_BOTH", value: 6)
!61 = !DIEnumerator(name: "D_UNDEFINED", value: 8)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 113, size: 32, align: 32, elements: !64, identifier: "_ZTSN6soplex6SoPlex4TypeE")
!63 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/soplex.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "ENTER", value: -1)
!66 = !DIEnumerator(name: "LEAVE", value: 1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Pricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 141, size: 32, align: 32, elements: !68, identifier: "_ZTSN6soplex6SoPlex7PricingE")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "FULL", value: 0)
!70 = !DIEnumerator(name: "PARTIAL", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Representation", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 94, size: 32, align: 32, elements: !72, identifier: "_ZTSN6soplex6SoPlex14RepresentationE")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "ROW", value: -1)
!74 = !DIEnumerator(name: "COLUMN", value: 1)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex5TimerE", file: !76, line: 100, size: 32, align: 32, elements: !77, identifier: "_ZTSN6soplex5TimerUt_E")
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "RESET", value: 0)
!79 = !DIEnumerator(name: "STOPPED", value: 1)
!80 = !DIEnumerator(name: "RUNNING", value: 2)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 177, size: 32, align: 32, elements: !82, identifier: "_ZTSN6soplex6SoPlex6StatusE")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!83 = !DIEnumerator(name: "ERROR", value: -9)
!84 = !DIEnumerator(name: "NOT_INIT", value: -8)
!85 = !DIEnumerator(name: "ABORT_TIME", value: -7)
!86 = !DIEnumerator(name: "ABORT_ITER", value: -6)
!87 = !DIEnumerator(name: "ABORT_VALUE", value: -5)
!88 = !DIEnumerator(name: "SINGULAR", value: -4)
!89 = !DIEnumerator(name: "NO_PROBLEM", value: -3)
!90 = !DIEnumerator(name: "REGULAR", value: -2)
!91 = !DIEnumerator(name: "RUNNING", value: -1)
!92 = !DIEnumerator(name: "UNKNOWN", value: 0)
!93 = !DIEnumerator(name: "OPTIMAL", value: 1)
!94 = !DIEnumerator(name: "UNBOUNDED", value: 2)
!95 = !DIEnumerator(name: "INFEASIBLE", value: 3)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VarStatus", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 165, size: 32, align: 32, elements: !97, identifier: "_ZTSN6soplex6SoPlex9VarStatusE")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "ON_UPPER", value: 0)
!99 = !DIEnumerator(name: "ON_LOWER", value: 1)
!100 = !DIEnumerator(name: "FIXED", value: 2)
!101 = !DIEnumerator(name: "ZERO", value: 3)
!102 = !DIEnumerator(name: "BASIC", value: 4)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !104, line: 87, size: 32, align: 32, elements: !105, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "FREE", value: 0)
!107 = !DIEnumerator(name: "RELEASED", value: 1)
!108 = !DIEnumerator(name: "USED", value: 2)
!109 = !{!110, !167, !171, !172, !179, !186, !201, !206, !210, !214, !236, !309, !879, !1155, !1291, !1415, !1498, !1586, !1590, !1665, !1787, !1837, !1882, !1998, !2025, !2029, !2056, !2098, !2155, !2200, !3, !2251, !2379, !10, !2416, !2429, !15, !2468, !2481, !2645, !2695, !2771, !21, !2919, !2994, !2995, !3351, !3388, !3392, !3402, !3457, !3460, !3465, !3470, !3474, !3517, !3521, !3523, !3533, !3538, !3539, !3542, !3545, !3558, !3569, !3576, !3580, !3584, !3621, !3624, !3626, !3627, !3628, !3629, !3631, !3642, !3671, !3692, !3709, !3811, !3916, !27, !3917, !4005, !4116, !4120, !4181, !4199, !4279, !4287, !4319, !4484, !4561, !4641, !32, !40, !4706, !4748, !51, !62, !67, !71, !4825, !75, !81, !4864, !4922, !4945, !4988, !4989, !4990, !4991, !96, !103}
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !111, line: 122, size: 1216, align: 64, elements: !112, identifier: "_ZTS7__sFILE")
!111 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !116, !118, !119, !121, !122, !123, !124, !126, !130, !136, !146, !152, !153, !155, !156, !160, !164, !165, !166}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !111, line: 123, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !111, line: 124, baseType: !117, size: 32, align: 32, offset: 64)
!117 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !111, line: 125, baseType: !117, size: 32, align: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !111, line: 126, baseType: !120, size: 16, align: 16, offset: 128)
!120 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !111, line: 127, baseType: !120, size: 16, align: 16, offset: 144)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !111, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !111, line: 129, baseType: !117, size: 32, align: 32, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !111, line: 132, baseType: !125, size: 64, align: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !111, line: 133, baseType: !127, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!117, !125}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !111, line: 134, baseType: !131, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!117, !125, !134, !117}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !111, line: 135, baseType: !137, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !125, !140, !117}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !111, line: 77, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !142, line: 71, baseType: !143)
!142 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !144, line: 46, baseType: !145)
!144 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !111, line: 136, baseType: !147, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!117, !125, !150, !117}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !111, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !111, line: 140, baseType: !154, size: 64, align: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !111, line: 141, baseType: !117, size: 32, align: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !111, line: 144, baseType: !157, size: 24, align: 8, offset: 928)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 24, align: 8, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 3)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !111, line: 145, baseType: !161, size: 8, align: 8, offset: 952)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !111, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !111, line: 151, baseType: !117, size: 32, align: 32, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !111, line: 152, baseType: !140, size: 64, align: 64, offset: 1152)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !111, line: 88, size: 128, align: 64, elements: !168, identifier: "_ZTS6__sbuf")
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !111, line: 89, baseType: !114, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !111, line: 90, baseType: !117, size: 32, align: 32, offset: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !111, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !173, identifier: "_ZTS13__va_list_tag")
!173 = !{!174, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !175, size: 32, align: 32)
!175 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !175, size: 32, align: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !125, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !125, size: 64, align: 64, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_union_type, file: !144, line: 76, size: 1024, align: 64, elements: !180, identifier: "_ZTS11__mbstate_t")
!180 = !{!181, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !144, line: 77, baseType: !182, size: 1024, align: 8)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 1024, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !144, line: 78, baseType: !145, size: 64, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !187, line: 73, size: 448, align: 64, elements: !188, identifier: "_ZTS2tm")
!187 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !200}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !187, line: 74, baseType: !117, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !187, line: 75, baseType: !117, size: 32, align: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !187, line: 76, baseType: !117, size: 32, align: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !187, line: 77, baseType: !117, size: 32, align: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !187, line: 78, baseType: !117, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !187, line: 79, baseType: !117, size: 32, align: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !187, line: 80, baseType: !117, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !187, line: 81, baseType: !117, size: 32, align: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !187, line: 82, baseType: !117, size: 32, align: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !187, line: 83, baseType: !199, size: 64, align: 64, offset: 320)
!199 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !187, line: 84, baseType: !134, size: 64, align: 64, offset: 384)
!201 = !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 82, size: 64, align: 32, elements: !203, identifier: "_ZTS5div_t")
!202 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !202, line: 83, baseType: !117, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !202, line: 84, baseType: !117, size: 32, align: 32, offset: 32)
!206 = !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 87, size: 128, align: 64, elements: !207, identifier: "_ZTS6ldiv_t")
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !202, line: 88, baseType: !199, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !202, line: 89, baseType: !199, size: 64, align: 64, offset: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 93, size: 128, align: 64, elements: !211, identifier: "_ZTS7lldiv_t")
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !202, line: 94, baseType: !145, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !202, line: 95, baseType: !145, size: 64, align: 64, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxDefaultPR", scope: !216, file: !215, line: 44, size: 256, align: 64, elements: !218, vtableHolder: !"_ZTSN6soplex9SPxPricerE", identifier: "_ZTSN6soplex12SPxDefaultPRE")
!215 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefaultpr.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!216 = !DINamespace(name: "soplex", scope: null, file: !217, line: 49)
!217 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!218 = !{!219, !220, !224, !227, !230, !233}
!219 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex12SPxDefaultPRE", baseType: !"_ZTSN6soplex9SPxPricerE", flags: DIFlagPublic)
!220 = !DISubprogram(name: "selectLeaveX", linkageName: "_ZN6soplex12SPxDefaultPR12selectLeaveXEii", scope: !"_ZTSN6soplex12SPxDefaultPRE", file: !215, line: 48, type: !221, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!117, !223, !117, !117}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12SPxDefaultPRE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!224 = !DISubprogram(name: "selectEnterX", linkageName: "_ZN6soplex12SPxDefaultPR12selectEnterXEiiii", scope: !"_ZTSN6soplex12SPxDefaultPRE", file: !215, line: 50, type: !225, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true)
!225 = !DISubroutineType(types: !226)
!226 = !{!"_ZTSN6soplex5SPxIdE", !223, !117, !117, !117, !117}
!227 = !DISubprogram(name: "selectLeave", linkageName: "_ZN6soplex12SPxDefaultPR11selectLeaveEv", scope: !"_ZTSN6soplex12SPxDefaultPRE", file: !215, line: 54, type: !228, isLocal: false, isDefinition: false, scopeLine: 54, containingType: !"_ZTSN6soplex12SPxDefaultPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!228 = !DISubroutineType(types: !229)
!229 = !{!117, !223}
!230 = !DISubprogram(name: "selectEnter", linkageName: "_ZN6soplex12SPxDefaultPR11selectEnterEv", scope: !"_ZTSN6soplex12SPxDefaultPRE", file: !215, line: 56, type: !231, isLocal: false, isDefinition: false, scopeLine: 56, containingType: !"_ZTSN6soplex12SPxDefaultPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{!"_ZTSN6soplex5SPxIdE", !223}
!233 = !DISubprogram(name: "SPxDefaultPR", scope: !"_ZTSN6soplex12SPxDefaultPRE", file: !215, line: 59, type: !234, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !223}
!236 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxPricer", scope: !216, file: !237, line: 52, size: 256, align: 64, elements: !238, vtableHolder: !"_ZTSN6soplex9SPxPricerE", identifier: "_ZTSN6soplex9SPxPricerE")
!237 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxpricer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!238 = !{!239, !244, !245, !247, !250, !255, !259, !262, !265, !268, !271, !274, !277, !280, !283, !286, !289, !292, !293, !294, !299, !300, !301, !305, !308}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxPricer", scope: !237, file: !237, baseType: !240, size: 64, flags: DIFlagArtificial)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!117}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 55, baseType: !150, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "thesolver", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 56, baseType: !246, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "theeps", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 57, baseType: !248, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !216, file: !217, line: 127, baseType: !249)
!249 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!250 = !DISubprogram(name: "getName", linkageName: "_ZNK6soplex9SPxPricer7getNameEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 63, type: !251, isLocal: false, isDefinition: false, scopeLine: 63, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!150, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9SPxPricerE")
!255 = !DISubprogram(name: "load", linkageName: "_ZN6soplex9SPxPricer4loadEPNS_6SoPlexE", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 71, type: !256, isLocal: false, isDefinition: false, scopeLine: 71, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258, !246}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!259 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex9SPxPricer5clearEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 77, type: !260, isLocal: false, isDefinition: false, scopeLine: 77, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !258}
!262 = !DISubprogram(name: "solver", linkageName: "_ZNK6soplex9SPxPricer6solverEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 83, type: !263, isLocal: false, isDefinition: false, scopeLine: 83, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!246, !253}
!265 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex9SPxPricer7epsilonEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 89, type: !266, isLocal: false, isDefinition: false, scopeLine: 89, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!266 = !DISubroutineType(types: !267)
!267 = !{!248, !253}
!268 = !DISubprogram(name: "setEpsilon", linkageName: "_ZN6soplex9SPxPricer10setEpsilonEd", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 97, type: !269, isLocal: false, isDefinition: false, scopeLine: 97, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !258, !248}
!271 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex9SPxPricer7setTypeENS_6SoPlex4TypeE", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 108, type: !272, isLocal: false, isDefinition: false, scopeLine: 108, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !258, !"_ZTSN6soplex6SoPlex4TypeE"}
!274 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex9SPxPricer6setRepENS_6SoPlex14RepresentationE", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 115, type: !275, isLocal: false, isDefinition: false, scopeLine: 115, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !258, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!277 = !DISubprogram(name: "selectLeave", linkageName: "_ZN6soplex9SPxPricer11selectLeaveEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 126, type: !278, isLocal: false, isDefinition: false, scopeLine: 126, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{!117, !258}
!280 = !DISubprogram(name: "left4", linkageName: "_ZN6soplex9SPxPricer5left4EiNS_5SPxIdE", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 138, type: !281, isLocal: false, isDefinition: false, scopeLine: 138, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !258, !117, !"_ZTSN6soplex5SPxIdE"}
!283 = !DISubprogram(name: "selectEnter", linkageName: "_ZN6soplex9SPxPricer11selectEnterEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 153, type: !284, isLocal: false, isDefinition: false, scopeLine: 153, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!"_ZTSN6soplex5SPxIdE", !258}
!286 = !DISubprogram(name: "entered4", linkageName: "_ZN6soplex9SPxPricer8entered4ENS_5SPxIdEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 165, type: !287, isLocal: false, isDefinition: false, scopeLine: 165, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !258, !"_ZTSN6soplex5SPxIdE", !117}
!289 = !DISubprogram(name: "addedVecs", linkageName: "_ZN6soplex9SPxPricer9addedVecsEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 173, type: !290, isLocal: false, isDefinition: false, scopeLine: 173, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !258, !117}
!292 = !DISubprogram(name: "addedCoVecs", linkageName: "_ZN6soplex9SPxPricer11addedCoVecsEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 176, type: !290, isLocal: false, isDefinition: false, scopeLine: 176, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!293 = !DISubprogram(name: "removedVec", linkageName: "_ZN6soplex9SPxPricer10removedVecEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 183, type: !290, isLocal: false, isDefinition: false, scopeLine: 183, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubprogram(name: "removedVecs", linkageName: "_ZN6soplex9SPxPricer11removedVecsEPKi", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 186, type: !295, isLocal: false, isDefinition: false, scopeLine: 186, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !258, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!299 = !DISubprogram(name: "removedCoVec", linkageName: "_ZN6soplex9SPxPricer12removedCoVecEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 189, type: !290, isLocal: false, isDefinition: false, scopeLine: 189, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubprogram(name: "removedCoVecs", linkageName: "_ZN6soplex9SPxPricer13removedCoVecsEPKi", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 192, type: !295, isLocal: false, isDefinition: false, scopeLine: 192, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9SPxPricer12isConsistentEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 196, type: !302, isLocal: false, isDefinition: false, scopeLine: 196, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !253}
!304 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!305 = !DISubprogram(name: "SPxPricer", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 204, type: !306, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !258, !150}
!308 = !DISubprogram(name: "~SPxPricer", scope: !"_ZTSN6soplex9SPxPricerE", file: !237, line: 211, type: !260, isLocal: false, isDefinition: false, scopeLine: 211, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!309 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !216, file: !63, line: 77, size: 12416, align: 64, elements: !310, vtableHolder: !"_ZTSN6soplex5SPxLPE", identifier: "_ZTSN6soplex6SoPlexE")
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !329, !331, !332, !333, !334, !335, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !354, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !371, !373, !375, !377, !379, !384, !387, !390, !393, !405, !410, !414, !417, !420, !423, !426, !429, !434, !437, !440, !443, !446, !449, !452, !453, !458, !461, !464, !467, !471, !472, !473, !474, !475, !478, !479, !480, !483, !484, !485, !488, !489, !490, !491, !492, !496, !497, !498, !503, !506, !509, !510, !511, !512, !513, !514, !515, !518, !521, !524, !525, !526, !529, !530, !531, !532, !533, !534, !537, !542, !545, !550, !553, !556, !559, !562, !563, !564, !567, !568, !571, !572, !577, !582, !587, !592, !593, !594, !595, !596, !597, !600, !601, !604, !605, !608, !611, !614, !615, !616, !617, !621, !624, !625, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !661, !662, !663, !667, !668, !669, !670, !671, !672, !677, !678, !683, !684, !687, !688, !689, !694, !698, !702, !707, !712, !717, !722, !723, !726, !730, !733, !734, !735, !736, !737, !738, !739, !742, !743, !744, !745, !746, !747, !748, !749, !750, !753, !754, !755, !756, !757, !758, !762, !768, !771, !774, !777, !780, !783, !786, !787, !788, !789, !790, !791, !792, !793, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !816, !819, !822, !823, !826, !827, !831, !836, !837, !838, !843, !848, !851, !852, !853, !854, !857, !858, !859, !860, !863, !866, !869, !870, !875, !878}
!311 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex5SPxLPE", flags: DIFlagPublic)
!312 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex8SPxBasisE", offset: 2816, flags: DIFlagProtected)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "theType", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 196, baseType: !"_ZTSN6soplex6SoPlex4TypeE", size: 32, align: 32, offset: 4480)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "thePricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 197, baseType: !"_ZTSN6soplex6SoPlex7PricingE", size: 32, align: 32, offset: 4512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "therep", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 198, baseType: !"_ZTSN6soplex6SoPlex14RepresentationE", size: 32, align: 32, offset: 4544)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "theTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 199, baseType: !"_ZTSN6soplex5TimerE", size: 448, align: 64, offset: 4608)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "maxIters", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 200, baseType: !117, size: 32, align: 32, offset: 5056)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 201, baseType: !248, size: 64, align: 64, offset: 5120)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 202, baseType: !248, size: 64, align: 64, offset: 5184)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "m_status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 203, baseType: !"_ZTSN6soplex6SoPlex6StatusE", size: 32, align: 32, offset: 5248)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 205, baseType: !248, size: 64, align: 64, offset: 5312)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "theShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 206, baseType: !248, size: 64, align: 64, offset: 5376)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lastShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 207, baseType: !248, size: 64, align: 64, offset: 5440)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 208, baseType: !117, size: 32, align: 32, offset: 5504)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "m_numCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 209, baseType: !117, size: 32, align: 32, offset: 5536)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 210, baseType: !304, size: 8, align: 8, offset: 5568)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 212, baseType: !328, size: 64, align: 64, offset: 5632)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 213, baseType: !330, size: 64, align: 64, offset: 5696)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 214, baseType: !328, size: 64, align: 64, offset: 5760)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 215, baseType: !330, size: 64, align: 64, offset: 5824)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cacheProductFactor", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 217, baseType: !248, size: 64, align: 64, offset: 5888)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "unitVecs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 220, baseType: !"_ZTSN6soplex5ArrayINS_10UnitVectorEEE", size: 128, align: 64, offset: 5952, flags: DIFlagProtected)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "thevectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 221, baseType: !336, size: 64, align: 64, offset: 6080, flags: DIFlagProtected)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!338 = !DIDerivedType(tag: DW_TAG_member, name: "thecovectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 222, baseType: !336, size: 64, align: 64, offset: 6144, flags: DIFlagProtected)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nNZEs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 224, baseType: !117, size: 32, align: 32, offset: 6208, flags: DIFlagProtected)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "coVecDim", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 225, baseType: !117, size: 32, align: 32, offset: 6240, flags: DIFlagProtected)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "primRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 227, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 6272, flags: DIFlagProtected)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "primVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 228, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 6528, flags: DIFlagProtected)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dualRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 229, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 7360, flags: DIFlagProtected)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dualVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 230, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 7616, flags: DIFlagProtected)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "addVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 231, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 8448, flags: DIFlagProtected)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "theURbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 233, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9280, flags: DIFlagProtected)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "theLRbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 234, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9536, flags: DIFlagProtected)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "theUCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 235, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9792, flags: DIFlagProtected)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "theLCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 236, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10048, flags: DIFlagProtected)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "theUBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 243, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10304, flags: DIFlagProtected)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "theLBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 244, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10560, flags: DIFlagProtected)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "theFrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 246, baseType: !353, size: 64, align: 64, offset: 10816, flags: DIFlagProtected)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "theFvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 247, baseType: !355, size: 64, align: 64, offset: 10880, flags: DIFlagProtected)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 249, baseType: !353, size: 64, align: 64, offset: 10944, flags: DIFlagProtected)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 250, baseType: !355, size: 64, align: 64, offset: 11008, flags: DIFlagProtected)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "thePvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 251, baseType: !355, size: 64, align: 64, offset: 11072, flags: DIFlagProtected)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "theRPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 254, baseType: !355, size: 64, align: 64, offset: 11136, flags: DIFlagProtected)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "theCPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 256, baseType: !355, size: 64, align: 64, offset: 11200, flags: DIFlagProtected)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "theUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 260, baseType: !353, size: 64, align: 64, offset: 11264, flags: DIFlagProtected)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "theLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 261, baseType: !353, size: 64, align: 64, offset: 11328, flags: DIFlagProtected)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "theCoUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 262, baseType: !353, size: 64, align: 64, offset: 11392, flags: DIFlagProtected)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "theCoLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 263, baseType: !353, size: 64, align: 64, offset: 11456, flags: DIFlagProtected)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "theCoTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 266, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11520, flags: DIFlagProtected)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "theTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 267, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11776, flags: DIFlagProtected)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "leaveCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 269, baseType: !117, size: 32, align: 32, offset: 12032, flags: DIFlagProtected)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "enterCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 270, baseType: !117, size: 32, align: 32, offset: 12064, flags: DIFlagProtected)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "thepricer", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 272, baseType: !370, size: 64, align: 64, offset: 12096, flags: DIFlagProtected)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "theratiotester", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 273, baseType: !372, size: 64, align: 64, offset: 12160, flags: DIFlagProtected)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "thestarter", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 274, baseType: !374, size: 64, align: 64, offset: 12224, flags: DIFlagProtected)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "thescaler", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 275, baseType: !376, size: 64, align: 64, offset: 12288, flags: DIFlagProtected)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxScalerE", size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "thesimplifier", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 276, baseType: !378, size: 64, align: 64, offset: 12352, flags: DIFlagProtected)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex13SPxSimplifierE", size: 64, align: 64)
!379 = !DISubprogram(name: "version", linkageName: "_ZNK6soplex6SoPlex7versionEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 280, type: !380, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!380 = !DISubroutineType(types: !381)
!381 = !{!117, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6SoPlexE")
!384 = !DISubprogram(name: "rep", linkageName: "_ZNK6soplex6SoPlex3repEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 285, type: !385, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{!"_ZTSN6soplex6SoPlex14RepresentationE", !382}
!387 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex6SoPlex4typeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 291, type: !388, isLocal: false, isDefinition: false, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{!"_ZTSN6soplex6SoPlex4TypeE", !382}
!390 = !DISubprogram(name: "pricing", linkageName: "_ZNK6soplex6SoPlex7pricingEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 297, type: !391, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!391 = !DISubroutineType(types: !392)
!392 = !{!"_ZTSN6soplex6SoPlex7PricingE", !382}
!393 = !DISubprogram(name: "read", linkageName: "_ZN6soplex6SoPlex4readERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEEPNS_7NameSetES8_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 329, type: !394, isLocal: false, isDefinition: false, scopeLine: 329, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{!304, !396, !397, !403, !403, !404}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!397 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !400, file: !399, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!399 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!400 = !DINamespace(name: "__1", scope: !402, file: !401, line: 369)
!401 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!402 = !DINamespace(name: "std", scope: null, file: !401, line: 368)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7NameSetE", size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64)
!405 = !DISubprogram(name: "loadLP", linkageName: "_ZN6soplex6SoPlex6loadLPERKNS_5SPxLPE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 333, type: !406, isLocal: false, isDefinition: false, scopeLine: 333, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !396, !408}
!408 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxLPE")
!410 = !DISubprogram(name: "setSolver", linkageName: "_ZN6soplex6SoPlex9setSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 335, type: !411, isLocal: false, isDefinition: false, scopeLine: 335, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !396, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!414 = !DISubprogram(name: "setPricer", linkageName: "_ZN6soplex6SoPlex9setPricerEPNS_9SPxPricerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 337, type: !415, isLocal: false, isDefinition: false, scopeLine: 337, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !396, !370}
!417 = !DISubprogram(name: "setTester", linkageName: "_ZN6soplex6SoPlex9setTesterEPNS_14SPxRatioTesterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 339, type: !418, isLocal: false, isDefinition: false, scopeLine: 339, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !396, !372}
!420 = !DISubprogram(name: "setStarter", linkageName: "_ZN6soplex6SoPlex10setStarterEPNS_10SPxStarterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 341, type: !421, isLocal: false, isDefinition: false, scopeLine: 341, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !396, !374}
!423 = !DISubprogram(name: "setScaler", linkageName: "_ZN6soplex6SoPlex9setScalerEPNS_9SPxScalerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 343, type: !424, isLocal: false, isDefinition: false, scopeLine: 343, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !396, !376}
!426 = !DISubprogram(name: "setSimplifier", linkageName: "_ZN6soplex6SoPlex13setSimplifierEPNS_13SPxSimplifierE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 345, type: !427, isLocal: false, isDefinition: false, scopeLine: 345, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !396, !378}
!429 = !DISubprogram(name: "loadBasis", linkageName: "_ZN6soplex6SoPlex9loadBasisERKNS_8SPxBasis4DescE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 347, type: !430, isLocal: false, isDefinition: false, scopeLine: 347, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !396, !432}
!432 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!434 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex6SoPlex6setRepENS0_14RepresentationE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 350, type: !435, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !396, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!437 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex6SoPlex7setTypeENS0_4TypeE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 352, type: !438, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !396, !"_ZTSN6soplex6SoPlex4TypeE"}
!440 = !DISubprogram(name: "setPricing", linkageName: "_ZN6soplex6SoPlex10setPricingENS0_7PricingE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 354, type: !441, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !396, !"_ZTSN6soplex6SoPlex7PricingE"}
!443 = !DISubprogram(name: "reLoad", linkageName: "_ZN6soplex6SoPlex6reLoadEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 357, type: !444, isLocal: false, isDefinition: false, scopeLine: 357, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !396}
!446 = !DISubprogram(name: "readFile", linkageName: "_ZN6soplex6SoPlex8readFileEPKcPNS_7NameSetES4_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 360, type: !447, isLocal: false, isDefinition: false, scopeLine: 360, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!447 = !DISubroutineType(types: !448)
!448 = !{!304, !396, !150, !403, !403, !404}
!449 = !DISubprogram(name: "dumpFile", linkageName: "_ZNK6soplex6SoPlex8dumpFileEPKc", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 364, type: !450, isLocal: false, isDefinition: false, scopeLine: 364, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !382, !150}
!452 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6SoPlex5clearEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 367, type: !444, isLocal: false, isDefinition: false, scopeLine: 367, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!453 = !DISubprogram(name: "readBasisFile", linkageName: "_ZN6soplex6SoPlex13readBasisFileEPKcRKNS_7NameSetES5_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 370, type: !454, isLocal: false, isDefinition: false, scopeLine: 370, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{!304, !396, !150, !456, !456}
!456 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!458 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex6SoPlex5solveEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 383, type: !459, isLocal: false, isDefinition: false, scopeLine: 383, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!459 = !DISubroutineType(types: !460)
!460 = !{!"_ZTSN6soplex6SoPlex6StatusE", !396}
!461 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex6SoPlex6statusEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 386, type: !462, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{!"_ZTSN6soplex6SoPlex6StatusE", !382}
!464 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex6SoPlex5valueEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 392, type: !465, isLocal: false, isDefinition: false, scopeLine: 392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubroutineType(types: !466)
!466 = !{!248, !382}
!467 = !DISubprogram(name: "getPrimal", linkageName: "_ZNK6soplex6SoPlex9getPrimalERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 401, type: !468, isLocal: false, isDefinition: false, scopeLine: 401, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{!"_ZTSN6soplex6SoPlex6StatusE", !382, !470}
!470 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!471 = !DISubprogram(name: "getPrimalUnscaled", linkageName: "_ZNK6soplex6SoPlex17getPrimalUnscaledERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 406, type: !468, isLocal: false, isDefinition: false, scopeLine: 406, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubprogram(name: "getSlacks", linkageName: "_ZNK6soplex6SoPlex9getSlacksERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 421, type: !468, isLocal: false, isDefinition: false, scopeLine: 421, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!473 = !DISubprogram(name: "getDual", linkageName: "_ZNK6soplex6SoPlex7getDualERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 447, type: !468, isLocal: false, isDefinition: false, scopeLine: 447, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubprogram(name: "getRdCost", linkageName: "_ZNK6soplex6SoPlex9getRdCostERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 460, type: !468, isLocal: false, isDefinition: false, scopeLine: 460, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubprogram(name: "terminate", linkageName: "_ZN6soplex6SoPlex9terminateEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 478, type: !476, isLocal: false, isDefinition: false, scopeLine: 478, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubroutineType(types: !477)
!477 = !{!304, !396}
!478 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex6SoPlex7epsilonEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 487, type: !465, isLocal: false, isDefinition: false, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex6SoPlex5deltaEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 496, type: !465, isLocal: false, isDefinition: false, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubprogram(name: "setDelta", linkageName: "_ZN6soplex6SoPlex8setDeltaEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 501, type: !481, isLocal: false, isDefinition: false, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !396, !248}
!483 = !DISubprogram(name: "maxCycle", linkageName: "_ZNK6soplex6SoPlex8maxCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 514, type: !380, isLocal: false, isDefinition: false, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!484 = !DISubprogram(name: "numCycle", linkageName: "_ZNK6soplex6SoPlex8numCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 519, type: !380, isLocal: false, isDefinition: false, scopeLine: 519, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubprogram(name: "localAddRows", linkageName: "_ZN6soplex6SoPlex12localAddRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 533, type: !486, isLocal: false, isDefinition: false, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !396, !117}
!488 = !DISubprogram(name: "localAddCols", linkageName: "_ZN6soplex6SoPlex12localAddColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 535, type: !486, isLocal: false, isDefinition: false, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true)
!489 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex6SoPlex9addedRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 539, type: !486, isLocal: false, isDefinition: false, scopeLine: 539, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 57, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!490 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex6SoPlex9addedColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 541, type: !486, isLocal: false, isDefinition: false, scopeLine: 541, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 58, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!491 = !DISubprogram(name: "doRemoveRow", linkageName: "_ZN6soplex6SoPlex11doRemoveRowEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 544, type: !486, isLocal: false, isDefinition: false, scopeLine: 544, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 53, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!492 = !DISubprogram(name: "doRemoveRows", linkageName: "_ZN6soplex6SoPlex12doRemoveRowsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 546, type: !493, isLocal: false, isDefinition: false, scopeLine: 546, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 55, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !396, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!496 = !DISubprogram(name: "doRemoveCol", linkageName: "_ZN6soplex6SoPlex11doRemoveColEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 548, type: !486, isLocal: false, isDefinition: false, scopeLine: 548, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 56, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!497 = !DISubprogram(name: "doRemoveCols", linkageName: "_ZN6soplex6SoPlex12doRemoveColsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 550, type: !493, isLocal: false, isDefinition: false, scopeLine: 550, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 54, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!498 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 554, type: !499, isLocal: false, isDefinition: false, scopeLine: 554, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !396, !501}
!501 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!503 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 556, type: !504, isLocal: false, isDefinition: false, scopeLine: 556, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !396, !117, !248}
!506 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 558, type: !507, isLocal: false, isDefinition: false, scopeLine: 558, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !396, !"_ZTSN6soplex8SPxColIdE", !248}
!509 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 563, type: !499, isLocal: false, isDefinition: false, scopeLine: 563, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 565, type: !504, isLocal: false, isDefinition: false, scopeLine: 565, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 567, type: !507, isLocal: false, isDefinition: false, scopeLine: 567, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 572, type: !499, isLocal: false, isDefinition: false, scopeLine: 572, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 574, type: !504, isLocal: false, isDefinition: false, scopeLine: 574, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 32, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 576, type: !507, isLocal: false, isDefinition: false, scopeLine: 576, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 581, type: !516, isLocal: false, isDefinition: false, scopeLine: 581, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !396, !501, !501}
!518 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 583, type: !519, isLocal: false, isDefinition: false, scopeLine: 583, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !396, !117, !248, !248}
!521 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsENS_8SPxColIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 585, type: !522, isLocal: false, isDefinition: false, scopeLine: 585, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !396, !"_ZTSN6soplex8SPxColIdE", !248, !248}
!524 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 591, type: !499, isLocal: false, isDefinition: false, scopeLine: 591, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 593, type: !504, isLocal: false, isDefinition: false, scopeLine: 593, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 595, type: !527, isLocal: false, isDefinition: false, scopeLine: 595, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !396, !"_ZTSN6soplex8SPxRowIdE", !248}
!529 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 600, type: !499, isLocal: false, isDefinition: false, scopeLine: 600, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 40, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 602, type: !504, isLocal: false, isDefinition: false, scopeLine: 602, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 604, type: !527, isLocal: false, isDefinition: false, scopeLine: 604, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 42, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!532 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 609, type: !516, isLocal: false, isDefinition: false, scopeLine: 609, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 611, type: !519, isLocal: false, isDefinition: false, scopeLine: 611, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeENS_8SPxRowIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 613, type: !535, isLocal: false, isDefinition: false, scopeLine: 613, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !396, !"_ZTSN6soplex8SPxRowIdE", !248, !248}
!537 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowEiRKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 619, type: !538, isLocal: false, isDefinition: false, scopeLine: 619, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !396, !117, !540}
!540 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPRowE")
!542 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowENS_8SPxRowIdERKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 621, type: !543, isLocal: false, isDefinition: false, scopeLine: 621, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !396, !"_ZTSN6soplex8SPxRowIdE", !540}
!545 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColEiRKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 626, type: !546, isLocal: false, isDefinition: false, scopeLine: 626, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !396, !117, !548}
!548 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!550 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColENS_8SPxColIdERKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 628, type: !551, isLocal: false, isDefinition: false, scopeLine: 628, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !396, !"_ZTSN6soplex8SPxColIdE", !548}
!553 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementEiid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 633, type: !554, isLocal: false, isDefinition: false, scopeLine: 633, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !396, !117, !117, !248}
!556 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementENS_8SPxRowIdENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 635, type: !557, isLocal: false, isDefinition: false, scopeLine: 635, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !396, !"_ZTSN6soplex8SPxRowIdE", !"_ZTSN6soplex8SPxColIdE", !248}
!559 = !DISubprogram(name: "changeSense", linkageName: "_ZN6soplex6SoPlex11changeSenseENS_5SPxLP8SPxSenseE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 641, type: !560, isLocal: false, isDefinition: false, scopeLine: 641, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !396, !"_ZTSN6soplex5SPxLP8SPxSenseE"}
!562 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6SoPlex3dimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 645, type: !380, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!563 = !DISubprogram(name: "coDim", linkageName: "_ZNK6soplex6SoPlex5coDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 650, type: !380, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!564 = !DISubprogram(name: "id", linkageName: "_ZNK6soplex6SoPlex2idEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 666, type: !565, isLocal: false, isDefinition: false, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!"_ZTSN6soplex5SPxIdE", !382, !117}
!567 = !DISubprogram(name: "coId", linkageName: "_ZNK6soplex6SoPlex4coIdEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 685, type: !565, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubprogram(name: "isId", linkageName: "_ZNK6soplex6SoPlex4isIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 703, type: !569, isLocal: false, isDefinition: false, scopeLine: 703, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{!117, !382, !"_ZTSN6soplex5SPxIdE"}
!571 = !DISubprogram(name: "isCoId", linkageName: "_ZNK6soplex6SoPlex6isCoIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 712, type: !569, isLocal: false, isDefinition: false, scopeLine: 712, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!572 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 724, type: !573, isLocal: false, isDefinition: false, scopeLine: 724, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{!575, !382, !117}
!575 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!577 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 730, type: !578, isLocal: false, isDefinition: false, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubroutineType(types: !579)
!579 = !{!575, !382, !580}
!580 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!582 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 738, type: !583, isLocal: false, isDefinition: false, scopeLine: 738, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{!575, !382, !585}
!585 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!587 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 755, type: !588, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubroutineType(types: !589)
!589 = !{!575, !382, !590}
!590 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!592 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 768, type: !573, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 773, type: !578, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 781, type: !583, isLocal: false, isDefinition: false, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 795, type: !588, isLocal: false, isDefinition: false, scopeLine: 795, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "unitVector", linkageName: "_ZNK6soplex6SoPlex10unitVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 803, type: !573, isLocal: false, isDefinition: false, scopeLine: 803, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubprogram(name: "varStatus", linkageName: "_ZNK6soplex6SoPlex9varStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 816, type: !598, isLocal: false, isDefinition: false, scopeLine: 816, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubroutineType(types: !599)
!599 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !382, !117}
!600 = !DISubprogram(name: "covarStatus", linkageName: "_ZNK6soplex6SoPlex11covarStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 822, type: !598, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 828, type: !602, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubroutineType(types: !603)
!603 = !{!117, !382, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!604 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 834, type: !569, isLocal: false, isDefinition: false, scopeLine: 834, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 843, type: !606, isLocal: false, isDefinition: false, scopeLine: 843, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{!117, !382, !"_ZTSN6soplex8SPxRowIdE"}
!608 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 849, type: !609, isLocal: false, isDefinition: false, scopeLine: 849, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubroutineType(types: !610)
!610 = !{!117, !382, !"_ZTSN6soplex8SPxColIdE"}
!611 = !DISubprogram(name: "isRowBasic", linkageName: "_ZNK6soplex6SoPlex10isRowBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 855, type: !612, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{!117, !382, !117}
!614 = !DISubprogram(name: "isColBasic", linkageName: "_ZNK6soplex6SoPlex10isColBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 861, type: !612, isLocal: false, isDefinition: false, scopeLine: 861, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 867, type: !612, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubprogram(name: "isCoBasic", linkageName: "_ZNK6soplex6SoPlex9isCoBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 873, type: !612, isLocal: false, isDefinition: false, scopeLine: 873, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubprogram(name: "fVec", linkageName: "_ZNK6soplex6SoPlex4fVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 888, type: !618, isLocal: false, isDefinition: false, scopeLine: 888, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{!620, !382}
!620 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!621 = !DISubprogram(name: "fRhs", linkageName: "_ZNK6soplex6SoPlex4fRhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 901, type: !622, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{!501, !382}
!624 = !DISubprogram(name: "ubBound", linkageName: "_ZNK6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 906, type: !622, isLocal: false, isDefinition: false, scopeLine: 906, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubprogram(name: "ubBound", linkageName: "_ZN6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 919, type: !626, isLocal: false, isDefinition: false, scopeLine: 919, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{!470, !396}
!628 = !DISubprogram(name: "lbBound", linkageName: "_ZNK6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 924, type: !622, isLocal: false, isDefinition: false, scopeLine: 924, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!629 = !DISubprogram(name: "lbBound", linkageName: "_ZN6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 937, type: !626, isLocal: false, isDefinition: false, scopeLine: 937, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!630 = !DISubprogram(name: "fTest", linkageName: "_ZNK6soplex6SoPlex5fTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 950, type: !622, isLocal: false, isDefinition: false, scopeLine: 950, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!631 = !DISubprogram(name: "coPvec", linkageName: "_ZNK6soplex6SoPlex6coPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 963, type: !618, isLocal: false, isDefinition: false, scopeLine: 963, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubprogram(name: "coPrhs", linkageName: "_ZNK6soplex6SoPlex6coPrhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 976, type: !622, isLocal: false, isDefinition: false, scopeLine: 976, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubprogram(name: "ucBound", linkageName: "_ZNK6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 982, type: !622, isLocal: false, isDefinition: false, scopeLine: 982, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!634 = !DISubprogram(name: "ucBound", linkageName: "_ZN6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 996, type: !626, isLocal: false, isDefinition: false, scopeLine: 996, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubprogram(name: "lcBound", linkageName: "_ZNK6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1003, type: !622, isLocal: false, isDefinition: false, scopeLine: 1003, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!636 = !DISubprogram(name: "lcBound", linkageName: "_ZN6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1017, type: !626, isLocal: false, isDefinition: false, scopeLine: 1017, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1030, type: !622, isLocal: false, isDefinition: false, scopeLine: 1030, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!638 = !DISubprogram(name: "pVec", linkageName: "_ZNK6soplex6SoPlex4pVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1043, type: !618, isLocal: false, isDefinition: false, scopeLine: 1043, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!639 = !DISubprogram(name: "upBound", linkageName: "_ZNK6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1048, type: !622, isLocal: false, isDefinition: false, scopeLine: 1048, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!640 = !DISubprogram(name: "upBound", linkageName: "_ZN6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1062, type: !626, isLocal: false, isDefinition: false, scopeLine: 1062, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!641 = !DISubprogram(name: "lpBound", linkageName: "_ZNK6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1069, type: !622, isLocal: false, isDefinition: false, scopeLine: 1069, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubprogram(name: "lpBound", linkageName: "_ZN6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1083, type: !626, isLocal: false, isDefinition: false, scopeLine: 1083, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1096, type: !622, isLocal: false, isDefinition: false, scopeLine: 1096, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!644 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1103, type: !645, isLocal: false, isDefinition: false, scopeLine: 1103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubroutineType(types: !646)
!646 = !{!248, !396, !117}
!647 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1105, type: !444, isLocal: false, isDefinition: false, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!648 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1107, type: !645, isLocal: false, isDefinition: false, scopeLine: 1107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!649 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1109, type: !444, isLocal: false, isDefinition: false, scopeLine: 1109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubprogram(name: "shiftFvec", linkageName: "_ZN6soplex6SoPlex9shiftFvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1135, type: !444, isLocal: false, isDefinition: false, scopeLine: 1135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!651 = !DISubprogram(name: "shiftPvec", linkageName: "_ZN6soplex6SoPlex9shiftPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1137, type: !444, isLocal: false, isDefinition: false, scopeLine: 1137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubprogram(name: "shiftUBbound", linkageName: "_ZN6soplex6SoPlex12shiftUBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1140, type: !504, isLocal: false, isDefinition: false, scopeLine: 1140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!653 = !DISubprogram(name: "shiftLBbound", linkageName: "_ZN6soplex6SoPlex12shiftLBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1147, type: !504, isLocal: false, isDefinition: false, scopeLine: 1147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!654 = !DISubprogram(name: "shiftUPbound", linkageName: "_ZN6soplex6SoPlex12shiftUPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1154, type: !504, isLocal: false, isDefinition: false, scopeLine: 1154, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubprogram(name: "shiftLPbound", linkageName: "_ZN6soplex6SoPlex12shiftLPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1161, type: !504, isLocal: false, isDefinition: false, scopeLine: 1161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!656 = !DISubprogram(name: "shiftUCbound", linkageName: "_ZN6soplex6SoPlex12shiftUCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1168, type: !504, isLocal: false, isDefinition: false, scopeLine: 1168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!657 = !DISubprogram(name: "shiftLCbound", linkageName: "_ZN6soplex6SoPlex12shiftLCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1175, type: !504, isLocal: false, isDefinition: false, scopeLine: 1175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!658 = !DISubprogram(name: "testBounds", linkageName: "_ZNK6soplex6SoPlex10testBoundsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1182, type: !659, isLocal: false, isDefinition: false, scopeLine: 1182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !382}
!661 = !DISubprogram(name: "shift", linkageName: "_ZNK6soplex6SoPlex5shiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1185, type: !465, isLocal: false, isDefinition: false, scopeLine: 1185, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!662 = !DISubprogram(name: "unShift", linkageName: "_ZN6soplex6SoPlex7unShiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1190, type: !444, isLocal: false, isDefinition: false, scopeLine: 1190, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 82, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!663 = !DISubprogram(name: "qualConstraintViolation", linkageName: "_ZNK6soplex6SoPlex23qualConstraintViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1193, type: !664, isLocal: false, isDefinition: false, scopeLine: 1193, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !382, !666, !666}
!666 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !249)
!667 = !DISubprogram(name: "qualConstraintViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex31qualConstraintViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1197, type: !664, isLocal: false, isDefinition: false, scopeLine: 1197, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubprogram(name: "qualBoundViolation", linkageName: "_ZNK6soplex6SoPlex18qualBoundViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1201, type: !664, isLocal: false, isDefinition: false, scopeLine: 1201, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!669 = !DISubprogram(name: "qualBoundViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex26qualBoundViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1205, type: !664, isLocal: false, isDefinition: false, scopeLine: 1205, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!670 = !DISubprogram(name: "qualSlackViolation", linkageName: "_ZNK6soplex6SoPlex18qualSlackViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1209, type: !664, isLocal: false, isDefinition: false, scopeLine: 1209, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubprogram(name: "qualRdCostViolation", linkageName: "_ZNK6soplex6SoPlex19qualRdCostViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1212, type: !664, isLocal: false, isDefinition: false, scopeLine: 1212, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!672 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1216, type: !673, isLocal: false, isDefinition: false, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: true)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !396, !675, !470, !470, !248, !117, !117}
!675 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!677 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1220, type: !673, isLocal: false, isDefinition: false, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true)
!678 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1224, type: !679, isLocal: false, isDefinition: false, scopeLine: 1224, flags: DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!248, !396, !675, !470, !470, !248, !248, !681, !117, !117}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4Desc6StatusE")
!683 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1228, type: !679, isLocal: false, isDefinition: false, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: true)
!684 = !DISubprogram(name: "setup4solve", linkageName: "_ZN6soplex6SoPlex11setup4solveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1259, type: !685, isLocal: false, isDefinition: false, scopeLine: 1259, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !396, !328, !330}
!687 = !DISubprogram(name: "setup4coSolve", linkageName: "_ZN6soplex6SoPlex13setup4coSolveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1273, type: !685, isLocal: false, isDefinition: false, scopeLine: 1273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!688 = !DISubprogram(name: "maxInfeas", linkageName: "_ZNK6soplex6SoPlex9maxInfeasEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1286, type: !465, isLocal: false, isDefinition: false, scopeLine: 1286, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubprogram(name: "basis", linkageName: "_ZNK6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1294, type: !690, isLocal: false, isDefinition: false, scopeLine: 1294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !382}
!692 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!694 = !DISubprogram(name: "basis", linkageName: "_ZN6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1299, type: !695, isLocal: false, isDefinition: false, scopeLine: 1299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !396}
!697 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasisE")
