; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdesc.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::SPxBasis::Desc" = type { %"class.soplex::DataArray", %"class.soplex::DataArray", %"class.soplex::DataArray"*, %"class.soplex::DataArray"* }
%"class.soplex::DataArray" = type { i32, i32, i32*, double }
%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
%"class.std::__1::locale::__imp" = type opaque
%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
%"class.std::__1::ctype" = type <{ %"class.std::__1::locale::facet", i32*, i8, [7 x i8] }>
%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }

!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "ROW_ID", value: -1)
!7 = !DIEnumerator(name: "INVALID", value: 0)
!8 = !DIEnumerator(name: "COL_ID", value: 1)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex10SLinSolverE", file: !10, line: 50, size: 32, align: 32, elements: !11, identifier: "_ZTSN6soplex10SLinSolver6StatusE")
!10 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slinsolver.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !{!12, !13, !14, !15, !16}
!12 = !DIEnumerator(name: "OK", value: 0)
!13 = !DIEnumerator(name: "INSTABLE", value: 1)
!14 = !DIEnumerator(name: "SINGULAR", value: 2)
!15 = !DIEnumerator(name: "UNLOADED", value: 4)
!16 = !DIEnumerator(name: "ERROR", value: 8)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SPxStatus", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 79, size: 32, align: 32, elements: !19, identifier: "_ZTSN6soplex8SPxBasis9SPxStatusE")
!18 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxbasis.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27}
!20 = !DIEnumerator(name: "NO_PROBLEM", value: -2)
!21 = !DIEnumerator(name: "SINGULAR", value: -1)
!22 = !DIEnumerator(name: "REGULAR", value: 0)
!23 = !DIEnumerator(name: "DUAL", value: 1)
!24 = !DIEnumerator(name: "PRIMAL", value: 2)
!25 = !DIEnumerator(name: "OPTIMAL", value: 3)
!26 = !DIEnumerator(name: "UNBOUNDED", value: 4)
!27 = !DIEnumerator(name: "INFEASIBLE", value: 5)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex8SPxBasis4DescE", file: !18, line: 170, size: 32, align: 32, elements: !29, identifier: "_ZTSN6soplex8SPxBasis4Desc6StatusE")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38}
!30 = !DIEnumerator(name: "P_ON_LOWER", value: -4)
!31 = !DIEnumerator(name: "P_ON_UPPER", value: -2)
!32 = !DIEnumerator(name: "P_FREE", value: -1)
!33 = !DIEnumerator(name: "P_FIXED", value: -6)
!34 = !DIEnumerator(name: "D_FREE", value: 1)
!35 = !DIEnumerator(name: "D_ON_UPPER", value: 2)
!36 = !DIEnumerator(name: "D_ON_LOWER", value: 4)
!37 = !DIEnumerator(name: "D_ON_BOTH", value: 6)
!38 = !DIEnumerator(name: "D_UNDEFINED", value: 8)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !40, line: 305, size: 32, align: 32, elements: !41, identifier: "_ZTSNSt3__18ios_base5eventE")
!40 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "erase_event", value: 0)
!43 = !DIEnumerator(name: "imbue_event", value: 1)
!44 = !DIEnumerator(name: "copyfmt_event", value: 2)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !40, line: 272, size: 32, align: 32, elements: !46, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "beg", value: 0)
!48 = !DIEnumerator(name: "cur", value: 1)
!49 = !DIEnumerator(name: "end", value: 2)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !51, line: 87, size: 32, align: 32, elements: !52, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!51 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "FREE", value: 0)
!54 = !DIEnumerator(name: "RELEASED", value: 1)
!55 = !DIEnumerator(name: "USED", value: 2)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !57, line: 1280, size: 32, align: 32, elements: !58, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!57 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !{!59}
!59 = !DIEnumerator(name: "__short_mask", value: 1)
!60 = !{!61, !118, !122, !123, !130, !137, !152, !157, !161, !165, !370, !372, !452, !491, !3, !521, !534, !547, !627, !726, !730, !806, !929, !979, !1024, !1148, !1223, !1339, !1366, !1370, !1412, !1469, !9, !17, !1535, !1580, !28, !1657, !1821, !1871, !1947, !39, !2095, !2170, !2171, !2527, !2564, !2568, !2578, !2633, !2636, !2641, !2646, !2650, !2693, !2697, !2699, !2709, !2714, !2715, !2718, !2721, !2734, !2745, !2752, !2756, !2760, !2797, !2800, !2802, !2803, !2804, !2805, !2807, !2818, !2847, !2868, !2885, !2987, !3092, !45, !3093, !3181, !3292, !3296, !3357, !3375, !3455, !68, !50, !3463, !3487, !3518, !3524, !3525, !3542, !179, !56, !3545, !3555, !3559, !101, !1668, !1764, !3560, !3631, !85, !1585}
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !62, line: 122, size: 1216, align: 64, elements: !63, identifier: "_ZTS7__sFILE")
!62 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !{!64, !67, !69, !70, !72, !73, !74, !75, !77, !81, !87, !97, !103, !104, !106, !107, !111, !115, !116, !117}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !62, line: 123, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !62, line: 124, baseType: !68, size: 32, align: 32, offset: 64)
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !62, line: 125, baseType: !68, size: 32, align: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !62, line: 126, baseType: !71, size: 16, align: 16, offset: 128)
!71 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !62, line: 127, baseType: !71, size: 16, align: 16, offset: 144)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !62, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !62, line: 129, baseType: !68, size: 32, align: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !62, line: 132, baseType: !76, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !62, line: 133, baseType: !78, size: 64, align: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!68, !76}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !62, line: 134, baseType: !82, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!68, !76, !85, !68}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !62, line: 135, baseType: !88, size: 64, align: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !76, !91, !68}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !62, line: 77, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !93, line: 71, baseType: !94)
!93 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!96 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !62, line: 136, baseType: !98, size: 64, align: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!68, !76, !101, !68}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !62, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !62, line: 140, baseType: !105, size: 64, align: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !62, line: 141, baseType: !68, size: 32, align: 32, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !62, line: 144, baseType: !108, size: 24, align: 8, offset: 928)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 24, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 3)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !62, line: 145, baseType: !112, size: 8, align: 8, offset: 952)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !62, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !62, line: 151, baseType: !68, size: 32, align: 32, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !62, line: 152, baseType: !91, size: 64, align: 64, offset: 1152)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !62, line: 88, size: 128, align: 64, elements: !119, identifier: "_ZTS6__sbuf")
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !62, line: 89, baseType: !65, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !62, line: 90, baseType: !68, size: 32, align: 32, offset: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !62, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !124, identifier: "_ZTS13__va_list_tag")
!124 = !{!125, !127, !128, !129}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !126, size: 32, align: 32)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !126, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !76, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !76, size: 64, align: 64, offset: 128)
!130 = !DICompositeType(tag: DW_TAG_union_type, file: !95, line: 76, size: 1024, align: 64, elements: !131, identifier: "_ZTS11__mbstate_t")
!131 = !{!132, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !95, line: 77, baseType: !133, size: 1024, align: 8)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 1024, align: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !95, line: 78, baseType: !96, size: 64, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !138, line: 73, size: 448, align: 64, elements: !139, identifier: "_ZTS2tm")
!138 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !151}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !138, line: 74, baseType: !68, size: 32, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !138, line: 75, baseType: !68, size: 32, align: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !138, line: 76, baseType: !68, size: 32, align: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !138, line: 77, baseType: !68, size: 32, align: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !138, line: 78, baseType: !68, size: 32, align: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !138, line: 79, baseType: !68, size: 32, align: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !138, line: 80, baseType: !68, size: 32, align: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !138, line: 81, baseType: !68, size: 32, align: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !138, line: 82, baseType: !68, size: 32, align: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !138, line: 83, baseType: !150, size: 64, align: 64, offset: 320)
!150 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !138, line: 84, baseType: !85, size: 64, align: 64, offset: 384)
!152 = !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 82, size: 64, align: 32, elements: !154, identifier: "_ZTS5div_t")
!153 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !153, line: 83, baseType: !68, size: 32, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !153, line: 84, baseType: !68, size: 32, align: 32, offset: 32)
!157 = !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 87, size: 128, align: 64, elements: !158, identifier: "_ZTS6ldiv_t")
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !153, line: 88, baseType: !150, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !153, line: 89, baseType: !150, size: 64, align: 64, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 93, size: 128, align: 64, elements: !162, identifier: "_ZTS7lldiv_t")
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !153, line: 94, baseType: !96, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !153, line: 95, baseType: !96, size: 64, align: 64, offset: 64)
!165 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxBasis", scope: !166, file: !18, line: 71, size: 1664, align: 64, elements: !168, vtableHolder: !"_ZTSN6soplex8SPxBasisE", identifier: "_ZTSN6soplex8SPxBasisE")
!166 = !DINamespace(name: "soplex", scope: null, file: !167, line: 49)
!167 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!168 = !{!169, !174, !176, !177, !178, !180, !182, !183, !184, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !202, !206, !211, !215, !218, !223, !224, !229, !234, !238, !241, !246, !249, !250, !253, !254, !255, !258, !262, !263, !266, !269, !273, !276, !279, !284, !287, !290, !293, !294, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !309, !310, !314, !315, !316, !317, !318, !319, !322, !328, !339, !344, !347, !350, !353, !356, !357, !358, !361, !362, !363, !364, !365, !368, !369}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxBasis", scope: !18, file: !18, baseType: !170, size: 64, flags: DIFlagArtificial)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!68}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "theLP", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 296, baseType: !175, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "theBaseId", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 307, baseType: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", size: 192, align: 64, offset: 128, flags: DIFlagProtected)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 310, baseType: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", size: 192, align: 64, offset: 320, flags: DIFlagProtected)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "matrixIsSetup", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 313, baseType: !179, size: 8, align: 8, offset: 512, flags: DIFlagProtected)
!179 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 318, baseType: !181, size: 64, align: 64, offset: 576, flags: DIFlagProtected)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "factorized", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 319, baseType: !179, size: 8, align: 8, offset: 640, flags: DIFlagProtected)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "maxUpdates", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 328, baseType: !68, size: 32, align: 32, offset: 672, flags: DIFlagProtected)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nonzeroFactor", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 335, baseType: !185, size: 64, align: 64, offset: 704, flags: DIFlagProtected)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !166, file: !167, line: 127, baseType: !186)
!186 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "iterCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 341, baseType: !68, size: 32, align: 32, offset: 768, flags: DIFlagProtected)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "updateCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 342, baseType: !68, size: 32, align: 32, offset: 800, flags: DIFlagProtected)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nzCount", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 343, baseType: !68, size: 32, align: 32, offset: 832, flags: DIFlagProtected)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nzFac", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 344, baseType: !185, size: 64, align: 64, offset: 896, flags: DIFlagProtected)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "lastFill", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 345, baseType: !185, size: 64, align: 64, offset: 960, flags: DIFlagProtected)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "lastin", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 347, baseType: !"_ZTSN6soplex5SPxIdE", size: 32, align: 32, offset: 1024, flags: DIFlagProtected)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "lastout", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 348, baseType: !"_ZTSN6soplex5SPxIdE", size: 32, align: 32, offset: 1056, flags: DIFlagProtected)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 349, baseType: !68, size: 32, align: 32, offset: 1088, flags: DIFlagProtected)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "thestatus", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 352, baseType: !"_ZTSN6soplex8SPxBasis9SPxStatusE", size: 32, align: 32, offset: 1120)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "thedesc", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 353, baseType: !"_ZTSN6soplex8SPxBasis4DescE", size: 512, align: 64, offset: 1152)
!197 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex8SPxBasis6statusEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 359, type: !198, isLocal: false, isDefinition: false, scopeLine: 359, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{!"_ZTSN6soplex8SPxBasis9SPxStatusE", !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!202 = !DISubprogram(name: "setStatus", linkageName: "_ZN6soplex8SPxBasis9setStatusENS0_9SPxStatusE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 365, type: !203, isLocal: false, isDefinition: false, scopeLine: 365, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205, !"_ZTSN6soplex8SPxBasis9SPxStatusE"}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SPxBasisE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!206 = !DISubprogram(name: "desc", linkageName: "_ZNK6soplex8SPxBasis4descEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 377, type: !207, isLocal: false, isDefinition: false, scopeLine: 377, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !200}
!209 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!211 = !DISubprogram(name: "desc", linkageName: "_ZN6soplex8SPxBasis4descEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 382, type: !212, isLocal: false, isDefinition: false, scopeLine: 382, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !205}
!214 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!215 = !DISubprogram(name: "dualColStatus", linkageName: "_ZNK6soplex8SPxBasis13dualColStatusEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 388, type: !216, isLocal: false, isDefinition: false, scopeLine: 388, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !200, !68}
!218 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_8SPxColIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 391, type: !219, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !200, !221}
!221 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!223 = !DISubprogram(name: "dualRowStatus", linkageName: "_ZNK6soplex8SPxBasis13dualRowStatusEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 394, type: !216, isLocal: false, isDefinition: false, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 397, type: !225, isLocal: false, isDefinition: false, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!225 = !DISubroutineType(types: !226)
!226 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !200, !227}
!227 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!229 = !DISubprogram(name: "dualStatus", linkageName: "_ZNK6soplex8SPxBasis10dualStatusERKNS_5SPxIdE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 404, type: !230, isLocal: false, isDefinition: false, scopeLine: 404, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !200, !232}
!232 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!234 = !DISubprogram(name: "baseId", linkageName: "_ZN6soplex8SPxBasis6baseIdEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 416, type: !235, isLocal: false, isDefinition: false, scopeLine: 416, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !205, !68}
!237 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SPxIdE")
!238 = !DISubprogram(name: "baseId", linkageName: "_ZNK6soplex8SPxBasis6baseIdEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 421, type: !239, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubroutineType(types: !240)
!240 = !{!"_ZTSN6soplex5SPxIdE", !200, !68}
!241 = !DISubprogram(name: "baseVec", linkageName: "_ZNK6soplex8SPxBasis7baseVecEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 427, type: !242, isLocal: false, isDefinition: false, scopeLine: 427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !200, !68}
!244 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!246 = !DISubprogram(name: "lastEntered", linkageName: "_ZNK6soplex8SPxBasis11lastEnteredEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 434, type: !247, isLocal: false, isDefinition: false, scopeLine: 434, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubroutineType(types: !248)
!248 = !{!"_ZTSN6soplex5SPxIdE", !200}
!249 = !DISubprogram(name: "lastLeft", linkageName: "_ZNK6soplex8SPxBasis8lastLeftEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 440, type: !247, isLocal: false, isDefinition: false, scopeLine: 440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!250 = !DISubprogram(name: "lastIndex", linkageName: "_ZNK6soplex8SPxBasis9lastIndexEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 446, type: !251, isLocal: false, isDefinition: false, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!68, !200}
!253 = !DISubprogram(name: "lastUpdate", linkageName: "_ZNK6soplex8SPxBasis10lastUpdateEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 452, type: !251, isLocal: false, isDefinition: false, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubprogram(name: "iteration", linkageName: "_ZNK6soplex8SPxBasis9iterationEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 458, type: !251, isLocal: false, isDefinition: false, scopeLine: 458, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubprogram(name: "solver", linkageName: "_ZNK6soplex8SPxBasis6solverEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 464, type: !256, isLocal: false, isDefinition: false, scopeLine: 464, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!256 = !DISubroutineType(types: !257)
!257 = !{!175, !200}
!258 = !DISubprogram(name: "multBaseWith", linkageName: "_ZNK6soplex8SPxBasis12multBaseWithERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 481, type: !259, isLocal: false, isDefinition: false, scopeLine: 481, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !200, !261}
!261 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!262 = !DISubprogram(name: "multWithBase", linkageName: "_ZNK6soplex8SPxBasis12multWithBaseERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 492, type: !259, isLocal: false, isDefinition: false, scopeLine: 492, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubprogram(name: "stability", linkageName: "_ZNK6soplex8SPxBasis9stabilityEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 495, type: !264, isLocal: false, isDefinition: false, scopeLine: 495, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{!185, !200}
!266 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_6VectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 502, type: !267, isLocal: false, isDefinition: false, scopeLine: 502, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !205, !261, !261}
!269 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 509, type: !270, isLocal: false, isDefinition: false, scopeLine: 509, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !205, !261, !272}
!272 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!273 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 516, type: !274, isLocal: false, isDefinition: false, scopeLine: 516, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !205, !272, !261}
!276 = !DISubprogram(name: "solve2", linkageName: "_ZN6soplex8SPxBasis6solve2ERNS_8SSVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 523, type: !277, isLocal: false, isDefinition: false, scopeLine: 523, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !205, !272, !272}
!279 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_6VectorERKS1_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 530, type: !280, isLocal: false, isDefinition: false, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !205, !261, !282}
!282 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!284 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 537, type: !285, isLocal: false, isDefinition: false, scopeLine: 537, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !205, !261, !244}
!287 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 544, type: !288, isLocal: false, isDefinition: false, scopeLine: 544, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !205, !272, !244}
!290 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex8SPxBasis5solveERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 551, type: !291, isLocal: false, isDefinition: false, scopeLine: 551, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !205, !272, !282}
!293 = !DISubprogram(name: "solve4update", linkageName: "_ZN6soplex8SPxBasis12solve4updateERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 567, type: !288, isLocal: false, isDefinition: false, scopeLine: 567, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubprogram(name: "solve4update", linkageName: "_ZN6soplex8SPxBasis12solve4updateERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 574, type: !295, isLocal: false, isDefinition: false, scopeLine: 574, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !205, !272, !261, !244, !272}
!297 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_6VectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 586, type: !267, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!298 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 593, type: !270, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!299 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 600, type: !274, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubprogram(name: "coSolve2", linkageName: "_ZN6soplex8SPxBasis8coSolve2ERNS_8SSVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 607, type: !277, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_6VectorERKS1_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 614, type: !280, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!302 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 621, type: !285, isLocal: false, isDefinition: false, scopeLine: 621, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 628, type: !288, isLocal: false, isDefinition: false, scopeLine: 628, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 648, type: !291, isLocal: false, isDefinition: false, scopeLine: 648, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!305 = !DISubprogram(name: "coSolve", linkageName: "_ZN6soplex8SPxBasis7coSolveERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 656, type: !295, isLocal: false, isDefinition: false, scopeLine: 656, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!306 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex8SPxBasis9addedRowsEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 671, type: !307, isLocal: false, isDefinition: false, scopeLine: 671, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !205, !68}
!309 = !DISubprogram(name: "removedRow", linkageName: "_ZN6soplex8SPxBasis10removedRowEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 673, type: !307, isLocal: false, isDefinition: false, scopeLine: 673, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!310 = !DISubprogram(name: "removedRows", linkageName: "_ZN6soplex8SPxBasis11removedRowsEPi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 676, type: !311, isLocal: false, isDefinition: false, scopeLine: 676, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !205, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!314 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex8SPxBasis9addedColsEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 678, type: !307, isLocal: false, isDefinition: false, scopeLine: 678, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!315 = !DISubprogram(name: "removedCol", linkageName: "_ZN6soplex8SPxBasis10removedColEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 680, type: !307, isLocal: false, isDefinition: false, scopeLine: 680, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!316 = !DISubprogram(name: "removedCols", linkageName: "_ZN6soplex8SPxBasis11removedColsEPi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 683, type: !311, isLocal: false, isDefinition: false, scopeLine: 683, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubprogram(name: "changedRow", linkageName: "_ZN6soplex8SPxBasis10changedRowEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 685, type: !307, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!318 = !DISubprogram(name: "changedCol", linkageName: "_ZN6soplex8SPxBasis10changedColEi", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 687, type: !307, isLocal: false, isDefinition: false, scopeLine: 687, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!319 = !DISubprogram(name: "changedElement", linkageName: "_ZN6soplex8SPxBasis14changedElementEii", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 689, type: !320, isLocal: false, isDefinition: false, scopeLine: 689, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !205, !68, !68}
!322 = !DISubprogram(name: "change", linkageName: "_ZN6soplex8SPxBasis6changeEiRNS_5SPxIdEPKNS_7SVectorEPKNS_8SSVectorE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 723, type: !323, isLocal: false, isDefinition: false, scopeLine: 723, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !205, !68, !237, !325, !326}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!328 = !DISubprogram(name: "readBasis", linkageName: "_ZN6soplex8SPxBasis9readBasisERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEERKNS_7NameSetES9_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 727, type: !329, isLocal: false, isDefinition: false, scopeLine: 727, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{!179, !205, !331, !337, !337}
!331 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !334, file: !333, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!333 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!334 = !DINamespace(name: "__1", scope: !336, file: !335, line: 369)
!335 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!336 = !DINamespace(name: "std", scope: null, file: !335, line: 368)
!337 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!339 = !DISubprogram(name: "writeBasis", linkageName: "_ZN6soplex8SPxBasis10writeBasisERNSt3__113basic_ostreamIcNS1_11char_traitsIcEEEERKNS_7NameSetES9_", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 731, type: !340, isLocal: false, isDefinition: false, scopeLine: 731, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !205, !342, !337, !337}
!342 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ostream", scope: !334, file: !333, line: 147, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!344 = !DISubprogram(name: "loadDesc", linkageName: "_ZN6soplex8SPxBasis8loadDescERKNS0_4DescE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 739, type: !345, isLocal: false, isDefinition: false, scopeLine: 739, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !205, !209}
!347 = !DISubprogram(name: "loadSolver", linkageName: "_ZN6soplex8SPxBasis10loadSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 742, type: !348, isLocal: false, isDefinition: false, scopeLine: 742, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !205, !181}
!350 = !DISubprogram(name: "load", linkageName: "_ZN6soplex8SPxBasis4loadEPNS_6SoPlexE", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 748, type: !351, isLocal: false, isDefinition: false, scopeLine: 748, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !205, !175}
!353 = !DISubprogram(name: "unLoad", linkageName: "_ZN6soplex8SPxBasis6unLoadEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 751, type: !354, isLocal: false, isDefinition: false, scopeLine: 751, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !205}
!356 = !DISubprogram(name: "invalidate", linkageName: "_ZN6soplex8SPxBasis10invalidateEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 762, type: !354, isLocal: false, isDefinition: false, scopeLine: 762, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!357 = !DISubprogram(name: "dump", linkageName: "_ZN6soplex8SPxBasis4dumpEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 765, type: !354, isLocal: false, isDefinition: false, scopeLine: 765, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SPxBasis12isConsistentEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 768, type: !359, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!179, !200}
!361 = !DISubprogram(name: "SPxBasis", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 775, type: !354, isLocal: false, isDefinition: false, scopeLine: 775, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!362 = !DISubprogram(name: "~SPxBasis", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 778, type: !354, isLocal: false, isDefinition: false, scopeLine: 778, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubprogram(name: "loadMatrixVecs", linkageName: "_ZN6soplex8SPxBasis14loadMatrixVecsEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 788, type: !354, isLocal: false, isDefinition: false, scopeLine: 788, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!364 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SPxBasis5reDimEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 796, type: !354, isLocal: false, isDefinition: false, scopeLine: 796, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!365 = !DISubprogram(name: "doFactorize", linkageName: "_ZN6soplex8SPxBasis11doFactorizeEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 799, type: !366, isLocal: false, isDefinition: false, scopeLine: 799, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!68, !205}
!368 = !DISubprogram(name: "factorize", linkageName: "_ZN6soplex8SPxBasis9factorizeEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 802, type: !354, isLocal: false, isDefinition: false, scopeLine: 802, containingType: !"_ZTSN6soplex8SPxBasisE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!369 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex8SPxBasis6setRepEv", scope: !"_ZTSN6soplex8SPxBasisE", file: !18, line: 805, type: !354, isLocal: false, isDefinition: false, scopeLine: 805, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!370 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !166, file: !371, line: 44, flags: DIFlagFwdDecl, identifier: "_ZTSN6soplex6SoPlexE")
!371 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxlp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!372 = !DICompositeType(tag: DW_TAG_class_type, name: "DataArray<soplex::SPxId>", scope: !166, file: !373, line: 68, size: 192, align: 64, elements: !374, templateParams: !450, identifier: "_ZTSN6soplex9DataArrayINS_5SPxIdEEE")
!373 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dataarray.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!374 = !{!375, !376, !377, !379, !380, !384, !389, !392, !395, !398, !402, !405, !408, !412, !415, !418, !421, !422, !425, !428, !431, !432, !433, !438, !442, !445, !446, !449}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "thesize", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 71, baseType: !68, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "themax", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 72, baseType: !68, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 73, baseType: !378, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex5SPxIdE", size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "memFactor", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 82, baseType: !185, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!380 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEEixEi", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 87, type: !381, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!237, !383, !68}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!384 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex9DataArrayINS_5SPxIdEEixEi", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 94, type: !385, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{!232, !387, !68}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE")
!389 = !DISubprogram(name: "last", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE4lastEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 102, type: !390, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{!237, !383}
!392 = !DISubprogram(name: "last", linkageName: "_ZNK6soplex9DataArrayINS_5SPxIdEE4lastEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 108, type: !393, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{!232, !387}
!395 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE7get_ptrEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 115, type: !396, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{!378, !383}
!398 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex9DataArrayINS_5SPxIdEE13get_const_ptrEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 120, type: !399, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!401, !387}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!402 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6appendERKS1_", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 126, type: !403, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !383, !232}
!405 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6appendEiPKS1_", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 131, type: !406, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !383, !68, !401}
!408 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6appendERKS2_", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 136, type: !409, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !383, !411}
!411 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !388)
!412 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6insertEii", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 142, type: !413, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !383, !68, !68}
!415 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6insertEiiPKS1_", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 151, type: !416, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !383, !68, !68, !401}
!418 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6insertEiRKS2_", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 161, type: !419, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !383, !68, !411}
!421 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6removeEii", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 171, type: !413, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubprogram(name: "removeLast", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE10removeLastEi", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 181, type: !423, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !383, !68}
!425 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE5clearEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 187, type: !426, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !383}
!428 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex9DataArrayINS_5SPxIdEE4sizeEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 193, type: !429, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{!68, !387}
!431 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE6reSizeEi", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 205, type: !423, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!432 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex9DataArrayINS_5SPxIdEE3maxEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 221, type: !429, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!433 = !DISubprogram(name: "reMax", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEE5reMaxEii", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 239, type: !434, isLocal: false, isDefinition: false, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !383, !68, !68}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !437, line: 51, baseType: !150)
!437 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!438 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex9DataArrayINS_5SPxIdEEaSERKS2_", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 262, type: !439, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !383, !411}
!441 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE")
!442 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9DataArrayINS_5SPxIdEE12isConsistentEv", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 273, type: !443, isLocal: false, isDefinition: false, scopeLine: 273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!179, !387}
!445 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 286, type: !409, isLocal: false, isDefinition: false, scopeLine: 286, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 309, type: !447, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !383, !68, !68, !185}
!449 = !DISubprogram(name: "~DataArray", scope: !"_ZTSN6soplex9DataArrayINS_5SPxIdEEE", file: !373, line: 325, type: !426, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!450 = !{!451}
!451 = !DITemplateTypeParameter(name: "T", type: !"_ZTSN6soplex5SPxIdE")
!452 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxId", scope: !166, file: !4, line: 88, size: 32, align: 32, elements: !453, identifier: "_ZTSN6soplex5SPxIdE")
!453 = !{!454, !455, !459, !462, !466, !467, !468, !471, !474, !477, !478, !481, !484, !487, !488}
!454 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex5SPxIdE", baseType: !"_ZTSN6soplex7DataKeyE", flags: DIFlagPublic)
!455 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex5SPxId4typeEv", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 100, type: !456, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!"_ZTSN6soplex5SPxId4TypeE", !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!459 = !DISubprogram(name: "isValid", linkageName: "_ZNK6soplex5SPxId7isValidEv", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 105, type: !460, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!460 = !DISubroutineType(types: !461)
!461 = !{!179, !458}
!462 = !DISubprogram(name: "inValidate", linkageName: "_ZN6soplex5SPxId10inValidateEv", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 110, type: !463, isLocal: false, isDefinition: false, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex5SPxIdE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!466 = !DISubprogram(name: "isSPxRowId", linkageName: "_ZNK6soplex5SPxId10isSPxRowIdEv", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 115, type: !460, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubprogram(name: "isSPxColId", linkageName: "_ZNK6soplex5SPxId10isSPxColIdEv", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 120, type: !460, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex5SPxIdaSERKS0_", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 125, type: !469, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{!237, !465, !232}
!471 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex5SPxIdaSERKNS_8SPxColIdE", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 132, type: !472, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{!237, !465, !221}
!474 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex5SPxIdaSERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 139, type: !475, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!237, !465, !227}
!477 = !DISubprogram(name: "SPxId", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 146, type: !463, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubprogram(name: "SPxId", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 150, type: !479, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !465, !221}
!481 = !DISubprogram(name: "SPxId", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 154, type: !482, isLocal: false, isDefinition: false, scopeLine: 154, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !465, !227}
!484 = !DISubprogram(name: "operator==", linkageName: "_ZN6soplex5SPxIdeqERKS0_", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 158, type: !485, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{!68, !465, !232}
!487 = !DISubprogram(name: "operator!=", linkageName: "_ZN6soplex5SPxIdneERKS0_", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 163, type: !485, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubprogram(name: "operator<", linkageName: "_ZN6soplex5SPxIdltERKS0_", scope: !"_ZTSN6soplex5SPxIdE", file: !4, line: 168, type: !489, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!489 = !DISubroutineType(types: !490)
!490 = !{!179, !465, !232}
!491 = !DICompositeType(tag: DW_TAG_class_type, name: "DataKey", scope: !166, file: !492, line: 50, size: 32, align: 32, elements: !493, identifier: "_ZTSN6soplex7DataKeyE")
!492 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datakey.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!493 = !{!494, !495, !496, !501, !505, !506, !509, !510, !513, !518}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 54, baseType: !68, size: 8, align: 32, flags: DIFlagPublic)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 55, baseType: !68, size: 24, align: 32, offset: 8, flags: DIFlagPublic)
!496 = !DISubprogram(name: "getIdx", linkageName: "_ZNK6soplex7DataKey6getIdxEv", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 59, type: !497, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!497 = !DISubroutineType(types: !498)
!498 = !{!68, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DataKeyE")
!501 = !DISubprogram(name: "setIdx", linkageName: "_ZN6soplex7DataKey6setIdxEi", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 64, type: !502, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504, !68}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DataKeyE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!505 = !DISubprogram(name: "isValid", linkageName: "_ZNK6soplex7DataKey7isValidEv", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 69, type: !497, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubprogram(name: "inValidate", linkageName: "_ZN6soplex7DataKey10inValidateEv", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 74, type: !507, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !504}
!509 = !DISubprogram(name: "DataKey", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 80, type: !507, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubprogram(name: "DataKey", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 85, type: !511, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !504, !68, !68}
!513 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DataKeyaSERKS0_", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 91, type: !514, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !504, !517}
!516 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DataKeyE")
!517 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !500)
!518 = !DISubprogram(name: "DataKey", scope: !"_ZTSN6soplex7DataKeyE", file: !492, line: 99, type: !519, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !504, !517}
!521 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxColId", scope: !166, file: !4, line: 40, size: 32, align: 32, elements: !522, identifier: "_ZTSN6soplex8SPxColIdE")
!522 = !{!523, !524, !528, !531}
!523 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SPxColIdE", baseType: !"_ZTSN6soplex7DataKeyE", flags: DIFlagPublic)
!524 = !DISubprogram(name: "SPxColId", scope: !"_ZTSN6soplex8SPxColIdE", file: !4, line: 44, type: !525, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SPxColIdE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!528 = !DISubprogram(name: "SPxColId", scope: !"_ZTSN6soplex8SPxColIdE", file: !4, line: 47, type: !529, isLocal: false, isDefinition: false, scopeLine: 47, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !527, !517}
!531 = !DISubprogram(name: "SPxColId", scope: !"_ZTSN6soplex8SPxColIdE", file: !4, line: 49, type: !532, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !527, !232}
!534 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxRowId", scope: !166, file: !4, line: 58, size: 32, align: 32, elements: !535, identifier: "_ZTSN6soplex8SPxRowIdE")
!535 = !{!536, !537, !541, !544}
!536 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SPxRowIdE", baseType: !"_ZTSN6soplex7DataKeyE", flags: DIFlagPublic)
!537 = !DISubprogram(name: "SPxRowId", scope: !"_ZTSN6soplex8SPxRowIdE", file: !4, line: 62, type: !538, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SPxRowIdE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!541 = !DISubprogram(name: "SPxRowId", scope: !"_ZTSN6soplex8SPxRowIdE", file: !4, line: 65, type: !542, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !540, !517}
!544 = !DISubprogram(name: "SPxRowId", scope: !"_ZTSN6soplex8SPxRowIdE", file: !4, line: 67, type: !545, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !540, !232}
!547 = !DICompositeType(tag: DW_TAG_class_type, name: "DataArray<const soplex::SVector *>", scope: !166, file: !373, line: 68, size: 192, align: 64, elements: !548, templateParams: !625, identifier: "_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE")
!548 = !{!549, !550, !551, !553, !554, !559, !566, !569, !572, !575, !579, !582, !585, !589, !592, !595, !598, !599, !602, !605, !608, !609, !610, !613, !617, !620, !621, !624}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "thesize", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 71, baseType: !68, size: 32, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "themax", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 72, baseType: !68, size: 32, align: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 73, baseType: !552, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "memFactor", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 82, baseType: !185, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!554 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEEixEi", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 87, type: !555, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !558, !68}
!557 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !325)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!559 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex9DataArrayIPKNS_7SVectorEEixEi", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 94, type: !560, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !564, !68}
!562 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE")
!566 = !DISubprogram(name: "last", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE4lastEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 102, type: !567, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!567 = !DISubroutineType(types: !568)
!568 = !{!557, !558}
!569 = !DISubprogram(name: "last", linkageName: "_ZNK6soplex9DataArrayIPKNS_7SVectorEE4lastEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 108, type: !570, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubroutineType(types: !571)
!571 = !{!562, !564}
!572 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE7get_ptrEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 115, type: !573, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{!552, !558}
!575 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex9DataArrayIPKNS_7SVectorEE13get_const_ptrEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 120, type: !576, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubroutineType(types: !577)
!577 = !{!578, !564}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!579 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6appendERKS3_", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 126, type: !580, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !558, !562}
!582 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6appendEiPKS3_", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 131, type: !583, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !558, !68, !578}
!585 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6appendERKS4_", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 136, type: !586, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !558, !588}
!588 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !565)
!589 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6insertEii", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 142, type: !590, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !558, !68, !68}
!592 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6insertEiiPKS3_", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 151, type: !593, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !558, !68, !68, !578}
!595 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6insertEiRKS4_", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 161, type: !596, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !558, !68, !588}
!598 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6removeEii", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 171, type: !590, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "removeLast", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE10removeLastEi", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 181, type: !600, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !558, !68}
!602 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE5clearEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 187, type: !603, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !558}
!605 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex9DataArrayIPKNS_7SVectorEE4sizeEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 193, type: !606, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{!68, !564}
!608 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE6reSizeEi", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 205, type: !600, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex9DataArrayIPKNS_7SVectorEE3maxEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 221, type: !606, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!610 = !DISubprogram(name: "reMax", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEE5reMaxEii", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 239, type: !611, isLocal: false, isDefinition: false, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!611 = !DISubroutineType(types: !612)
!612 = !{!436, !558, !68, !68}
!613 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex9DataArrayIPKNS_7SVectorEEaSERKS4_", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 262, type: !614, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubroutineType(types: !615)
!615 = !{!616, !558, !588}
!616 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE")
!617 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9DataArrayIPKNS_7SVectorEE12isConsistentEv", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 273, type: !618, isLocal: false, isDefinition: false, scopeLine: 273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{!179, !564}
!620 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 286, type: !586, isLocal: false, isDefinition: false, scopeLine: 286, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 309, type: !622, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !558, !68, !68, !185}
!624 = !DISubprogram(name: "~DataArray", scope: !"_ZTSN6soplex9DataArrayIPKNS_7SVectorEEE", file: !373, line: 325, type: !603, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !{!626}
!626 = !DITemplateTypeParameter(name: "T", type: !325)
!627 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !166, file: !628, line: 98, size: 64, align: 64, elements: !629, identifier: "_ZTSN6soplex7SVectorE")
!628 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!629 = !{!630, !632, !636, !639, !646, !651, !654, !657, !660, !661, !665, !666, !667, !670, !673, !677, !681, !685, !686, !690, !691, !694, !695, !696, !697, !701, !704, !708, !711, !714, !717, !720, !723, !724, !725}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 120, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!632 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 127, type: !633, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !635, !68, !185}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!636 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 138, type: !637, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !635, !244}
!639 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 144, type: !640, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !635, !68, !642, !644}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!646 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 147, type: !647, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !635, !68, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!651 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 150, type: !652, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !635, !68, !68}
!654 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 153, type: !655, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !635, !68}
!657 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 160, type: !658, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !635}
!660 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 165, type: !658, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 172, type: !662, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!662 = !DISubroutineType(types: !663)
!663 = !{!68, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!665 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 181, type: !662, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!666 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 190, type: !662, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!667 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 197, type: !668, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{!68, !664, !68}
!670 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 214, type: !671, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{!185, !664, !68}
!673 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 223, type: !674, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !635, !68}
!676 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!677 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 230, type: !678, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !664, !68}
!680 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !650)
!681 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 237, type: !682, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{!684, !635, !68}
!684 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !68)
!685 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 244, type: !668, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!686 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 251, type: !687, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!687 = !DISubroutineType(types: !688)
!688 = !{!689, !635, !68}
!689 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !185)
!690 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 258, type: !671, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!691 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 269, type: !692, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubroutineType(types: !693)
!693 = !{!185, !664}
!694 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 272, type: !692, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 275, type: !692, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 281, type: !692, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!697 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 284, type: !698, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !635, !185}
!700 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!701 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 287, type: !702, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!702 = !DISubroutineType(types: !703)
!703 = !{!185, !664, !282}
!704 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 305, type: !705, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubroutineType(types: !706)
!706 = !{!700, !635, !707}
!707 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !327)
!708 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 307, type: !709, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{!700, !635, !244}
!711 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 309, type: !712, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!712 = !DISubroutineType(types: !713)
!713 = !{!700, !635, !282}
!714 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 312, type: !715, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!715 = !DISubroutineType(types: !716)
!716 = !{!179, !664}
!717 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 324, type: !718, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !635, !68, !631}
!720 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 329, type: !721, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{!631, !664}
!723 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 334, type: !655, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!724 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 340, type: !655, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!725 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 346, type: !718, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !628, line: 109, size: 128, align: 64, elements: !727, identifier: "_ZTSN6soplex7SVector7ElementE")
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !628, line: 111, baseType: !185, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !628, line: 112, baseType: !68, size: 32, align: 32, offset: 64)
!730 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !166, file: !731, line: 82, size: 128, align: 64, elements: !732, identifier: "_ZTSN6soplex6VectorE")
!731 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!732 = !{!733, !734, !736, !740, !743, !746, !749, !750, !751, !755, !758, !761, !762, !763, !764, !765, !766, !767, !770, !773, !776, !779, !782, !783, !784, !787, !790, !793, !796, !799, !802, !805}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 90, baseType: !68, size: 32, align: 32, flags: DIFlagProtected)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 96, baseType: !735, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!736 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 107, type: !737, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !739, !68, !735}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!740 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 114, type: !741, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!741 = !DISubroutineType(types: !742)
!742 = !{!261, !739, !282}
!743 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 121, type: !744, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!744 = !DISubroutineType(types: !745)
!745 = !{!261, !739, !244}
!746 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 128, type: !747, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!747 = !DISubroutineType(types: !748)
!748 = !{!261, !739, !707}
!749 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 134, type: !744, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!750 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 140, type: !747, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!751 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 146, type: !752, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!752 = !DISubroutineType(types: !753)
!753 = !{!68, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!755 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 151, type: !756, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!756 = !DISubroutineType(types: !757)
!757 = !{!689, !739, !68}
!758 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 158, type: !759, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!759 = !DISubroutineType(types: !760)
!760 = !{!185, !754, !68}
!761 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 168, type: !741, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!762 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 170, type: !744, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!763 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 172, type: !747, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!764 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 175, type: !741, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!765 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 177, type: !744, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!766 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !731, line: 179, type: !747, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
