; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefaultrt.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.soplex::SPxDefaultRT" = type { %"class.soplex::SPxRatioTester" }
%"class.soplex::SPxRatioTester" = type { i32 (...)**, %"class.soplex::SoPlex"* }

!50 = !DIEnumerator(name: "INFEASIBLE", value: 5)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex8SPxBasis4DescE", file: !41, line: 170, size: 32, align: 32, elements: !52, identifier: "_ZTSN6soplex8SPxBasis4Desc6StatusE")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIEnumerator(name: "P_ON_LOWER", value: -4)
!54 = !DIEnumerator(name: "P_ON_UPPER", value: -2)
!55 = !DIEnumerator(name: "P_FREE", value: -1)
!56 = !DIEnumerator(name: "P_FIXED", value: -6)
!57 = !DIEnumerator(name: "D_FREE", value: 1)
!58 = !DIEnumerator(name: "D_ON_UPPER", value: 2)
!59 = !DIEnumerator(name: "D_ON_LOWER", value: 4)
!60 = !DIEnumerator(name: "D_ON_BOTH", value: 6)
!61 = !DIEnumerator(name: "D_UNDEFINED", value: 8)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 113, size: 32, align: 32, elements: !64, identifier: "_ZTSN6soplex6SoPlex4TypeE")
!63 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/soplex.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "ENTER", value: -1)
!66 = !DIEnumerator(name: "LEAVE", value: 1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Pricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 141, size: 32, align: 32, elements: !68, identifier: "_ZTSN6soplex6SoPlex7PricingE")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "FULL", value: 0)
!70 = !DIEnumerator(name: "PARTIAL", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Representation", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 94, size: 32, align: 32, elements: !72, identifier: "_ZTSN6soplex6SoPlex14RepresentationE")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "ROW", value: -1)
!74 = !DIEnumerator(name: "COLUMN", value: 1)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex5TimerE", file: !76, line: 100, size: 32, align: 32, elements: !77, identifier: "_ZTSN6soplex5TimerUt_E")
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "RESET", value: 0)
!79 = !DIEnumerator(name: "STOPPED", value: 1)
!80 = !DIEnumerator(name: "RUNNING", value: 2)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 177, size: 32, align: 32, elements: !82, identifier: "_ZTSN6soplex6SoPlex6StatusE")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!83 = !DIEnumerator(name: "ERROR", value: -9)
!84 = !DIEnumerator(name: "NOT_INIT", value: -8)
!85 = !DIEnumerator(name: "ABORT_TIME", value: -7)
!86 = !DIEnumerator(name: "ABORT_ITER", value: -6)
!87 = !DIEnumerator(name: "ABORT_VALUE", value: -5)
!88 = !DIEnumerator(name: "SINGULAR", value: -4)
!89 = !DIEnumerator(name: "NO_PROBLEM", value: -3)
!90 = !DIEnumerator(name: "REGULAR", value: -2)
!91 = !DIEnumerator(name: "RUNNING", value: -1)
!92 = !DIEnumerator(name: "UNKNOWN", value: 0)
!93 = !DIEnumerator(name: "OPTIMAL", value: 1)
!94 = !DIEnumerator(name: "UNBOUNDED", value: 2)
!95 = !DIEnumerator(name: "INFEASIBLE", value: 3)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VarStatus", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 165, size: 32, align: 32, elements: !97, identifier: "_ZTSN6soplex6SoPlex9VarStatusE")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "ON_UPPER", value: 0)
!99 = !DIEnumerator(name: "ON_LOWER", value: 1)
!100 = !DIEnumerator(name: "FIXED", value: 2)
!101 = !DIEnumerator(name: "ZERO", value: 3)
!102 = !DIEnumerator(name: "BASIC", value: 4)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !104, line: 87, size: 32, align: 32, elements: !105, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "FREE", value: 0)
!107 = !DIEnumerator(name: "RELEASED", value: 1)
!108 = !DIEnumerator(name: "USED", value: 2)
!109 = !{!110, !167, !171, !172, !179, !186, !201, !206, !210, !214, !239, !272, !842, !1118, !1254, !1380, !1463, !1551, !1555, !1630, !1752, !1802, !1847, !1963, !1990, !1994, !2021, !2063, !2120, !2165, !3, !2216, !2344, !10, !2381, !2394, !15, !2433, !2446, !2610, !2660, !2736, !21, !2884, !2959, !2960, !3316, !3353, !3357, !3367, !3422, !3425, !3430, !3435, !3439, !3482, !3486, !3488, !3498, !3503, !3504, !3507, !3510, !3523, !3534, !3541, !3545, !3549, !3586, !3589, !3591, !3592, !3593, !3594, !3596, !3607, !3636, !3657, !3674, !3776, !3881, !27, !3882, !3970, !4081, !4085, !4146, !4164, !4244, !4252, !4284, !4449, !4526, !4606, !32, !40, !4671, !4713, !51, !62, !67, !71, !4790, !75, !81, !4829, !4887, !4910, !4953, !4954, !4955, !4956, !96, !103}
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !111, line: 122, size: 1216, align: 64, elements: !112, identifier: "_ZTS7__sFILE")
!111 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !116, !118, !119, !121, !122, !123, !124, !126, !130, !136, !146, !152, !153, !155, !156, !160, !164, !165, !166}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !111, line: 123, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !111, line: 124, baseType: !117, size: 32, align: 32, offset: 64)
!117 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !111, line: 125, baseType: !117, size: 32, align: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !111, line: 126, baseType: !120, size: 16, align: 16, offset: 128)
!120 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !111, line: 127, baseType: !120, size: 16, align: 16, offset: 144)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !111, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !111, line: 129, baseType: !117, size: 32, align: 32, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !111, line: 132, baseType: !125, size: 64, align: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !111, line: 133, baseType: !127, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!117, !125}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !111, line: 134, baseType: !131, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!117, !125, !134, !117}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !111, line: 135, baseType: !137, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !125, !140, !117}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !111, line: 77, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !142, line: 71, baseType: !143)
!142 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !144, line: 46, baseType: !145)
!144 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !111, line: 136, baseType: !147, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!117, !125, !150, !117}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !111, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !111, line: 140, baseType: !154, size: 64, align: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !111, line: 141, baseType: !117, size: 32, align: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !111, line: 144, baseType: !157, size: 24, align: 8, offset: 928)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 24, align: 8, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 3)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !111, line: 145, baseType: !161, size: 8, align: 8, offset: 952)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !111, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !111, line: 151, baseType: !117, size: 32, align: 32, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !111, line: 152, baseType: !140, size: 64, align: 64, offset: 1152)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !111, line: 88, size: 128, align: 64, elements: !168, identifier: "_ZTS6__sbuf")
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !111, line: 89, baseType: !114, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !111, line: 90, baseType: !117, size: 32, align: 32, offset: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !111, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !173, identifier: "_ZTS13__va_list_tag")
!173 = !{!174, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !175, size: 32, align: 32)
!175 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !175, size: 32, align: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !125, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !125, size: 64, align: 64, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_union_type, file: !144, line: 76, size: 1024, align: 64, elements: !180, identifier: "_ZTS11__mbstate_t")
!180 = !{!181, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !144, line: 77, baseType: !182, size: 1024, align: 8)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 1024, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !144, line: 78, baseType: !145, size: 64, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !187, line: 73, size: 448, align: 64, elements: !188, identifier: "_ZTS2tm")
!187 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !200}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !187, line: 74, baseType: !117, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !187, line: 75, baseType: !117, size: 32, align: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !187, line: 76, baseType: !117, size: 32, align: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !187, line: 77, baseType: !117, size: 32, align: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !187, line: 78, baseType: !117, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !187, line: 79, baseType: !117, size: 32, align: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !187, line: 80, baseType: !117, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !187, line: 81, baseType: !117, size: 32, align: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !187, line: 82, baseType: !117, size: 32, align: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !187, line: 83, baseType: !199, size: 64, align: 64, offset: 320)
!199 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !187, line: 84, baseType: !134, size: 64, align: 64, offset: 384)
!201 = !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 82, size: 64, align: 32, elements: !203, identifier: "_ZTS5div_t")
!202 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !202, line: 83, baseType: !117, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !202, line: 84, baseType: !117, size: 32, align: 32, offset: 32)
!206 = !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 87, size: 128, align: 64, elements: !207, identifier: "_ZTS6ldiv_t")
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !202, line: 88, baseType: !199, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !202, line: 89, baseType: !199, size: 64, align: 64, offset: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 93, size: 128, align: 64, elements: !211, identifier: "_ZTS7lldiv_t")
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !202, line: 94, baseType: !145, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !202, line: 95, baseType: !145, size: 64, align: 64, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxDefaultRT", scope: !216, file: !215, line: 46, size: 128, align: 64, elements: !218, vtableHolder: !"_ZTSN6soplex14SPxRatioTesterE", identifier: "_ZTSN6soplex12SPxDefaultRTE")
!215 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefaultrt.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!216 = !DINamespace(name: "soplex", scope: null, file: !217, line: 49)
!217 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!218 = !{!219, !220, !227, !230, !233, !236}
!219 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex12SPxDefaultRTE", baseType: !"_ZTSN6soplex14SPxRatioTesterE", flags: DIFlagPublic)
!220 = !DISubprogram(name: "selectLeaveX", linkageName: "_ZN6soplex12SPxDefaultRT12selectLeaveXERdii", scope: !"_ZTSN6soplex12SPxDefaultRTE", file: !215, line: 50, type: !221, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!117, !223, !224, !117, !117}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12SPxDefaultRTE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!224 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !216, file: !217, line: 127, baseType: !226)
!226 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!227 = !DISubprogram(name: "selectEnterX", linkageName: "_ZN6soplex12SPxDefaultRT12selectEnterXERdiiii", scope: !"_ZTSN6soplex12SPxDefaultRTE", file: !215, line: 52, type: !228, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true)
!228 = !DISubroutineType(types: !229)
!229 = !{!"_ZTSN6soplex5SPxIdE", !223, !224, !117, !117, !117, !117}
!230 = !DISubprogram(name: "selectLeave", linkageName: "_ZN6soplex12SPxDefaultRT11selectLeaveERd", scope: !"_ZTSN6soplex12SPxDefaultRTE", file: !215, line: 57, type: !231, isLocal: false, isDefinition: false, scopeLine: 57, containingType: !"_ZTSN6soplex12SPxDefaultRTE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{!117, !223, !224}
!233 = !DISubprogram(name: "selectEnter", linkageName: "_ZN6soplex12SPxDefaultRT11selectEnterERd", scope: !"_ZTSN6soplex12SPxDefaultRTE", file: !215, line: 59, type: !234, isLocal: false, isDefinition: false, scopeLine: 59, containingType: !"_ZTSN6soplex12SPxDefaultRTE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{!"_ZTSN6soplex5SPxIdE", !223, !224}
!236 = !DISubprogram(name: "SPxDefaultRT", scope: !"_ZTSN6soplex12SPxDefaultRTE", file: !215, line: 61, type: !237, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !223}
!239 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxRatioTester", scope: !216, file: !240, line: 44, size: 128, align: 64, elements: !241, vtableHolder: !"_ZTSN6soplex14SPxRatioTesterE", identifier: "_ZTSN6soplex14SPxRatioTesterE")
!240 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxratiotester.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!241 = !{!242, !247, !249, !253, !256, !261, !264, !267, !270, !271}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxRatioTester", scope: !240, file: !240, baseType: !243, size: 64, flags: DIFlagArtificial)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!117}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "thesolver", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 47, baseType: !248, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64)
!249 = !DISubprogram(name: "load", linkageName: "_ZN6soplex14SPxRatioTester4loadEPNS_6SoPlexE", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 53, type: !250, isLocal: false, isDefinition: false, scopeLine: 53, containingType: !"_ZTSN6soplex14SPxRatioTesterE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !252, !248}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!253 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex14SPxRatioTester5clearEv", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 59, type: !254, isLocal: false, isDefinition: false, scopeLine: 59, containingType: !"_ZTSN6soplex14SPxRatioTesterE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !252}
!256 = !DISubprogram(name: "solver", linkageName: "_ZNK6soplex14SPxRatioTester6solverEv", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 65, type: !257, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN6soplex14SPxRatioTesterE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!257 = !DISubroutineType(types: !258)
!258 = !{!248, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE")
!261 = !DISubprogram(name: "selectLeave", linkageName: "_ZN6soplex14SPxRatioTester11selectLeaveERd", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 86, type: !262, isLocal: false, isDefinition: false, scopeLine: 86, containingType: !"_ZTSN6soplex14SPxRatioTesterE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{!117, !252, !224}
!264 = !DISubprogram(name: "selectEnter", linkageName: "_ZN6soplex14SPxRatioTester11selectEnterERd", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 107, type: !265, isLocal: false, isDefinition: false, scopeLine: 107, containingType: !"_ZTSN6soplex14SPxRatioTesterE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubroutineType(types: !266)
!266 = !{!"_ZTSN6soplex5SPxIdE", !252, !224}
!267 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex14SPxRatioTester7setTypeENS_6SoPlex4TypeE", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 113, type: !268, isLocal: false, isDefinition: false, scopeLine: 113, containingType: !"_ZTSN6soplex14SPxRatioTesterE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !252, !"_ZTSN6soplex6SoPlex4TypeE"}
!270 = !DISubprogram(name: "SPxRatioTester", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 116, type: !254, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubprogram(name: "~SPxRatioTester", scope: !"_ZTSN6soplex14SPxRatioTesterE", file: !240, line: 120, type: !254, isLocal: false, isDefinition: false, scopeLine: 120, containingType: !"_ZTSN6soplex14SPxRatioTesterE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !216, file: !63, line: 77, size: 12416, align: 64, elements: !273, vtableHolder: !"_ZTSN6soplex5SPxLPE", identifier: "_ZTSN6soplex6SoPlexE")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !291, !293, !295, !296, !297, !298, !299, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !318, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !335, !337, !339, !341, !343, !348, !351, !354, !357, !369, !374, !378, !381, !384, !387, !390, !393, !398, !401, !404, !407, !410, !413, !416, !417, !422, !425, !428, !431, !435, !436, !437, !438, !439, !442, !443, !444, !447, !448, !449, !452, !453, !454, !455, !456, !460, !461, !462, !467, !470, !473, !474, !475, !476, !477, !478, !479, !482, !485, !488, !489, !490, !493, !494, !495, !496, !497, !498, !501, !506, !509, !514, !517, !520, !523, !526, !527, !528, !531, !532, !535, !536, !541, !546, !551, !556, !557, !558, !559, !560, !561, !564, !565, !568, !569, !572, !575, !578, !579, !580, !581, !585, !588, !589, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !625, !626, !627, !631, !632, !633, !634, !635, !636, !641, !642, !647, !648, !651, !652, !653, !658, !662, !667, !672, !676, !681, !686, !687, !690, !694, !697, !698, !699, !700, !701, !702, !703, !706, !707, !708, !709, !710, !711, !712, !713, !714, !717, !718, !719, !720, !721, !722, !726, !731, !734, !737, !740, !743, !746, !749, !750, !751, !752, !753, !754, !755, !756, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !779, !782, !785, !786, !789, !790, !794, !799, !800, !801, !806, !811, !814, !815, !816, !817, !820, !821, !822, !823, !826, !829, !832, !833, !838, !841}
!274 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex5SPxLPE", flags: DIFlagPublic)
!275 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex8SPxBasisE", offset: 2816, flags: DIFlagProtected)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "theType", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 196, baseType: !"_ZTSN6soplex6SoPlex4TypeE", size: 32, align: 32, offset: 4480)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "thePricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 197, baseType: !"_ZTSN6soplex6SoPlex7PricingE", size: 32, align: 32, offset: 4512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "therep", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 198, baseType: !"_ZTSN6soplex6SoPlex14RepresentationE", size: 32, align: 32, offset: 4544)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "theTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 199, baseType: !"_ZTSN6soplex5TimerE", size: 448, align: 64, offset: 4608)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "maxIters", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 200, baseType: !117, size: 32, align: 32, offset: 5056)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 201, baseType: !225, size: 64, align: 64, offset: 5120)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 202, baseType: !225, size: 64, align: 64, offset: 5184)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "m_status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 203, baseType: !"_ZTSN6soplex6SoPlex6StatusE", size: 32, align: 32, offset: 5248)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 205, baseType: !225, size: 64, align: 64, offset: 5312)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "theShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 206, baseType: !225, size: 64, align: 64, offset: 5376)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lastShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 207, baseType: !225, size: 64, align: 64, offset: 5440)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 208, baseType: !117, size: 32, align: 32, offset: 5504)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "m_numCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 209, baseType: !117, size: 32, align: 32, offset: 5536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 210, baseType: !290, size: 8, align: 8, offset: 5568)
!290 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 212, baseType: !292, size: 64, align: 64, offset: 5632)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 213, baseType: !294, size: 64, align: 64, offset: 5696)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 214, baseType: !292, size: 64, align: 64, offset: 5760)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 215, baseType: !294, size: 64, align: 64, offset: 5824)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cacheProductFactor", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 217, baseType: !225, size: 64, align: 64, offset: 5888)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "unitVecs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 220, baseType: !"_ZTSN6soplex5ArrayINS_10UnitVectorEEE", size: 128, align: 64, offset: 5952, flags: DIFlagProtected)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "thevectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 221, baseType: !300, size: 64, align: 64, offset: 6080, flags: DIFlagProtected)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!302 = !DIDerivedType(tag: DW_TAG_member, name: "thecovectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 222, baseType: !300, size: 64, align: 64, offset: 6144, flags: DIFlagProtected)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nNZEs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 224, baseType: !117, size: 32, align: 32, offset: 6208, flags: DIFlagProtected)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "coVecDim", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 225, baseType: !117, size: 32, align: 32, offset: 6240, flags: DIFlagProtected)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "primRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 227, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 6272, flags: DIFlagProtected)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "primVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 228, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 6528, flags: DIFlagProtected)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dualRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 229, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 7360, flags: DIFlagProtected)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dualVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 230, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 7616, flags: DIFlagProtected)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "addVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 231, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 8448, flags: DIFlagProtected)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "theURbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 233, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9280, flags: DIFlagProtected)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "theLRbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 234, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9536, flags: DIFlagProtected)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "theUCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 235, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9792, flags: DIFlagProtected)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "theLCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 236, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10048, flags: DIFlagProtected)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "theUBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 243, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10304, flags: DIFlagProtected)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "theLBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 244, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10560, flags: DIFlagProtected)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "theFrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 246, baseType: !317, size: 64, align: 64, offset: 10816, flags: DIFlagProtected)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "theFvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 247, baseType: !319, size: 64, align: 64, offset: 10880, flags: DIFlagProtected)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 249, baseType: !317, size: 64, align: 64, offset: 10944, flags: DIFlagProtected)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 250, baseType: !319, size: 64, align: 64, offset: 11008, flags: DIFlagProtected)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "thePvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 251, baseType: !319, size: 64, align: 64, offset: 11072, flags: DIFlagProtected)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "theRPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 254, baseType: !319, size: 64, align: 64, offset: 11136, flags: DIFlagProtected)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "theCPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 256, baseType: !319, size: 64, align: 64, offset: 11200, flags: DIFlagProtected)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "theUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 260, baseType: !317, size: 64, align: 64, offset: 11264, flags: DIFlagProtected)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "theLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 261, baseType: !317, size: 64, align: 64, offset: 11328, flags: DIFlagProtected)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "theCoUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 262, baseType: !317, size: 64, align: 64, offset: 11392, flags: DIFlagProtected)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "theCoLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 263, baseType: !317, size: 64, align: 64, offset: 11456, flags: DIFlagProtected)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "theCoTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 266, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11520, flags: DIFlagProtected)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "theTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 267, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11776, flags: DIFlagProtected)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "leaveCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 269, baseType: !117, size: 32, align: 32, offset: 12032, flags: DIFlagProtected)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "enterCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 270, baseType: !117, size: 32, align: 32, offset: 12064, flags: DIFlagProtected)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "thepricer", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 272, baseType: !334, size: 64, align: 64, offset: 12096, flags: DIFlagProtected)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "theratiotester", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 273, baseType: !336, size: 64, align: 64, offset: 12160, flags: DIFlagProtected)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "thestarter", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 274, baseType: !338, size: 64, align: 64, offset: 12224, flags: DIFlagProtected)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "thescaler", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 275, baseType: !340, size: 64, align: 64, offset: 12288, flags: DIFlagProtected)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxScalerE", size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "thesimplifier", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 276, baseType: !342, size: 64, align: 64, offset: 12352, flags: DIFlagProtected)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex13SPxSimplifierE", size: 64, align: 64)
!343 = !DISubprogram(name: "version", linkageName: "_ZNK6soplex6SoPlex7versionEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 280, type: !344, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{!117, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6SoPlexE")
!348 = !DISubprogram(name: "rep", linkageName: "_ZNK6soplex6SoPlex3repEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 285, type: !349, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!"_ZTSN6soplex6SoPlex14RepresentationE", !346}
!351 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex6SoPlex4typeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 291, type: !352, isLocal: false, isDefinition: false, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{!"_ZTSN6soplex6SoPlex4TypeE", !346}
!354 = !DISubprogram(name: "pricing", linkageName: "_ZNK6soplex6SoPlex7pricingEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 297, type: !355, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{!"_ZTSN6soplex6SoPlex7PricingE", !346}
!357 = !DISubprogram(name: "read", linkageName: "_ZN6soplex6SoPlex4readERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEEPNS_7NameSetES8_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 329, type: !358, isLocal: false, isDefinition: false, scopeLine: 329, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubroutineType(types: !359)
!359 = !{!290, !360, !361, !367, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !364, file: !363, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!363 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!364 = !DINamespace(name: "__1", scope: !366, file: !365, line: 369)
!365 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!366 = !DINamespace(name: "std", scope: null, file: !365, line: 368)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7NameSetE", size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64)
!369 = !DISubprogram(name: "loadLP", linkageName: "_ZN6soplex6SoPlex6loadLPERKNS_5SPxLPE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 333, type: !370, isLocal: false, isDefinition: false, scopeLine: 333, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !360, !372}
!372 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxLPE")
!374 = !DISubprogram(name: "setSolver", linkageName: "_ZN6soplex6SoPlex9setSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 335, type: !375, isLocal: false, isDefinition: false, scopeLine: 335, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !360, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!378 = !DISubprogram(name: "setPricer", linkageName: "_ZN6soplex6SoPlex9setPricerEPNS_9SPxPricerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 337, type: !379, isLocal: false, isDefinition: false, scopeLine: 337, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !360, !334}
!381 = !DISubprogram(name: "setTester", linkageName: "_ZN6soplex6SoPlex9setTesterEPNS_14SPxRatioTesterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 339, type: !382, isLocal: false, isDefinition: false, scopeLine: 339, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !360, !336}
!384 = !DISubprogram(name: "setStarter", linkageName: "_ZN6soplex6SoPlex10setStarterEPNS_10SPxStarterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 341, type: !385, isLocal: false, isDefinition: false, scopeLine: 341, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !360, !338}
!387 = !DISubprogram(name: "setScaler", linkageName: "_ZN6soplex6SoPlex9setScalerEPNS_9SPxScalerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 343, type: !388, isLocal: false, isDefinition: false, scopeLine: 343, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !360, !340}
!390 = !DISubprogram(name: "setSimplifier", linkageName: "_ZN6soplex6SoPlex13setSimplifierEPNS_13SPxSimplifierE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 345, type: !391, isLocal: false, isDefinition: false, scopeLine: 345, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !360, !342}
!393 = !DISubprogram(name: "loadBasis", linkageName: "_ZN6soplex6SoPlex9loadBasisERKNS_8SPxBasis4DescE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 347, type: !394, isLocal: false, isDefinition: false, scopeLine: 347, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !360, !396}
!396 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!398 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex6SoPlex6setRepENS0_14RepresentationE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 350, type: !399, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !360, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!401 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex6SoPlex7setTypeENS0_4TypeE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 352, type: !402, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !360, !"_ZTSN6soplex6SoPlex4TypeE"}
!404 = !DISubprogram(name: "setPricing", linkageName: "_ZN6soplex6SoPlex10setPricingENS0_7PricingE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 354, type: !405, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !360, !"_ZTSN6soplex6SoPlex7PricingE"}
!407 = !DISubprogram(name: "reLoad", linkageName: "_ZN6soplex6SoPlex6reLoadEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 357, type: !408, isLocal: false, isDefinition: false, scopeLine: 357, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !360}
!410 = !DISubprogram(name: "readFile", linkageName: "_ZN6soplex6SoPlex8readFileEPKcPNS_7NameSetES4_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 360, type: !411, isLocal: false, isDefinition: false, scopeLine: 360, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubroutineType(types: !412)
!412 = !{!290, !360, !150, !367, !367, !368}
!413 = !DISubprogram(name: "dumpFile", linkageName: "_ZNK6soplex6SoPlex8dumpFileEPKc", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 364, type: !414, isLocal: false, isDefinition: false, scopeLine: 364, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !346, !150}
!416 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6SoPlex5clearEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 367, type: !408, isLocal: false, isDefinition: false, scopeLine: 367, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!417 = !DISubprogram(name: "readBasisFile", linkageName: "_ZN6soplex6SoPlex13readBasisFileEPKcRKNS_7NameSetES5_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 370, type: !418, isLocal: false, isDefinition: false, scopeLine: 370, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{!290, !360, !150, !420, !420}
!420 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!422 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex6SoPlex5solveEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 383, type: !423, isLocal: false, isDefinition: false, scopeLine: 383, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubroutineType(types: !424)
!424 = !{!"_ZTSN6soplex6SoPlex6StatusE", !360}
!425 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex6SoPlex6statusEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 386, type: !426, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{!"_ZTSN6soplex6SoPlex6StatusE", !346}
!428 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex6SoPlex5valueEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 392, type: !429, isLocal: false, isDefinition: false, scopeLine: 392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{!225, !346}
!431 = !DISubprogram(name: "getPrimal", linkageName: "_ZNK6soplex6SoPlex9getPrimalERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 401, type: !432, isLocal: false, isDefinition: false, scopeLine: 401, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!"_ZTSN6soplex6SoPlex6StatusE", !346, !434}
!434 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!435 = !DISubprogram(name: "getPrimalUnscaled", linkageName: "_ZNK6soplex6SoPlex17getPrimalUnscaledERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 406, type: !432, isLocal: false, isDefinition: false, scopeLine: 406, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!436 = !DISubprogram(name: "getSlacks", linkageName: "_ZNK6soplex6SoPlex9getSlacksERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 421, type: !432, isLocal: false, isDefinition: false, scopeLine: 421, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!437 = !DISubprogram(name: "getDual", linkageName: "_ZNK6soplex6SoPlex7getDualERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 447, type: !432, isLocal: false, isDefinition: false, scopeLine: 447, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!438 = !DISubprogram(name: "getRdCost", linkageName: "_ZNK6soplex6SoPlex9getRdCostERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 460, type: !432, isLocal: false, isDefinition: false, scopeLine: 460, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubprogram(name: "terminate", linkageName: "_ZN6soplex6SoPlex9terminateEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 478, type: !440, isLocal: false, isDefinition: false, scopeLine: 478, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!440 = !DISubroutineType(types: !441)
!441 = !{!290, !360}
!442 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex6SoPlex7epsilonEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 487, type: !429, isLocal: false, isDefinition: false, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex6SoPlex5deltaEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 496, type: !429, isLocal: false, isDefinition: false, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!444 = !DISubprogram(name: "setDelta", linkageName: "_ZN6soplex6SoPlex8setDeltaEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 501, type: !445, isLocal: false, isDefinition: false, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !360, !225}
!447 = !DISubprogram(name: "maxCycle", linkageName: "_ZNK6soplex6SoPlex8maxCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 514, type: !344, isLocal: false, isDefinition: false, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubprogram(name: "numCycle", linkageName: "_ZNK6soplex6SoPlex8numCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 519, type: !344, isLocal: false, isDefinition: false, scopeLine: 519, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!449 = !DISubprogram(name: "localAddRows", linkageName: "_ZN6soplex6SoPlex12localAddRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 533, type: !450, isLocal: false, isDefinition: false, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !360, !117}
!452 = !DISubprogram(name: "localAddCols", linkageName: "_ZN6soplex6SoPlex12localAddColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 535, type: !450, isLocal: false, isDefinition: false, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true)
!453 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex6SoPlex9addedRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 539, type: !450, isLocal: false, isDefinition: false, scopeLine: 539, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 57, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!454 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex6SoPlex9addedColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 541, type: !450, isLocal: false, isDefinition: false, scopeLine: 541, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 58, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!455 = !DISubprogram(name: "doRemoveRow", linkageName: "_ZN6soplex6SoPlex11doRemoveRowEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 544, type: !450, isLocal: false, isDefinition: false, scopeLine: 544, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 53, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!456 = !DISubprogram(name: "doRemoveRows", linkageName: "_ZN6soplex6SoPlex12doRemoveRowsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 546, type: !457, isLocal: false, isDefinition: false, scopeLine: 546, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 55, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !360, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!460 = !DISubprogram(name: "doRemoveCol", linkageName: "_ZN6soplex6SoPlex11doRemoveColEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 548, type: !450, isLocal: false, isDefinition: false, scopeLine: 548, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 56, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!461 = !DISubprogram(name: "doRemoveCols", linkageName: "_ZN6soplex6SoPlex12doRemoveColsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 550, type: !457, isLocal: false, isDefinition: false, scopeLine: 550, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 54, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!462 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 554, type: !463, isLocal: false, isDefinition: false, scopeLine: 554, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !360, !465}
!465 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!467 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 556, type: !468, isLocal: false, isDefinition: false, scopeLine: 556, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !360, !117, !225}
!470 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 558, type: !471, isLocal: false, isDefinition: false, scopeLine: 558, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !360, !"_ZTSN6soplex8SPxColIdE", !225}
!473 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 563, type: !463, isLocal: false, isDefinition: false, scopeLine: 563, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 565, type: !468, isLocal: false, isDefinition: false, scopeLine: 565, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 567, type: !471, isLocal: false, isDefinition: false, scopeLine: 567, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 572, type: !463, isLocal: false, isDefinition: false, scopeLine: 572, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 574, type: !468, isLocal: false, isDefinition: false, scopeLine: 574, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 32, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 576, type: !471, isLocal: false, isDefinition: false, scopeLine: 576, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 581, type: !480, isLocal: false, isDefinition: false, scopeLine: 581, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !360, !465, !465}
!482 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 583, type: !483, isLocal: false, isDefinition: false, scopeLine: 583, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !360, !117, !225, !225}
!485 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsENS_8SPxColIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 585, type: !486, isLocal: false, isDefinition: false, scopeLine: 585, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !360, !"_ZTSN6soplex8SPxColIdE", !225, !225}
!488 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 591, type: !463, isLocal: false, isDefinition: false, scopeLine: 591, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!489 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 593, type: !468, isLocal: false, isDefinition: false, scopeLine: 593, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!490 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 595, type: !491, isLocal: false, isDefinition: false, scopeLine: 595, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !360, !"_ZTSN6soplex8SPxRowIdE", !225}
!493 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 600, type: !463, isLocal: false, isDefinition: false, scopeLine: 600, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 40, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 602, type: !468, isLocal: false, isDefinition: false, scopeLine: 602, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!495 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 604, type: !491, isLocal: false, isDefinition: false, scopeLine: 604, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 42, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!496 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 609, type: !480, isLocal: false, isDefinition: false, scopeLine: 609, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!497 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 611, type: !483, isLocal: false, isDefinition: false, scopeLine: 611, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeENS_8SPxRowIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 613, type: !499, isLocal: false, isDefinition: false, scopeLine: 613, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !360, !"_ZTSN6soplex8SPxRowIdE", !225, !225}
!501 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowEiRKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 619, type: !502, isLocal: false, isDefinition: false, scopeLine: 619, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !360, !117, !504}
!504 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPRowE")
!506 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowENS_8SPxRowIdERKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 621, type: !507, isLocal: false, isDefinition: false, scopeLine: 621, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !360, !"_ZTSN6soplex8SPxRowIdE", !504}
!509 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColEiRKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 626, type: !510, isLocal: false, isDefinition: false, scopeLine: 626, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !360, !117, !512}
!512 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!514 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColENS_8SPxColIdERKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 628, type: !515, isLocal: false, isDefinition: false, scopeLine: 628, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !360, !"_ZTSN6soplex8SPxColIdE", !512}
!517 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementEiid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 633, type: !518, isLocal: false, isDefinition: false, scopeLine: 633, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !360, !117, !117, !225}
!520 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementENS_8SPxRowIdENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 635, type: !521, isLocal: false, isDefinition: false, scopeLine: 635, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !360, !"_ZTSN6soplex8SPxRowIdE", !"_ZTSN6soplex8SPxColIdE", !225}
!523 = !DISubprogram(name: "changeSense", linkageName: "_ZN6soplex6SoPlex11changeSenseENS_5SPxLP8SPxSenseE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 641, type: !524, isLocal: false, isDefinition: false, scopeLine: 641, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !360, !"_ZTSN6soplex5SPxLP8SPxSenseE"}
!526 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6SoPlex3dimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 645, type: !344, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubprogram(name: "coDim", linkageName: "_ZNK6soplex6SoPlex5coDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 650, type: !344, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubprogram(name: "id", linkageName: "_ZNK6soplex6SoPlex2idEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 666, type: !529, isLocal: false, isDefinition: false, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!529 = !DISubroutineType(types: !530)
!530 = !{!"_ZTSN6soplex5SPxIdE", !346, !117}
!531 = !DISubprogram(name: "coId", linkageName: "_ZNK6soplex6SoPlex4coIdEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 685, type: !529, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!532 = !DISubprogram(name: "isId", linkageName: "_ZNK6soplex6SoPlex4isIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 703, type: !533, isLocal: false, isDefinition: false, scopeLine: 703, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubroutineType(types: !534)
!534 = !{!117, !346, !"_ZTSN6soplex5SPxIdE"}
!535 = !DISubprogram(name: "isCoId", linkageName: "_ZNK6soplex6SoPlex6isCoIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 712, type: !533, isLocal: false, isDefinition: false, scopeLine: 712, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 724, type: !537, isLocal: false, isDefinition: false, scopeLine: 724, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubroutineType(types: !538)
!538 = !{!539, !346, !117}
!539 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!541 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 730, type: !542, isLocal: false, isDefinition: false, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{!539, !346, !544}
!544 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!546 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 738, type: !547, isLocal: false, isDefinition: false, scopeLine: 738, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!547 = !DISubroutineType(types: !548)
!548 = !{!539, !346, !549}
!549 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!551 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 755, type: !552, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!552 = !DISubroutineType(types: !553)
!553 = !{!539, !346, !554}
!554 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!556 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 768, type: !537, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!557 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 773, type: !542, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 781, type: !547, isLocal: false, isDefinition: false, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 795, type: !552, isLocal: false, isDefinition: false, scopeLine: 795, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubprogram(name: "unitVector", linkageName: "_ZNK6soplex6SoPlex10unitVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 803, type: !537, isLocal: false, isDefinition: false, scopeLine: 803, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!561 = !DISubprogram(name: "varStatus", linkageName: "_ZNK6soplex6SoPlex9varStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 816, type: !562, isLocal: false, isDefinition: false, scopeLine: 816, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !346, !117}
!564 = !DISubprogram(name: "covarStatus", linkageName: "_ZNK6soplex6SoPlex11covarStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 822, type: !562, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 828, type: !566, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{!117, !346, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!568 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 834, type: !533, isLocal: false, isDefinition: false, scopeLine: 834, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 843, type: !570, isLocal: false, isDefinition: false, scopeLine: 843, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubroutineType(types: !571)
!571 = !{!117, !346, !"_ZTSN6soplex8SPxRowIdE"}
!572 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 849, type: !573, isLocal: false, isDefinition: false, scopeLine: 849, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{!117, !346, !"_ZTSN6soplex8SPxColIdE"}
!575 = !DISubprogram(name: "isRowBasic", linkageName: "_ZNK6soplex6SoPlex10isRowBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 855, type: !576, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubroutineType(types: !577)
!577 = !{!117, !346, !117}
!578 = !DISubprogram(name: "isColBasic", linkageName: "_ZNK6soplex6SoPlex10isColBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 861, type: !576, isLocal: false, isDefinition: false, scopeLine: 861, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 867, type: !576, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!580 = !DISubprogram(name: "isCoBasic", linkageName: "_ZNK6soplex6SoPlex9isCoBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 873, type: !576, isLocal: false, isDefinition: false, scopeLine: 873, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!581 = !DISubprogram(name: "fVec", linkageName: "_ZNK6soplex6SoPlex4fVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 888, type: !582, isLocal: false, isDefinition: false, scopeLine: 888, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{!584, !346}
!584 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!585 = !DISubprogram(name: "fRhs", linkageName: "_ZNK6soplex6SoPlex4fRhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 901, type: !586, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{!465, !346}
!588 = !DISubprogram(name: "ubBound", linkageName: "_ZNK6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 906, type: !586, isLocal: false, isDefinition: false, scopeLine: 906, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubprogram(name: "ubBound", linkageName: "_ZN6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 919, type: !590, isLocal: false, isDefinition: false, scopeLine: 919, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{!434, !360}
!592 = !DISubprogram(name: "lbBound", linkageName: "_ZNK6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 924, type: !586, isLocal: false, isDefinition: false, scopeLine: 924, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubprogram(name: "lbBound", linkageName: "_ZN6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 937, type: !590, isLocal: false, isDefinition: false, scopeLine: 937, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubprogram(name: "fTest", linkageName: "_ZNK6soplex6SoPlex5fTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 950, type: !586, isLocal: false, isDefinition: false, scopeLine: 950, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubprogram(name: "coPvec", linkageName: "_ZNK6soplex6SoPlex6coPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 963, type: !582, isLocal: false, isDefinition: false, scopeLine: 963, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "coPrhs", linkageName: "_ZNK6soplex6SoPlex6coPrhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 976, type: !586, isLocal: false, isDefinition: false, scopeLine: 976, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubprogram(name: "ucBound", linkageName: "_ZNK6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 982, type: !586, isLocal: false, isDefinition: false, scopeLine: 982, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubprogram(name: "ucBound", linkageName: "_ZN6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 996, type: !590, isLocal: false, isDefinition: false, scopeLine: 996, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "lcBound", linkageName: "_ZNK6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1003, type: !586, isLocal: false, isDefinition: false, scopeLine: 1003, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubprogram(name: "lcBound", linkageName: "_ZN6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1017, type: !590, isLocal: false, isDefinition: false, scopeLine: 1017, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1030, type: !586, isLocal: false, isDefinition: false, scopeLine: 1030, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubprogram(name: "pVec", linkageName: "_ZNK6soplex6SoPlex4pVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1043, type: !582, isLocal: false, isDefinition: false, scopeLine: 1043, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "upBound", linkageName: "_ZNK6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1048, type: !586, isLocal: false, isDefinition: false, scopeLine: 1048, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "upBound", linkageName: "_ZN6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1062, type: !590, isLocal: false, isDefinition: false, scopeLine: 1062, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "lpBound", linkageName: "_ZNK6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1069, type: !586, isLocal: false, isDefinition: false, scopeLine: 1069, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubprogram(name: "lpBound", linkageName: "_ZN6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1083, type: !590, isLocal: false, isDefinition: false, scopeLine: 1083, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!607 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1096, type: !586, isLocal: false, isDefinition: false, scopeLine: 1096, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!608 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1103, type: !609, isLocal: false, isDefinition: false, scopeLine: 1103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubroutineType(types: !610)
!610 = !{!225, !360, !117}
!611 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1105, type: !408, isLocal: false, isDefinition: false, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1107, type: !609, isLocal: false, isDefinition: false, scopeLine: 1107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1109, type: !408, isLocal: false, isDefinition: false, scopeLine: 1109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubprogram(name: "shiftFvec", linkageName: "_ZN6soplex6SoPlex9shiftFvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1135, type: !408, isLocal: false, isDefinition: false, scopeLine: 1135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "shiftPvec", linkageName: "_ZN6soplex6SoPlex9shiftPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1137, type: !408, isLocal: false, isDefinition: false, scopeLine: 1137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubprogram(name: "shiftUBbound", linkageName: "_ZN6soplex6SoPlex12shiftUBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1140, type: !468, isLocal: false, isDefinition: false, scopeLine: 1140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubprogram(name: "shiftLBbound", linkageName: "_ZN6soplex6SoPlex12shiftLBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1147, type: !468, isLocal: false, isDefinition: false, scopeLine: 1147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubprogram(name: "shiftUPbound", linkageName: "_ZN6soplex6SoPlex12shiftUPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1154, type: !468, isLocal: false, isDefinition: false, scopeLine: 1154, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!619 = !DISubprogram(name: "shiftLPbound", linkageName: "_ZN6soplex6SoPlex12shiftLPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1161, type: !468, isLocal: false, isDefinition: false, scopeLine: 1161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!620 = !DISubprogram(name: "shiftUCbound", linkageName: "_ZN6soplex6SoPlex12shiftUCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1168, type: !468, isLocal: false, isDefinition: false, scopeLine: 1168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubprogram(name: "shiftLCbound", linkageName: "_ZN6soplex6SoPlex12shiftLCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1175, type: !468, isLocal: false, isDefinition: false, scopeLine: 1175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubprogram(name: "testBounds", linkageName: "_ZNK6soplex6SoPlex10testBoundsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1182, type: !623, isLocal: false, isDefinition: false, scopeLine: 1182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !346}
!625 = !DISubprogram(name: "shift", linkageName: "_ZNK6soplex6SoPlex5shiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1185, type: !429, isLocal: false, isDefinition: false, scopeLine: 1185, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!626 = !DISubprogram(name: "unShift", linkageName: "_ZN6soplex6SoPlex7unShiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1190, type: !408, isLocal: false, isDefinition: false, scopeLine: 1190, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 82, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubprogram(name: "qualConstraintViolation", linkageName: "_ZNK6soplex6SoPlex23qualConstraintViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1193, type: !628, isLocal: false, isDefinition: false, scopeLine: 1193, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !346, !630, !630}
!630 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !226)
!631 = !DISubprogram(name: "qualConstraintViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex31qualConstraintViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1197, type: !628, isLocal: false, isDefinition: false, scopeLine: 1197, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubprogram(name: "qualBoundViolation", linkageName: "_ZNK6soplex6SoPlex18qualBoundViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1201, type: !628, isLocal: false, isDefinition: false, scopeLine: 1201, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubprogram(name: "qualBoundViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex26qualBoundViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1205, type: !628, isLocal: false, isDefinition: false, scopeLine: 1205, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!634 = !DISubprogram(name: "qualSlackViolation", linkageName: "_ZNK6soplex6SoPlex18qualSlackViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1209, type: !628, isLocal: false, isDefinition: false, scopeLine: 1209, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubprogram(name: "qualRdCostViolation", linkageName: "_ZNK6soplex6SoPlex19qualRdCostViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1212, type: !628, isLocal: false, isDefinition: false, scopeLine: 1212, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!636 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1216, type: !637, isLocal: false, isDefinition: false, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !360, !639, !434, !434, !225, !117, !117}
!639 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!641 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1220, type: !637, isLocal: false, isDefinition: false, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true)
!642 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1224, type: !643, isLocal: false, isDefinition: false, scopeLine: 1224, flags: DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{!225, !360, !639, !434, !434, !225, !225, !645, !117, !117}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4Desc6StatusE")
!647 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1228, type: !643, isLocal: false, isDefinition: false, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: true)
!648 = !DISubprogram(name: "setup4solve", linkageName: "_ZN6soplex6SoPlex11setup4solveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1259, type: !649, isLocal: false, isDefinition: false, scopeLine: 1259, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !360, !292, !294}
!651 = !DISubprogram(name: "setup4coSolve", linkageName: "_ZN6soplex6SoPlex13setup4coSolveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1273, type: !649, isLocal: false, isDefinition: false, scopeLine: 1273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubprogram(name: "maxInfeas", linkageName: "_ZNK6soplex6SoPlex9maxInfeasEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1286, type: !429, isLocal: false, isDefinition: false, scopeLine: 1286, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!653 = !DISubprogram(name: "basis", linkageName: "_ZNK6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1294, type: !654, isLocal: false, isDefinition: false, scopeLine: 1294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !346}
!656 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!658 = !DISubprogram(name: "basis", linkageName: "_ZN6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1299, type: !659, isLocal: false, isDefinition: false, scopeLine: 1299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{!661, !360}
!661 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!662 = !DISubprogram(name: "pricer", linkageName: "_ZNK6soplex6SoPlex6pricerEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1304, type: !663, isLocal: false, isDefinition: false, scopeLine: 1304, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!663 = !DISubroutineType(types: !664)
!664 = !{!665, !346}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9SPxPricerE")
!667 = !DISubprogram(name: "slinSolver", linkageName: "_ZNK6soplex6SoPlex10slinSolverEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1309, type: !668, isLocal: false, isDefinition: false, scopeLine: 1309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{!670, !346}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SLinSolverE")
!672 = !DISubprogram(name: "ratiotester", linkageName: "_ZNK6soplex6SoPlex11ratiotesterEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1314, type: !673, isLocal: false, isDefinition: false, scopeLine: 1314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!673 = !DISubroutineType(types: !674)
!674 = !{!675, !346}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!676 = !DISubprogram(name: "starter", linkageName: "_ZNK6soplex6SoPlex7starterEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1319, type: !677, isLocal: false, isDefinition: false, scopeLine: 1319, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!677 = !DISubroutineType(types: !678)
!678 = !{!679, !346}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SPxStarterE")
!681 = !DISubprogram(name: "simplifier", linkageName: "_ZNK6soplex6SoPlex10simplifierEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1324, type: !682, isLocal: false, isDefinition: false, scopeLine: 1324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{!684, !346}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex13SPxSimplifierE")
!686 = !DISubprogram(name: "factorize", linkageName: "_ZN6soplex6SoPlex9factorizeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1331, type: !408, isLocal: false, isDefinition: false, scopeLine: 1331, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 90, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!687 = !DISubprogram(name: "leave", linkageName: "_ZN6soplex6SoPlex5leaveEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1334, type: !688, isLocal: false, isDefinition: false, scopeLine: 1334, flags: DIFlagPrototyped, isOptimized: true)
!688 = !DISubroutineType(types: !689)
!689 = !{!117, !360, !117}
!690 = !DISubprogram(name: "enter", linkageName: "_ZN6soplex6SoPlex5enterERNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1335, type: !691, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPrototyped, isOptimized: true)
!691 = !DISubroutineType(types: !692)
!692 = !{!117, !360, !693}
!693 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SPxIdE")
!694 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEiNS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1338, type: !695, isLocal: false, isDefinition: false, scopeLine: 1338, flags: DIFlagPrototyped, isOptimized: true)
!695 = !DISubroutineType(types: !696)
!696 = !{!225, !346, !117, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!697 = !DISubprogram(name: "computeCoTest", linkageName: "_ZN6soplex6SoPlex13computeCoTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1340, type: !408, isLocal: false, isDefinition: false, scopeLine: 1340, flags: DIFlagPrototyped, isOptimized: true)
!698 = !DISubprogram(name: "updateCoTest", linkageName: "_ZN6soplex6SoPlex12updateCoTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1342, type: !408, isLocal: false, isDefinition: false, scopeLine: 1342, flags: DIFlagPrototyped, isOptimized: true)
!699 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEiNS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1345, type: !695, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPrototyped, isOptimized: true)
!700 = !DISubprogram(name: "updateTest", linkageName: "_ZN6soplex6SoPlex10updateTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1347, type: !408, isLocal: false, isDefinition: false, scopeLine: 1347, flags: DIFlagPrototyped, isOptimized: true)
!701 = !DISubprogram(name: "computeFtest", linkageName: "_ZN6soplex6SoPlex12computeFtestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1350, type: !408, isLocal: false, isDefinition: false, scopeLine: 1350, flags: DIFlagPrototyped, isOptimized: true)
!702 = !DISubprogram(name: "updateFtest", linkageName: "_ZN6soplex6SoPlex11updateFtestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1352, type: !408, isLocal: false, isDefinition: false, scopeLine: 1352, flags: DIFlagPrototyped, isOptimized: true)
!703 = !DISubprogram(name: "isInitialized", linkageName: "_ZNK6soplex6SoPlex13isInitializedEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1373, type: !704, isLocal: false, isDefinition: false, scopeLine: 1373, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!704 = !DISubroutineType(types: !705)
!705 = !{!290, !346}
