; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

@_ZN6soplex8infinityE = constant double 1.000000e+100, align 8
@_ZN6soplex5Param9s_epsilonE = global double 1.000000e-17, align 8
@_ZN6soplex5Param9s_verboseE = global i32 1, align 4

; Function Attrs: nounwind optsize ssp uwtable
define void @_ZN6soplex5Param10setEpsilonEd(double %eps) #0 align 2 {
  tail call void @llvm.dbg.value(metadata double %eps, i64 0, metadata !134, metadata !965), !dbg !966
  store double %eps, double* @_ZN6soplex5Param9s_epsilonE, align 8, !dbg !967, !tbaa !968
  ret void, !dbg !972
}

; Function Attrs: nounwind optsize ssp uwtable
define void @_ZN6soplex5Param10setVerboseEi(i32 %p_verbose) #0 align 2 {
  tail call void @llvm.dbg.value(metadata i32 %p_verbose, i64 0, metadata !137, metadata !965), !dbg !973
  store i32 %p_verbose, i32* @_ZN6soplex5Param9s_verboseE, align 4, !dbg !974, !tbaa !975
  ret void, !dbg !977
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.value(metadata, i64, metadata, metadata) #1


!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !131, globals: !138, imports: !143)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !61, !65, !66, !73, !80, !95, !100, !104, !108}
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !5, line: 122, size: 1216, align: 64, elements: !6, identifier: "_ZTS7__sFILE")
!5 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !10, !12, !13, !15, !16, !17, !18, !20, !24, !30, !40, !46, !47, !49, !50, !54, !58, !59, !60}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !5, line: 123, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !5, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !5, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !5, line: 126, baseType: !14, size: 16, align: 16, offset: 128)
!14 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !5, line: 127, baseType: !14, size: 16, align: 16, offset: 144)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !5, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !5, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !5, line: 132, baseType: !19, size: 64, align: 64, offset: 384)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !5, line: 133, baseType: !21, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !19}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !5, line: 134, baseType: !25, size: 64, align: 64, offset: 512)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!11, !19, !28, !11}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !5, line: 135, baseType: !31, size: 64, align: 64, offset: 576)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !19, !34, !11}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !5, line: 77, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !36, line: 71, baseType: !37)
!36 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !38, line: 46, baseType: !39)
!38 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!39 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !5, line: 136, baseType: !41, size: 64, align: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!11, !19, !44, !11}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !5, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !5, line: 140, baseType: !48, size: 64, align: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !5, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !5, line: 144, baseType: !51, size: 24, align: 8, offset: 928)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 24, align: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !5, line: 145, baseType: !55, size: 8, align: 8, offset: 952)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, align: 8, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !5, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !5, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !5, line: 152, baseType: !34, size: 64, align: 64, offset: 1152)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !5, line: 88, size: 128, align: 64, elements: !62, identifier: "_ZTS6__sbuf")
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !5, line: 89, baseType: !8, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !5, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !5, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !67, identifier: "_ZTS13__va_list_tag")
!67 = !{!68, !70, !71, !72}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !69, size: 32, align: 32)
!69 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !69, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !19, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !19, size: 64, align: 64, offset: 128)
!73 = !DICompositeType(tag: DW_TAG_union_type, file: !38, line: 76, size: 1024, align: 64, elements: !74, identifier: "_ZTS11__mbstate_t")
!74 = !{!75, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !38, line: 77, baseType: !76, size: 1024, align: 8)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !38, line: 78, baseType: !39, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !81, line: 73, size: 448, align: 64, elements: !82, identifier: "_ZTS2tm")
!81 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !94}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !81, line: 74, baseType: !11, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !81, line: 75, baseType: !11, size: 32, align: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !81, line: 76, baseType: !11, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !81, line: 77, baseType: !11, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !81, line: 78, baseType: !11, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !81, line: 79, baseType: !11, size: 32, align: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !81, line: 80, baseType: !11, size: 32, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !81, line: 81, baseType: !11, size: 32, align: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !81, line: 82, baseType: !11, size: 32, align: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !81, line: 83, baseType: !93, size: 64, align: 64, offset: 320)
!93 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !81, line: 84, baseType: !28, size: 64, align: 64, offset: 384)
!95 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 82, size: 64, align: 32, elements: !97, identifier: "_ZTS5div_t")
!96 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !96, line: 83, baseType: !11, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !96, line: 84, baseType: !11, size: 32, align: 32, offset: 32)
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 87, size: 128, align: 64, elements: !101, identifier: "_ZTS6ldiv_t")
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !96, line: 88, baseType: !93, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !96, line: 89, baseType: !93, size: 64, align: 64, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 93, size: 128, align: 64, elements: !105, identifier: "_ZTS7lldiv_t")
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !96, line: 94, baseType: !39, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !96, line: 95, baseType: !39, size: 64, align: 64, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "Param", scope: !110, file: !109, line: 141, size: 8, align: 8, elements: !111, identifier: "_ZTSN6soplex5ParamE")
!109 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !DINamespace(name: "soplex", scope: null, file: !109, line: 49)
!111 = !{!112, !115, !116, !119, !122, !125, !128}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "s_epsilon", scope: !"_ZTSN6soplex5ParamE", file: !109, line: 144, baseType: !113, flags: DIFlagStaticMember)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !110, file: !109, line: 127, baseType: !114)
!114 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "s_verbose", scope: !"_ZTSN6soplex5ParamE", file: !109, line: 145, baseType: !11, flags: DIFlagStaticMember)
!116 = !DISubprogram(name: "epsilon", linkageName: "_ZN6soplex5Param7epsilonEv", scope: !"_ZTSN6soplex5ParamE", file: !109, line: 148, type: !117, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubroutineType(types: !118)
!118 = !{!113}
!119 = !DISubprogram(name: "setEpsilon", linkageName: "_ZN6soplex5Param10setEpsilonEd", scope: !"_ZTSN6soplex5ParamE", file: !109, line: 152, type: !120, isLocal: false, isDefinition: false, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !113}
!122 = !DISubprogram(name: "computeEpsilon", linkageName: "_ZN6soplex5Param14computeEpsilonEv", scope: !"_ZTSN6soplex5ParamE", file: !109, line: 153, type: !123, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!123 = !DISubroutineType(types: !124)
!124 = !{null}
!125 = !DISubprogram(name: "verbose", linkageName: "_ZN6soplex5Param7verboseEv", scope: !"_ZTSN6soplex5ParamE", file: !109, line: 154, type: !126, isLocal: false, isDefinition: false, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!126 = !DISubroutineType(types: !127)
!127 = !{!11}
!128 = !DISubprogram(name: "setVerbose", linkageName: "_ZN6soplex5Param10setVerboseEi", scope: !"_ZTSN6soplex5ParamE", file: !109, line: 158, type: !129, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !11}
!131 = !{!132, !135}
!132 = !DISubprogram(name: "setEpsilon", linkageName: "_ZN6soplex5Param10setEpsilonEd", scope: !"_ZTSN6soplex5ParamE", file: !1, line: 39, type: !120, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: void (double)* @_ZN6soplex5Param10setEpsilonEd, declaration: !119, variables: !133)
!133 = !{!134}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eps", arg: 1, scope: !132, file: !1, line: 39, type: !113)
!135 = !DISubprogram(name: "setVerbose", linkageName: "_ZN6soplex5Param10setVerboseEi", scope: !"_ZTSN6soplex5ParamE", file: !1, line: 44, type: !129, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_ZN6soplex5Param10setVerboseEi, declaration: !128, variables: !136)
!136 = !{!137}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_verbose", arg: 1, scope: !135, file: !1, line: 44, type: !11)
!138 = !{!139, !141, !142}
!139 = !DIGlobalVariable(name: "infinity", linkageName: "_ZN6soplex8infinityE", scope: !110, file: !1, line: 34, type: !140, isLocal: false, isDefinition: true, variable: double* @_ZN6soplex8infinityE)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
