; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxsteeppr.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::SPxSteepPR" = type { %"class.soplex::SPxPricer", %"class.soplex::DVector", %"class.soplex::DVector", %"class.soplex::DVector", %"class.soplex::SSVector", i32, %"class.soplex::SPxId", double, i32, %"class.soplex::DataArray.3", %"class.soplex::DataArray.3", %"class.soplex::DataArray.3", i32, double }
%"class.soplex::SPxPricer" = type { i32 (...)**, i8*, %"class.soplex::SoPlex"*, double }

!66 = !DIEnumerator(name: "LEAVE", value: 1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Pricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 141, size: 32, align: 32, elements: !68, identifier: "_ZTSN6soplex6SoPlex7PricingE")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "FULL", value: 0)
!70 = !DIEnumerator(name: "PARTIAL", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Representation", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 94, size: 32, align: 32, elements: !72, identifier: "_ZTSN6soplex6SoPlex14RepresentationE")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "ROW", value: -1)
!74 = !DIEnumerator(name: "COLUMN", value: 1)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex5TimerE", file: !76, line: 100, size: 32, align: 32, elements: !77, identifier: "_ZTSN6soplex5TimerUt_E")
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "RESET", value: 0)
!79 = !DIEnumerator(name: "STOPPED", value: 1)
!80 = !DIEnumerator(name: "RUNNING", value: 2)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 177, size: 32, align: 32, elements: !82, identifier: "_ZTSN6soplex6SoPlex6StatusE")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!83 = !DIEnumerator(name: "ERROR", value: -9)
!84 = !DIEnumerator(name: "NOT_INIT", value: -8)
!85 = !DIEnumerator(name: "ABORT_TIME", value: -7)
!86 = !DIEnumerator(name: "ABORT_ITER", value: -6)
!87 = !DIEnumerator(name: "ABORT_VALUE", value: -5)
!88 = !DIEnumerator(name: "SINGULAR", value: -4)
!89 = !DIEnumerator(name: "NO_PROBLEM", value: -3)
!90 = !DIEnumerator(name: "REGULAR", value: -2)
!91 = !DIEnumerator(name: "RUNNING", value: -1)
!92 = !DIEnumerator(name: "UNKNOWN", value: 0)
!93 = !DIEnumerator(name: "OPTIMAL", value: 1)
!94 = !DIEnumerator(name: "UNBOUNDED", value: 2)
!95 = !DIEnumerator(name: "INFEASIBLE", value: 3)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VarStatus", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 165, size: 32, align: 32, elements: !97, identifier: "_ZTSN6soplex6SoPlex9VarStatusE")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "ON_UPPER", value: 0)
!99 = !DIEnumerator(name: "ON_LOWER", value: 1)
!100 = !DIEnumerator(name: "FIXED", value: 2)
!101 = !DIEnumerator(name: "ZERO", value: 3)
!102 = !DIEnumerator(name: "BASIC", value: 4)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Setup", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 53, size: 32, align: 32, elements: !105, identifier: "_ZTSN6soplex10SPxSteepPR5SetupE")
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxsteeppr.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107}
!106 = !DIEnumerator(name: "EXACT", value: 0)
!107 = !DIEnumerator(name: "DEFAULT", value: 1)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !109, line: 87, size: 32, align: 32, elements: !110, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!109 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "FREE", value: 0)
!112 = !DIEnumerator(name: "RELEASED", value: 1)
!113 = !DIEnumerator(name: "USED", value: 2)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !115, line: 1280, size: 32, align: 32, elements: !116, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!115 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!116 = !{!117}
!117 = !DIEnumerator(name: "__short_mask", value: 1)
!118 = !{!119, !176, !180, !181, !188, !195, !210, !215, !219, !223, !305, !372, !941, !1217, !1353, !1477, !1560, !1648, !1652, !1727, !1849, !1899, !1944, !2060, !2087, !2091, !2118, !2160, !2217, !2262, !3, !2313, !2441, !10, !2478, !2491, !15, !2530, !2543, !2706, !2756, !2832, !21, !2980, !3055, !3056, !3412, !3449, !3453, !3463, !3518, !3521, !3526, !3531, !3535, !3578, !3582, !3584, !3594, !3599, !3600, !3603, !3606, !3619, !3630, !3637, !3641, !3645, !3682, !3685, !3687, !3688, !3689, !3690, !3692, !3703, !3732, !3753, !3770, !3872, !3977, !27, !3978, !4066, !4177, !4181, !4242, !4260, !4340, !4348, !4380, !4545, !4622, !4702, !32, !40, !4767, !4809, !51, !62, !67, !71, !4886, !75, !81, !4925, !4983, !5006, !5049, !5050, !5051, !5052, !96, !5053, !103, !235, !108, !558, !5132, !5156, !5187, !5193, !5194, !5211, !301, !114, !5214, !5224, !5228, !159, !2554, !2649, !5229, !5300, !126, !143, !5058}
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !120, line: 122, size: 1216, align: 64, elements: !121, identifier: "_ZTS7__sFILE")
!120 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!121 = !{!122, !125, !127, !128, !130, !131, !132, !133, !135, !139, !145, !155, !161, !162, !164, !165, !169, !173, !174, !175}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !120, line: 123, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !120, line: 124, baseType: !126, size: 32, align: 32, offset: 64)
!126 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !120, line: 125, baseType: !126, size: 32, align: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !120, line: 126, baseType: !129, size: 16, align: 16, offset: 128)
!129 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !120, line: 127, baseType: !129, size: 16, align: 16, offset: 144)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !120, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !120, line: 129, baseType: !126, size: 32, align: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !120, line: 132, baseType: !134, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !120, line: 133, baseType: !136, size: 64, align: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!126, !134}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !120, line: 134, baseType: !140, size: 64, align: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!126, !134, !143, !126}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !120, line: 135, baseType: !146, size: 64, align: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!149, !134, !149, !126}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !120, line: 77, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !151, line: 71, baseType: !152)
!151 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !153, line: 46, baseType: !154)
!153 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !120, line: 136, baseType: !156, size: 64, align: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!126, !134, !159, !126}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !120, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !120, line: 140, baseType: !163, size: 64, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !120, line: 141, baseType: !126, size: 32, align: 32, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !120, line: 144, baseType: !166, size: 24, align: 8, offset: 928)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 24, align: 8, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 3)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !120, line: 145, baseType: !170, size: 8, align: 8, offset: 952)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 8, align: 8, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 1)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !120, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !120, line: 151, baseType: !126, size: 32, align: 32, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !120, line: 152, baseType: !149, size: 64, align: 64, offset: 1152)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !120, line: 88, size: 128, align: 64, elements: !177, identifier: "_ZTS6__sbuf")
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !120, line: 89, baseType: !123, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !120, line: 90, baseType: !126, size: 32, align: 32, offset: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !120, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !182, identifier: "_ZTS13__va_list_tag")
!182 = !{!183, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !184, size: 32, align: 32)
!184 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !184, size: 32, align: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !134, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !134, size: 64, align: 64, offset: 128)
!188 = !DICompositeType(tag: DW_TAG_union_type, file: !153, line: 76, size: 1024, align: 64, elements: !189, identifier: "_ZTS11__mbstate_t")
!189 = !{!190, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !153, line: 77, baseType: !191, size: 1024, align: 8)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1024, align: 8, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !153, line: 78, baseType: !154, size: 64, align: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !196, line: 73, size: 448, align: 64, elements: !197, identifier: "_ZTS2tm")
!196 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !209}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !196, line: 74, baseType: !126, size: 32, align: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !196, line: 75, baseType: !126, size: 32, align: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !196, line: 76, baseType: !126, size: 32, align: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !196, line: 77, baseType: !126, size: 32, align: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !196, line: 78, baseType: !126, size: 32, align: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !196, line: 79, baseType: !126, size: 32, align: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !196, line: 80, baseType: !126, size: 32, align: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !196, line: 81, baseType: !126, size: 32, align: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !196, line: 82, baseType: !126, size: 32, align: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !196, line: 83, baseType: !208, size: 64, align: 64, offset: 320)
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !196, line: 84, baseType: !143, size: 64, align: 64, offset: 384)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 82, size: 64, align: 32, elements: !212, identifier: "_ZTS5div_t")
!211 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !211, line: 83, baseType: !126, size: 32, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !211, line: 84, baseType: !126, size: 32, align: 32, offset: 32)
!215 = !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 87, size: 128, align: 64, elements: !216, identifier: "_ZTS6ldiv_t")
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !211, line: 88, baseType: !208, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !211, line: 89, baseType: !208, size: 64, align: 64, offset: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 93, size: 128, align: 64, elements: !220, identifier: "_ZTS7lldiv_t")
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !211, line: 94, baseType: !154, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !211, line: 95, baseType: !154, size: 64, align: 64, offset: 64)
!223 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxSteepPR", scope: !224, file: !104, line: 45, size: 2432, align: 64, elements: !226, vtableHolder: !"_ZTSN6soplex9SPxPricerE", identifier: "_ZTSN6soplex10SPxSteepPRE")
!224 = !DINamespace(name: "soplex", scope: null, file: !225, line: 49)
!225 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !237, !238, !239, !240, !241, !242, !243, !247, !250, !254, !257, !260, !263, !267, !270, !271, !274, !277, !280, !283, !286, !289, !290, !291, !296, !297, !298, !304}
!227 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex10SPxSteepPRE", baseType: !"_ZTSN6soplex9SPxPricerE", flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "penalty", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 59, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "coPenalty", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 60, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "workVec", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 62, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "workRhs", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 63, baseType: !"_ZTSN6soplex8SSVectorE", size: 512, align: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "lastIdx", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 65, baseType: !126, size: 32, align: 32, offset: 1536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lastId", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 66, baseType: !"_ZTSN6soplex5SPxIdE", size: 32, align: 32, offset: 1568)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pi_p", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 67, baseType: !235, size: 64, align: 64, offset: 1600)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !224, file: !225, line: 127, baseType: !236)
!236 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "prefSetup", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 70, baseType: !126, size: 32, align: 32, offset: 1664)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "coPref", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 71, baseType: !"_ZTSN6soplex9DataArrayIdEE", size: 192, align: 64, offset: 1728)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pref", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 72, baseType: !"_ZTSN6soplex9DataArrayIdEE", size: 192, align: 64, offset: 1920)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "leavePref", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 73, baseType: !"_ZTSN6soplex9DataArrayIdEE", size: 192, align: 64, offset: 2112)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 97, baseType: !"_ZTSN6soplex10SPxSteepPR5SetupE", size: 32, align: 32, offset: 2304, flags: DIFlagPublic)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "accuracy", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 100, baseType: !235, size: 64, align: 64, offset: 2368, flags: DIFlagPublic)
!243 = !DISubprogram(name: "setupPrefs", linkageName: "_ZN6soplex10SPxSteepPR10setupPrefsEdddddiiii", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 76, type: !244, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !246, !235, !235, !235, !235, !235, !126, !126, !126, !126}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxSteepPRE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!247 = !DISubprogram(name: "setupPrefs", linkageName: "_ZN6soplex10SPxSteepPR10setupPrefsENS_6SoPlex4TypeE", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 83, type: !248, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !246, !"_ZTSN6soplex6SoPlex4TypeE"}
!250 = !DISubprogram(name: "selectLeaveX", linkageName: "_ZN6soplex10SPxSteepPR12selectLeaveXERdii", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 85, type: !251, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!126, !246, !253, !126, !126}
!253 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !235)
!254 = !DISubprogram(name: "selectEnterX", linkageName: "_ZN6soplex10SPxSteepPR12selectEnterXERdiiii", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 87, type: !255, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{!"_ZTSN6soplex5SPxIdE", !246, !253, !126, !126, !126, !126}
!257 = !DISubprogram(name: "left4X", linkageName: "_ZN6soplex10SPxSteepPR6left4XEiNS_5SPxIdEii", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 90, type: !258, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !246, !126, !"_ZTSN6soplex5SPxIdE", !126, !126}
!260 = !DISubprogram(name: "entered4X", linkageName: "_ZN6soplex10SPxSteepPR9entered4XENS_5SPxIdEiiiii", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 92, type: !261, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !246, !"_ZTSN6soplex5SPxIdE", !126, !126, !126, !126, !126}
!263 = !DISubprogram(name: "load", linkageName: "_ZN6soplex10SPxSteepPR4loadEPNS_6SoPlexE", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 103, type: !264, isLocal: false, isDefinition: false, scopeLine: 103, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !246, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64)
!267 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex10SPxSteepPR5clearEv", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 105, type: !268, isLocal: false, isDefinition: false, scopeLine: 105, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !246}
!270 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex10SPxSteepPR7setTypeENS_6SoPlex4TypeE", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 107, type: !248, isLocal: false, isDefinition: false, scopeLine: 107, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex10SPxSteepPR6setRepENS_6SoPlex14RepresentationE", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 109, type: !272, isLocal: false, isDefinition: false, scopeLine: 109, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !246, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!274 = !DISubprogram(name: "selectLeave", linkageName: "_ZN6soplex10SPxSteepPR11selectLeaveEv", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 111, type: !275, isLocal: false, isDefinition: false, scopeLine: 111, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{!126, !246}
!277 = !DISubprogram(name: "left4", linkageName: "_ZN6soplex10SPxSteepPR5left4EiNS_5SPxIdE", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 113, type: !278, isLocal: false, isDefinition: false, scopeLine: 113, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !246, !126, !"_ZTSN6soplex5SPxIdE"}
!280 = !DISubprogram(name: "selectEnter", linkageName: "_ZN6soplex10SPxSteepPR11selectEnterEv", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 115, type: !281, isLocal: false, isDefinition: false, scopeLine: 115, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{!"_ZTSN6soplex5SPxIdE", !246}
!283 = !DISubprogram(name: "entered4", linkageName: "_ZN6soplex10SPxSteepPR8entered4ENS_5SPxIdEi", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 117, type: !284, isLocal: false, isDefinition: false, scopeLine: 117, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !246, !"_ZTSN6soplex5SPxIdE", !126}
!286 = !DISubprogram(name: "addedVecs", linkageName: "_ZN6soplex10SPxSteepPR9addedVecsEi", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 119, type: !287, isLocal: false, isDefinition: false, scopeLine: 119, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !246, !126}
!289 = !DISubprogram(name: "addedCoVecs", linkageName: "_ZN6soplex10SPxSteepPR11addedCoVecsEi", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 121, type: !287, isLocal: false, isDefinition: false, scopeLine: 121, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubprogram(name: "removedVec", linkageName: "_ZN6soplex10SPxSteepPR10removedVecEi", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 123, type: !287, isLocal: false, isDefinition: false, scopeLine: 123, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!291 = !DISubprogram(name: "removedCoVecs", linkageName: "_ZN6soplex10SPxSteepPR13removedCoVecsEPKi", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 125, type: !292, isLocal: false, isDefinition: false, scopeLine: 125, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !246, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!296 = !DISubprogram(name: "removedVecs", linkageName: "_ZN6soplex10SPxSteepPR11removedVecsEPKi", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 127, type: !292, isLocal: false, isDefinition: false, scopeLine: 127, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!297 = !DISubprogram(name: "removedCoVec", linkageName: "_ZN6soplex10SPxSteepPR12removedCoVecEi", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 129, type: !287, isLocal: false, isDefinition: false, scopeLine: 129, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!298 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex10SPxSteepPR12isConsistentEv", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 131, type: !299, isLocal: false, isDefinition: false, scopeLine: 131, containingType: !"_ZTSN6soplex10SPxSteepPRE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !302}
!301 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SPxSteepPRE")
!304 = !DISubprogram(name: "SPxSteepPR", scope: !"_ZTSN6soplex10SPxSteepPRE", file: !104, line: 134, type: !268, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!305 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxPricer", scope: !224, file: !306, line: 52, size: 256, align: 64, elements: !307, vtableHolder: !"_ZTSN6soplex9SPxPricerE", identifier: "_ZTSN6soplex9SPxPricerE")
!306 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxpricer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!307 = !{!308, !313, !314, !315, !316, !321, !325, !328, !331, !334, !337, !340, !343, !346, !349, !352, !355, !358, !359, !360, !363, !364, !365, !368, !371}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxPricer", scope: !306, file: !306, baseType: !309, size: 64, flags: DIFlagArtificial)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!126}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 55, baseType: !159, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "thesolver", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 56, baseType: !266, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "theeps", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 57, baseType: !235, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!316 = !DISubprogram(name: "getName", linkageName: "_ZNK6soplex9SPxPricer7getNameEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 63, type: !317, isLocal: false, isDefinition: false, scopeLine: 63, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!159, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9SPxPricerE")
!321 = !DISubprogram(name: "load", linkageName: "_ZN6soplex9SPxPricer4loadEPNS_6SoPlexE", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 71, type: !322, isLocal: false, isDefinition: false, scopeLine: 71, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !324, !266}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!325 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex9SPxPricer5clearEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 77, type: !326, isLocal: false, isDefinition: false, scopeLine: 77, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !324}
!328 = !DISubprogram(name: "solver", linkageName: "_ZNK6soplex9SPxPricer6solverEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 83, type: !329, isLocal: false, isDefinition: false, scopeLine: 83, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{!266, !319}
!331 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex9SPxPricer7epsilonEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 89, type: !332, isLocal: false, isDefinition: false, scopeLine: 89, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!332 = !DISubroutineType(types: !333)
!333 = !{!235, !319}
!334 = !DISubprogram(name: "setEpsilon", linkageName: "_ZN6soplex9SPxPricer10setEpsilonEd", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 97, type: !335, isLocal: false, isDefinition: false, scopeLine: 97, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !324, !235}
!337 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex9SPxPricer7setTypeENS_6SoPlex4TypeE", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 108, type: !338, isLocal: false, isDefinition: false, scopeLine: 108, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !324, !"_ZTSN6soplex6SoPlex4TypeE"}
!340 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex9SPxPricer6setRepENS_6SoPlex14RepresentationE", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 115, type: !341, isLocal: false, isDefinition: false, scopeLine: 115, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !324, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!343 = !DISubprogram(name: "selectLeave", linkageName: "_ZN6soplex9SPxPricer11selectLeaveEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 126, type: !344, isLocal: false, isDefinition: false, scopeLine: 126, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{!126, !324}
!346 = !DISubprogram(name: "left4", linkageName: "_ZN6soplex9SPxPricer5left4EiNS_5SPxIdE", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 138, type: !347, isLocal: false, isDefinition: false, scopeLine: 138, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !324, !126, !"_ZTSN6soplex5SPxIdE"}
!349 = !DISubprogram(name: "selectEnter", linkageName: "_ZN6soplex9SPxPricer11selectEnterEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 153, type: !350, isLocal: false, isDefinition: false, scopeLine: 153, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{!"_ZTSN6soplex5SPxIdE", !324}
!352 = !DISubprogram(name: "entered4", linkageName: "_ZN6soplex9SPxPricer8entered4ENS_5SPxIdEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 165, type: !353, isLocal: false, isDefinition: false, scopeLine: 165, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !324, !"_ZTSN6soplex5SPxIdE", !126}
!355 = !DISubprogram(name: "addedVecs", linkageName: "_ZN6soplex9SPxPricer9addedVecsEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 173, type: !356, isLocal: false, isDefinition: false, scopeLine: 173, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !324, !126}
!358 = !DISubprogram(name: "addedCoVecs", linkageName: "_ZN6soplex9SPxPricer11addedCoVecsEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 176, type: !356, isLocal: false, isDefinition: false, scopeLine: 176, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubprogram(name: "removedVec", linkageName: "_ZN6soplex9SPxPricer10removedVecEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 183, type: !356, isLocal: false, isDefinition: false, scopeLine: 183, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubprogram(name: "removedVecs", linkageName: "_ZN6soplex9SPxPricer11removedVecsEPKi", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 186, type: !361, isLocal: false, isDefinition: false, scopeLine: 186, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !324, !294}
!363 = !DISubprogram(name: "removedCoVec", linkageName: "_ZN6soplex9SPxPricer12removedCoVecEi", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 189, type: !356, isLocal: false, isDefinition: false, scopeLine: 189, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubprogram(name: "removedCoVecs", linkageName: "_ZN6soplex9SPxPricer13removedCoVecsEPKi", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 192, type: !361, isLocal: false, isDefinition: false, scopeLine: 192, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9SPxPricer12isConsistentEv", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 196, type: !366, isLocal: false, isDefinition: false, scopeLine: 196, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!301, !319}
!368 = !DISubprogram(name: "SPxPricer", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 204, type: !369, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !324, !159}
!371 = !DISubprogram(name: "~SPxPricer", scope: !"_ZTSN6soplex9SPxPricerE", file: !306, line: 211, type: !326, isLocal: false, isDefinition: false, scopeLine: 211, containingType: !"_ZTSN6soplex9SPxPricerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !224, file: !63, line: 77, size: 12416, align: 64, elements: !373, vtableHolder: !"_ZTSN6soplex5SPxLPE", identifier: "_ZTSN6soplex6SoPlexE")
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !392, !394, !395, !396, !397, !398, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !417, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !434, !436, !438, !440, !442, !447, !450, !453, !456, !468, !473, !477, !480, !483, !486, !489, !492, !497, !500, !503, !506, !509, !512, !515, !516, !521, !524, !527, !530, !534, !535, !536, !537, !538, !541, !542, !543, !546, !547, !548, !551, !552, !553, !554, !555, !559, !560, !561, !566, !569, !572, !573, !574, !575, !576, !577, !578, !581, !584, !587, !588, !589, !592, !593, !594, !595, !596, !597, !600, !605, !608, !613, !616, !619, !622, !625, !626, !627, !630, !631, !634, !635, !640, !645, !650, !655, !656, !657, !658, !659, !660, !663, !664, !667, !668, !671, !674, !677, !678, !679, !680, !684, !687, !688, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !724, !725, !726, !730, !731, !732, !733, !734, !735, !740, !741, !746, !747, !750, !751, !752, !757, !761, !765, !770, !775, !780, !785, !786, !789, !793, !796, !797, !798, !799, !800, !801, !802, !805, !806, !807, !808, !809, !810, !811, !812, !813, !816, !817, !818, !819, !820, !821, !825, !830, !833, !836, !839, !842, !845, !848, !849, !850, !851, !852, !853, !854, !855, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !878, !881, !884, !885, !888, !889, !893, !898, !899, !900, !905, !910, !913, !914, !915, !916, !919, !920, !921, !922, !925, !928, !931, !932, !937, !940}
!374 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex5SPxLPE", flags: DIFlagPublic)
!375 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex8SPxBasisE", offset: 2816, flags: DIFlagProtected)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "theType", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 196, baseType: !"_ZTSN6soplex6SoPlex4TypeE", size: 32, align: 32, offset: 4480)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "thePricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 197, baseType: !"_ZTSN6soplex6SoPlex7PricingE", size: 32, align: 32, offset: 4512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "therep", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 198, baseType: !"_ZTSN6soplex6SoPlex14RepresentationE", size: 32, align: 32, offset: 4544)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "theTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 199, baseType: !"_ZTSN6soplex5TimerE", size: 448, align: 64, offset: 4608)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "maxIters", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 200, baseType: !126, size: 32, align: 32, offset: 5056)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 201, baseType: !235, size: 64, align: 64, offset: 5120)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 202, baseType: !235, size: 64, align: 64, offset: 5184)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "m_status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 203, baseType: !"_ZTSN6soplex6SoPlex6StatusE", size: 32, align: 32, offset: 5248)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 205, baseType: !235, size: 64, align: 64, offset: 5312)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "theShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 206, baseType: !235, size: 64, align: 64, offset: 5376)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lastShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 207, baseType: !235, size: 64, align: 64, offset: 5440)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 208, baseType: !126, size: 32, align: 32, offset: 5504)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_numCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 209, baseType: !126, size: 32, align: 32, offset: 5536)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 210, baseType: !301, size: 8, align: 8, offset: 5568)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 212, baseType: !391, size: 64, align: 64, offset: 5632)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 213, baseType: !393, size: 64, align: 64, offset: 5696)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 214, baseType: !391, size: 64, align: 64, offset: 5760)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 215, baseType: !393, size: 64, align: 64, offset: 5824)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cacheProductFactor", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 217, baseType: !235, size: 64, align: 64, offset: 5888)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "unitVecs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 220, baseType: !"_ZTSN6soplex5ArrayINS_10UnitVectorEEE", size: 128, align: 64, offset: 5952, flags: DIFlagProtected)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "thevectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 221, baseType: !399, size: 64, align: 64, offset: 6080, flags: DIFlagProtected)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!401 = !DIDerivedType(tag: DW_TAG_member, name: "thecovectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 222, baseType: !399, size: 64, align: 64, offset: 6144, flags: DIFlagProtected)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nNZEs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 224, baseType: !126, size: 32, align: 32, offset: 6208, flags: DIFlagProtected)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "coVecDim", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 225, baseType: !126, size: 32, align: 32, offset: 6240, flags: DIFlagProtected)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "primRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 227, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 6272, flags: DIFlagProtected)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "primVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 228, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 6528, flags: DIFlagProtected)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dualRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 229, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 7360, flags: DIFlagProtected)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dualVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 230, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 7616, flags: DIFlagProtected)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "addVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 231, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 8448, flags: DIFlagProtected)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "theURbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 233, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9280, flags: DIFlagProtected)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "theLRbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 234, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9536, flags: DIFlagProtected)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "theUCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 235, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9792, flags: DIFlagProtected)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "theLCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 236, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10048, flags: DIFlagProtected)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "theUBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 243, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10304, flags: DIFlagProtected)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "theLBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 244, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10560, flags: DIFlagProtected)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "theFrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 246, baseType: !416, size: 64, align: 64, offset: 10816, flags: DIFlagProtected)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "theFvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 247, baseType: !418, size: 64, align: 64, offset: 10880, flags: DIFlagProtected)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 249, baseType: !416, size: 64, align: 64, offset: 10944, flags: DIFlagProtected)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 250, baseType: !418, size: 64, align: 64, offset: 11008, flags: DIFlagProtected)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "thePvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 251, baseType: !418, size: 64, align: 64, offset: 11072, flags: DIFlagProtected)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "theRPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 254, baseType: !418, size: 64, align: 64, offset: 11136, flags: DIFlagProtected)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "theCPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 256, baseType: !418, size: 64, align: 64, offset: 11200, flags: DIFlagProtected)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "theUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 260, baseType: !416, size: 64, align: 64, offset: 11264, flags: DIFlagProtected)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "theLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 261, baseType: !416, size: 64, align: 64, offset: 11328, flags: DIFlagProtected)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "theCoUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 262, baseType: !416, size: 64, align: 64, offset: 11392, flags: DIFlagProtected)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "theCoLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 263, baseType: !416, size: 64, align: 64, offset: 11456, flags: DIFlagProtected)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "theCoTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 266, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11520, flags: DIFlagProtected)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "theTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 267, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11776, flags: DIFlagProtected)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "leaveCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 269, baseType: !126, size: 32, align: 32, offset: 12032, flags: DIFlagProtected)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "enterCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 270, baseType: !126, size: 32, align: 32, offset: 12064, flags: DIFlagProtected)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "thepricer", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 272, baseType: !433, size: 64, align: 64, offset: 12096, flags: DIFlagProtected)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "theratiotester", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 273, baseType: !435, size: 64, align: 64, offset: 12160, flags: DIFlagProtected)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "thestarter", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 274, baseType: !437, size: 64, align: 64, offset: 12224, flags: DIFlagProtected)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "thescaler", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 275, baseType: !439, size: 64, align: 64, offset: 12288, flags: DIFlagProtected)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxScalerE", size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "thesimplifier", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 276, baseType: !441, size: 64, align: 64, offset: 12352, flags: DIFlagProtected)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex13SPxSimplifierE", size: 64, align: 64)
!442 = !DISubprogram(name: "version", linkageName: "_ZNK6soplex6SoPlex7versionEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 280, type: !443, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!126, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6SoPlexE")
!447 = !DISubprogram(name: "rep", linkageName: "_ZNK6soplex6SoPlex3repEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 285, type: !448, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{!"_ZTSN6soplex6SoPlex14RepresentationE", !445}
!450 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex6SoPlex4typeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 291, type: !451, isLocal: false, isDefinition: false, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubroutineType(types: !452)
!452 = !{!"_ZTSN6soplex6SoPlex4TypeE", !445}
!453 = !DISubprogram(name: "pricing", linkageName: "_ZNK6soplex6SoPlex7pricingEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 297, type: !454, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{!"_ZTSN6soplex6SoPlex7PricingE", !445}
!456 = !DISubprogram(name: "read", linkageName: "_ZN6soplex6SoPlex4readERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEEPNS_7NameSetES8_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 329, type: !457, isLocal: false, isDefinition: false, scopeLine: 329, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!301, !459, !460, !466, !466, !467}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!460 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !463, file: !462, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!462 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!463 = !DINamespace(name: "__1", scope: !465, file: !464, line: 369)
!464 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!465 = !DINamespace(name: "std", scope: null, file: !464, line: 368)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7NameSetE", size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64)
!468 = !DISubprogram(name: "loadLP", linkageName: "_ZN6soplex6SoPlex6loadLPERKNS_5SPxLPE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 333, type: !469, isLocal: false, isDefinition: false, scopeLine: 333, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !459, !471}
!471 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxLPE")
!473 = !DISubprogram(name: "setSolver", linkageName: "_ZN6soplex6SoPlex9setSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 335, type: !474, isLocal: false, isDefinition: false, scopeLine: 335, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !459, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!477 = !DISubprogram(name: "setPricer", linkageName: "_ZN6soplex6SoPlex9setPricerEPNS_9SPxPricerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 337, type: !478, isLocal: false, isDefinition: false, scopeLine: 337, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !459, !433}
!480 = !DISubprogram(name: "setTester", linkageName: "_ZN6soplex6SoPlex9setTesterEPNS_14SPxRatioTesterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 339, type: !481, isLocal: false, isDefinition: false, scopeLine: 339, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !459, !435}
!483 = !DISubprogram(name: "setStarter", linkageName: "_ZN6soplex6SoPlex10setStarterEPNS_10SPxStarterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 341, type: !484, isLocal: false, isDefinition: false, scopeLine: 341, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !459, !437}
!486 = !DISubprogram(name: "setScaler", linkageName: "_ZN6soplex6SoPlex9setScalerEPNS_9SPxScalerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 343, type: !487, isLocal: false, isDefinition: false, scopeLine: 343, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !459, !439}
!489 = !DISubprogram(name: "setSimplifier", linkageName: "_ZN6soplex6SoPlex13setSimplifierEPNS_13SPxSimplifierE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 345, type: !490, isLocal: false, isDefinition: false, scopeLine: 345, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !459, !441}
!492 = !DISubprogram(name: "loadBasis", linkageName: "_ZN6soplex6SoPlex9loadBasisERKNS_8SPxBasis4DescE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 347, type: !493, isLocal: false, isDefinition: false, scopeLine: 347, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !459, !495}
!495 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!497 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex6SoPlex6setRepENS0_14RepresentationE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 350, type: !498, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !459, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!500 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex6SoPlex7setTypeENS0_4TypeE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 352, type: !501, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !459, !"_ZTSN6soplex6SoPlex4TypeE"}
!503 = !DISubprogram(name: "setPricing", linkageName: "_ZN6soplex6SoPlex10setPricingENS0_7PricingE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 354, type: !504, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !459, !"_ZTSN6soplex6SoPlex7PricingE"}
!506 = !DISubprogram(name: "reLoad", linkageName: "_ZN6soplex6SoPlex6reLoadEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 357, type: !507, isLocal: false, isDefinition: false, scopeLine: 357, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !459}
!509 = !DISubprogram(name: "readFile", linkageName: "_ZN6soplex6SoPlex8readFileEPKcPNS_7NameSetES4_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 360, type: !510, isLocal: false, isDefinition: false, scopeLine: 360, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{!301, !459, !159, !466, !466, !467}
!512 = !DISubprogram(name: "dumpFile", linkageName: "_ZNK6soplex6SoPlex8dumpFileEPKc", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 364, type: !513, isLocal: false, isDefinition: false, scopeLine: 364, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !445, !159}
!515 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6SoPlex5clearEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 367, type: !507, isLocal: false, isDefinition: false, scopeLine: 367, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubprogram(name: "readBasisFile", linkageName: "_ZN6soplex6SoPlex13readBasisFileEPKcRKNS_7NameSetES5_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 370, type: !517, isLocal: false, isDefinition: false, scopeLine: 370, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubroutineType(types: !518)
!518 = !{!301, !459, !159, !519, !519}
!519 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!521 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex6SoPlex5solveEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 383, type: !522, isLocal: false, isDefinition: false, scopeLine: 383, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{!"_ZTSN6soplex6SoPlex6StatusE", !459}
!524 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex6SoPlex6statusEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 386, type: !525, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{!"_ZTSN6soplex6SoPlex6StatusE", !445}
!527 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex6SoPlex5valueEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 392, type: !528, isLocal: false, isDefinition: false, scopeLine: 392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubroutineType(types: !529)
!529 = !{!235, !445}
!530 = !DISubprogram(name: "getPrimal", linkageName: "_ZNK6soplex6SoPlex9getPrimalERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 401, type: !531, isLocal: false, isDefinition: false, scopeLine: 401, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{!"_ZTSN6soplex6SoPlex6StatusE", !445, !533}
!533 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!534 = !DISubprogram(name: "getPrimalUnscaled", linkageName: "_ZNK6soplex6SoPlex17getPrimalUnscaledERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 406, type: !531, isLocal: false, isDefinition: false, scopeLine: 406, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubprogram(name: "getSlacks", linkageName: "_ZNK6soplex6SoPlex9getSlacksERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 421, type: !531, isLocal: false, isDefinition: false, scopeLine: 421, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubprogram(name: "getDual", linkageName: "_ZNK6soplex6SoPlex7getDualERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 447, type: !531, isLocal: false, isDefinition: false, scopeLine: 447, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubprogram(name: "getRdCost", linkageName: "_ZNK6soplex6SoPlex9getRdCostERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 460, type: !531, isLocal: false, isDefinition: false, scopeLine: 460, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !DISubprogram(name: "terminate", linkageName: "_ZN6soplex6SoPlex9terminateEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 478, type: !539, isLocal: false, isDefinition: false, scopeLine: 478, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!539 = !DISubroutineType(types: !540)
!540 = !{!301, !459}
!541 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex6SoPlex7epsilonEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 487, type: !528, isLocal: false, isDefinition: false, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex6SoPlex5deltaEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 496, type: !528, isLocal: false, isDefinition: false, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubprogram(name: "setDelta", linkageName: "_ZN6soplex6SoPlex8setDeltaEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 501, type: !544, isLocal: false, isDefinition: false, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !459, !235}
!546 = !DISubprogram(name: "maxCycle", linkageName: "_ZNK6soplex6SoPlex8maxCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 514, type: !443, isLocal: false, isDefinition: false, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!547 = !DISubprogram(name: "numCycle", linkageName: "_ZNK6soplex6SoPlex8numCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 519, type: !443, isLocal: false, isDefinition: false, scopeLine: 519, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubprogram(name: "localAddRows", linkageName: "_ZN6soplex6SoPlex12localAddRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 533, type: !549, isLocal: false, isDefinition: false, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !459, !126}
!551 = !DISubprogram(name: "localAddCols", linkageName: "_ZN6soplex6SoPlex12localAddColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 535, type: !549, isLocal: false, isDefinition: false, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true)
!552 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex6SoPlex9addedRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 539, type: !549, isLocal: false, isDefinition: false, scopeLine: 539, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 57, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!553 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex6SoPlex9addedColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 541, type: !549, isLocal: false, isDefinition: false, scopeLine: 541, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 58, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!554 = !DISubprogram(name: "doRemoveRow", linkageName: "_ZN6soplex6SoPlex11doRemoveRowEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 544, type: !549, isLocal: false, isDefinition: false, scopeLine: 544, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 53, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!555 = !DISubprogram(name: "doRemoveRows", linkageName: "_ZN6soplex6SoPlex12doRemoveRowsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 546, type: !556, isLocal: false, isDefinition: false, scopeLine: 546, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 55, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !459, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!559 = !DISubprogram(name: "doRemoveCol", linkageName: "_ZN6soplex6SoPlex11doRemoveColEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 548, type: !549, isLocal: false, isDefinition: false, scopeLine: 548, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 56, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!560 = !DISubprogram(name: "doRemoveCols", linkageName: "_ZN6soplex6SoPlex12doRemoveColsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 550, type: !556, isLocal: false, isDefinition: false, scopeLine: 550, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 54, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!561 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 554, type: !562, isLocal: false, isDefinition: false, scopeLine: 554, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !459, !564}
!564 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!566 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 556, type: !567, isLocal: false, isDefinition: false, scopeLine: 556, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !459, !126, !235}
!569 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 558, type: !570, isLocal: false, isDefinition: false, scopeLine: 558, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !459, !"_ZTSN6soplex8SPxColIdE", !235}
!572 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 563, type: !562, isLocal: false, isDefinition: false, scopeLine: 563, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!573 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 565, type: !567, isLocal: false, isDefinition: false, scopeLine: 565, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 567, type: !570, isLocal: false, isDefinition: false, scopeLine: 567, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 572, type: !562, isLocal: false, isDefinition: false, scopeLine: 572, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 574, type: !567, isLocal: false, isDefinition: false, scopeLine: 574, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 32, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!577 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 576, type: !570, isLocal: false, isDefinition: false, scopeLine: 576, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 581, type: !579, isLocal: false, isDefinition: false, scopeLine: 581, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !459, !564, !564}
!581 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 583, type: !582, isLocal: false, isDefinition: false, scopeLine: 583, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !459, !126, !235, !235}
!584 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsENS_8SPxColIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 585, type: !585, isLocal: false, isDefinition: false, scopeLine: 585, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !459, !"_ZTSN6soplex8SPxColIdE", !235, !235}
!587 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 591, type: !562, isLocal: false, isDefinition: false, scopeLine: 591, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 593, type: !567, isLocal: false, isDefinition: false, scopeLine: 593, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 595, type: !590, isLocal: false, isDefinition: false, scopeLine: 595, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !459, !"_ZTSN6soplex8SPxRowIdE", !235}
!592 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 600, type: !562, isLocal: false, isDefinition: false, scopeLine: 600, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 40, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 602, type: !567, isLocal: false, isDefinition: false, scopeLine: 602, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 604, type: !590, isLocal: false, isDefinition: false, scopeLine: 604, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 42, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 609, type: !579, isLocal: false, isDefinition: false, scopeLine: 609, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 611, type: !582, isLocal: false, isDefinition: false, scopeLine: 611, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeENS_8SPxRowIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 613, type: !598, isLocal: false, isDefinition: false, scopeLine: 613, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !459, !"_ZTSN6soplex8SPxRowIdE", !235, !235}
!600 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowEiRKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 619, type: !601, isLocal: false, isDefinition: false, scopeLine: 619, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !459, !126, !603}
!603 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPRowE")
!605 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowENS_8SPxRowIdERKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 621, type: !606, isLocal: false, isDefinition: false, scopeLine: 621, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !459, !"_ZTSN6soplex8SPxRowIdE", !603}
!608 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColEiRKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 626, type: !609, isLocal: false, isDefinition: false, scopeLine: 626, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !459, !126, !611}
!611 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!613 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColENS_8SPxColIdERKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 628, type: !614, isLocal: false, isDefinition: false, scopeLine: 628, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !459, !"_ZTSN6soplex8SPxColIdE", !611}
!616 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementEiid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 633, type: !617, isLocal: false, isDefinition: false, scopeLine: 633, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !459, !126, !126, !235}
!619 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementENS_8SPxRowIdENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 635, type: !620, isLocal: false, isDefinition: false, scopeLine: 635, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !459, !"_ZTSN6soplex8SPxRowIdE", !"_ZTSN6soplex8SPxColIdE", !235}
!622 = !DISubprogram(name: "changeSense", linkageName: "_ZN6soplex6SoPlex11changeSenseENS_5SPxLP8SPxSenseE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 641, type: !623, isLocal: false, isDefinition: false, scopeLine: 641, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !459, !"_ZTSN6soplex5SPxLP8SPxSenseE"}
!625 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6SoPlex3dimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 645, type: !443, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!626 = !DISubprogram(name: "coDim", linkageName: "_ZNK6soplex6SoPlex5coDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 650, type: !443, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubprogram(name: "id", linkageName: "_ZNK6soplex6SoPlex2idEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 666, type: !628, isLocal: false, isDefinition: false, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!628 = !DISubroutineType(types: !629)
!629 = !{!"_ZTSN6soplex5SPxIdE", !445, !126}
!630 = !DISubprogram(name: "coId", linkageName: "_ZNK6soplex6SoPlex4coIdEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 685, type: !628, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!631 = !DISubprogram(name: "isId", linkageName: "_ZNK6soplex6SoPlex4isIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 703, type: !632, isLocal: false, isDefinition: false, scopeLine: 703, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{!126, !445, !"_ZTSN6soplex5SPxIdE"}
!634 = !DISubprogram(name: "isCoId", linkageName: "_ZNK6soplex6SoPlex6isCoIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 712, type: !632, isLocal: false, isDefinition: false, scopeLine: 712, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 724, type: !636, isLocal: false, isDefinition: false, scopeLine: 724, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!636 = !DISubroutineType(types: !637)
!637 = !{!638, !445, !126}
!638 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!640 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 730, type: !641, isLocal: false, isDefinition: false, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!641 = !DISubroutineType(types: !642)
!642 = !{!638, !445, !643}
!643 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!645 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 738, type: !646, isLocal: false, isDefinition: false, scopeLine: 738, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{!638, !445, !648}
!648 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!650 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 755, type: !651, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!651 = !DISubroutineType(types: !652)
!652 = !{!638, !445, !653}
!653 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!655 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 768, type: !636, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!656 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 773, type: !641, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!657 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 781, type: !646, isLocal: false, isDefinition: false, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!658 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 795, type: !651, isLocal: false, isDefinition: false, scopeLine: 795, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubprogram(name: "unitVector", linkageName: "_ZNK6soplex6SoPlex10unitVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 803, type: !636, isLocal: false, isDefinition: false, scopeLine: 803, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!660 = !DISubprogram(name: "varStatus", linkageName: "_ZNK6soplex6SoPlex9varStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 816, type: !661, isLocal: false, isDefinition: false, scopeLine: 816, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubroutineType(types: !662)
!662 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !445, !126}
!663 = !DISubprogram(name: "covarStatus", linkageName: "_ZNK6soplex6SoPlex11covarStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 822, type: !661, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 828, type: !665, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!665 = !DISubroutineType(types: !666)
!666 = !{!126, !445, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!667 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 834, type: !632, isLocal: false, isDefinition: false, scopeLine: 834, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 843, type: !669, isLocal: false, isDefinition: false, scopeLine: 843, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!669 = !DISubroutineType(types: !670)
!670 = !{!126, !445, !"_ZTSN6soplex8SPxRowIdE"}
!671 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 849, type: !672, isLocal: false, isDefinition: false, scopeLine: 849, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{!126, !445, !"_ZTSN6soplex8SPxColIdE"}
!674 = !DISubprogram(name: "isRowBasic", linkageName: "_ZNK6soplex6SoPlex10isRowBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 855, type: !675, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubroutineType(types: !676)
!676 = !{!126, !445, !126}
!677 = !DISubprogram(name: "isColBasic", linkageName: "_ZNK6soplex6SoPlex10isColBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 861, type: !675, isLocal: false, isDefinition: false, scopeLine: 861, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 867, type: !675, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubprogram(name: "isCoBasic", linkageName: "_ZNK6soplex6SoPlex9isCoBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 873, type: !675, isLocal: false, isDefinition: false, scopeLine: 873, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!680 = !DISubprogram(name: "fVec", linkageName: "_ZNK6soplex6SoPlex4fVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 888, type: !681, isLocal: false, isDefinition: false, scopeLine: 888, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!681 = !DISubroutineType(types: !682)
!682 = !{!683, !445}
!683 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!684 = !DISubprogram(name: "fRhs", linkageName: "_ZNK6soplex6SoPlex4fRhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 901, type: !685, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{!564, !445}
!687 = !DISubprogram(name: "ubBound", linkageName: "_ZNK6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 906, type: !685, isLocal: false, isDefinition: false, scopeLine: 906, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!688 = !DISubprogram(name: "ubBound", linkageName: "_ZN6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 919, type: !689, isLocal: false, isDefinition: false, scopeLine: 919, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubroutineType(types: !690)
!690 = !{!533, !459}
!691 = !DISubprogram(name: "lbBound", linkageName: "_ZNK6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 924, type: !685, isLocal: false, isDefinition: false, scopeLine: 924, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubprogram(name: "lbBound", linkageName: "_ZN6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 937, type: !689, isLocal: false, isDefinition: false, scopeLine: 937, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubprogram(name: "fTest", linkageName: "_ZNK6soplex6SoPlex5fTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 950, type: !685, isLocal: false, isDefinition: false, scopeLine: 950, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!694 = !DISubprogram(name: "coPvec", linkageName: "_ZNK6soplex6SoPlex6coPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 963, type: !681, isLocal: false, isDefinition: false, scopeLine: 963, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubprogram(name: "coPrhs", linkageName: "_ZNK6soplex6SoPlex6coPrhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 976, type: !685, isLocal: false, isDefinition: false, scopeLine: 976, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "ucBound", linkageName: "_ZNK6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 982, type: !685, isLocal: false, isDefinition: false, scopeLine: 982, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!697 = !DISubprogram(name: "ucBound", linkageName: "_ZN6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 996, type: !689, isLocal: false, isDefinition: false, scopeLine: 996, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!698 = !DISubprogram(name: "lcBound", linkageName: "_ZNK6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1003, type: !685, isLocal: false, isDefinition: false, scopeLine: 1003, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!699 = !DISubprogram(name: "lcBound", linkageName: "_ZN6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1017, type: !689, isLocal: false, isDefinition: false, scopeLine: 1017, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1030, type: !685, isLocal: false, isDefinition: false, scopeLine: 1030, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!701 = !DISubprogram(name: "pVec", linkageName: "_ZNK6soplex6SoPlex4pVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1043, type: !681, isLocal: false, isDefinition: false, scopeLine: 1043, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!702 = !DISubprogram(name: "upBound", linkageName: "_ZNK6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1048, type: !685, isLocal: false, isDefinition: false, scopeLine: 1048, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!703 = !DISubprogram(name: "upBound", linkageName: "_ZN6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1062, type: !689, isLocal: false, isDefinition: false, scopeLine: 1062, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubprogram(name: "lpBound", linkageName: "_ZNK6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1069, type: !685, isLocal: false, isDefinition: false, scopeLine: 1069, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubprogram(name: "lpBound", linkageName: "_ZN6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1083, type: !689, isLocal: false, isDefinition: false, scopeLine: 1083, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!706 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1096, type: !685, isLocal: false, isDefinition: false, scopeLine: 1096, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
