; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxscaler.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.soplex::SPxScaler" = type <{ i32 (...)**, i8*, %"class.soplex::SPxLP"*, %"class.soplex::DataArray.0", %"class.soplex::DataArray.0", i8, i8, [6 x i8] }>
%"class.soplex::SPxLP" = type <{ i32 (...)**, %"class.soplex::LPRowSet", %"class.soplex::LPColSet", i32, [4 x i8] }>
%"class.soplex::LPRowSet" = type { %"class.soplex::SVSet", %"class.soplex::DVector", %"class.soplex::DVector" }
%"class.soplex::SVSet" = type { %"class.soplex::DataArray", %"class.soplex::DataSet", %"class.soplex::IdList", double, double* }
%"class.soplex::DataArray" = type { i32, i32, %"struct.soplex::SVector::Element"*, double }
%"struct.soplex::SVector::Element" = type { double, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !42, subprograms: !3956, globals: !1031, imports: !4508)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxscaler.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14, !14, !21, !26, !32, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !"_ZTSN6soplex5LPRowE", file: !15, line: 73, size: 32, align: 32, elements: !16, identifier: "_ZTSN6soplex5LPRow4TypeE")
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/lprow.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "LESS_EQUAL", value: 0)
!18 = !DIEnumerator(name: "EQUAL", value: 1)
!19 = !DIEnumerator(name: "GREATER_EQUAL", value: 2)
!20 = !DIEnumerator(name: "RANGE", value: 3)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SPxSense", scope: !"_ZTSN6soplex5SPxLPE", file: !22, line: 91, size: 32, align: 32, elements: !23, identifier: "_ZTSN6soplex5SPxLP8SPxSenseE")
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxlp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !{!24, !25}
!24 = !DIEnumerator(name: "MAXIMIZE", value: 1)
!25 = !DIEnumerator(name: "MINIMIZE", value: -1)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !"_ZTSN6soplex5SPxIdE", file: !27, line: 92, size: 32, align: 32, elements: !28, identifier: "_ZTSN6soplex5SPxId4TypeE")
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "ROW_ID", value: -1)
!30 = !DIEnumerator(name: "INVALID", value: 0)
!31 = !DIEnumerator(name: "COL_ID", value: 1)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !33, line: 87, size: 32, align: 32, elements: !34, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!33 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "FREE", value: 0)
!36 = !DIEnumerator(name: "RELEASED", value: 1)
!37 = !DIEnumerator(name: "USED", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1280, size: 32, align: 32, elements: !40, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!39 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !{!41}
!41 = !DIEnumerator(name: "__short_mask", value: 1)
!42 = !{!43, !100, !104, !105, !112, !119, !134, !139, !143, !147, !285, !336, !412, !3, !563, !638, !639, !995, !1030, !1034, !1044, !1099, !1102, !1107, !1112, !1116, !1159, !1163, !1165, !1175, !1180, !1181, !1184, !1187, !1200, !1211, !1218, !1222, !1226, !1263, !1266, !1268, !1269, !1270, !1271, !1273, !1284, !1313, !1334, !1351, !1457, !9, !1458, !1517, !1821, !1958, !2085, !2166, !2255, !2259, !2334, !2456, !2506, !2551, !2667, !2694, !2698, !2725, !2767, !2824, !2869, !14, !2919, !3047, !21, !3084, !3097, !26, !3137, !3150, !3288, !3377, !3488, !3492, !3553, !3571, !3651, !3659, !3691, !32, !50, !3770, !3794, !3825, !3831, !3832, !3849, !202, !38, !3852, !3862, !3866, !83, !163, !322, !3867, !3938, !3696, !67}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !44, line: 122, size: 1216, align: 64, elements: !45, identifier: "_ZTS7__sFILE")
!44 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!45 = !{!46, !49, !51, !52, !54, !55, !56, !57, !59, !63, !69, !79, !85, !86, !88, !89, !93, !97, !98, !99}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !44, line: 123, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !44, line: 124, baseType: !50, size: 32, align: 32, offset: 64)
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !44, line: 125, baseType: !50, size: 32, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !44, line: 126, baseType: !53, size: 16, align: 16, offset: 128)
!53 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !44, line: 127, baseType: !53, size: 16, align: 16, offset: 144)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !44, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !44, line: 129, baseType: !50, size: 32, align: 32, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !44, line: 132, baseType: !58, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !44, line: 133, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!50, !58}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !44, line: 134, baseType: !64, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!50, !58, !67, !50}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !44, line: 135, baseType: !70, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !58, !73, !50}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !44, line: 77, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !75, line: 71, baseType: !76)
!75 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !77, line: 46, baseType: !78)
!77 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !44, line: 136, baseType: !80, size: 64, align: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!50, !58, !83, !50}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !44, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !44, line: 140, baseType: !87, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !44, line: 141, baseType: !50, size: 32, align: 32, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !44, line: 144, baseType: !90, size: 24, align: 8, offset: 928)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 24, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 3)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !44, line: 145, baseType: !94, size: 8, align: 8, offset: 952)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !44, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !44, line: 151, baseType: !50, size: 32, align: 32, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !44, line: 152, baseType: !73, size: 64, align: 64, offset: 1152)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !44, line: 88, size: 128, align: 64, elements: !101, identifier: "_ZTS6__sbuf")
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !44, line: 89, baseType: !47, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !44, line: 90, baseType: !50, size: 32, align: 32, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !44, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !106, identifier: "_ZTS13__va_list_tag")
!106 = !{!107, !109, !110, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !108, size: 32, align: 32)
!108 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !108, size: 32, align: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !58, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !58, size: 64, align: 64, offset: 128)
!112 = !DICompositeType(tag: DW_TAG_union_type, file: !77, line: 76, size: 1024, align: 64, elements: !113, identifier: "_ZTS11__mbstate_t")
!113 = !{!114, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !77, line: 77, baseType: !115, size: 1024, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1024, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !77, line: 78, baseType: !78, size: 64, align: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !120, line: 73, size: 448, align: 64, elements: !121, identifier: "_ZTS2tm")
!120 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !133}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !120, line: 74, baseType: !50, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !120, line: 75, baseType: !50, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !120, line: 76, baseType: !50, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !120, line: 77, baseType: !50, size: 32, align: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !120, line: 78, baseType: !50, size: 32, align: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !120, line: 79, baseType: !50, size: 32, align: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !120, line: 80, baseType: !50, size: 32, align: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !120, line: 81, baseType: !50, size: 32, align: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !120, line: 82, baseType: !50, size: 32, align: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !120, line: 83, baseType: !132, size: 64, align: 64, offset: 320)
!132 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !120, line: 84, baseType: !67, size: 64, align: 64, offset: 384)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 82, size: 64, align: 32, elements: !136, identifier: "_ZTS5div_t")
!135 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !135, line: 83, baseType: !50, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !135, line: 84, baseType: !50, size: 32, align: 32, offset: 32)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 87, size: 128, align: 64, elements: !140, identifier: "_ZTS6ldiv_t")
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !135, line: 88, baseType: !132, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !135, line: 89, baseType: !132, size: 64, align: 64, offset: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 93, size: 128, align: 64, elements: !144, identifier: "_ZTS7lldiv_t")
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !135, line: 94, baseType: !78, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !135, line: 95, baseType: !78, size: 64, align: 64, offset: 64)
!147 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ostream<char, std::__1::char_traits<char> >", scope: !149, file: !148, line: 1108, size: 1280, align: 64, elements: !152, vtableHolder: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", templateParams: !282, identifier: "_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!148 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ostream", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!149 = !DINamespace(name: "__1", scope: !151, file: !150, line: 369)
!150 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!151 = !DINamespace(name: "std", scope: null, file: !150, line: 368)
!152 = !{!153, !154, !159, !164, !167, !171, !176, !179, !185, !192, !199, !203, !206, !210, !213, !216, !219, !223, !226, !230, !234, !238, !242, !247, !250, !254, !262, !265, !272, !275, !281}
!153 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", offset: 24, flags: DIFlagPublic | DIFlagVirtual)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$basic_ostream", scope: !148, file: !148, baseType: !155, size: 64, flags: DIFlagArtificial)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!50}
!159 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 163, type: !160, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !162, !163}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__115basic_streambufIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!164 = !DISubprogram(name: "~basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 164, type: !165, isLocal: false, isDefinition: false, scopeLine: 164, containingType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !162}
!167 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 176, type: !168, isLocal: false, isDefinition: false, scopeLine: 176, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !162, !170}
!170 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!171 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 182, type: !172, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !162, !174}
!174 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!176 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEEaSERKS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 183, type: !177, isLocal: false, isDefinition: false, scopeLine: 183, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{!170, !162, !174}
!179 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRS3_S4_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 191, type: !180, isLocal: false, isDefinition: false, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubroutineType(types: !181)
!181 = !{!170, !162, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!170, !170}
!185 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_9basic_iosIcS2_EES6_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 192, type: !186, isLocal: false, isDefinition: false, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!170, !162, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !191}
!191 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!192 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_8ios_baseES5_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 194, type: !193, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!193 = !DISubroutineType(types: !194)
!194 = !{!170, !162, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !198}
!198 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__18ios_baseE")
!199 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEb", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 195, type: !200, isLocal: false, isDefinition: false, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{!170, !162, !202}
!202 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!203 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEs", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 196, type: !204, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!204 = !DISubroutineType(types: !205)
!205 = !{!170, !162, !53}
!206 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEt", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 197, type: !207, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{!170, !162, !209}
!209 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!210 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEi", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 198, type: !211, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubroutineType(types: !212)
!212 = !{!170, !162, !50}
!213 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEj", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 199, type: !214, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubroutineType(types: !215)
!215 = !{!170, !162, !108}
!216 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 200, type: !217, isLocal: false, isDefinition: false, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!217 = !DISubroutineType(types: !218)
!218 = !{!170, !162, !132}
!219 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEm", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 201, type: !220, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!220 = !DISubroutineType(types: !221)
!221 = !{!170, !162, !222}
!222 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!223 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEx", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 202, type: !224, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubroutineType(types: !225)
!225 = !{!170, !162, !78}
!226 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEy", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 203, type: !227, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!227 = !DISubroutineType(types: !228)
!228 = !{!170, !162, !229}
!229 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!230 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEf", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 204, type: !231, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{!170, !162, !233}
!233 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!234 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEd", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 205, type: !235, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{!170, !162, !237}
!237 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!238 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEe", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 206, type: !239, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubroutineType(types: !240)
!240 = !{!170, !162, !241}
!241 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!242 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPKv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 207, type: !243, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubroutineType(types: !244)
!244 = !{!170, !162, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!247 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 208, type: !248, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!170, !162, !163}
!250 = !DISubprogram(name: "put", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE3putEc", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 211, type: !251, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!170, !162, !253}
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 156, baseType: !68)
!254 = !DISubprogram(name: "write", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5writeEPKcl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 212, type: !255, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{!170, !162, !257, !259}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !149, file: !4, line: 229, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !261, line: 51, baseType: !132)
!261 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!262 = !DISubprogram(name: "flush", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5flushEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 213, type: !263, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!170, !162}
!265 = !DISubprogram(name: "tellp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5tellpEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 216, type: !266, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !162}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 159, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 628, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "streampos", scope: !149, file: !271, line: 176, baseType: !"_ZTSNSt3__14fposI11__mbstate_tEE")
!271 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!272 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpENS_4fposI11__mbstate_tEE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 217, type: !273, isLocal: false, isDefinition: false, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!273 = !DISubroutineType(types: !274)
!274 = !{!170, !162, !268}
!275 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpExNS_8ios_base7seekdirE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 218, type: !276, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!276 = !DISubroutineType(types: !277)
!277 = !{!170, !162, !278, !"_ZTSNSt3__18ios_base7seekdirE"}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 160, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 627, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamoff", scope: !149, file: !271, line: 187, baseType: !78)
!281 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !148, line: 222, type: !165, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!282 = !{!283, !284}
!283 = !DITemplateTypeParameter(name: "_CharT", type: !68)
!284 = !DITemplateTypeParameter(name: "_Traits", type: !"_ZTSNSt3__111char_traitsIcEE")
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !149, file: !39, line: 623, size: 8, align: 8, elements: !286, templateParams: !335, identifier: "_ZTSNSt3__111char_traitsIcEE")
!286 = !{!287, !294, !297, !298, !305, !308, !311, !315, !316, !319, !323, !326, !329, !332}
!287 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignERcRKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 631, type: !288, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !290, !292}
!290 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 625, baseType: !68)
!292 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!294 = !DISubprogram(name: "eq", linkageName: "_ZNSt3__111char_traitsIcE2eqEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 633, type: !295, isLocal: false, isDefinition: false, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!202, !291, !291}
!297 = !DISubprogram(name: "lt", linkageName: "_ZNSt3__111char_traitsIcE2ltEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 635, type: !295, isLocal: false, isDefinition: false, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DISubprogram(name: "compare", linkageName: "_ZNSt3__111char_traitsIcE7compareEPKcS3_m", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 638, type: !299, isLocal: false, isDefinition: false, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true)
!299 = !DISubroutineType(types: !300)
!300 = !{!50, !301, !301, !302}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !303, line: 30, baseType: !304)
!303 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !77, line: 92, baseType: !222)
!305 = !DISubprogram(name: "length", linkageName: "_ZNSt3__111char_traitsIcE6lengthEPKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 640, type: !306, isLocal: false, isDefinition: false, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{!302, !301}
!308 = !DISubprogram(name: "find", linkageName: "_ZNSt3__111char_traitsIcE4findEPKcmRS2_", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 641, type: !309, isLocal: false, isDefinition: false, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{!301, !301, !302, !292}
!311 = !DISubprogram(name: "move", linkageName: "_ZNSt3__111char_traitsIcE4moveEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 643, type: !312, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{!314, !314, !301, !302}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!315 = !DISubprogram(name: "copy", linkageName: "_ZNSt3__111char_traitsIcE4copyEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 645, type: !312, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true)
!316 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignEPcmc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 650, type: !317, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!314, !314, !302, !291}
!319 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt3__111char_traitsIcE7not_eofEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 653, type: !320, isLocal: false, isDefinition: false, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !322}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 626, baseType: !50)
!323 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt3__111char_traitsIcE12to_char_typeEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 655, type: !324, isLocal: false, isDefinition: false, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{!291, !322}
!326 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt3__111char_traitsIcE11to_int_typeEc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 657, type: !327, isLocal: false, isDefinition: false, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{!322, !291}
!329 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt3__111char_traitsIcE11eq_int_typeEii", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 659, type: !330, isLocal: false, isDefinition: false, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true)
!330 = !DISubroutineType(types: !331)
!331 = !{!202, !322, !322}
!332 = !DISubprogram(name: "eof", linkageName: "_ZNSt3__111char_traitsIcE3eofEv", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !39, line: 661, type: !333, isLocal: false, isDefinition: false, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: true)
!333 = !DISubroutineType(types: !334)
!334 = !{!322}
!335 = !{!283}
!336 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ios<char, std::__1::char_traits<char> >", scope: !149, file: !337, line: 570, size: 1216, align: 64, elements: !338, vtableHolder: !"_ZTSNSt3__18ios_baseE", templateParams: !282, identifier: "_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!337 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/streambuf", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!338 = !{!339, !340, !342, !344, !349, !350, !354, !358, !359, !360, !361, !362, !363, !364, !365, !368, !371, !374, !377, !380, !383, !387, !391, !394, !399, !402, !405, !406, !407, !410, !411}
!339 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__18ios_baseE", flags: DIFlagPublic)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__tie_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 647, baseType: !341, size: 64, align: 64, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__fill_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 648, baseType: !343, size: 32, align: 32, offset: 1152)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 579, baseType: !322)
!344 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEcvbEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 585, type: !345, isLocal: false, isDefinition: false, scopeLine: 585, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{!202, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!349 = !DISubprogram(name: "operator!", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEntEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 586, type: !345, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE7rdstateEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 587, type: !351, isLocal: false, isDefinition: false, scopeLine: 587, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !347}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "iostate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 256, baseType: !108)
!354 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5clearEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 588, type: !355, isLocal: false, isDefinition: false, scopeLine: 588, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357, !353}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!358 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE8setstateEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 589, type: !355, isLocal: false, isDefinition: false, scopeLine: 589, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4goodEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 590, type: !345, isLocal: false, isDefinition: false, scopeLine: 590, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3eofEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 591, type: !345, isLocal: false, isDefinition: false, scopeLine: 591, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!361 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4failEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 592, type: !345, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!362 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3badEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 593, type: !345, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 595, type: !351, isLocal: false, isDefinition: false, scopeLine: 595, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 596, type: !355, isLocal: false, isDefinition: false, scopeLine: 596, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 600, type: !366, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !357, !163}
!368 = !DISubprogram(name: "~basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 601, type: !369, isLocal: false, isDefinition: false, scopeLine: 601, containingType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !357}
!371 = !DISubprogram(name: "tie", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 605, type: !372, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!341, !347}
!374 = !DISubprogram(name: "tie", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEPNS_13basic_ostreamIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 607, type: !375, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!375 = !DISubroutineType(types: !376)
!376 = !{!341, !357, !341}
!377 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 610, type: !378, isLocal: false, isDefinition: false, scopeLine: 610, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!378 = !DISubroutineType(types: !379)
!379 = !{!163, !347}
!380 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 612, type: !381, isLocal: false, isDefinition: false, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!163, !357, !163}
!383 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE7copyfmtERKS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 614, type: !384, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{!191, !357, !386}
!386 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !348)
!387 = !DISubprogram(name: "fill", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 617, type: !388, isLocal: false, isDefinition: false, scopeLine: 617, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !347}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 576, baseType: !68)
!391 = !DISubprogram(name: "fill", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 619, type: !392, isLocal: false, isDefinition: false, scopeLine: 619, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!392 = !DISubroutineType(types: !393)
!393 = !{!390, !357, !390}
!394 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5imbueERKNS_6localeE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 622, type: !395, isLocal: false, isDefinition: false, scopeLine: 622, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!395 = !DISubroutineType(types: !396)
!396 = !{!"_ZTSNSt3__16localeE", !357, !397}
!397 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16localeE")
!399 = !DISubprogram(name: "narrow", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE6narrowEcc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 625, type: !400, isLocal: false, isDefinition: false, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!400 = !DISubroutineType(types: !401)
!401 = !{!68, !347, !390, !68}
!402 = !DISubprogram(name: "widen", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5widenEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 627, type: !403, isLocal: false, isDefinition: false, scopeLine: 627, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{!390, !347, !68}
!405 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 631, type: !369, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!406 = !DISubprogram(name: "init", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4initEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 634, type: !366, isLocal: false, isDefinition: false, scopeLine: 634, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!407 = !DISubprogram(name: "move", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4moveERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 637, type: !408, isLocal: false, isDefinition: false, scopeLine: 637, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !357, !191}
!410 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 643, type: !408, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!411 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE9set_rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 645, type: !366, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!412 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !149, file: !4, line: 231, size: 1088, align: 64, elements: !413, vtableHolder: !"_ZTSNSt3__18ios_baseE", identifier: "_ZTSNSt3__18ios_baseE")
!413 = !{!414, !415, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438, !439, !440, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !461, !463, !464, !465, !466, !468, !469, !470, !472, !473, !474, !479, !483, !484, !487, !490, !493, !496, !497, !498, !501, !504, !505, !509, !513, !516, !519, !523, !526, !529, !532, !535, !536, !539, !540, !541, !542, !543, !544, !545, !546, !547, !550, !553, !554, !557, !558, !561, !562}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ios_base", scope: !4, file: !4, baseType: !155, size: 64, flags: DIFlagArtificial)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "boolalpha", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 237, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmtflags", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 236, baseType: !108)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 238, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 239, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hex", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 240, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 241, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 242, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "oct", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 243, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 244, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scientific", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 245, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "showbase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 246, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "showpoint", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 247, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "showpos", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 248, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "skipws", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 249, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4096)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "unitbuf", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 250, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "uppercase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 251, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "adjustfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 252, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 176)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "basefield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 253, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 74)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "floatfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 254, baseType: !416, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 260)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "badbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 258, baseType: !436, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "eofbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 259, baseType: !436, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "failbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 260, baseType: !436, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "goodbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 261, baseType: !436, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 265, baseType: !441, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "openmode", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 263, baseType: !108)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 266, baseType: !441, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 267, baseType: !441, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 268, baseType: !441, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 269, baseType: !441, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "trunc", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 270, baseType: !441, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__fmtflags_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 359, baseType: !417, size: 32, align: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__precision_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 360, baseType: !259, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__width_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 361, baseType: !259, size: 64, align: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__rdstate_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 362, baseType: !353, size: 32, align: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__exceptions_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 363, baseType: !353, size: 32, align: 32, offset: 288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__rdbuf_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 364, baseType: !58, size: 64, align: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__loc_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 365, baseType: !58, size: 64, align: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__fn_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 366, baseType: !456, size: 64, align: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_callback", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 306, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !"_ZTSNSt3__18ios_base5eventE", !198, !50}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__index_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 367, baseType: !462, size: 64, align: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__event_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 368, baseType: !302, size: 64, align: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__event_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 369, baseType: !302, size: 64, align: 64, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__xindex_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 373, baseType: !50, flags: DIFlagStaticMember)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 375, baseType: !467, size: 64, align: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 376, baseType: !302, size: 64, align: 64, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 377, baseType: !302, size: 64, align: 64, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 378, baseType: !471, size: 64, align: 64, offset: 896)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 379, baseType: !302, size: 64, align: 64, offset: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 380, baseType: !302, size: 64, align: 64, offset: 1024)
!474 = !DISubprogram(name: "flags", linkageName: "_ZNKSt3__18ios_base5flagsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 281, type: !475, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!417, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__18ios_baseE")
!479 = !DISubprogram(name: "flags", linkageName: "_ZNSt3__18ios_base5flagsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 282, type: !480, isLocal: false, isDefinition: false, scopeLine: 282, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubroutineType(types: !481)
!481 = !{!417, !482, !417}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__18ios_baseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!483 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 283, type: !480, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!484 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEjj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 284, type: !485, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{!417, !482, !417, !417}
!487 = !DISubprogram(name: "unsetf", linkageName: "_ZNSt3__18ios_base6unsetfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 285, type: !488, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !482, !417}
!490 = !DISubprogram(name: "precision", linkageName: "_ZNKSt3__18ios_base9precisionEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 287, type: !491, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{!259, !477}
!493 = !DISubprogram(name: "precision", linkageName: "_ZNSt3__18ios_base9precisionEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 288, type: !494, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{!259, !482, !259}
!496 = !DISubprogram(name: "width", linkageName: "_ZNKSt3__18ios_base5widthEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 289, type: !491, isLocal: false, isDefinition: false, scopeLine: 289, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!497 = !DISubprogram(name: "width", linkageName: "_ZNSt3__18ios_base5widthEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 290, type: !494, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__18ios_base5imbueERKNS_6localeE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 293, type: !499, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{!"_ZTSNSt3__16localeE", !482, !397}
!501 = !DISubprogram(name: "getloc", linkageName: "_ZNKSt3__18ios_base6getlocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 294, type: !502, isLocal: false, isDefinition: false, scopeLine: 294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{!"_ZTSNSt3__16localeE", !477}
!504 = !DISubprogram(name: "xalloc", linkageName: "_ZNSt3__18ios_base6xallocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 297, type: !157, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!505 = !DISubprogram(name: "iword", linkageName: "_ZNSt3__18ios_base5iwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 298, type: !506, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{!508, !482, !50}
!508 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !132)
!509 = !DISubprogram(name: "pword", linkageName: "_ZNSt3__18ios_base5pwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 299, type: !510, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{!512, !482, !50}
!512 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !58)
!513 = !DISubprogram(name: "~ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 302, type: !514, isLocal: false, isDefinition: false, scopeLine: 302, containingType: !"_ZTSNSt3__18ios_baseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !482}
!516 = !DISubprogram(name: "register_callback", linkageName: "_ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 307, type: !517, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !482, !457, !50}
!519 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 310, type: !520, isLocal: false, isDefinition: false, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !482, !522}
!522 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !478)
!523 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__18ios_baseaSERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 311, type: !524, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true)
!524 = !DISubroutineType(types: !525)
!525 = !{!198, !482, !522}
!526 = !DISubprogram(name: "sync_with_stdio", linkageName: "_ZNSt3__18ios_base15sync_with_stdioEb", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 314, type: !527, isLocal: false, isDefinition: false, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{!202, !202}
!529 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__18ios_base7rdstateEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 316, type: !530, isLocal: false, isDefinition: false, scopeLine: 316, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{!353, !477}
!532 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__18ios_base5clearEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 317, type: !533, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !482, !353}
!535 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__18ios_base8setstateEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 318, type: !533, isLocal: false, isDefinition: false, scopeLine: 318, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__18ios_base4goodEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 320, type: !537, isLocal: false, isDefinition: false, scopeLine: 320, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubroutineType(types: !538)
!538 = !{!202, !477}
!539 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__18ios_base3eofEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 321, type: !537, isLocal: false, isDefinition: false, scopeLine: 321, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__18ios_base4failEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 322, type: !537, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!541 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__18ios_base3badEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 323, type: !537, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__18ios_base10exceptionsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 325, type: !530, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__18ios_base10exceptionsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 326, type: !533, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!544 = !DISubprogram(name: "__set_badbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 328, type: !514, isLocal: false, isDefinition: false, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!545 = !DISubprogram(name: "__set_failbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 329, type: !514, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 333, type: !514, isLocal: false, isDefinition: false, scopeLine: 333, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!547 = !DISubprogram(name: "init", linkageName: "_ZNSt3__18ios_base4initEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 336, type: !548, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !482, !58}
!550 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__18ios_base5rdbufEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 337, type: !551, isLocal: false, isDefinition: false, scopeLine: 337, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{!58, !477}
!553 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__18ios_base5rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 340, type: !548, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!554 = !DISubprogram(name: "__call_callbacks", linkageName: "_ZNSt3__18ios_base16__call_callbacksENS0_5eventE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 346, type: !555, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !482, !"_ZTSNSt3__18ios_base5eventE"}
!557 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__18ios_base7copyfmtERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 347, type: !520, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!558 = !DISubprogram(name: "move", linkageName: "_ZNSt3__18ios_base4moveERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 348, type: !559, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !482, !198}
!561 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__18ios_base4swapERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 349, type: !559, isLocal: false, isDefinition: false, scopeLine: 349, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!562 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__18ios_base9set_rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 352, type: !548, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!563 = !DICompositeType(tag: DW_TAG_class_type, name: "locale", scope: !149, file: !564, line: 60, size: 64, align: 64, elements: !565, identifier: "_ZTSNSt3__16localeE")
!564 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__locale", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!565 = !{!566, !569, !570, !571, !572, !573, !574, !575, !576, !578, !582, !585, !588, !594, !597, !600, !603, !604, !607, !611, !614, !615, !618, !621, !625, !629, !633}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "none", scope: !"_ZTSNSt3__16localeE", file: !564, line: 69, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "category", scope: !"_ZTSNSt3__16localeE", file: !564, line: 67, baseType: !50)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !"_ZTSNSt3__16localeE", file: !564, line: 70, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !"_ZTSNSt3__16localeE", file: !564, line: 71, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "monetary", scope: !"_ZTSNSt3__16localeE", file: !564, line: 72, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !"_ZTSNSt3__16localeE", file: !564, line: 73, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !"_ZTSNSt3__16localeE", file: !564, line: 74, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "messages", scope: !"_ZTSNSt3__16localeE", file: !564, line: 75, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !"_ZTSNSt3__16localeE", file: !564, line: 76, baseType: !567, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 63)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__locale_", scope: !"_ZTSNSt3__16localeE", file: !564, line: 109, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5__impE", size: 64, align: 64)
!578 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 79, type: !579, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16localeE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!582 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 80, type: !583, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !581, !397}
!585 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 81, type: !586, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !581, !83}
!588 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 82, type: !589, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !581, !591}
!591 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !149, file: !271, line: 194, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!594 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 83, type: !595, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !581, !397, !83, !568}
!597 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 84, type: !598, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !581, !397, !591, !568}
!600 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 87, type: !601, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !581, !397, !397, !568}
!603 = !DISubprogram(name: "~locale", scope: !"_ZTSNSt3__16localeE", file: !564, line: 89, type: !579, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__16localeaSERKS0_", scope: !"_ZTSNSt3__16localeE", file: !564, line: 91, type: !605, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubroutineType(types: !606)
!606 = !{!397, !581, !397}
!607 = !DISubprogram(name: "name", linkageName: "_ZNKSt3__16locale4nameEv", scope: !"_ZTSNSt3__16localeE", file: !564, line: 96, type: !608, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!608 = !DISubroutineType(types: !609)
!609 = !{!593, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!611 = !DISubprogram(name: "operator==", linkageName: "_ZNKSt3__16localeeqERKS0_", scope: !"_ZTSNSt3__16localeE", file: !564, line: 97, type: !612, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{!202, !610, !397}
!614 = !DISubprogram(name: "operator!=", linkageName: "_ZNKSt3__16localeneERKS0_", scope: !"_ZTSNSt3__16localeE", file: !564, line: 98, type: !612, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "global", linkageName: "_ZNSt3__16locale6globalERKS0_", scope: !"_ZTSNSt3__16localeE", file: !564, line: 104, type: !616, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubroutineType(types: !617)
!617 = !{!"_ZTSNSt3__16localeE", !397}
!618 = !DISubprogram(name: "classic", linkageName: "_ZNSt3__16locale7classicEv", scope: !"_ZTSNSt3__16localeE", file: !564, line: 105, type: !619, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!619 = !DISubroutineType(types: !620)
!620 = !{!397}
!621 = !DISubprogram(name: "__install_ctor", linkageName: "_ZNSt3__16locale14__install_ctorERKS0_PNS0_5facetEl", scope: !"_ZTSNSt3__16localeE", file: !564, line: 111, type: !622, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !581, !397, !624, !132}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5facetE", size: 64, align: 64)
!625 = !DISubprogram(name: "__global", linkageName: "_ZNSt3__16locale8__globalEv", scope: !"_ZTSNSt3__16localeE", file: !564, line: 112, type: !626, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16localeE")
!629 = !DISubprogram(name: "has_facet", linkageName: "_ZNKSt3__16locale9has_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !564, line: 113, type: !630, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true)
!630 = !DISubroutineType(types: !631)
!631 = !{!202, !610, !632}
!632 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16locale2idE")
!633 = !DISubprogram(name: "use_facet", linkageName: "_ZNKSt3__16locale9use_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !564, line: 114, type: !634, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true)
!634 = !DISubroutineType(types: !635)
!635 = !{!636, !610, !632}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16locale5facetE")
!638 = !DICompositeType(tag: DW_TAG_class_type, name: "__imp", scope: !"_ZTSNSt3__16localeE", file: !564, line: 108, flags: DIFlagFwdDecl, identifier: "_ZTSNSt3__16locale5__impE")
!639 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >", scope: !149, file: !39, line: 4243, size: 192, align: 64, elements: !640, templateParams: !993, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!640 = !{!641, !642, !643, !650, !654, !660, !665, !668, !674, !677, !680, !683, !686, !689, !692, !693, !697, !700, !703, !707, !712, !713, !714, !718, !722, !723, !724, !725, !726, !727, !728, !731, !732, !733, !734, !735, !738, !739, !740, !741, !744, !749, !754, !755, !756, !757, !758, !759, !760, !763, !766, !767, !770, !773, !774, !777, !780, !781, !782, !783, !784, !785, !786, !787, !790, !793, !796, !799, !802, !805, !808, !811, !814, !817, !820, !823, !826, !829, !832, !835, !838, !841, !844, !848, !851, !854, !857, !858, !861, !864, !867, !870, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !896, !899, !902, !905, !908, !911, !912, !913, !917, !920, !921, !922, !923, !924, !925, !926, !927, !935, !938, !945, !946, !947, !948, !949, !950, !953, !956, !957, !958, !961, !964, !965, !966, !971, !975, !976, !979, !982, !985, !988, !991, !992}
!641 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", baseType: !"_ZTSNSt3__121__basic_string_commonILb1EEE")
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__r_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1318, baseType: !"_ZTSNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE", size: 192, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "npos", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1321, baseType: !644, flags: DIFlagPublic | DIFlagStaticMember, extraData: i64 -1)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1213, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__116allocator_traitsINS_9allocatorIcEEEE", file: !647, line: 1417, baseType: !648)
!647 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/memory", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !"_ZTSNSt3__111__size_typeINS_9allocatorIcEElLb1EEE", file: !647, line: 1074, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__19allocatorIcEE", file: !647, line: 1643, baseType: !302)
!650 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1323, type: !651, isLocal: false, isDefinition: false, scopeLine: 1323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!654 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1325, type: !655, isLocal: false, isDefinition: false, scopeLine: 1325, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !653, !657}
!657 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1211, baseType: !"_ZTSNSt3__19allocatorIcEE")
!660 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1326, type: !661, isLocal: false, isDefinition: false, scopeLine: 1326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !653, !663}
!663 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!665 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1327, type: !666, isLocal: false, isDefinition: false, scopeLine: 1327, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !653, !663, !657}
!668 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1335, type: !669, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !653, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1210, baseType: !291)
!674 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1337, type: !675, isLocal: false, isDefinition: false, scopeLine: 1337, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !653, !671, !657}
!677 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1339, type: !678, isLocal: false, isDefinition: false, scopeLine: 1339, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !653, !671, !645}
!680 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1341, type: !681, isLocal: false, isDefinition: false, scopeLine: 1341, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !653, !671, !645, !657}
!683 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1343, type: !684, isLocal: false, isDefinition: false, scopeLine: 1343, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !653, !645, !673}
!686 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1345, type: !687, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !653, !645, !673, !657}
!689 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1346, type: !690, isLocal: false, isDefinition: false, scopeLine: 1346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !653, !663, !645, !645, !657}
!692 = !DISubprogram(name: "~basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1361, type: !651, isLocal: false, isDefinition: false, scopeLine: 1361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSERKS5_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1363, type: !694, isLocal: false, isDefinition: false, scopeLine: 1363, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!694 = !DISubroutineType(types: !695)
!695 = !{!696, !653, !663}
!696 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!697 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEPKc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1370, type: !698, isLocal: false, isDefinition: false, scopeLine: 1370, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!698 = !DISubroutineType(types: !699)
!699 = !{!696, !653, !671}
!700 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1371, type: !701, isLocal: false, isDefinition: false, scopeLine: 1371, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!701 = !DISubroutineType(types: !702)
!702 = !{!696, !653, !673}
!703 = !DISubprogram(name: "begin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1392, type: !704, isLocal: false, isDefinition: false, scopeLine: 1392, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubroutineType(types: !705)
!705 = !{!706, !653}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1229, baseType: !"_ZTSNSt3__111__wrap_iterIPcEE")
!707 = !DISubprogram(name: "begin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1395, type: !708, isLocal: false, isDefinition: false, scopeLine: 1395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1230, baseType: !"_ZTSNSt3__111__wrap_iterIPKcEE")
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!712 = !DISubprogram(name: "end", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1398, type: !704, isLocal: false, isDefinition: false, scopeLine: 1398, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!713 = !DISubprogram(name: "end", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1401, type: !708, isLocal: false, isDefinition: false, scopeLine: 1401, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!714 = !DISubprogram(name: "rbegin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1405, type: !715, isLocal: false, isDefinition: false, scopeLine: 1405, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !653}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1232, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPcEEEE")
!718 = !DISubprogram(name: "rbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1408, type: !719, isLocal: false, isDefinition: false, scopeLine: 1408, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !711}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1233, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPKcEEEE")
!722 = !DISubprogram(name: "rend", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1411, type: !715, isLocal: false, isDefinition: false, scopeLine: 1411, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!723 = !DISubprogram(name: "rend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1414, type: !719, isLocal: false, isDefinition: false, scopeLine: 1414, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!724 = !DISubprogram(name: "cbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6cbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1418, type: !708, isLocal: false, isDefinition: false, scopeLine: 1418, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!725 = !DISubprogram(name: "cend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4cendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1421, type: !708, isLocal: false, isDefinition: false, scopeLine: 1421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!726 = !DISubprogram(name: "crbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7crbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1424, type: !719, isLocal: false, isDefinition: false, scopeLine: 1424, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!727 = !DISubprogram(name: "crend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5crendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1427, type: !719, isLocal: false, isDefinition: false, scopeLine: 1427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!728 = !DISubprogram(name: "size", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4sizeEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1430, type: !729, isLocal: false, isDefinition: false, scopeLine: 1430, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!729 = !DISubroutineType(types: !730)
!730 = !{!645, !711}
!731 = !DISubprogram(name: "length", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6lengthEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !39, line: 1432, type: !729, isLocal: false, isDefinition: false, scopeLine: 1432, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
