; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxvectorst.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.soplex::SPxVectorST" = type { %"class.soplex::SPxWeightST", i32, %"class.soplex::DVector" }
%"class.soplex::SPxWeightST" = type { %"class.soplex::SPxStarter", %"class.soplex::DataArray", %"class.soplex::DataArray.0"*, %"class.soplex::DataArray.0"*, %"class.soplex::DataArray.0", %"class.soplex::DataArray.0", %"class.soplex::DataArray.1", %"class.soplex::DataArray.1" }
%"class.soplex::SPxStarter" = type { i32 (...)** }
%"class.soplex::DataArray" = type { i32, i32, i32*, double }
%"class.soplex::DataArray.0" = type { i32, i32, double*, double }
%"class.soplex::DataArray.1" = type { i32, i32, i8*, double }
%"class.soplex::DVector" = type { %"class.soplex::Vector", i32, double* }
%"class.soplex::Vector" = type { i32, double* }

!58 = !DIEnumerator(name: "D_ON_UPPER", value: 2)
!59 = !DIEnumerator(name: "D_ON_LOWER", value: 4)
!60 = !DIEnumerator(name: "D_ON_BOTH", value: 6)
!61 = !DIEnumerator(name: "D_UNDEFINED", value: 8)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 113, size: 32, align: 32, elements: !64, identifier: "_ZTSN6soplex6SoPlex4TypeE")
!63 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/soplex.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "ENTER", value: -1)
!66 = !DIEnumerator(name: "LEAVE", value: 1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Pricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 141, size: 32, align: 32, elements: !68, identifier: "_ZTSN6soplex6SoPlex7PricingE")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "FULL", value: 0)
!70 = !DIEnumerator(name: "PARTIAL", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Representation", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 94, size: 32, align: 32, elements: !72, identifier: "_ZTSN6soplex6SoPlex14RepresentationE")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "ROW", value: -1)
!74 = !DIEnumerator(name: "COLUMN", value: 1)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex5TimerE", file: !76, line: 100, size: 32, align: 32, elements: !77, identifier: "_ZTSN6soplex5TimerUt_E")
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "RESET", value: 0)
!79 = !DIEnumerator(name: "STOPPED", value: 1)
!80 = !DIEnumerator(name: "RUNNING", value: 2)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 177, size: 32, align: 32, elements: !82, identifier: "_ZTSN6soplex6SoPlex6StatusE")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!83 = !DIEnumerator(name: "ERROR", value: -9)
!84 = !DIEnumerator(name: "NOT_INIT", value: -8)
!85 = !DIEnumerator(name: "ABORT_TIME", value: -7)
!86 = !DIEnumerator(name: "ABORT_ITER", value: -6)
!87 = !DIEnumerator(name: "ABORT_VALUE", value: -5)
!88 = !DIEnumerator(name: "SINGULAR", value: -4)
!89 = !DIEnumerator(name: "NO_PROBLEM", value: -3)
!90 = !DIEnumerator(name: "REGULAR", value: -2)
!91 = !DIEnumerator(name: "RUNNING", value: -1)
!92 = !DIEnumerator(name: "UNKNOWN", value: 0)
!93 = !DIEnumerator(name: "OPTIMAL", value: 1)
!94 = !DIEnumerator(name: "UNBOUNDED", value: 2)
!95 = !DIEnumerator(name: "INFEASIBLE", value: 3)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VarStatus", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 165, size: 32, align: 32, elements: !97, identifier: "_ZTSN6soplex6SoPlex9VarStatusE")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "ON_UPPER", value: 0)
!99 = !DIEnumerator(name: "ON_LOWER", value: 1)
!100 = !DIEnumerator(name: "FIXED", value: 2)
!101 = !DIEnumerator(name: "ZERO", value: 3)
!102 = !DIEnumerator(name: "BASIC", value: 4)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex11SPxVectorSTE", file: !104, line: 50, size: 32, align: 32, elements: !105, identifier: "_ZTSN6soplex11SPxVectorSTUt_E")
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxvectorst.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "NONE", value: 0)
!107 = !DIEnumerator(name: "PVEC", value: 1)
!108 = !DIEnumerator(name: "DVEC", value: 2)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !110, line: 87, size: 32, align: 32, elements: !111, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!110 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !{!112, !113, !114}
!112 = !DIEnumerator(name: "FREE", value: 0)
!113 = !DIEnumerator(name: "RELEASED", value: 1)
!114 = !DIEnumerator(name: "USED", value: 2)
!115 = !{!116, !173, !177, !178, !185, !192, !207, !212, !216, !220, !241, !262, !831, !1107, !1243, !1369, !1452, !1540, !1544, !1619, !1741, !1791, !1836, !1952, !1979, !1983, !2010, !2052, !2109, !2154, !3, !2205, !2333, !10, !2370, !2383, !15, !2422, !2435, !2599, !2649, !2725, !21, !2873, !2948, !2949, !3305, !3342, !3346, !3356, !3411, !3414, !3419, !3424, !3428, !3471, !3475, !3477, !3487, !3492, !3493, !3496, !3499, !3512, !3523, !3530, !3534, !3538, !3575, !3578, !3580, !3581, !3582, !3583, !3585, !3596, !3625, !3646, !3663, !3765, !3870, !27, !3871, !3959, !4070, !4074, !4135, !4153, !4233, !4241, !4273, !4439, !4516, !4596, !32, !40, !4661, !4703, !51, !62, !67, !71, !4780, !75, !81, !4819, !4877, !4900, !4943, !4944, !4945, !4946, !96, !4947, !4975, !5050, !5129, !103, !109}
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !117, line: 122, size: 1216, align: 64, elements: !118, identifier: "_ZTS7__sFILE")
!117 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!118 = !{!119, !122, !124, !125, !127, !128, !129, !130, !132, !136, !142, !152, !158, !159, !161, !162, !166, !170, !171, !172}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !117, line: 123, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !117, line: 124, baseType: !123, size: 32, align: 32, offset: 64)
!123 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !117, line: 125, baseType: !123, size: 32, align: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !117, line: 126, baseType: !126, size: 16, align: 16, offset: 128)
!126 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !117, line: 127, baseType: !126, size: 16, align: 16, offset: 144)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !117, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !117, line: 129, baseType: !123, size: 32, align: 32, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !117, line: 132, baseType: !131, size: 64, align: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !117, line: 133, baseType: !133, size: 64, align: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!123, !131}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !117, line: 134, baseType: !137, size: 64, align: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!123, !131, !140, !123}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !117, line: 135, baseType: !143, size: 64, align: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !131, !146, !123}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !117, line: 77, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !148, line: 71, baseType: !149)
!148 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!151 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !117, line: 136, baseType: !153, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!123, !131, !156, !123}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !117, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !117, line: 140, baseType: !160, size: 64, align: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !117, line: 141, baseType: !123, size: 32, align: 32, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !117, line: 144, baseType: !163, size: 24, align: 8, offset: 928)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 24, align: 8, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !117, line: 145, baseType: !167, size: 8, align: 8, offset: 952)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 8, align: 8, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 1)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !117, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !117, line: 151, baseType: !123, size: 32, align: 32, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !117, line: 152, baseType: !146, size: 64, align: 64, offset: 1152)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !117, line: 88, size: 128, align: 64, elements: !174, identifier: "_ZTS6__sbuf")
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !117, line: 89, baseType: !120, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !117, line: 90, baseType: !123, size: 32, align: 32, offset: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !117, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !179, identifier: "_ZTS13__va_list_tag")
!179 = !{!180, !182, !183, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !181, size: 32, align: 32)
!181 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !181, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !131, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !131, size: 64, align: 64, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 76, size: 1024, align: 64, elements: !186, identifier: "_ZTS11__mbstate_t")
!186 = !{!187, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !150, line: 77, baseType: !188, size: 1024, align: 8)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1024, align: 8, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !150, line: 78, baseType: !151, size: 64, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !193, line: 73, size: 448, align: 64, elements: !194, identifier: "_ZTS2tm")
!193 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !206}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !193, line: 74, baseType: !123, size: 32, align: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !193, line: 75, baseType: !123, size: 32, align: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !193, line: 76, baseType: !123, size: 32, align: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !193, line: 77, baseType: !123, size: 32, align: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !193, line: 78, baseType: !123, size: 32, align: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !193, line: 79, baseType: !123, size: 32, align: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !193, line: 80, baseType: !123, size: 32, align: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !193, line: 81, baseType: !123, size: 32, align: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !193, line: 82, baseType: !123, size: 32, align: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !193, line: 83, baseType: !205, size: 64, align: 64, offset: 320)
!205 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !193, line: 84, baseType: !140, size: 64, align: 64, offset: 384)
!207 = !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 82, size: 64, align: 32, elements: !209, identifier: "_ZTS5div_t")
!208 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !208, line: 83, baseType: !123, size: 32, align: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !208, line: 84, baseType: !123, size: 32, align: 32, offset: 32)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 87, size: 128, align: 64, elements: !213, identifier: "_ZTS6ldiv_t")
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !208, line: 88, baseType: !205, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !208, line: 89, baseType: !205, size: 64, align: 64, offset: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 93, size: 128, align: 64, elements: !217, identifier: "_ZTS7lldiv_t")
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !208, line: 94, baseType: !151, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !208, line: 95, baseType: !151, size: 64, align: 64, offset: 64)
!220 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxVectorST", scope: !221, file: !104, line: 48, size: 1472, align: 64, elements: !223, vtableHolder: !"_ZTSN6soplex10SPxStarterE", identifier: "_ZTSN6soplex11SPxVectorSTE")
!221 = !DINamespace(name: "soplex", scope: null, file: !222, line: 49)
!222 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!223 = !{!224, !225, !226, !227, !232, !237, !238}
!224 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex11SPxVectorSTE", baseType: !"_ZTSN6soplex11SPxWeightSTE", flags: DIFlagPublic)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !"_ZTSN6soplex11SPxVectorSTE", file: !104, line: 50, baseType: !"_ZTSN6soplex11SPxVectorSTUt_E", size: 32, align: 32, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !"_ZTSN6soplex11SPxVectorSTE", file: !104, line: 51, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 1216)
!227 = !DISubprogram(name: "setupWeights", linkageName: "_ZN6soplex11SPxVectorST12setupWeightsERNS_6SoPlexE", scope: !"_ZTSN6soplex11SPxVectorSTE", file: !104, line: 55, type: !228, isLocal: false, isDefinition: false, scopeLine: 55, containingType: !"_ZTSN6soplex11SPxVectorSTE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230, !231}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex11SPxVectorSTE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!231 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6SoPlexE")
!232 = !DISubprogram(name: "primal", linkageName: "_ZN6soplex11SPxVectorST6primalERKNS_6VectorE", scope: !"_ZTSN6soplex11SPxVectorSTE", file: !104, line: 59, type: !233, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !230, !235}
!235 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!237 = !DISubprogram(name: "dual", linkageName: "_ZN6soplex11SPxVectorST4dualERKNS_6VectorE", scope: !"_ZTSN6soplex11SPxVectorSTE", file: !104, line: 66, type: !233, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubprogram(name: "SPxVectorST", scope: !"_ZTSN6soplex11SPxVectorSTE", file: !104, line: 73, type: !239, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !230}
!241 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxStarter", scope: !221, file: !242, line: 45, size: 64, align: 64, elements: !243, vtableHolder: !"_ZTSN6soplex10SPxStarterE", identifier: "_ZTSN6soplex10SPxStarterE")
!242 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxstarter.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!243 = !{!244, !249, !253, !256}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxStarter", scope: !242, file: !242, baseType: !245, size: 64, flags: DIFlagArtificial)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!123}
!249 = !DISubprogram(name: "generate", linkageName: "_ZN6soplex10SPxStarter8generateERNS_6SoPlexE", scope: !"_ZTSN6soplex10SPxStarterE", file: !242, line: 49, type: !250, isLocal: false, isDefinition: false, scopeLine: 49, containingType: !"_ZTSN6soplex10SPxStarterE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !252, !231}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!253 = !DISubprogram(name: "~SPxStarter", scope: !"_ZTSN6soplex10SPxStarterE", file: !242, line: 52, type: !254, isLocal: false, isDefinition: false, scopeLine: 52, containingType: !"_ZTSN6soplex10SPxStarterE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !252}
!256 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex10SPxStarter12isConsistentEv", scope: !"_ZTSN6soplex10SPxStarterE", file: !242, line: 56, type: !257, isLocal: false, isDefinition: false, scopeLine: 56, containingType: !"_ZTSN6soplex10SPxStarterE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !260}
!259 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SPxStarterE")
!262 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !221, file: !63, line: 77, size: 12416, align: 64, elements: !263, vtableHolder: !"_ZTSN6soplex5SPxLPE", identifier: "_ZTSN6soplex6SoPlexE")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !274, !275, !276, !277, !278, !279, !280, !281, !282, !284, !286, !287, !288, !289, !290, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !309, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !326, !328, !330, !332, !334, !339, !342, !345, !348, !360, !365, !369, !372, !375, !378, !381, !384, !389, !392, !395, !398, !401, !404, !407, !408, !413, !416, !419, !422, !426, !427, !428, !429, !430, !433, !434, !435, !438, !439, !440, !443, !444, !445, !446, !447, !451, !452, !453, !456, !459, !462, !463, !464, !465, !466, !467, !468, !471, !474, !477, !478, !479, !482, !483, !484, !485, !486, !487, !490, !495, !498, !503, !506, !509, !512, !515, !516, !517, !520, !521, !524, !525, !530, !535, !540, !545, !546, !547, !548, !549, !550, !553, !554, !557, !558, !561, !564, !567, !568, !569, !570, !574, !577, !578, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !614, !615, !616, !620, !621, !622, !623, !624, !625, !630, !631, !636, !637, !640, !641, !642, !647, !651, !656, !661, !666, !670, !675, !676, !679, !683, !686, !687, !688, !689, !690, !691, !692, !695, !696, !697, !698, !699, !700, !701, !702, !703, !706, !707, !708, !709, !710, !711, !715, !721, !724, !727, !730, !733, !736, !739, !740, !741, !742, !743, !744, !745, !746, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !769, !772, !775, !776, !779, !780, !784, !789, !790, !791, !796, !801, !804, !805, !806, !807, !810, !811, !812, !813, !816, !819, !822, !823, !827, !830}
!264 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex5SPxLPE", flags: DIFlagPublic)
!265 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex8SPxBasisE", offset: 2816, flags: DIFlagProtected)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "theType", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 196, baseType: !"_ZTSN6soplex6SoPlex4TypeE", size: 32, align: 32, offset: 4480)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "thePricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 197, baseType: !"_ZTSN6soplex6SoPlex7PricingE", size: 32, align: 32, offset: 4512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "therep", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 198, baseType: !"_ZTSN6soplex6SoPlex14RepresentationE", size: 32, align: 32, offset: 4544)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "theTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 199, baseType: !"_ZTSN6soplex5TimerE", size: 448, align: 64, offset: 4608)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "maxIters", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 200, baseType: !123, size: 32, align: 32, offset: 5056)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 201, baseType: !272, size: 64, align: 64, offset: 5120)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !221, file: !222, line: 127, baseType: !273)
!273 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 202, baseType: !272, size: 64, align: 64, offset: 5184)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "m_status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 203, baseType: !"_ZTSN6soplex6SoPlex6StatusE", size: 32, align: 32, offset: 5248)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 205, baseType: !272, size: 64, align: 64, offset: 5312)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "theShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 206, baseType: !272, size: 64, align: 64, offset: 5376)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lastShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 207, baseType: !272, size: 64, align: 64, offset: 5440)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 208, baseType: !123, size: 32, align: 32, offset: 5504)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "m_numCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 209, baseType: !123, size: 32, align: 32, offset: 5536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 210, baseType: !259, size: 8, align: 8, offset: 5568)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 212, baseType: !283, size: 64, align: 64, offset: 5632)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 213, baseType: !285, size: 64, align: 64, offset: 5696)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 214, baseType: !283, size: 64, align: 64, offset: 5760)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 215, baseType: !285, size: 64, align: 64, offset: 5824)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cacheProductFactor", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 217, baseType: !272, size: 64, align: 64, offset: 5888)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "unitVecs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 220, baseType: !"_ZTSN6soplex5ArrayINS_10UnitVectorEEE", size: 128, align: 64, offset: 5952, flags: DIFlagProtected)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "thevectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 221, baseType: !291, size: 64, align: 64, offset: 6080, flags: DIFlagProtected)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "thecovectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 222, baseType: !291, size: 64, align: 64, offset: 6144, flags: DIFlagProtected)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nNZEs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 224, baseType: !123, size: 32, align: 32, offset: 6208, flags: DIFlagProtected)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "coVecDim", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 225, baseType: !123, size: 32, align: 32, offset: 6240, flags: DIFlagProtected)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "primRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 227, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 6272, flags: DIFlagProtected)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "primVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 228, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 6528, flags: DIFlagProtected)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dualRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 229, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 7360, flags: DIFlagProtected)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dualVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 230, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 7616, flags: DIFlagProtected)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "addVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 231, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 8448, flags: DIFlagProtected)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "theURbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 233, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9280, flags: DIFlagProtected)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "theLRbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 234, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9536, flags: DIFlagProtected)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "theUCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 235, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9792, flags: DIFlagProtected)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "theLCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 236, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10048, flags: DIFlagProtected)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "theUBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 243, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10304, flags: DIFlagProtected)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "theLBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 244, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10560, flags: DIFlagProtected)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "theFrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 246, baseType: !308, size: 64, align: 64, offset: 10816, flags: DIFlagProtected)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "theFvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 247, baseType: !310, size: 64, align: 64, offset: 10880, flags: DIFlagProtected)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 249, baseType: !308, size: 64, align: 64, offset: 10944, flags: DIFlagProtected)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 250, baseType: !310, size: 64, align: 64, offset: 11008, flags: DIFlagProtected)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "thePvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 251, baseType: !310, size: 64, align: 64, offset: 11072, flags: DIFlagProtected)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "theRPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 254, baseType: !310, size: 64, align: 64, offset: 11136, flags: DIFlagProtected)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "theCPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 256, baseType: !310, size: 64, align: 64, offset: 11200, flags: DIFlagProtected)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "theUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 260, baseType: !308, size: 64, align: 64, offset: 11264, flags: DIFlagProtected)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "theLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 261, baseType: !308, size: 64, align: 64, offset: 11328, flags: DIFlagProtected)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "theCoUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 262, baseType: !308, size: 64, align: 64, offset: 11392, flags: DIFlagProtected)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "theCoLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 263, baseType: !308, size: 64, align: 64, offset: 11456, flags: DIFlagProtected)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "theCoTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 266, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11520, flags: DIFlagProtected)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "theTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 267, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11776, flags: DIFlagProtected)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "leaveCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 269, baseType: !123, size: 32, align: 32, offset: 12032, flags: DIFlagProtected)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "enterCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 270, baseType: !123, size: 32, align: 32, offset: 12064, flags: DIFlagProtected)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "thepricer", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 272, baseType: !325, size: 64, align: 64, offset: 12096, flags: DIFlagProtected)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "theratiotester", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 273, baseType: !327, size: 64, align: 64, offset: 12160, flags: DIFlagProtected)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "thestarter", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 274, baseType: !329, size: 64, align: 64, offset: 12224, flags: DIFlagProtected)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thescaler", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 275, baseType: !331, size: 64, align: 64, offset: 12288, flags: DIFlagProtected)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxScalerE", size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "thesimplifier", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 276, baseType: !333, size: 64, align: 64, offset: 12352, flags: DIFlagProtected)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex13SPxSimplifierE", size: 64, align: 64)
!334 = !DISubprogram(name: "version", linkageName: "_ZNK6soplex6SoPlex7versionEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 280, type: !335, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{!123, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6SoPlexE")
!339 = !DISubprogram(name: "rep", linkageName: "_ZNK6soplex6SoPlex3repEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 285, type: !340, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{!"_ZTSN6soplex6SoPlex14RepresentationE", !337}
!342 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex6SoPlex4typeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 291, type: !343, isLocal: false, isDefinition: false, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!343 = !DISubroutineType(types: !344)
!344 = !{!"_ZTSN6soplex6SoPlex4TypeE", !337}
!345 = !DISubprogram(name: "pricing", linkageName: "_ZNK6soplex6SoPlex7pricingEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 297, type: !346, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{!"_ZTSN6soplex6SoPlex7PricingE", !337}
!348 = !DISubprogram(name: "read", linkageName: "_ZN6soplex6SoPlex4readERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEEPNS_7NameSetES8_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 329, type: !349, isLocal: false, isDefinition: false, scopeLine: 329, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!259, !351, !352, !358, !358, !359}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!352 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !355, file: !354, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!354 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!355 = !DINamespace(name: "__1", scope: !357, file: !356, line: 369)
!356 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!357 = !DINamespace(name: "std", scope: null, file: !356, line: 368)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7NameSetE", size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64)
!360 = !DISubprogram(name: "loadLP", linkageName: "_ZN6soplex6SoPlex6loadLPERKNS_5SPxLPE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 333, type: !361, isLocal: false, isDefinition: false, scopeLine: 333, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !351, !363}
!363 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxLPE")
!365 = !DISubprogram(name: "setSolver", linkageName: "_ZN6soplex6SoPlex9setSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 335, type: !366, isLocal: false, isDefinition: false, scopeLine: 335, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !351, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!369 = !DISubprogram(name: "setPricer", linkageName: "_ZN6soplex6SoPlex9setPricerEPNS_9SPxPricerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 337, type: !370, isLocal: false, isDefinition: false, scopeLine: 337, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !351, !325}
!372 = !DISubprogram(name: "setTester", linkageName: "_ZN6soplex6SoPlex9setTesterEPNS_14SPxRatioTesterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 339, type: !373, isLocal: false, isDefinition: false, scopeLine: 339, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !351, !327}
!375 = !DISubprogram(name: "setStarter", linkageName: "_ZN6soplex6SoPlex10setStarterEPNS_10SPxStarterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 341, type: !376, isLocal: false, isDefinition: false, scopeLine: 341, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !351, !329}
!378 = !DISubprogram(name: "setScaler", linkageName: "_ZN6soplex6SoPlex9setScalerEPNS_9SPxScalerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 343, type: !379, isLocal: false, isDefinition: false, scopeLine: 343, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !351, !331}
!381 = !DISubprogram(name: "setSimplifier", linkageName: "_ZN6soplex6SoPlex13setSimplifierEPNS_13SPxSimplifierE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 345, type: !382, isLocal: false, isDefinition: false, scopeLine: 345, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !351, !333}
!384 = !DISubprogram(name: "loadBasis", linkageName: "_ZN6soplex6SoPlex9loadBasisERKNS_8SPxBasis4DescE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 347, type: !385, isLocal: false, isDefinition: false, scopeLine: 347, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !351, !387}
!387 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!389 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex6SoPlex6setRepENS0_14RepresentationE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 350, type: !390, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !351, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!392 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex6SoPlex7setTypeENS0_4TypeE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 352, type: !393, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !351, !"_ZTSN6soplex6SoPlex4TypeE"}
!395 = !DISubprogram(name: "setPricing", linkageName: "_ZN6soplex6SoPlex10setPricingENS0_7PricingE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 354, type: !396, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !351, !"_ZTSN6soplex6SoPlex7PricingE"}
!398 = !DISubprogram(name: "reLoad", linkageName: "_ZN6soplex6SoPlex6reLoadEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 357, type: !399, isLocal: false, isDefinition: false, scopeLine: 357, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !351}
!401 = !DISubprogram(name: "readFile", linkageName: "_ZN6soplex6SoPlex8readFileEPKcPNS_7NameSetES4_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 360, type: !402, isLocal: false, isDefinition: false, scopeLine: 360, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{!259, !351, !156, !358, !358, !359}
!404 = !DISubprogram(name: "dumpFile", linkageName: "_ZNK6soplex6SoPlex8dumpFileEPKc", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 364, type: !405, isLocal: false, isDefinition: false, scopeLine: 364, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !337, !156}
!407 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6SoPlex5clearEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 367, type: !399, isLocal: false, isDefinition: false, scopeLine: 367, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubprogram(name: "readBasisFile", linkageName: "_ZN6soplex6SoPlex13readBasisFileEPKcRKNS_7NameSetES5_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 370, type: !409, isLocal: false, isDefinition: false, scopeLine: 370, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!409 = !DISubroutineType(types: !410)
!410 = !{!259, !351, !156, !411, !411}
!411 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!413 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex6SoPlex5solveEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 383, type: !414, isLocal: false, isDefinition: false, scopeLine: 383, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{!"_ZTSN6soplex6SoPlex6StatusE", !351}
!416 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex6SoPlex6statusEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 386, type: !417, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!417 = !DISubroutineType(types: !418)
!418 = !{!"_ZTSN6soplex6SoPlex6StatusE", !337}
!419 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex6SoPlex5valueEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 392, type: !420, isLocal: false, isDefinition: false, scopeLine: 392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!420 = !DISubroutineType(types: !421)
!421 = !{!272, !337}
!422 = !DISubprogram(name: "getPrimal", linkageName: "_ZNK6soplex6SoPlex9getPrimalERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 401, type: !423, isLocal: false, isDefinition: false, scopeLine: 401, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubroutineType(types: !424)
!424 = !{!"_ZTSN6soplex6SoPlex6StatusE", !337, !425}
!425 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!426 = !DISubprogram(name: "getPrimalUnscaled", linkageName: "_ZNK6soplex6SoPlex17getPrimalUnscaledERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 406, type: !423, isLocal: false, isDefinition: false, scopeLine: 406, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!427 = !DISubprogram(name: "getSlacks", linkageName: "_ZNK6soplex6SoPlex9getSlacksERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 421, type: !423, isLocal: false, isDefinition: false, scopeLine: 421, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubprogram(name: "getDual", linkageName: "_ZNK6soplex6SoPlex7getDualERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 447, type: !423, isLocal: false, isDefinition: false, scopeLine: 447, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!429 = !DISubprogram(name: "getRdCost", linkageName: "_ZNK6soplex6SoPlex9getRdCostERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 460, type: !423, isLocal: false, isDefinition: false, scopeLine: 460, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!430 = !DISubprogram(name: "terminate", linkageName: "_ZN6soplex6SoPlex9terminateEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 478, type: !431, isLocal: false, isDefinition: false, scopeLine: 478, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{!259, !351}
!433 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex6SoPlex7epsilonEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 487, type: !420, isLocal: false, isDefinition: false, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!434 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex6SoPlex5deltaEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 496, type: !420, isLocal: false, isDefinition: false, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!435 = !DISubprogram(name: "setDelta", linkageName: "_ZN6soplex6SoPlex8setDeltaEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 501, type: !436, isLocal: false, isDefinition: false, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !351, !272}
!438 = !DISubprogram(name: "maxCycle", linkageName: "_ZNK6soplex6SoPlex8maxCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 514, type: !335, isLocal: false, isDefinition: false, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubprogram(name: "numCycle", linkageName: "_ZNK6soplex6SoPlex8numCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 519, type: !335, isLocal: false, isDefinition: false, scopeLine: 519, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!440 = !DISubprogram(name: "localAddRows", linkageName: "_ZN6soplex6SoPlex12localAddRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 533, type: !441, isLocal: false, isDefinition: false, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !351, !123}
!443 = !DISubprogram(name: "localAddCols", linkageName: "_ZN6soplex6SoPlex12localAddColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 535, type: !441, isLocal: false, isDefinition: false, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true)
!444 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex6SoPlex9addedRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 539, type: !441, isLocal: false, isDefinition: false, scopeLine: 539, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 57, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!445 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex6SoPlex9addedColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 541, type: !441, isLocal: false, isDefinition: false, scopeLine: 541, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 58, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!446 = !DISubprogram(name: "doRemoveRow", linkageName: "_ZN6soplex6SoPlex11doRemoveRowEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 544, type: !441, isLocal: false, isDefinition: false, scopeLine: 544, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 53, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!447 = !DISubprogram(name: "doRemoveRows", linkageName: "_ZN6soplex6SoPlex12doRemoveRowsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 546, type: !448, isLocal: false, isDefinition: false, scopeLine: 546, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 55, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !351, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!451 = !DISubprogram(name: "doRemoveCol", linkageName: "_ZN6soplex6SoPlex11doRemoveColEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 548, type: !441, isLocal: false, isDefinition: false, scopeLine: 548, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 56, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!452 = !DISubprogram(name: "doRemoveCols", linkageName: "_ZN6soplex6SoPlex12doRemoveColsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 550, type: !448, isLocal: false, isDefinition: false, scopeLine: 550, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 54, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!453 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 554, type: !454, isLocal: false, isDefinition: false, scopeLine: 554, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !351, !235}
!456 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 556, type: !457, isLocal: false, isDefinition: false, scopeLine: 556, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !351, !123, !272}
!459 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 558, type: !460, isLocal: false, isDefinition: false, scopeLine: 558, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !351, !"_ZTSN6soplex8SPxColIdE", !272}
!462 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 563, type: !454, isLocal: false, isDefinition: false, scopeLine: 563, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!463 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 565, type: !457, isLocal: false, isDefinition: false, scopeLine: 565, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!464 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 567, type: !460, isLocal: false, isDefinition: false, scopeLine: 567, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 572, type: !454, isLocal: false, isDefinition: false, scopeLine: 572, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 574, type: !457, isLocal: false, isDefinition: false, scopeLine: 574, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 32, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 576, type: !460, isLocal: false, isDefinition: false, scopeLine: 576, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 581, type: !469, isLocal: false, isDefinition: false, scopeLine: 581, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !351, !235, !235}
!471 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 583, type: !472, isLocal: false, isDefinition: false, scopeLine: 583, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !351, !123, !272, !272}
!474 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsENS_8SPxColIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 585, type: !475, isLocal: false, isDefinition: false, scopeLine: 585, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !351, !"_ZTSN6soplex8SPxColIdE", !272, !272}
!477 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 591, type: !454, isLocal: false, isDefinition: false, scopeLine: 591, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 593, type: !457, isLocal: false, isDefinition: false, scopeLine: 593, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 595, type: !480, isLocal: false, isDefinition: false, scopeLine: 595, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !351, !"_ZTSN6soplex8SPxRowIdE", !272}
!482 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 600, type: !454, isLocal: false, isDefinition: false, scopeLine: 600, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 40, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!483 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 602, type: !457, isLocal: false, isDefinition: false, scopeLine: 602, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!484 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 604, type: !480, isLocal: false, isDefinition: false, scopeLine: 604, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 42, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 609, type: !469, isLocal: false, isDefinition: false, scopeLine: 609, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!486 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 611, type: !472, isLocal: false, isDefinition: false, scopeLine: 611, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!487 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeENS_8SPxRowIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 613, type: !488, isLocal: false, isDefinition: false, scopeLine: 613, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !351, !"_ZTSN6soplex8SPxRowIdE", !272, !272}
!490 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowEiRKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 619, type: !491, isLocal: false, isDefinition: false, scopeLine: 619, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !351, !123, !493}
!493 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPRowE")
!495 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowENS_8SPxRowIdERKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 621, type: !496, isLocal: false, isDefinition: false, scopeLine: 621, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !351, !"_ZTSN6soplex8SPxRowIdE", !493}
!498 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColEiRKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 626, type: !499, isLocal: false, isDefinition: false, scopeLine: 626, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !351, !123, !501}
!501 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!503 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColENS_8SPxColIdERKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 628, type: !504, isLocal: false, isDefinition: false, scopeLine: 628, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !351, !"_ZTSN6soplex8SPxColIdE", !501}
!506 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementEiid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 633, type: !507, isLocal: false, isDefinition: false, scopeLine: 633, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !351, !123, !123, !272}
!509 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementENS_8SPxRowIdENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 635, type: !510, isLocal: false, isDefinition: false, scopeLine: 635, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !351, !"_ZTSN6soplex8SPxRowIdE", !"_ZTSN6soplex8SPxColIdE", !272}
!512 = !DISubprogram(name: "changeSense", linkageName: "_ZN6soplex6SoPlex11changeSenseENS_5SPxLP8SPxSenseE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 641, type: !513, isLocal: false, isDefinition: false, scopeLine: 641, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !351, !"_ZTSN6soplex5SPxLP8SPxSenseE"}
!515 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6SoPlex3dimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 645, type: !335, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubprogram(name: "coDim", linkageName: "_ZNK6soplex6SoPlex5coDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 650, type: !335, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubprogram(name: "id", linkageName: "_ZNK6soplex6SoPlex2idEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 666, type: !518, isLocal: false, isDefinition: false, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{!"_ZTSN6soplex5SPxIdE", !337, !123}
!520 = !DISubprogram(name: "coId", linkageName: "_ZNK6soplex6SoPlex4coIdEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 685, type: !518, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubprogram(name: "isId", linkageName: "_ZNK6soplex6SoPlex4isIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 703, type: !522, isLocal: false, isDefinition: false, scopeLine: 703, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{!123, !337, !"_ZTSN6soplex5SPxIdE"}
!524 = !DISubprogram(name: "isCoId", linkageName: "_ZNK6soplex6SoPlex6isCoIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 712, type: !522, isLocal: false, isDefinition: false, scopeLine: 712, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 724, type: !526, isLocal: false, isDefinition: false, scopeLine: 724, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !337, !123}
!528 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!530 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 730, type: !531, isLocal: false, isDefinition: false, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{!528, !337, !533}
!533 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!535 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 738, type: !536, isLocal: false, isDefinition: false, scopeLine: 738, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubroutineType(types: !537)
!537 = !{!528, !337, !538}
!538 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!540 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 755, type: !541, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!541 = !DISubroutineType(types: !542)
!542 = !{!528, !337, !543}
!543 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!545 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 768, type: !526, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 773, type: !531, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!547 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 781, type: !536, isLocal: false, isDefinition: false, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 795, type: !541, isLocal: false, isDefinition: false, scopeLine: 795, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubprogram(name: "unitVector", linkageName: "_ZNK6soplex6SoPlex10unitVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 803, type: !526, isLocal: false, isDefinition: false, scopeLine: 803, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!550 = !DISubprogram(name: "varStatus", linkageName: "_ZNK6soplex6SoPlex9varStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 816, type: !551, isLocal: false, isDefinition: false, scopeLine: 816, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !337, !123}
!553 = !DISubprogram(name: "covarStatus", linkageName: "_ZNK6soplex6SoPlex11covarStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 822, type: !551, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!554 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 828, type: !555, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{!123, !337, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!557 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 834, type: !522, isLocal: false, isDefinition: false, scopeLine: 834, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 843, type: !559, isLocal: false, isDefinition: false, scopeLine: 843, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{!123, !337, !"_ZTSN6soplex8SPxRowIdE"}
!561 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 849, type: !562, isLocal: false, isDefinition: false, scopeLine: 849, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{!123, !337, !"_ZTSN6soplex8SPxColIdE"}
!564 = !DISubprogram(name: "isRowBasic", linkageName: "_ZNK6soplex6SoPlex10isRowBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 855, type: !565, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!123, !337, !123}
!567 = !DISubprogram(name: "isColBasic", linkageName: "_ZNK6soplex6SoPlex10isColBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 861, type: !565, isLocal: false, isDefinition: false, scopeLine: 861, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 867, type: !565, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubprogram(name: "isCoBasic", linkageName: "_ZNK6soplex6SoPlex9isCoBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 873, type: !565, isLocal: false, isDefinition: false, scopeLine: 873, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubprogram(name: "fVec", linkageName: "_ZNK6soplex6SoPlex4fVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 888, type: !571, isLocal: false, isDefinition: false, scopeLine: 888, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !337}
!573 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!574 = !DISubprogram(name: "fRhs", linkageName: "_ZNK6soplex6SoPlex4fRhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 901, type: !575, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubroutineType(types: !576)
!576 = !{!235, !337}
!577 = !DISubprogram(name: "ubBound", linkageName: "_ZNK6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 906, type: !575, isLocal: false, isDefinition: false, scopeLine: 906, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubprogram(name: "ubBound", linkageName: "_ZN6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 919, type: !579, isLocal: false, isDefinition: false, scopeLine: 919, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{!425, !351}
!581 = !DISubprogram(name: "lbBound", linkageName: "_ZNK6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 924, type: !575, isLocal: false, isDefinition: false, scopeLine: 924, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubprogram(name: "lbBound", linkageName: "_ZN6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 937, type: !579, isLocal: false, isDefinition: false, scopeLine: 937, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubprogram(name: "fTest", linkageName: "_ZNK6soplex6SoPlex5fTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 950, type: !575, isLocal: false, isDefinition: false, scopeLine: 950, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!584 = !DISubprogram(name: "coPvec", linkageName: "_ZNK6soplex6SoPlex6coPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 963, type: !571, isLocal: false, isDefinition: false, scopeLine: 963, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!585 = !DISubprogram(name: "coPrhs", linkageName: "_ZNK6soplex6SoPlex6coPrhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 976, type: !575, isLocal: false, isDefinition: false, scopeLine: 976, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubprogram(name: "ucBound", linkageName: "_ZNK6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 982, type: !575, isLocal: false, isDefinition: false, scopeLine: 982, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubprogram(name: "ucBound", linkageName: "_ZN6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 996, type: !579, isLocal: false, isDefinition: false, scopeLine: 996, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubprogram(name: "lcBound", linkageName: "_ZNK6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1003, type: !575, isLocal: false, isDefinition: false, scopeLine: 1003, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubprogram(name: "lcBound", linkageName: "_ZN6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1017, type: !579, isLocal: false, isDefinition: false, scopeLine: 1017, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1030, type: !575, isLocal: false, isDefinition: false, scopeLine: 1030, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!591 = !DISubprogram(name: "pVec", linkageName: "_ZNK6soplex6SoPlex4pVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1043, type: !571, isLocal: false, isDefinition: false, scopeLine: 1043, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!592 = !DISubprogram(name: "upBound", linkageName: "_ZNK6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1048, type: !575, isLocal: false, isDefinition: false, scopeLine: 1048, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubprogram(name: "upBound", linkageName: "_ZN6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1062, type: !579, isLocal: false, isDefinition: false, scopeLine: 1062, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubprogram(name: "lpBound", linkageName: "_ZNK6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1069, type: !575, isLocal: false, isDefinition: false, scopeLine: 1069, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubprogram(name: "lpBound", linkageName: "_ZN6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1083, type: !579, isLocal: false, isDefinition: false, scopeLine: 1083, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1096, type: !575, isLocal: false, isDefinition: false, scopeLine: 1096, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1103, type: !598, isLocal: false, isDefinition: false, scopeLine: 1103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubroutineType(types: !599)
!599 = !{!272, !351, !123}
!600 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1105, type: !399, isLocal: false, isDefinition: false, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1107, type: !598, isLocal: false, isDefinition: false, scopeLine: 1107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1109, type: !399, isLocal: false, isDefinition: false, scopeLine: 1109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "shiftFvec", linkageName: "_ZN6soplex6SoPlex9shiftFvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1135, type: !399, isLocal: false, isDefinition: false, scopeLine: 1135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "shiftPvec", linkageName: "_ZN6soplex6SoPlex9shiftPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1137, type: !399, isLocal: false, isDefinition: false, scopeLine: 1137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "shiftUBbound", linkageName: "_ZN6soplex6SoPlex12shiftUBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1140, type: !457, isLocal: false, isDefinition: false, scopeLine: 1140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubprogram(name: "shiftLBbound", linkageName: "_ZN6soplex6SoPlex12shiftLBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1147, type: !457, isLocal: false, isDefinition: false, scopeLine: 1147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!607 = !DISubprogram(name: "shiftUPbound", linkageName: "_ZN6soplex6SoPlex12shiftUPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1154, type: !457, isLocal: false, isDefinition: false, scopeLine: 1154, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!608 = !DISubprogram(name: "shiftLPbound", linkageName: "_ZN6soplex6SoPlex12shiftLPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1161, type: !457, isLocal: false, isDefinition: false, scopeLine: 1161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubprogram(name: "shiftUCbound", linkageName: "_ZN6soplex6SoPlex12shiftUCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1168, type: !457, isLocal: false, isDefinition: false, scopeLine: 1168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!610 = !DISubprogram(name: "shiftLCbound", linkageName: "_ZN6soplex6SoPlex12shiftLCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1175, type: !457, isLocal: false, isDefinition: false, scopeLine: 1175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!611 = !DISubprogram(name: "testBounds", linkageName: "_ZNK6soplex6SoPlex10testBoundsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1182, type: !612, isLocal: false, isDefinition: false, scopeLine: 1182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !337}
!614 = !DISubprogram(name: "shift", linkageName: "_ZNK6soplex6SoPlex5shiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1185, type: !420, isLocal: false, isDefinition: false, scopeLine: 1185, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "unShift", linkageName: "_ZN6soplex6SoPlex7unShiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1190, type: !399, isLocal: false, isDefinition: false, scopeLine: 1190, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 82, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubprogram(name: "qualConstraintViolation", linkageName: "_ZNK6soplex6SoPlex23qualConstraintViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1193, type: !617, isLocal: false, isDefinition: false, scopeLine: 1193, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !337, !619, !619}
!619 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !273)
!620 = !DISubprogram(name: "qualConstraintViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex31qualConstraintViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1197, type: !617, isLocal: false, isDefinition: false, scopeLine: 1197, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubprogram(name: "qualBoundViolation", linkageName: "_ZNK6soplex6SoPlex18qualBoundViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1201, type: !617, isLocal: false, isDefinition: false, scopeLine: 1201, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubprogram(name: "qualBoundViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex26qualBoundViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1205, type: !617, isLocal: false, isDefinition: false, scopeLine: 1205, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubprogram(name: "qualSlackViolation", linkageName: "_ZNK6soplex6SoPlex18qualSlackViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1209, type: !617, isLocal: false, isDefinition: false, scopeLine: 1209, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubprogram(name: "qualRdCostViolation", linkageName: "_ZNK6soplex6SoPlex19qualRdCostViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1212, type: !617, isLocal: false, isDefinition: false, scopeLine: 1212, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1216, type: !626, isLocal: false, isDefinition: false, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !351, !628, !425, !425, !272, !123, !123}
!628 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!630 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1220, type: !626, isLocal: false, isDefinition: false, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true)
!631 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1224, type: !632, isLocal: false, isDefinition: false, scopeLine: 1224, flags: DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{!272, !351, !628, !425, !425, !272, !272, !634, !123, !123}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4Desc6StatusE")
!636 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1228, type: !632, isLocal: false, isDefinition: false, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: true)
!637 = !DISubprogram(name: "setup4solve", linkageName: "_ZN6soplex6SoPlex11setup4solveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1259, type: !638, isLocal: false, isDefinition: false, scopeLine: 1259, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !351, !283, !285}
!640 = !DISubprogram(name: "setup4coSolve", linkageName: "_ZN6soplex6SoPlex13setup4coSolveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1273, type: !638, isLocal: false, isDefinition: false, scopeLine: 1273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!641 = !DISubprogram(name: "maxInfeas", linkageName: "_ZNK6soplex6SoPlex9maxInfeasEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1286, type: !420, isLocal: false, isDefinition: false, scopeLine: 1286, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubprogram(name: "basis", linkageName: "_ZNK6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1294, type: !643, isLocal: false, isDefinition: false, scopeLine: 1294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{!645, !337}
!645 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!647 = !DISubprogram(name: "basis", linkageName: "_ZN6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1299, type: !648, isLocal: false, isDefinition: false, scopeLine: 1299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!648 = !DISubroutineType(types: !649)
!649 = !{!650, !351}
!650 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!651 = !DISubprogram(name: "pricer", linkageName: "_ZNK6soplex6SoPlex6pricerEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1304, type: !652, isLocal: false, isDefinition: false, scopeLine: 1304, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{!654, !337}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9SPxPricerE")
!656 = !DISubprogram(name: "slinSolver", linkageName: "_ZNK6soplex6SoPlex10slinSolverEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1309, type: !657, isLocal: false, isDefinition: false, scopeLine: 1309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!657 = !DISubroutineType(types: !658)
!658 = !{!659, !337}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SLinSolverE")
!661 = !DISubprogram(name: "ratiotester", linkageName: "_ZNK6soplex6SoPlex11ratiotesterEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1314, type: !662, isLocal: false, isDefinition: false, scopeLine: 1314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!662 = !DISubroutineType(types: !663)
!663 = !{!664, !337}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE")
!666 = !DISubprogram(name: "starter", linkageName: "_ZNK6soplex6SoPlex7starterEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1319, type: !667, isLocal: false, isDefinition: false, scopeLine: 1319, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!667 = !DISubroutineType(types: !668)
!668 = !{!669, !337}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!670 = !DISubprogram(name: "simplifier", linkageName: "_ZNK6soplex6SoPlex10simplifierEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1324, type: !671, isLocal: false, isDefinition: false, scopeLine: 1324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !337}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex13SPxSimplifierE")
!675 = !DISubprogram(name: "factorize", linkageName: "_ZN6soplex6SoPlex9factorizeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1331, type: !399, isLocal: false, isDefinition: false, scopeLine: 1331, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 90, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!676 = !DISubprogram(name: "leave", linkageName: "_ZN6soplex6SoPlex5leaveEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1334, type: !677, isLocal: false, isDefinition: false, scopeLine: 1334, flags: DIFlagPrototyped, isOptimized: true)
!677 = !DISubroutineType(types: !678)
!678 = !{!123, !351, !123}
!679 = !DISubprogram(name: "enter", linkageName: "_ZN6soplex6SoPlex5enterERNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1335, type: !680, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPrototyped, isOptimized: true)
!680 = !DISubroutineType(types: !681)
!681 = !{!123, !351, !682}
!682 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SPxIdE")
!683 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEiNS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1338, type: !684, isLocal: false, isDefinition: false, scopeLine: 1338, flags: DIFlagPrototyped, isOptimized: true)
!684 = !DISubroutineType(types: !685)
!685 = !{!272, !337, !123, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!686 = !DISubprogram(name: "computeCoTest", linkageName: "_ZN6soplex6SoPlex13computeCoTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1340, type: !399, isLocal: false, isDefinition: false, scopeLine: 1340, flags: DIFlagPrototyped, isOptimized: true)
!687 = !DISubprogram(name: "updateCoTest", linkageName: "_ZN6soplex6SoPlex12updateCoTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1342, type: !399, isLocal: false, isDefinition: false, scopeLine: 1342, flags: DIFlagPrototyped, isOptimized: true)
!688 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEiNS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1345, type: !684, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPrototyped, isOptimized: true)
!689 = !DISubprogram(name: "updateTest", linkageName: "_ZN6soplex6SoPlex10updateTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1347, type: !399, isLocal: false, isDefinition: false, scopeLine: 1347, flags: DIFlagPrototyped, isOptimized: true)
!690 = !DISubprogram(name: "computeFtest", linkageName: "_ZN6soplex6SoPlex12computeFtestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1350, type: !399, isLocal: false, isDefinition: false, scopeLine: 1350, flags: DIFlagPrototyped, isOptimized: true)
!691 = !DISubprogram(name: "updateFtest", linkageName: "_ZN6soplex6SoPlex11updateFtestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1352, type: !399, isLocal: false, isDefinition: false, scopeLine: 1352, flags: DIFlagPrototyped, isOptimized: true)
!692 = !DISubprogram(name: "isInitialized", linkageName: "_ZNK6soplex6SoPlex13isInitializedEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1373, type: !693, isLocal: false, isDefinition: false, scopeLine: 1373, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!693 = !DISubroutineType(types: !694)
!694 = !{!259, !337}
!695 = !DISubprogram(name: "init", linkageName: "_ZN6soplex6SoPlex4initEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1388, type: !399, isLocal: false, isDefinition: false, scopeLine: 1388, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "unInit", linkageName: "_ZN6soplex6SoPlex6unInitEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1392, type: !399, isLocal: false, isDefinition: false, scopeLine: 1392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 92, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!697 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex6SoPlex5reDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1398, type: !399, isLocal: false, isDefinition: false, scopeLine: 1398, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 93, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!698 = !DISubprogram(name: "computeFrhs", linkageName: "_ZN6soplex6SoPlex11computeFrhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1400, type: !399, isLocal: false, isDefinition: false, scopeLine: 1400, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!699 = !DISubprogram(name: "computeFrhsXtra", linkageName: "_ZN6soplex6SoPlex15computeFrhsXtraEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1402, type: !399, isLocal: false, isDefinition: false, scopeLine: 1402, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 94, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!700 = !DISubprogram(name: "computeFrhs1", linkageName: "_ZN6soplex6SoPlex12computeFrhs1ERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1404, type: !469, isLocal: false, isDefinition: false, scopeLine: 1404, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 95, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!701 = !DISubprogram(name: "computeFrhs2", linkageName: "_ZN6soplex6SoPlex12computeFrhs2ERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1406, type: !469, isLocal: false, isDefinition: false, scopeLine: 1406, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
