; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxweightst.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::SPxWeightST" = type { %"class.soplex::SPxStarter", %"class.soplex::DataArray", %"class.soplex::DataArray.0"*, %"class.soplex::DataArray.0"*, %"class.soplex::DataArray.0", %"class.soplex::DataArray.0", %"class.soplex::DataArray.1", %"class.soplex::DataArray.1" }
%"class.soplex::SPxStarter" = type { i32 (...)** }
%"class.soplex::DataArray" = type { i32, i32, i32*, double }
%"class.soplex::DataArray.0" = type { i32, i32, double*, double }
%"class.soplex::DataArray.1" = type { i32, i32, i8*, double }
%"class.soplex::SPxBasis::Desc" = type { %"class.soplex::DataArray.2", %"class.soplex::DataArray.2", %"class.soplex::DataArray.2"*, %"class.soplex::DataArray.2"* }
%"class.soplex::DataArray.2" = type { i32, i32, i32*, double }

!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 113, size: 32, align: 32, elements: !64, identifier: "_ZTSN6soplex6SoPlex4TypeE")
!63 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/soplex.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "ENTER", value: -1)
!66 = !DIEnumerator(name: "LEAVE", value: 1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Pricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 141, size: 32, align: 32, elements: !68, identifier: "_ZTSN6soplex6SoPlex7PricingE")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "FULL", value: 0)
!70 = !DIEnumerator(name: "PARTIAL", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Representation", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 94, size: 32, align: 32, elements: !72, identifier: "_ZTSN6soplex6SoPlex14RepresentationE")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "ROW", value: -1)
!74 = !DIEnumerator(name: "COLUMN", value: 1)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex5TimerE", file: !76, line: 100, size: 32, align: 32, elements: !77, identifier: "_ZTSN6soplex5TimerUt_E")
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "RESET", value: 0)
!79 = !DIEnumerator(name: "STOPPED", value: 1)
!80 = !DIEnumerator(name: "RUNNING", value: 2)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 177, size: 32, align: 32, elements: !82, identifier: "_ZTSN6soplex6SoPlex6StatusE")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!83 = !DIEnumerator(name: "ERROR", value: -9)
!84 = !DIEnumerator(name: "NOT_INIT", value: -8)
!85 = !DIEnumerator(name: "ABORT_TIME", value: -7)
!86 = !DIEnumerator(name: "ABORT_ITER", value: -6)
!87 = !DIEnumerator(name: "ABORT_VALUE", value: -5)
!88 = !DIEnumerator(name: "SINGULAR", value: -4)
!89 = !DIEnumerator(name: "NO_PROBLEM", value: -3)
!90 = !DIEnumerator(name: "REGULAR", value: -2)
!91 = !DIEnumerator(name: "RUNNING", value: -1)
!92 = !DIEnumerator(name: "UNKNOWN", value: 0)
!93 = !DIEnumerator(name: "OPTIMAL", value: 1)
!94 = !DIEnumerator(name: "UNBOUNDED", value: 2)
!95 = !DIEnumerator(name: "INFEASIBLE", value: 3)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VarStatus", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 165, size: 32, align: 32, elements: !97, identifier: "_ZTSN6soplex6SoPlex9VarStatusE")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "ON_UPPER", value: 0)
!99 = !DIEnumerator(name: "ON_LOWER", value: 1)
!100 = !DIEnumerator(name: "FIXED", value: 2)
!101 = !DIEnumerator(name: "ZERO", value: 3)
!102 = !DIEnumerator(name: "BASIC", value: 4)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EE", file: !104, line: 87, size: 32, align: 32, elements: !105, identifier: "_ZTSN6soplex13DataHashTableINS_7NameSet4NameENS_7DataKeyEE7ElementIS2_S3_EUt_E")
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/datahashtable.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "FREE", value: 0)
!107 = !DIEnumerator(name: "RELEASED", value: 1)
!108 = !DIEnumerator(name: "USED", value: 2)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !110, line: 1280, size: 32, align: 32, elements: !111, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!110 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !{!112}
!112 = !DIEnumerator(name: "__short_mask", value: 1)
!113 = !{!114, !171, !175, !176, !183, !190, !205, !210, !214, !218, !255, !275, !842, !1118, !1254, !1380, !1463, !1551, !1555, !1630, !1752, !1802, !1847, !1963, !1990, !1994, !2021, !2063, !2120, !2165, !3, !2216, !2344, !10, !2381, !2394, !15, !2433, !2446, !2609, !2659, !2735, !21, !2883, !2958, !2959, !3315, !3352, !3356, !3366, !3421, !3424, !3429, !3434, !3438, !3481, !3485, !3487, !3497, !3502, !3503, !3506, !3509, !3522, !3533, !3540, !3544, !3548, !3585, !3588, !3590, !3591, !3592, !3593, !3595, !3606, !3635, !3656, !3673, !3775, !3880, !27, !3881, !3969, !4080, !4084, !4145, !4163, !4243, !4251, !4283, !4448, !4525, !4605, !32, !40, !4670, !4712, !51, !62, !67, !71, !4789, !75, !81, !4828, !4886, !4909, !4952, !4953, !4954, !4955, !96, !4956, !5031, !5110, !103, !4717, !5188, !5212, !5243, !5249, !5250, !5267, !249, !109, !5270, !5280, !5284, !154, !2457, !2552, !5285, !5356, !5374, !462, !121, !138, !5036, !5115, !4453}
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !115, line: 122, size: 1216, align: 64, elements: !116, identifier: "_ZTS7__sFILE")
!115 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!116 = !{!117, !120, !122, !123, !125, !126, !127, !128, !130, !134, !140, !150, !156, !157, !159, !160, !164, !168, !169, !170}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !115, line: 123, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !115, line: 124, baseType: !121, size: 32, align: 32, offset: 64)
!121 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !115, line: 125, baseType: !121, size: 32, align: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !115, line: 126, baseType: !124, size: 16, align: 16, offset: 128)
!124 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !115, line: 127, baseType: !124, size: 16, align: 16, offset: 144)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !115, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !115, line: 129, baseType: !121, size: 32, align: 32, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !115, line: 132, baseType: !129, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !115, line: 133, baseType: !131, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!121, !129}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !115, line: 134, baseType: !135, size: 64, align: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!121, !129, !138, !121}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !115, line: 135, baseType: !141, size: 64, align: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !129, !144, !121}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !115, line: 77, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !146, line: 71, baseType: !147)
!146 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 46, baseType: !149)
!148 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!149 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !115, line: 136, baseType: !151, size: 64, align: 64, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!121, !129, !154, !121}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !115, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !115, line: 140, baseType: !158, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !115, line: 141, baseType: !121, size: 32, align: 32, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !115, line: 144, baseType: !161, size: 24, align: 8, offset: 928)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 24, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !115, line: 145, baseType: !165, size: 8, align: 8, offset: 952)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !115, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !115, line: 151, baseType: !121, size: 32, align: 32, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !115, line: 152, baseType: !144, size: 64, align: 64, offset: 1152)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !115, line: 88, size: 128, align: 64, elements: !172, identifier: "_ZTS6__sbuf")
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !115, line: 89, baseType: !118, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !115, line: 90, baseType: !121, size: 32, align: 32, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !115, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !177, identifier: "_ZTS13__va_list_tag")
!177 = !{!178, !180, !181, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !179, size: 32, align: 32)
!179 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !179, size: 32, align: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !129, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !129, size: 64, align: 64, offset: 128)
!183 = !DICompositeType(tag: DW_TAG_union_type, file: !148, line: 76, size: 1024, align: 64, elements: !184, identifier: "_ZTS11__mbstate_t")
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !148, line: 77, baseType: !186, size: 1024, align: 8)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 1024, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !148, line: 78, baseType: !149, size: 64, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !191, line: 73, size: 448, align: 64, elements: !192, identifier: "_ZTS2tm")
!191 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !191, line: 74, baseType: !121, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !191, line: 75, baseType: !121, size: 32, align: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !191, line: 76, baseType: !121, size: 32, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !191, line: 77, baseType: !121, size: 32, align: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !191, line: 78, baseType: !121, size: 32, align: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !191, line: 79, baseType: !121, size: 32, align: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !191, line: 80, baseType: !121, size: 32, align: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !191, line: 81, baseType: !121, size: 32, align: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !191, line: 82, baseType: !121, size: 32, align: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !191, line: 83, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !191, line: 84, baseType: !138, size: 64, align: 64, offset: 384)
!205 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 82, size: 64, align: 32, elements: !207, identifier: "_ZTS5div_t")
!206 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !206, line: 83, baseType: !121, size: 32, align: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !206, line: 84, baseType: !121, size: 32, align: 32, offset: 32)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 87, size: 128, align: 64, elements: !211, identifier: "_ZTS6ldiv_t")
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !206, line: 88, baseType: !203, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !206, line: 89, baseType: !203, size: 64, align: 64, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 93, size: 128, align: 64, elements: !215, identifier: "_ZTS7lldiv_t")
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !206, line: 94, baseType: !149, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !206, line: 95, baseType: !149, size: 64, align: 64, offset: 64)
!218 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxWeightST", scope: !220, file: !219, line: 60, size: 1152, align: 64, elements: !222, vtableHolder: !"_ZTSN6soplex10SPxStarterE", identifier: "_ZTSN6soplex11SPxWeightSTE")
!219 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxweightst.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!220 = !DINamespace(name: "soplex", scope: null, file: !221, line: 49)
!221 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!222 = !{!223, !224, !225, !227, !228, !229, !230, !231, !232, !241, !245, !246, !252}
!223 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex11SPxWeightSTE", baseType: !"_ZTSN6soplex10SPxStarterE", flags: DIFlagPublic)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 62, baseType: !"_ZTSN6soplex9DataArrayIiEE", size: 192, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 64, baseType: !226, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9DataArrayIdEE", size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "coWeight", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 65, baseType: !226, size: 64, align: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rowWeight", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 70, baseType: !"_ZTSN6soplex9DataArrayIdEE", size: 192, align: 64, offset: 384, flags: DIFlagProtected)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "colWeight", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 72, baseType: !"_ZTSN6soplex9DataArrayIdEE", size: 192, align: 64, offset: 576, flags: DIFlagProtected)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "rowRight", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 75, baseType: !"_ZTSN6soplex9DataArrayIbEE", size: 192, align: 64, offset: 768, flags: DIFlagProtected)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "colUp", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 77, baseType: !"_ZTSN6soplex9DataArrayIbEE", size: 192, align: 64, offset: 960, flags: DIFlagProtected)
!232 = !DISubprogram(name: "setPrimalStatus", linkageName: "_ZN6soplex11SPxWeightST15setPrimalStatusERNS_8SPxBasis4DescERKNS_6SoPlexERKNS_5SPxIdE", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 66, type: !233, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !235, !236, !237, !239}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex11SPxWeightSTE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!236 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!237 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6SoPlexE")
!239 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxIdE")
!241 = !DISubprogram(name: "setupWeights", linkageName: "_ZN6soplex11SPxWeightST12setupWeightsERNS_6SoPlexE", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 84, type: !242, isLocal: false, isDefinition: false, scopeLine: 84, containingType: !"_ZTSN6soplex11SPxWeightSTE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !235, !244}
!244 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6SoPlexE")
!245 = !DISubprogram(name: "generate", linkageName: "_ZN6soplex11SPxWeightST8generateERNS_6SoPlexE", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 88, type: !242, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN6soplex11SPxWeightSTE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex11SPxWeightST12isConsistentEv", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 91, type: !247, isLocal: false, isDefinition: false, scopeLine: 91, containingType: !"_ZTSN6soplex11SPxWeightSTE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !250}
!249 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex11SPxWeightSTE")
!252 = !DISubprogram(name: "SPxWeightST", scope: !"_ZTSN6soplex11SPxWeightSTE", file: !219, line: 94, type: !253, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !235}
!255 = !DICompositeType(tag: DW_TAG_class_type, name: "SPxStarter", scope: !220, file: !256, line: 45, size: 64, align: 64, elements: !257, vtableHolder: !"_ZTSN6soplex10SPxStarterE", identifier: "_ZTSN6soplex10SPxStarterE")
!256 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxstarter.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!257 = !{!258, !263, !267, !270}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SPxStarter", scope: !256, file: !256, baseType: !259, size: 64, flags: DIFlagArtificial)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!121}
!263 = !DISubprogram(name: "generate", linkageName: "_ZN6soplex10SPxStarter8generateERNS_6SoPlexE", scope: !"_ZTSN6soplex10SPxStarterE", file: !256, line: 49, type: !264, isLocal: false, isDefinition: false, scopeLine: 49, containingType: !"_ZTSN6soplex10SPxStarterE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266, !244}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!267 = !DISubprogram(name: "~SPxStarter", scope: !"_ZTSN6soplex10SPxStarterE", file: !256, line: 52, type: !268, isLocal: false, isDefinition: false, scopeLine: 52, containingType: !"_ZTSN6soplex10SPxStarterE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !266}
!270 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex10SPxStarter12isConsistentEv", scope: !"_ZTSN6soplex10SPxStarterE", file: !256, line: 56, type: !271, isLocal: false, isDefinition: false, scopeLine: 56, containingType: !"_ZTSN6soplex10SPxStarterE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{!249, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SPxStarterE")
!275 = !DICompositeType(tag: DW_TAG_class_type, name: "SoPlex", scope: !220, file: !63, line: 77, size: 12416, align: 64, elements: !276, vtableHolder: !"_ZTSN6soplex5SPxLPE", identifier: "_ZTSN6soplex6SoPlexE")
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !287, !288, !289, !290, !291, !292, !293, !294, !295, !297, !299, !300, !301, !302, !303, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !322, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !339, !341, !343, !345, !347, !351, !354, !357, !360, !372, !377, !381, !384, !387, !390, !393, !396, !401, !404, !407, !410, !413, !416, !419, !420, !425, !428, !431, !434, !438, !439, !440, !441, !442, !445, !446, !447, !450, !451, !452, !455, !456, !457, !458, !459, !463, !464, !465, !470, !473, !476, !477, !478, !479, !480, !481, !482, !485, !488, !491, !492, !493, !496, !497, !498, !499, !500, !501, !504, !509, !512, !517, !520, !523, !526, !529, !530, !531, !534, !535, !538, !539, !544, !549, !554, !557, !558, !559, !560, !561, !562, !565, !566, !569, !570, !573, !576, !579, !580, !581, !582, !586, !589, !590, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !626, !627, !628, !632, !633, !634, !635, !636, !637, !642, !643, !648, !649, !652, !653, !654, !659, !663, !668, !673, !678, !682, !687, !688, !691, !695, !698, !699, !700, !701, !702, !703, !704, !707, !708, !709, !710, !711, !712, !713, !714, !715, !718, !719, !720, !721, !722, !723, !727, !733, !736, !739, !742, !745, !748, !751, !752, !753, !754, !755, !756, !757, !758, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !781, !784, !787, !788, !791, !792, !796, !801, !802, !803, !808, !813, !816, !817, !818, !819, !822, !823, !824, !825, !828, !831, !834, !835, !838, !841}
!277 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex5SPxLPE", flags: DIFlagPublic)
!278 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex6SoPlexE", baseType: !"_ZTSN6soplex8SPxBasisE", offset: 2816, flags: DIFlagProtected)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "theType", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 196, baseType: !"_ZTSN6soplex6SoPlex4TypeE", size: 32, align: 32, offset: 4480)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "thePricing", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 197, baseType: !"_ZTSN6soplex6SoPlex7PricingE", size: 32, align: 32, offset: 4512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "therep", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 198, baseType: !"_ZTSN6soplex6SoPlex14RepresentationE", size: 32, align: 32, offset: 4544)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "theTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 199, baseType: !"_ZTSN6soplex5TimerE", size: 448, align: 64, offset: 4608)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "maxIters", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 200, baseType: !121, size: 32, align: 32, offset: 5056)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 201, baseType: !285, size: 64, align: 64, offset: 5120)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !220, file: !221, line: 127, baseType: !286)
!286 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "maxValue", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 202, baseType: !285, size: 64, align: 64, offset: 5184)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "m_status", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 203, baseType: !"_ZTSN6soplex6SoPlex6StatusE", size: 32, align: 32, offset: 5248)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 205, baseType: !285, size: 64, align: 64, offset: 5312)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "theShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 206, baseType: !285, size: 64, align: 64, offset: 5376)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "lastShift", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 207, baseType: !285, size: 64, align: 64, offset: 5440)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "m_maxCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 208, baseType: !121, size: 32, align: 32, offset: 5504)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "m_numCycle", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 209, baseType: !121, size: 32, align: 32, offset: 5536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 210, baseType: !249, size: 8, align: 8, offset: 5568)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 212, baseType: !296, size: 64, align: 64, offset: 5632)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "solveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 213, baseType: !298, size: 64, align: 64, offset: 5696)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 214, baseType: !296, size: 64, align: 64, offset: 5760)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "coSolveVector2rhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 215, baseType: !298, size: 64, align: 64, offset: 5824)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cacheProductFactor", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 217, baseType: !285, size: 64, align: 64, offset: 5888)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "unitVecs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 220, baseType: !"_ZTSN6soplex5ArrayINS_10UnitVectorEEE", size: 128, align: 64, offset: 5952, flags: DIFlagProtected)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "thevectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 221, baseType: !304, size: 64, align: 64, offset: 6080, flags: DIFlagProtected)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "thecovectors", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 222, baseType: !304, size: 64, align: 64, offset: 6144, flags: DIFlagProtected)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nNZEs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 224, baseType: !121, size: 32, align: 32, offset: 6208, flags: DIFlagProtected)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "coVecDim", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 225, baseType: !121, size: 32, align: 32, offset: 6240, flags: DIFlagProtected)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "primRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 227, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 6272, flags: DIFlagProtected)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "primVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 228, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 6528, flags: DIFlagProtected)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dualRhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 229, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 7360, flags: DIFlagProtected)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dualVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 230, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 7616, flags: DIFlagProtected)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "addVec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 231, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 832, align: 64, offset: 8448, flags: DIFlagProtected)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "theURbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 233, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9280, flags: DIFlagProtected)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "theLRbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 234, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9536, flags: DIFlagProtected)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "theUCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 235, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 9792, flags: DIFlagProtected)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "theLCbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 236, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10048, flags: DIFlagProtected)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "theUBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 243, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10304, flags: DIFlagProtected)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "theLBbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 244, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 10560, flags: DIFlagProtected)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "theFrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 246, baseType: !321, size: 64, align: 64, offset: 10816, flags: DIFlagProtected)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "theFvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 247, baseType: !323, size: 64, align: 64, offset: 10880, flags: DIFlagProtected)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPrhs", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 249, baseType: !321, size: 64, align: 64, offset: 10944, flags: DIFlagProtected)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "theCoPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 250, baseType: !323, size: 64, align: 64, offset: 11008, flags: DIFlagProtected)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "thePvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 251, baseType: !323, size: 64, align: 64, offset: 11072, flags: DIFlagProtected)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "theRPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 254, baseType: !323, size: 64, align: 64, offset: 11136, flags: DIFlagProtected)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "theCPvec", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 256, baseType: !323, size: 64, align: 64, offset: 11200, flags: DIFlagProtected)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "theUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 260, baseType: !321, size: 64, align: 64, offset: 11264, flags: DIFlagProtected)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "theLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 261, baseType: !321, size: 64, align: 64, offset: 11328, flags: DIFlagProtected)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "theCoUbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 262, baseType: !321, size: 64, align: 64, offset: 11392, flags: DIFlagProtected)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "theCoLbound", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 263, baseType: !321, size: 64, align: 64, offset: 11456, flags: DIFlagProtected)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "theCoTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 266, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11520, flags: DIFlagProtected)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "theTest", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 267, baseType: !"_ZTSN6soplex7DVectorE", size: 256, align: 64, offset: 11776, flags: DIFlagProtected)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "leaveCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 269, baseType: !121, size: 32, align: 32, offset: 12032, flags: DIFlagProtected)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "enterCount", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 270, baseType: !121, size: 32, align: 32, offset: 12064, flags: DIFlagProtected)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "thepricer", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 272, baseType: !338, size: 64, align: 64, offset: 12096, flags: DIFlagProtected)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxPricerE", size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "theratiotester", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 273, baseType: !340, size: 64, align: 64, offset: 12160, flags: DIFlagProtected)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE", size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "thestarter", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 274, baseType: !342, size: 64, align: 64, offset: 12224, flags: DIFlagProtected)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SPxStarterE", size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "thescaler", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 275, baseType: !344, size: 64, align: 64, offset: 12288, flags: DIFlagProtected)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9SPxScalerE", size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "thesimplifier", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 276, baseType: !346, size: 64, align: 64, offset: 12352, flags: DIFlagProtected)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex13SPxSimplifierE", size: 64, align: 64)
!347 = !DISubprogram(name: "version", linkageName: "_ZNK6soplex6SoPlex7versionEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 280, type: !348, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{!121, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!351 = !DISubprogram(name: "rep", linkageName: "_ZNK6soplex6SoPlex3repEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 285, type: !352, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{!"_ZTSN6soplex6SoPlex14RepresentationE", !350}
!354 = !DISubprogram(name: "type", linkageName: "_ZNK6soplex6SoPlex4typeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 291, type: !355, isLocal: false, isDefinition: false, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{!"_ZTSN6soplex6SoPlex4TypeE", !350}
!357 = !DISubprogram(name: "pricing", linkageName: "_ZNK6soplex6SoPlex7pricingEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 297, type: !358, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubroutineType(types: !359)
!359 = !{!"_ZTSN6soplex6SoPlex7PricingE", !350}
!360 = !DISubprogram(name: "read", linkageName: "_ZN6soplex6SoPlex4readERNSt3__113basic_istreamIcNS1_11char_traitsIcEEEEPNS_7NameSetES8_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 329, type: !361, isLocal: false, isDefinition: false, scopeLine: 329, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!361 = !DISubroutineType(types: !362)
!362 = !{!249, !363, !364, !370, !370, !371}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6SoPlexE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!364 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "istream", scope: !367, file: !366, line: 146, baseType: !"_ZTSNSt3__113basic_istreamIcNS_11char_traitsIcEEEE")
!366 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!367 = !DINamespace(name: "__1", scope: !369, file: !368, line: 369)
!368 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!369 = !DINamespace(name: "std", scope: null, file: !368, line: 368)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7NameSetE", size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DIdxSetE", size: 64, align: 64)
!372 = !DISubprogram(name: "loadLP", linkageName: "_ZN6soplex6SoPlex6loadLPERKNS_5SPxLPE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 333, type: !373, isLocal: false, isDefinition: false, scopeLine: 333, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !363, !375}
!375 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SPxLPE")
!377 = !DISubprogram(name: "setSolver", linkageName: "_ZN6soplex6SoPlex9setSolverEPNS_10SLinSolverE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 335, type: !378, isLocal: false, isDefinition: false, scopeLine: 335, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !363, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64)
!381 = !DISubprogram(name: "setPricer", linkageName: "_ZN6soplex6SoPlex9setPricerEPNS_9SPxPricerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 337, type: !382, isLocal: false, isDefinition: false, scopeLine: 337, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !363, !338}
!384 = !DISubprogram(name: "setTester", linkageName: "_ZN6soplex6SoPlex9setTesterEPNS_14SPxRatioTesterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 339, type: !385, isLocal: false, isDefinition: false, scopeLine: 339, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !363, !340}
!387 = !DISubprogram(name: "setStarter", linkageName: "_ZN6soplex6SoPlex10setStarterEPNS_10SPxStarterE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 341, type: !388, isLocal: false, isDefinition: false, scopeLine: 341, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !363, !342}
!390 = !DISubprogram(name: "setScaler", linkageName: "_ZN6soplex6SoPlex9setScalerEPNS_9SPxScalerE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 343, type: !391, isLocal: false, isDefinition: false, scopeLine: 343, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !363, !344}
!393 = !DISubprogram(name: "setSimplifier", linkageName: "_ZN6soplex6SoPlex13setSimplifierEPNS_13SPxSimplifierE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 345, type: !394, isLocal: false, isDefinition: false, scopeLine: 345, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !363, !346}
!396 = !DISubprogram(name: "loadBasis", linkageName: "_ZN6soplex6SoPlex9loadBasisERKNS_8SPxBasis4DescE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 347, type: !397, isLocal: false, isDefinition: false, scopeLine: 347, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !363, !399}
!399 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4DescE")
!401 = !DISubprogram(name: "setRep", linkageName: "_ZN6soplex6SoPlex6setRepENS0_14RepresentationE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 350, type: !402, isLocal: false, isDefinition: false, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !363, !"_ZTSN6soplex6SoPlex14RepresentationE"}
!404 = !DISubprogram(name: "setType", linkageName: "_ZN6soplex6SoPlex7setTypeENS0_4TypeE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 352, type: !405, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !363, !"_ZTSN6soplex6SoPlex4TypeE"}
!407 = !DISubprogram(name: "setPricing", linkageName: "_ZN6soplex6SoPlex10setPricingENS0_7PricingE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 354, type: !408, isLocal: false, isDefinition: false, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !363, !"_ZTSN6soplex6SoPlex7PricingE"}
!410 = !DISubprogram(name: "reLoad", linkageName: "_ZN6soplex6SoPlex6reLoadEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 357, type: !411, isLocal: false, isDefinition: false, scopeLine: 357, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !363}
!413 = !DISubprogram(name: "readFile", linkageName: "_ZN6soplex6SoPlex8readFileEPKcPNS_7NameSetES4_PNS_7DIdxSetE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 360, type: !414, isLocal: false, isDefinition: false, scopeLine: 360, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{!249, !363, !154, !370, !370, !371}
!416 = !DISubprogram(name: "dumpFile", linkageName: "_ZNK6soplex6SoPlex8dumpFileEPKc", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 364, type: !417, isLocal: false, isDefinition: false, scopeLine: 364, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !350, !154}
!419 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6SoPlex5clearEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 367, type: !411, isLocal: false, isDefinition: false, scopeLine: 367, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!420 = !DISubprogram(name: "readBasisFile", linkageName: "_ZN6soplex6SoPlex13readBasisFileEPKcRKNS_7NameSetES5_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 370, type: !421, isLocal: false, isDefinition: false, scopeLine: 370, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!421 = !DISubroutineType(types: !422)
!422 = !{!249, !363, !154, !423, !423}
!423 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7NameSetE")
!425 = !DISubprogram(name: "solve", linkageName: "_ZN6soplex6SoPlex5solveEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 383, type: !426, isLocal: false, isDefinition: false, scopeLine: 383, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{!"_ZTSN6soplex6SoPlex6StatusE", !363}
!428 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex6SoPlex6statusEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 386, type: !429, isLocal: false, isDefinition: false, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{!"_ZTSN6soplex6SoPlex6StatusE", !350}
!431 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex6SoPlex5valueEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 392, type: !432, isLocal: false, isDefinition: false, scopeLine: 392, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!285, !350}
!434 = !DISubprogram(name: "getPrimal", linkageName: "_ZNK6soplex6SoPlex9getPrimalERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 401, type: !435, isLocal: false, isDefinition: false, scopeLine: 401, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!435 = !DISubroutineType(types: !436)
!436 = !{!"_ZTSN6soplex6SoPlex6StatusE", !350, !437}
!437 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!438 = !DISubprogram(name: "getPrimalUnscaled", linkageName: "_ZNK6soplex6SoPlex17getPrimalUnscaledERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 406, type: !435, isLocal: false, isDefinition: false, scopeLine: 406, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubprogram(name: "getSlacks", linkageName: "_ZNK6soplex6SoPlex9getSlacksERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 421, type: !435, isLocal: false, isDefinition: false, scopeLine: 421, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!440 = !DISubprogram(name: "getDual", linkageName: "_ZNK6soplex6SoPlex7getDualERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 447, type: !435, isLocal: false, isDefinition: false, scopeLine: 447, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!441 = !DISubprogram(name: "getRdCost", linkageName: "_ZNK6soplex6SoPlex9getRdCostERNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 460, type: !435, isLocal: false, isDefinition: false, scopeLine: 460, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!442 = !DISubprogram(name: "terminate", linkageName: "_ZN6soplex6SoPlex9terminateEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 478, type: !443, isLocal: false, isDefinition: false, scopeLine: 478, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!249, !363}
!445 = !DISubprogram(name: "epsilon", linkageName: "_ZNK6soplex6SoPlex7epsilonEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 487, type: !432, isLocal: false, isDefinition: false, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex6SoPlex5deltaEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 496, type: !432, isLocal: false, isDefinition: false, scopeLine: 496, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!447 = !DISubprogram(name: "setDelta", linkageName: "_ZN6soplex6SoPlex8setDeltaEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 501, type: !448, isLocal: false, isDefinition: false, scopeLine: 501, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !363, !285}
!450 = !DISubprogram(name: "maxCycle", linkageName: "_ZNK6soplex6SoPlex8maxCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 514, type: !348, isLocal: false, isDefinition: false, scopeLine: 514, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubprogram(name: "numCycle", linkageName: "_ZNK6soplex6SoPlex8numCycleEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 519, type: !348, isLocal: false, isDefinition: false, scopeLine: 519, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!452 = !DISubprogram(name: "localAddRows", linkageName: "_ZN6soplex6SoPlex12localAddRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 533, type: !453, isLocal: false, isDefinition: false, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !363, !121}
!455 = !DISubprogram(name: "localAddCols", linkageName: "_ZN6soplex6SoPlex12localAddColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 535, type: !453, isLocal: false, isDefinition: false, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true)
!456 = !DISubprogram(name: "addedRows", linkageName: "_ZN6soplex6SoPlex9addedRowsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 539, type: !453, isLocal: false, isDefinition: false, scopeLine: 539, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 57, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!457 = !DISubprogram(name: "addedCols", linkageName: "_ZN6soplex6SoPlex9addedColsEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 541, type: !453, isLocal: false, isDefinition: false, scopeLine: 541, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 58, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!458 = !DISubprogram(name: "doRemoveRow", linkageName: "_ZN6soplex6SoPlex11doRemoveRowEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 544, type: !453, isLocal: false, isDefinition: false, scopeLine: 544, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 53, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!459 = !DISubprogram(name: "doRemoveRows", linkageName: "_ZN6soplex6SoPlex12doRemoveRowsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 546, type: !460, isLocal: false, isDefinition: false, scopeLine: 546, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 55, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !363, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!463 = !DISubprogram(name: "doRemoveCol", linkageName: "_ZN6soplex6SoPlex11doRemoveColEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 548, type: !453, isLocal: false, isDefinition: false, scopeLine: 548, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 56, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!464 = !DISubprogram(name: "doRemoveCols", linkageName: "_ZN6soplex6SoPlex12doRemoveColsEPi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 550, type: !460, isLocal: false, isDefinition: false, scopeLine: 550, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 54, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!465 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 554, type: !466, isLocal: false, isDefinition: false, scopeLine: 554, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !363, !468}
!468 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!470 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 556, type: !471, isLocal: false, isDefinition: false, scopeLine: 556, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !363, !121, !285}
!473 = !DISubprogram(name: "changeObj", linkageName: "_ZN6soplex6SoPlex9changeObjENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 558, type: !474, isLocal: false, isDefinition: false, scopeLine: 558, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !363, !"_ZTSN6soplex8SPxColIdE", !285}
!476 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 563, type: !466, isLocal: false, isDefinition: false, scopeLine: 563, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 28, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 565, type: !471, isLocal: false, isDefinition: false, scopeLine: 565, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubprogram(name: "changeLower", linkageName: "_ZN6soplex6SoPlex11changeLowerENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 567, type: !474, isLocal: false, isDefinition: false, scopeLine: 567, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 572, type: !466, isLocal: false, isDefinition: false, scopeLine: 572, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 574, type: !471, isLocal: false, isDefinition: false, scopeLine: 574, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 32, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubprogram(name: "changeUpper", linkageName: "_ZN6soplex6SoPlex11changeUpperENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 576, type: !474, isLocal: false, isDefinition: false, scopeLine: 576, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 581, type: !483, isLocal: false, isDefinition: false, scopeLine: 581, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !363, !468, !468}
!485 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 583, type: !486, isLocal: false, isDefinition: false, scopeLine: 583, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 35, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !363, !121, !285, !285}
!488 = !DISubprogram(name: "changeBounds", linkageName: "_ZN6soplex6SoPlex12changeBoundsENS_8SPxColIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 585, type: !489, isLocal: false, isDefinition: false, scopeLine: 585, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 36, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !363, !"_ZTSN6soplex8SPxColIdE", !285, !285}
!491 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 591, type: !466, isLocal: false, isDefinition: false, scopeLine: 591, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!492 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 593, type: !471, isLocal: false, isDefinition: false, scopeLine: 593, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!493 = !DISubprogram(name: "changeLhs", linkageName: "_ZN6soplex6SoPlex9changeLhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 595, type: !494, isLocal: false, isDefinition: false, scopeLine: 595, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !363, !"_ZTSN6soplex8SPxRowIdE", !285}
!496 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsERKNS_6VectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 600, type: !466, isLocal: false, isDefinition: false, scopeLine: 600, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 40, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!497 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 602, type: !471, isLocal: false, isDefinition: false, scopeLine: 602, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 41, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubprogram(name: "changeRhs", linkageName: "_ZN6soplex6SoPlex9changeRhsENS_8SPxRowIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 604, type: !494, isLocal: false, isDefinition: false, scopeLine: 604, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 42, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeERKNS_6VectorES3_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 609, type: !483, isLocal: false, isDefinition: false, scopeLine: 609, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!500 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeEidd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 611, type: !486, isLocal: false, isDefinition: false, scopeLine: 611, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 44, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!501 = !DISubprogram(name: "changeRange", linkageName: "_ZN6soplex6SoPlex11changeRangeENS_8SPxRowIdEdd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 613, type: !502, isLocal: false, isDefinition: false, scopeLine: 613, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !363, !"_ZTSN6soplex8SPxRowIdE", !285, !285}
!504 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowEiRKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 619, type: !505, isLocal: false, isDefinition: false, scopeLine: 619, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !363, !121, !507}
!507 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPRowE")
!509 = !DISubprogram(name: "changeRow", linkageName: "_ZN6soplex6SoPlex9changeRowENS_8SPxRowIdERKNS_5LPRowE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 621, type: !510, isLocal: false, isDefinition: false, scopeLine: 621, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !363, !"_ZTSN6soplex8SPxRowIdE", !507}
!512 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColEiRKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 626, type: !513, isLocal: false, isDefinition: false, scopeLine: 626, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !363, !121, !515}
!515 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5LPColE")
!517 = !DISubprogram(name: "changeCol", linkageName: "_ZN6soplex6SoPlex9changeColENS_8SPxColIdERKNS_5LPColE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 628, type: !518, isLocal: false, isDefinition: false, scopeLine: 628, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !363, !"_ZTSN6soplex8SPxColIdE", !515}
!520 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementEiid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 633, type: !521, isLocal: false, isDefinition: false, scopeLine: 633, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !363, !121, !121, !285}
!523 = !DISubprogram(name: "changeElement", linkageName: "_ZN6soplex6SoPlex13changeElementENS_8SPxRowIdENS_8SPxColIdEd", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 635, type: !524, isLocal: false, isDefinition: false, scopeLine: 635, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !363, !"_ZTSN6soplex8SPxRowIdE", !"_ZTSN6soplex8SPxColIdE", !285}
!526 = !DISubprogram(name: "changeSense", linkageName: "_ZN6soplex6SoPlex11changeSenseENS_5SPxLP8SPxSenseE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 641, type: !527, isLocal: false, isDefinition: false, scopeLine: 641, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !363, !"_ZTSN6soplex5SPxLP8SPxSenseE"}
!529 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6SoPlex3dimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 645, type: !348, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubprogram(name: "coDim", linkageName: "_ZNK6soplex6SoPlex5coDimEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 650, type: !348, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubprogram(name: "id", linkageName: "_ZNK6soplex6SoPlex2idEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 666, type: !532, isLocal: false, isDefinition: false, scopeLine: 666, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!532 = !DISubroutineType(types: !533)
!533 = !{!"_ZTSN6soplex5SPxIdE", !350, !121}
!534 = !DISubprogram(name: "coId", linkageName: "_ZNK6soplex6SoPlex4coIdEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 685, type: !532, isLocal: false, isDefinition: false, scopeLine: 685, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubprogram(name: "isId", linkageName: "_ZNK6soplex6SoPlex4isIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 703, type: !536, isLocal: false, isDefinition: false, scopeLine: 703, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubroutineType(types: !537)
!537 = !{!121, !350, !"_ZTSN6soplex5SPxIdE"}
!538 = !DISubprogram(name: "isCoId", linkageName: "_ZNK6soplex6SoPlex6isCoIdENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 712, type: !536, isLocal: false, isDefinition: false, scopeLine: 712, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!539 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 724, type: !540, isLocal: false, isDefinition: false, scopeLine: 724, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !350, !121}
!542 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!544 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 730, type: !545, isLocal: false, isDefinition: false, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{!542, !350, !547}
!547 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxRowIdE")
!549 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 738, type: !550, isLocal: false, isDefinition: false, scopeLine: 738, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!550 = !DISubroutineType(types: !551)
!551 = !{!542, !350, !552}
!552 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxColIdE")
!554 = !DISubprogram(name: "vector", linkageName: "_ZNK6soplex6SoPlex6vectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 755, type: !555, isLocal: false, isDefinition: false, scopeLine: 755, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{!542, !350, !239}
!557 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 768, type: !540, isLocal: false, isDefinition: false, scopeLine: 768, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 773, type: !545, isLocal: false, isDefinition: false, scopeLine: 773, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 781, type: !550, isLocal: false, isDefinition: false, scopeLine: 781, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubprogram(name: "coVector", linkageName: "_ZNK6soplex6SoPlex8coVectorERKNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 795, type: !555, isLocal: false, isDefinition: false, scopeLine: 795, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!561 = !DISubprogram(name: "unitVector", linkageName: "_ZNK6soplex6SoPlex10unitVectorEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 803, type: !540, isLocal: false, isDefinition: false, scopeLine: 803, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubprogram(name: "varStatus", linkageName: "_ZNK6soplex6SoPlex9varStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 816, type: !563, isLocal: false, isDefinition: false, scopeLine: 816, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!563 = !DISubroutineType(types: !564)
!564 = !{!"_ZTSN6soplex8SPxBasis4Desc6StatusE", !350, !121}
!565 = !DISubprogram(name: "covarStatus", linkageName: "_ZNK6soplex6SoPlex11covarStatusEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 822, type: !563, isLocal: false, isDefinition: false, scopeLine: 822, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!566 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 828, type: !567, isLocal: false, isDefinition: false, scopeLine: 828, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!567 = !DISubroutineType(types: !568)
!568 = !{!121, !350, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!569 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 834, type: !536, isLocal: false, isDefinition: false, scopeLine: 834, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxRowIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 843, type: !571, isLocal: false, isDefinition: false, scopeLine: 843, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{!121, !350, !"_ZTSN6soplex8SPxRowIdE"}
!573 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicENS_8SPxColIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 849, type: !574, isLocal: false, isDefinition: false, scopeLine: 849, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubroutineType(types: !575)
!575 = !{!121, !350, !"_ZTSN6soplex8SPxColIdE"}
!576 = !DISubprogram(name: "isRowBasic", linkageName: "_ZNK6soplex6SoPlex10isRowBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 855, type: !577, isLocal: false, isDefinition: false, scopeLine: 855, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!577 = !DISubroutineType(types: !578)
!578 = !{!121, !350, !121}
!579 = !DISubprogram(name: "isColBasic", linkageName: "_ZNK6soplex6SoPlex10isColBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 861, type: !577, isLocal: false, isDefinition: false, scopeLine: 861, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!580 = !DISubprogram(name: "isBasic", linkageName: "_ZNK6soplex6SoPlex7isBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 867, type: !577, isLocal: false, isDefinition: false, scopeLine: 867, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!581 = !DISubprogram(name: "isCoBasic", linkageName: "_ZNK6soplex6SoPlex9isCoBasicEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 873, type: !577, isLocal: false, isDefinition: false, scopeLine: 873, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubprogram(name: "fVec", linkageName: "_ZNK6soplex6SoPlex4fVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 888, type: !583, isLocal: false, isDefinition: false, scopeLine: 888, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !350}
!585 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!586 = !DISubprogram(name: "fRhs", linkageName: "_ZNK6soplex6SoPlex4fRhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 901, type: !587, isLocal: false, isDefinition: false, scopeLine: 901, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubroutineType(types: !588)
!588 = !{!468, !350}
!589 = !DISubprogram(name: "ubBound", linkageName: "_ZNK6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 906, type: !587, isLocal: false, isDefinition: false, scopeLine: 906, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubprogram(name: "ubBound", linkageName: "_ZN6soplex6SoPlex7ubBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 919, type: !591, isLocal: false, isDefinition: false, scopeLine: 919, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!591 = !DISubroutineType(types: !592)
!592 = !{!437, !363}
!593 = !DISubprogram(name: "lbBound", linkageName: "_ZNK6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 924, type: !587, isLocal: false, isDefinition: false, scopeLine: 924, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubprogram(name: "lbBound", linkageName: "_ZN6soplex6SoPlex7lbBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 937, type: !591, isLocal: false, isDefinition: false, scopeLine: 937, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubprogram(name: "fTest", linkageName: "_ZNK6soplex6SoPlex5fTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 950, type: !587, isLocal: false, isDefinition: false, scopeLine: 950, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "coPvec", linkageName: "_ZNK6soplex6SoPlex6coPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 963, type: !583, isLocal: false, isDefinition: false, scopeLine: 963, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubprogram(name: "coPrhs", linkageName: "_ZNK6soplex6SoPlex6coPrhsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 976, type: !587, isLocal: false, isDefinition: false, scopeLine: 976, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubprogram(name: "ucBound", linkageName: "_ZNK6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 982, type: !587, isLocal: false, isDefinition: false, scopeLine: 982, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "ucBound", linkageName: "_ZN6soplex6SoPlex7ucBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 996, type: !591, isLocal: false, isDefinition: false, scopeLine: 996, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubprogram(name: "lcBound", linkageName: "_ZNK6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1003, type: !587, isLocal: false, isDefinition: false, scopeLine: 1003, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubprogram(name: "lcBound", linkageName: "_ZN6soplex6SoPlex7lcBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1017, type: !591, isLocal: false, isDefinition: false, scopeLine: 1017, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1030, type: !587, isLocal: false, isDefinition: false, scopeLine: 1030, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "pVec", linkageName: "_ZNK6soplex6SoPlex4pVecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1043, type: !583, isLocal: false, isDefinition: false, scopeLine: 1043, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "upBound", linkageName: "_ZNK6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1048, type: !587, isLocal: false, isDefinition: false, scopeLine: 1048, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "upBound", linkageName: "_ZN6soplex6SoPlex7upBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1062, type: !591, isLocal: false, isDefinition: false, scopeLine: 1062, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubprogram(name: "lpBound", linkageName: "_ZNK6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1069, type: !587, isLocal: false, isDefinition: false, scopeLine: 1069, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!607 = !DISubprogram(name: "lpBound", linkageName: "_ZN6soplex6SoPlex7lpBoundEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1083, type: !591, isLocal: false, isDefinition: false, scopeLine: 1083, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!608 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1096, type: !587, isLocal: false, isDefinition: false, scopeLine: 1096, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1103, type: !610, isLocal: false, isDefinition: false, scopeLine: 1103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!610 = !DISubroutineType(types: !611)
!611 = !{!285, !363, !121}
!612 = !DISubprogram(name: "computePvec", linkageName: "_ZN6soplex6SoPlex11computePvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1105, type: !411, isLocal: false, isDefinition: false, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1107, type: !610, isLocal: false, isDefinition: false, scopeLine: 1107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubprogram(name: "computeTest", linkageName: "_ZN6soplex6SoPlex11computeTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1109, type: !411, isLocal: false, isDefinition: false, scopeLine: 1109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "shiftFvec", linkageName: "_ZN6soplex6SoPlex9shiftFvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1135, type: !411, isLocal: false, isDefinition: false, scopeLine: 1135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubprogram(name: "shiftPvec", linkageName: "_ZN6soplex6SoPlex9shiftPvecEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1137, type: !411, isLocal: false, isDefinition: false, scopeLine: 1137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubprogram(name: "shiftUBbound", linkageName: "_ZN6soplex6SoPlex12shiftUBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1140, type: !471, isLocal: false, isDefinition: false, scopeLine: 1140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubprogram(name: "shiftLBbound", linkageName: "_ZN6soplex6SoPlex12shiftLBboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1147, type: !471, isLocal: false, isDefinition: false, scopeLine: 1147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!619 = !DISubprogram(name: "shiftUPbound", linkageName: "_ZN6soplex6SoPlex12shiftUPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1154, type: !471, isLocal: false, isDefinition: false, scopeLine: 1154, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!620 = !DISubprogram(name: "shiftLPbound", linkageName: "_ZN6soplex6SoPlex12shiftLPboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1161, type: !471, isLocal: false, isDefinition: false, scopeLine: 1161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!621 = !DISubprogram(name: "shiftUCbound", linkageName: "_ZN6soplex6SoPlex12shiftUCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1168, type: !471, isLocal: false, isDefinition: false, scopeLine: 1168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubprogram(name: "shiftLCbound", linkageName: "_ZN6soplex6SoPlex12shiftLCboundEid", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1175, type: !471, isLocal: false, isDefinition: false, scopeLine: 1175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubprogram(name: "testBounds", linkageName: "_ZNK6soplex6SoPlex10testBoundsEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1182, type: !624, isLocal: false, isDefinition: false, scopeLine: 1182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !350}
!626 = !DISubprogram(name: "shift", linkageName: "_ZNK6soplex6SoPlex5shiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1185, type: !432, isLocal: false, isDefinition: false, scopeLine: 1185, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubprogram(name: "unShift", linkageName: "_ZN6soplex6SoPlex7unShiftEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1190, type: !411, isLocal: false, isDefinition: false, scopeLine: 1190, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 82, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!628 = !DISubprogram(name: "qualConstraintViolation", linkageName: "_ZNK6soplex6SoPlex23qualConstraintViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1193, type: !629, isLocal: false, isDefinition: false, scopeLine: 1193, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !350, !631, !631}
!631 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !286)
!632 = !DISubprogram(name: "qualConstraintViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex31qualConstraintViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1197, type: !629, isLocal: false, isDefinition: false, scopeLine: 1197, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubprogram(name: "qualBoundViolation", linkageName: "_ZNK6soplex6SoPlex18qualBoundViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1201, type: !629, isLocal: false, isDefinition: false, scopeLine: 1201, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!634 = !DISubprogram(name: "qualBoundViolationUnscaled", linkageName: "_ZNK6soplex6SoPlex26qualBoundViolationUnscaledERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1205, type: !629, isLocal: false, isDefinition: false, scopeLine: 1205, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubprogram(name: "qualSlackViolation", linkageName: "_ZNK6soplex6SoPlex18qualSlackViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1209, type: !629, isLocal: false, isDefinition: false, scopeLine: 1209, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!636 = !DISubprogram(name: "qualRdCostViolation", linkageName: "_ZNK6soplex6SoPlex19qualRdCostViolationERdS1_", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1212, type: !629, isLocal: false, isDefinition: false, scopeLine: 1212, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1216, type: !638, isLocal: false, isDefinition: false, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: true)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !363, !640, !437, !437, !285, !121, !121}
!640 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!642 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_dii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1220, type: !638, isLocal: false, isDefinition: false, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true)
!643 = !DISubprogram(name: "perturbMin", linkageName: "_ZN6soplex6SoPlex10perturbMinERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1224, type: !644, isLocal: false, isDefinition: false, scopeLine: 1224, flags: DIFlagPrototyped, isOptimized: true)
!644 = !DISubroutineType(types: !645)
!645 = !{!285, !363, !640, !437, !437, !285, !285, !646, !121, !121}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasis4Desc6StatusE")
!648 = !DISubprogram(name: "perturbMax", linkageName: "_ZN6soplex6SoPlex10perturbMaxERKNS_12UpdateVectorERNS_6VectorES5_ddPKNS_8SPxBasis4Desc6StatusEii", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1228, type: !644, isLocal: false, isDefinition: false, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: true)
!649 = !DISubprogram(name: "setup4solve", linkageName: "_ZN6soplex6SoPlex11setup4solveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1259, type: !650, isLocal: false, isDefinition: false, scopeLine: 1259, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !363, !296, !298}
!652 = !DISubprogram(name: "setup4coSolve", linkageName: "_ZN6soplex6SoPlex13setup4coSolveEPNS_6VectorEPNS_8SSVectorE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1273, type: !650, isLocal: false, isDefinition: false, scopeLine: 1273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!653 = !DISubprogram(name: "maxInfeas", linkageName: "_ZNK6soplex6SoPlex9maxInfeasEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1286, type: !432, isLocal: false, isDefinition: false, scopeLine: 1286, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!654 = !DISubprogram(name: "basis", linkageName: "_ZNK6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1294, type: !655, isLocal: false, isDefinition: false, scopeLine: 1294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !350}
!657 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!659 = !DISubprogram(name: "basis", linkageName: "_ZN6soplex6SoPlex5basisEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1299, type: !660, isLocal: false, isDefinition: false, scopeLine: 1299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !363}
!662 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SPxBasisE")
!663 = !DISubprogram(name: "pricer", linkageName: "_ZNK6soplex6SoPlex6pricerEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1304, type: !664, isLocal: false, isDefinition: false, scopeLine: 1304, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !350}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9SPxPricerE")
!668 = !DISubprogram(name: "slinSolver", linkageName: "_ZNK6soplex6SoPlex10slinSolverEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1309, type: !669, isLocal: false, isDefinition: false, scopeLine: 1309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!669 = !DISubroutineType(types: !670)
!670 = !{!671, !350}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SLinSolverE")
!673 = !DISubprogram(name: "ratiotester", linkageName: "_ZNK6soplex6SoPlex11ratiotesterEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1314, type: !674, isLocal: false, isDefinition: false, scopeLine: 1314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !350}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex14SPxRatioTesterE")
!678 = !DISubprogram(name: "starter", linkageName: "_ZNK6soplex6SoPlex7starterEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1319, type: !679, isLocal: false, isDefinition: false, scopeLine: 1319, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !350}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!682 = !DISubprogram(name: "simplifier", linkageName: "_ZNK6soplex6SoPlex10simplifierEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1324, type: !683, isLocal: false, isDefinition: false, scopeLine: 1324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !350}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex13SPxSimplifierE")
!687 = !DISubprogram(name: "factorize", linkageName: "_ZN6soplex6SoPlex9factorizeEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1331, type: !411, isLocal: false, isDefinition: false, scopeLine: 1331, containingType: !"_ZTSN6soplex6SoPlexE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 90, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!688 = !DISubprogram(name: "leave", linkageName: "_ZN6soplex6SoPlex5leaveEi", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1334, type: !689, isLocal: false, isDefinition: false, scopeLine: 1334, flags: DIFlagPrototyped, isOptimized: true)
!689 = !DISubroutineType(types: !690)
!690 = !{!121, !363, !121}
!691 = !DISubprogram(name: "enter", linkageName: "_ZN6soplex6SoPlex5enterERNS_5SPxIdE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1335, type: !692, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPrototyped, isOptimized: true)
!692 = !DISubroutineType(types: !693)
!693 = !{!121, !363, !694}
!694 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SPxIdE")
!695 = !DISubprogram(name: "coTest", linkageName: "_ZNK6soplex6SoPlex6coTestEiNS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1338, type: !696, isLocal: false, isDefinition: false, scopeLine: 1338, flags: DIFlagPrototyped, isOptimized: true)
!696 = !DISubroutineType(types: !697)
!697 = !{!285, !350, !121, !"_ZTSN6soplex8SPxBasis4Desc6StatusE"}
!698 = !DISubprogram(name: "computeCoTest", linkageName: "_ZN6soplex6SoPlex13computeCoTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1340, type: !411, isLocal: false, isDefinition: false, scopeLine: 1340, flags: DIFlagPrototyped, isOptimized: true)
!699 = !DISubprogram(name: "updateCoTest", linkageName: "_ZN6soplex6SoPlex12updateCoTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1342, type: !411, isLocal: false, isDefinition: false, scopeLine: 1342, flags: DIFlagPrototyped, isOptimized: true)
!700 = !DISubprogram(name: "test", linkageName: "_ZNK6soplex6SoPlex4testEiNS_8SPxBasis4Desc6StatusE", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1345, type: !696, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPrototyped, isOptimized: true)
!701 = !DISubprogram(name: "updateTest", linkageName: "_ZN6soplex6SoPlex10updateTestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1347, type: !411, isLocal: false, isDefinition: false, scopeLine: 1347, flags: DIFlagPrototyped, isOptimized: true)
!702 = !DISubprogram(name: "computeFtest", linkageName: "_ZN6soplex6SoPlex12computeFtestEv", scope: !"_ZTSN6soplex6SoPlexE", file: !63, line: 1350, type: !411, isLocal: false, isDefinition: false, scopeLine: 1350, flags: DIFlagPrototyped, isOptimized: true)
