; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::locale::id" = type <{ %"struct.std::__1::once_flag", i32, [4 x i8] }>
%"struct.std::__1::once_flag" = type { i64 }
%"class.soplex::SSVector" = type { %"class.soplex::DVector", %"class.soplex::IdxSet", i8, double }
%"class.soplex::DVector" = type { %"class.soplex::Vector", i32, double* }
%"class.soplex::Vector" = type { i32, double* }
%"class.soplex::IdxSet" = type { i32, i32, i32* }
%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
%"class.std::__1::locale::__imp" = type opaque
%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
%"class.std::__1::ctype" = type <{ %"class.std::__1::locale::facet", i32*, i8, [7 x i8] }>
%"class.soplex::SVector" = type { %"struct.soplex::SVector::Element"* }
%"struct.soplex::SVector::Element" = type { double, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !2512, globals: !3137, imports: !3139)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !15, line: 1280, size: 32, align: 32, elements: !16, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEUt_E")
!15 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17}
!17 = !DIEnumerator(name: "__short_mask", value: 1)
!18 = !{!19, !76, !80, !81, !88, !95, !110, !115, !119, !123, !264, !314, !391, !484, !488, !533, !661, !739, !855, !882, !886, !913, !955, !26, !571, !133, !1012, !188, !1023, !1076, !1205, !1281, !3, !1431, !1506, !1507, !1863, !1898, !1902, !1912, !1967, !1970, !1975, !1980, !1984, !2027, !2031, !2033, !2043, !2048, !2049, !2052, !2055, !2068, !2079, !2086, !2090, !2094, !2131, !2134, !2136, !2137, !2138, !2139, !2141, !2152, !2181, !2202, !2219, !2325, !9, !2326, !2350, !2381, !2387, !2388, !2405, !131, !14, !2408, !2418, !2422, !59, !1089, !1061, !2423, !2494}
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !21, identifier: "_ZTS7__sFILE")
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !{!22, !25, !27, !28, !30, !31, !32, !33, !35, !39, !45, !55, !61, !62, !64, !65, !69, !73, !74, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !20, line: 123, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !20, line: 124, baseType: !26, size: 32, align: 32, offset: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !20, line: 125, baseType: !26, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !20, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !20, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !20, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !20, line: 129, baseType: !26, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !20, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !20, line: 133, baseType: !36, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!26, !34}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !20, line: 134, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!26, !34, !43, !26}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !20, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !34, !49, !26}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !20, line: 136, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!26, !34, !59, !26}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !20, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !20, line: 140, baseType: !63, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !20, line: 141, baseType: !26, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !20, line: 144, baseType: !66, size: 24, align: 8, offset: 928)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !20, line: 145, baseType: !70, size: 8, align: 8, offset: 952)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !20, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !20, line: 151, baseType: !26, size: 32, align: 32, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !20, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !77, identifier: "_ZTS6__sbuf")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !20, line: 89, baseType: !23, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !20, line: 90, baseType: !26, size: 32, align: 32, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !82, identifier: "_ZTS13__va_list_tag")
!82 = !{!83, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !84, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_union_type, file: !53, line: 76, size: 1024, align: 64, elements: !89, identifier: "_ZTS11__mbstate_t")
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !53, line: 77, baseType: !91, size: 1024, align: 8)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !53, line: 78, baseType: !54, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !96, line: 73, size: 448, align: 64, elements: !97, identifier: "_ZTS2tm")
!96 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !96, line: 74, baseType: !26, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !96, line: 75, baseType: !26, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !96, line: 76, baseType: !26, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !96, line: 77, baseType: !26, size: 32, align: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !96, line: 78, baseType: !26, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !96, line: 79, baseType: !26, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !96, line: 80, baseType: !26, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !96, line: 81, baseType: !26, size: 32, align: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !96, line: 82, baseType: !26, size: 32, align: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !96, line: 83, baseType: !108, size: 64, align: 64, offset: 320)
!108 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !96, line: 84, baseType: !43, size: 64, align: 64, offset: 384)
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 82, size: 64, align: 32, elements: !112, identifier: "_ZTS5div_t")
!111 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !111, line: 83, baseType: !26, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !111, line: 84, baseType: !26, size: 32, align: 32, offset: 32)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 87, size: 128, align: 64, elements: !116, identifier: "_ZTS6ldiv_t")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !111, line: 88, baseType: !108, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !111, line: 89, baseType: !108, size: 64, align: 64, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 93, size: 128, align: 64, elements: !120, identifier: "_ZTS7lldiv_t")
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !111, line: 94, baseType: !54, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !111, line: 95, baseType: !54, size: 64, align: 64, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "SSVector", scope: !125, file: !124, line: 50, size: 512, align: 64, elements: !127, identifier: "_ZTSN6soplex8SSVectorE")
!124 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!125 = !DINamespace(name: "soplex", scope: null, file: !126, line: 49)
!126 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !{!128, !129, !130, !132, !135, !139, !143, !148, !151, !152, !153, !156, !159, !160, !163, !166, !167, !168, !169, !170, !175, !180, !185, !189, !190, !194, !200, !205, !209, !210, !211, !212, !215, !218, !221, !224, !229, !232, !235, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !250, !253, !256, !257, !258, !259, !260, !261, !262, !263}
!128 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex7DVectorE", flags: DIFlagProtected)
!129 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex6IdxSetE", offset: 256, flags: DIFlagProtected)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "setupStatus", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 53, baseType: !131, size: 8, align: 8, offset: 384)
!131 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 64, baseType: !133, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !125, file: !126, line: 127, baseType: !134)
!134 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!135 = !DISubprogram(name: "setMax", linkageName: "_ZN6soplex8SSVector6setMaxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 59, type: !136, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138, !26}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!139 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex8SSVector7get_ptrEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 85, type: !140, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !138}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!143 = !DISubprogram(name: "isSetup", linkageName: "_ZNK6soplex8SSVector7isSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 91, type: !144, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{!131, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!148 = !DISubprogram(name: "unSetup", linkageName: "_ZN6soplex8SSVector7unSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 97, type: !149, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !138}
!151 = !DISubprogram(name: "setup", linkageName: "_ZN6soplex8SSVector5setupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 106, type: !149, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!152 = !DISubprogram(name: "forceSetup", linkageName: "_ZN6soplex8SSVector10forceSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 109, type: !149, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex8SSVector5indexEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 119, type: !154, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{!26, !146, !26}
!156 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex8SSVector5valueEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 126, type: !157, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!157 = !DISubroutineType(types: !158)
!158 = !{!133, !146, !26}
!159 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex8SSVector6numberEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 134, type: !154, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!160 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex8SSVector4sizeEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 141, type: !161, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!161 = !DISubroutineType(types: !162)
!162 = !{!26, !146}
!163 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8SSVector3addEid", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 150, type: !164, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !138, !26, !133}
!166 = !DISubprogram(name: "setValue", linkageName: "_ZN6soplex8SSVector8setValueEid", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 159, type: !164, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!167 = !DISubprogram(name: "clearIdx", linkageName: "_ZN6soplex8SSVector8clearIdxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 162, type: !136, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!168 = !DISubprogram(name: "clearNum", linkageName: "_ZN6soplex8SSVector8clearNumEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 174, type: !136, isLocal: false, isDefinition: false, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!169 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex8SSVectorixEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 187, type: !157, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubprogram(name: "indexMem", linkageName: "_ZNK6soplex8SSVector8indexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 193, type: !171, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !146}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!175 = !DISubprogram(name: "values", linkageName: "_ZNK6soplex8SSVector6valuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 199, type: !176, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !146}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!180 = !DISubprogram(name: "indices", linkageName: "_ZNK6soplex8SSVector7indicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 205, type: !181, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !146}
!183 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6IdxSetE")
!185 = !DISubprogram(name: "altIndexMem", linkageName: "_ZN6soplex8SSVector11altIndexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 211, type: !186, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !138}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!189 = !DISubprogram(name: "altValues", linkageName: "_ZN6soplex8SSVector9altValuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 218, type: !140, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubprogram(name: "altIndices", linkageName: "_ZN6soplex8SSVector10altIndicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 225, type: !191, isLocal: false, isDefinition: false, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !138}
!193 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6IdxSetE")
!194 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 236, type: !195, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !138, !198}
!197 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!198 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!200 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 238, type: !201, isLocal: false, isDefinition: false, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!201 = !DISubroutineType(types: !202)
!202 = !{!197, !138, !203}
!203 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!205 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 240, type: !206, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubroutineType(types: !207)
!207 = !{!197, !138, !208}
!208 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !147)
!209 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 243, type: !195, isLocal: false, isDefinition: false, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 245, type: !201, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 247, type: !206, isLocal: false, isDefinition: false, scopeLine: 247, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex8SSVectormLEd", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 250, type: !213, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubroutineType(types: !214)
!214 = !{!197, !138, !133}
!215 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 253, type: !216, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!197, !138, !133, !208}
!218 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 255, type: !219, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{!197, !138, !133, !203}
!221 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 257, type: !222, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!222 = !DISubroutineType(types: !223)
!223 = !{!197, !138, !133, !198}
!224 = !DISubprogram(name: "assign2product", linkageName: "_ZN6soplex8SSVector14assign2productERKS0_RKNS_5SVSetE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 260, type: !225, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!225 = !DISubroutineType(types: !226)
!226 = !{!197, !138, !208, !227}
!227 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!229 = !DISubprogram(name: "assign2product4setup", linkageName: "_ZN6soplex8SSVector20assign2product4setupERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 262, type: !230, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!197, !138, !227, !208}
!232 = !DISubprogram(name: "assign2productAndSetup", linkageName: "_ZN6soplex8SSVector22assign2productAndSetupERKNS_5SVSetERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 264, type: !233, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{!197, !138, !227, !197}
!235 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex8SSVector6maxAbsEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 267, type: !236, isLocal: false, isDefinition: false, scopeLine: 267, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!236 = !DISubroutineType(types: !237)
!237 = !{!133, !146}
!238 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex8SSVector6lengthEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 269, type: !236, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex8SSVector7length2Ev", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 271, type: !236, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!240 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex8SSVector3dimEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 278, type: !161, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!241 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SSVector5reDimEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 284, type: !136, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubprogram(name: "setSize", linkageName: "_ZN6soplex8SSVector7setSizeEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 287, type: !136, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubprogram(name: "reMem", linkageName: "_ZN6soplex8SSVector5reMemEi", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 296, type: !136, isLocal: false, isDefinition: false, scopeLine: 296, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!244 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex8SSVector5clearEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 299, type: !149, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!245 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SSVector12isConsistentEv", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 302, type: !144, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 309, type: !164, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!247 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 322, type: !248, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !138, !208}
!250 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 334, type: !251, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !138, !198, !133}
!253 = !DISubprogram(name: "setup_and_assign", linkageName: "_ZN6soplex8SSVector16setup_and_assignERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 345, type: !254, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !138, !197}
!256 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex8SSVector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 348, type: !201, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!257 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 351, type: !206, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 353, type: !201, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 355, type: !195, isLocal: false, isDefinition: false, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DISubprogram(name: "~SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 362, type: !149, isLocal: false, isDefinition: false, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!261 = !DISubprogram(name: "assign2product1", linkageName: "_ZN6soplex8SSVector15assign2product1ERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 371, type: !230, isLocal: false, isDefinition: false, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true)
!262 = !DISubprogram(name: "assign2productShort", linkageName: "_ZN6soplex8SSVector19assign2productShortERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 372, type: !230, isLocal: false, isDefinition: false, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: true)
!263 = !DISubprogram(name: "assign2productFull", linkageName: "_ZN6soplex8SSVector18assign2productFullERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !124, line: 373, type: !230, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPrototyped, isOptimized: true)
!264 = !DICompositeType(tag: DW_TAG_class_type, name: "DVector", scope: !125, file: !265, line: 55, size: 256, align: 64, elements: !266, identifier: "_ZTSN6soplex7DVectorE")
!265 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!266 = !{!267, !268, !269, !270, !275, !278, !279, !280, !283, !286, !287, !290, !295, !298, !299, !302, !306, !307, !310, !311}
!267 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex7DVectorE", baseType: !"_ZTSN6soplex6VectorE", flags: DIFlagPublic)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "memsize", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 57, baseType: !26, size: 32, align: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 58, baseType: !142, size: 64, align: 64, offset: 192)
!270 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 92, type: !271, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !274, !198}
!273 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DVectorE")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!275 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 98, type: !276, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!276 = !DISubroutineType(types: !277)
!277 = !{!273, !274, !203}
!278 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 105, type: !271, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!279 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 111, type: !276, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7DVectormLEd", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 118, type: !281, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{!273, !274, !133}
!283 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex7DVector5reDimEi", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 125, type: !284, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !274, !26}
!286 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEi", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 128, type: !284, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEii", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 131, type: !288, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !274, !26, !26}
!290 = !DISubprogram(name: "memSize", linkageName: "_ZNK6soplex7DVector7memSizeEv", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 134, type: !291, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{!26, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DVectorE")
!295 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7DVector12isConsistentEv", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 140, type: !296, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!296 = !DISubroutineType(types: !297)
!297 = !{!131, !293}
!298 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 143, type: !284, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!299 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 146, type: !300, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !274, !198}
!302 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 148, type: !303, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !274, !305}
!305 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !294)
!306 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 151, type: !271, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKS0_", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 159, type: !308, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!308 = !DISubroutineType(types: !309)
!309 = !{!273, !274, !305}
!310 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 170, type: !276, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!311 = !DISubprogram(name: "~DVector", scope: !"_ZTSN6soplex7DVectorE", file: !265, line: 180, type: !312, isLocal: false, isDefinition: false, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !274}
!314 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !125, file: !315, line: 82, size: 128, align: 64, elements: !316, identifier: "_ZTSN6soplex6VectorE")
!315 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!316 = !{!317, !318, !319, !323, !327, !330, !333, !334, !335, !339, !343, !346, !347, !348, !349, !350, !351, !352, !355, !358, !361, !364, !367, !368, !369, !372, !375, !378, !381, !384, !387, !390}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 90, baseType: !26, size: 32, align: 32, flags: DIFlagProtected)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 96, baseType: !142, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!319 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 107, type: !320, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322, !26, !142}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!323 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 114, type: !324, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !322, !198}
!326 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!327 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 121, type: !328, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!328 = !DISubroutineType(types: !329)
!329 = !{!326, !322, !203}
!330 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 128, type: !331, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!326, !322, !208}
!333 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 134, type: !328, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 140, type: !331, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 146, type: !336, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!336 = !DISubroutineType(types: !337)
!337 = !{!26, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!339 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 151, type: !340, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !322, !26}
!342 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !133)
!343 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 158, type: !344, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{!133, !338, !26}
!346 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 168, type: !324, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 170, type: !328, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 172, type: !331, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!349 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 175, type: !324, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 177, type: !328, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 179, type: !331, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex6VectormLEd", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 182, type: !353, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!326, !322, !133}
!355 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 185, type: !356, isLocal: false, isDefinition: false, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!133, !338, !208}
!358 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 187, type: !359, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!133, !338, !203}
!361 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 189, type: !362, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!362 = !DISubroutineType(types: !363)
!363 = !{!133, !338, !198}
!364 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex6Vector6maxAbsEv", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 199, type: !365, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{!133, !338}
!367 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex6Vector6lengthEv", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 201, type: !365, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex6Vector7length2Ev", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 203, type: !365, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 206, type: !370, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!370 = !DISubroutineType(types: !371)
!371 = !{!326, !322, !133, !203}
!372 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 208, type: !373, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{!326, !322, !133, !208}
!375 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKS0_", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 210, type: !376, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!326, !322, !133, !198}
!378 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex6Vector7get_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 229, type: !379, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!142, !322}
!381 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex6Vector13get_const_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 237, type: !382, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{!178, !338}
!384 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6Vector12isConsistentEv", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 245, type: !385, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{!131, !338}
!387 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6Vector5clearEv", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 248, type: !388, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !322}
!390 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !315, line: 256, type: !388, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!391 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !125, file: !392, line: 98, size: 64, align: 64, elements: !393, identifier: "_ZTSN6soplex7SVectorE")
!392 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!393 = !{!394, !396, !400, !403, !406, !411, !414, !417, !420, !421, !425, !426, !427, !430, !433, !437, !441, !445, !446, !449, !450, !453, !454, !455, !456, !460, !463, !466, !469, !472, !475, !478, !481, !482, !483}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 120, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!396 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 127, type: !397, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !399, !26, !133}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!400 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 138, type: !401, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !399, !203}
!403 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 144, type: !404, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !399, !26, !173, !178}
!406 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 147, type: !407, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !399, !26, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!411 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 150, type: !412, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !399, !26, !26}
!414 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 153, type: !415, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !399, !26}
!417 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 160, type: !418, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !399}
!420 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 165, type: !418, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!421 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 172, type: !422, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{!26, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!425 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 181, type: !422, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 190, type: !422, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!427 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 197, type: !428, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{!26, !424, !26}
!430 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 214, type: !431, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{!133, !424, !26}
!433 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 223, type: !434, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !399, !26}
!436 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!437 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 230, type: !438, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !424, !26}
!440 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !410)
!441 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 237, type: !442, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !399, !26}
!444 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !26)
!445 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 244, type: !428, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 251, type: !447, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!447 = !DISubroutineType(types: !448)
!448 = !{!342, !399, !26}
!449 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 258, type: !431, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!450 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 269, type: !451, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubroutineType(types: !452)
!452 = !{!133, !424}
!453 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 272, type: !451, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!454 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 275, type: !451, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!455 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 281, type: !451, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 284, type: !457, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !399, !133}
!459 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!460 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 287, type: !461, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!133, !424, !198}
!463 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 305, type: !464, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!464 = !DISubroutineType(types: !465)
!465 = !{!459, !399, !208}
!466 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 307, type: !467, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubroutineType(types: !468)
!468 = !{!459, !399, !203}
!469 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 309, type: !470, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!470 = !DISubroutineType(types: !471)
!471 = !{!459, !399, !198}
!472 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 312, type: !473, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!473 = !DISubroutineType(types: !474)
!474 = !{!131, !424}
!475 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 324, type: !476, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !399, !26, !395}
!478 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 329, type: !479, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubroutineType(types: !480)
!480 = !{!395, !424}
!481 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 334, type: !415, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 340, type: !415, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!483 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 346, type: !476, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !392, line: 109, size: 128, align: 64, elements: !485, identifier: "_ZTSN6soplex7SVector7ElementE")
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !392, line: 111, baseType: !133, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !392, line: 112, baseType: !26, size: 32, align: 32, offset: 64)
!488 = !DICompositeType(tag: DW_TAG_class_type, name: "IdxSet", scope: !125, file: !489, line: 58, size: 128, align: 64, elements: !490, identifier: "_ZTSN6soplex6IdxSetE")
!489 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/idxset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!490 = !{!491, !492, !493, !494, !498, !501, !502, !503, !504, !508, !511, !514, !515, !518, !519, !522, !525, !526, !529, !532}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 61, baseType: !26, size: 32, align: 32, flags: DIFlagProtected)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 62, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 63, baseType: !188, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!494 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex6IdxSet5indexEi", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 67, type: !495, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!495 = !DISubroutineType(types: !496)
!496 = !{!26, !497, !26}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!498 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex6IdxSet4sizeEv", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 73, type: !499, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{!26, !497}
!501 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex6IdxSet3maxEv", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 78, type: !499, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6IdxSet3dimEv", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 84, type: !499, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!503 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex6IdxSet6numberEi", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 91, type: !495, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!504 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addEi", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 94, type: !505, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !507, !26}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6IdxSetE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!508 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addERKS0_", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 101, type: !509, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !507, !183}
!511 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addEiPKi", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 107, type: !512, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !507, !26, !173}
!514 = !DISubprogram(name: "addIdx", linkageName: "_ZN6soplex6IdxSet6addIdxEi", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 110, type: !505, isLocal: false, isDefinition: false, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex6IdxSet6removeEii", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 116, type: !516, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !507, !26, !26}
!518 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex6IdxSet6removeEi", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 119, type: !505, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6IdxSet5clearEv", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 127, type: !520, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !507}
!522 = !DISubprogram(name: "IdxSet", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 138, type: !523, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !507, !26, !188, !26}
!525 = !DISubprogram(name: "IdxSet", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 149, type: !520, isLocal: false, isDefinition: false, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6IdxSetaSERKS0_", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 160, type: !527, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{!193, !507, !183}
!529 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6IdxSet12isConsistentEv", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 163, type: !530, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{!131, !497}
!532 = !DISubprogram(name: "IdxSet", scope: !"_ZTSN6soplex6IdxSetE", file: !489, line: 167, type: !509, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true)
!533 = !DICompositeType(tag: DW_TAG_class_type, name: "SVSet", scope: !125, file: !534, line: 69, size: 704, align: 64, elements: !535, identifier: "_ZTSN6soplex5SVSetE")
!534 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!535 = !{!536, !538, !539, !540, !541, !542, !546, !547, !550, !554, !558, !562, !565, !568, !572, !575, !578, !581, !584, !587, !588, !591, !594, !597, !600, !603, !606, !609, !612, !616, !621, !624, !627, !628, !631, !634, !637, !640, !641, !644, !645, !646, !647, !648, !649, !650, !653, !657, !658}
!536 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex5SVSetE", baseType: !537, flags: DIFlagProtected)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "SVSetBase", scope: !125, file: !534, line: 38, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 129, baseType: !"_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEEE", size: 256, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 130, baseType: !"_ZTSN6soplex6IdListINS_5SVSet5DLPSVEEE", size: 128, align: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 155, baseType: !133, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "memFactor", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 162, baseType: !342, size: 64, align: 64, offset: 640, flags: DIFlagPublic)
!542 = !DISubprogram(name: "ensurePSVec", linkageName: "_ZN6soplex5SVSet11ensurePSVecEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 133, type: !543, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !545, !26}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex5SVSetE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!546 = !DISubprogram(name: "ensureMem", linkageName: "_ZN6soplex5SVSet9ensureMemEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 143, type: !543, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true)
!547 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addERKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 173, type: !548, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !545, !203}
!550 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addERNS_7DataKeyERKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 188, type: !551, isLocal: false, isDefinition: false, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !545, !553, !203}
!553 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DataKeyE")
!554 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addEPKNS_7SVectorEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 198, type: !555, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !545, !557, !26}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!558 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addEPNS_7DataKeyEPKNS_7SVectorEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 207, type: !559, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !545, !561, !557, !26}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DataKeyE", size: 64, align: 64)
!562 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addERKS0_", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 210, type: !563, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !545, !227}
!565 = !DISubprogram(name: "add", linkageName: "_ZN6soplex5SVSet3addEPNS_7DataKeyERKS0_", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 219, type: !566, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !545, !561, !227}
!568 = !DISubprogram(name: "create", linkageName: "_ZN6soplex5SVSet6createEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 224, type: !569, isLocal: false, isDefinition: false, scopeLine: 224, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{!571, !545, !26}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64)
!572 = !DISubprogram(name: "create", linkageName: "_ZN6soplex5SVSet6createERNS_7DataKeyEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 231, type: !573, isLocal: false, isDefinition: false, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{!571, !545, !553, !26}
!575 = !DISubprogram(name: "xtend", linkageName: "_ZN6soplex5SVSet5xtendERNS_7SVectorEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 236, type: !576, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !545, !459, !26}
!578 = !DISubprogram(name: "add2", linkageName: "_ZN6soplex5SVSet4add2ERNS_7SVectorEid", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 244, type: !579, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !545, !459, !26, !133}
!581 = !DISubprogram(name: "add2", linkageName: "_ZN6soplex5SVSet4add2ERNS_7SVectorEiPKiPKd", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 252, type: !582, isLocal: false, isDefinition: false, scopeLine: 252, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !545, !459, !26, !173, !178}
!584 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeENS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 260, type: !585, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !545, !"_ZTSN6soplex7DataKeyE"}
!587 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 264, type: !543, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 271, type: !589, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !545, !571}
!591 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 284, type: !592, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !545, !188}
!594 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPNS_7DataKeyEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 290, type: !595, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !545, !561, !26}
!597 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPii", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 300, type: !598, isLocal: false, isDefinition: false, scopeLine: 300, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !545, !188, !26}
!600 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPNS_7DataKeyEiPi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 307, type: !601, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !545, !561, !26, !188}
!603 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex5SVSet6removeEPiiS1_", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 317, type: !604, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !545, !188, !26, !188}
!606 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex5SVSet5clearEv", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 320, type: !607, isLocal: false, isDefinition: false, scopeLine: 320, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !545}
!609 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex5SVSetixEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 333, type: !610, isLocal: false, isDefinition: false, scopeLine: 333, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!610 = !DISubroutineType(types: !611)
!611 = !{!459, !545, !26}
!612 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex5SVSetixEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 339, type: !613, isLocal: false, isDefinition: false, scopeLine: 339, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubroutineType(types: !614)
!614 = !{!203, !615, !26}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!616 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex5SVSetixERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 345, type: !617, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubroutineType(types: !618)
!618 = !{!459, !545, !619}
!619 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DataKeyE")
!621 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex5SVSetixERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 351, type: !622, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{!203, !615, !619}
!624 = !DISubprogram(name: "num", linkageName: "_ZNK6soplex5SVSet3numEv", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 361, type: !625, isLocal: false, isDefinition: false, scopeLine: 361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubroutineType(types: !626)
!626 = !{!26, !615}
!627 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex5SVSet3maxEv", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 367, type: !625, isLocal: false, isDefinition: false, scopeLine: 367, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!628 = !DISubprogram(name: "key", linkageName: "_ZNK6soplex5SVSet3keyEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 373, type: !629, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!629 = !DISubroutineType(types: !630)
!630 = !{!"_ZTSN6soplex7DataKeyE", !615, !26}
!631 = !DISubprogram(name: "key", linkageName: "_ZNK6soplex5SVSet3keyEPKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 379, type: !632, isLocal: false, isDefinition: false, scopeLine: 379, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{!"_ZTSN6soplex7DataKeyE", !615, !557}
!634 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex5SVSet6numberERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 385, type: !635, isLocal: false, isDefinition: false, scopeLine: 385, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{!26, !615, !619}
!637 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex5SVSet6numberEPKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 391, type: !638, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!638 = !DISubroutineType(types: !639)
!639 = !{!26, !615, !557}
!640 = !DISubprogram(name: "has", linkageName: "_ZNK6soplex5SVSet3hasERKNS_7DataKeyE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 397, type: !635, isLocal: false, isDefinition: false, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!641 = !DISubprogram(name: "has", linkageName: "_ZNK6soplex5SVSet3hasEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 403, type: !642, isLocal: false, isDefinition: false, scopeLine: 403, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{!26, !615, !26}
!644 = !DISubprogram(name: "has", linkageName: "_ZNK6soplex5SVSet3hasEPKNS_7SVectorE", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 409, type: !638, isLocal: false, isDefinition: false, scopeLine: 409, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubprogram(name: "memSize", linkageName: "_ZNK6soplex5SVSet7memSizeEv", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 418, type: !625, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubprogram(name: "memMax", linkageName: "_ZNK6soplex5SVSet6memMaxEv", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 424, type: !625, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!647 = !DISubprogram(name: "memRemax", linkageName: "_ZN6soplex5SVSet8memRemaxEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 430, type: !543, isLocal: false, isDefinition: false, scopeLine: 430, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!648 = !DISubprogram(name: "memPack", linkageName: "_ZN6soplex5SVSet7memPackEv", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 433, type: !607, isLocal: false, isDefinition: false, scopeLine: 433, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!649 = !DISubprogram(name: "reMax", linkageName: "_ZN6soplex5SVSet5reMaxEi", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 440, type: !543, isLocal: false, isDefinition: false, scopeLine: 440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex5SVSet12isConsistentEv", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 443, type: !651, isLocal: false, isDefinition: false, scopeLine: 443, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!651 = !DISubroutineType(types: !652)
!652 = !{!131, !615}
!653 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex5SVSetaSERKS0_", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 446, type: !654, isLocal: false, isDefinition: false, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !545, !227}
!656 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex5SVSetE")
!657 = !DISubprogram(name: "SVSet", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 449, type: !563, isLocal: false, isDefinition: false, scopeLine: 449, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!658 = !DISubprogram(name: "SVSet", scope: !"_ZTSN6soplex5SVSetE", file: !534, line: 452, type: !659, isLocal: false, isDefinition: false, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !545, !26, !26, !133, !133}
!661 = !DICompositeType(tag: DW_TAG_class_type, name: "DataArray<soplex::SVector::Element>", scope: !125, file: !662, line: 68, size: 192, align: 64, elements: !663, templateParams: !737, identifier: "_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!662 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dataarray.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!663 = !{!664, !665, !666, !667, !668, !672, !677, !680, !683, !686, !689, !692, !695, !699, !702, !705, !708, !709, !712, !715, !718, !719, !720, !725, !729, !732, !733, !736}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "thesize", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 71, baseType: !26, size: 32, align: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "themax", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 72, baseType: !26, size: 32, align: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 73, baseType: !395, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "memFactor", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 82, baseType: !133, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!668 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEEixEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 87, type: !669, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!669 = !DISubroutineType(types: !670)
!670 = !{!436, !671, !26}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!672 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEEixEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 94, type: !673, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!673 = !DISubroutineType(types: !674)
!674 = !{!440, !675, !26}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!677 = !DISubprogram(name: "last", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE4lastEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 102, type: !678, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubroutineType(types: !679)
!679 = !{!436, !671}
!680 = !DISubprogram(name: "last", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE4lastEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 108, type: !681, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!681 = !DISubroutineType(types: !682)
!682 = !{!440, !675}
!683 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE7get_ptrEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 115, type: !684, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubroutineType(types: !685)
!685 = !{!395, !671}
!686 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE13get_const_ptrEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 120, type: !687, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!687 = !DISubroutineType(types: !688)
!688 = !{!409, !675}
!689 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6appendERKS2_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 126, type: !690, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !671, !440}
!692 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6appendEiPKS2_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 131, type: !693, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !671, !26, !409}
!695 = !DISubprogram(name: "append", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6appendERKS3_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 136, type: !696, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !671, !698}
!698 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !676)
!699 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6insertEii", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 142, type: !700, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !671, !26, !26}
!702 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6insertEiiPKS2_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 151, type: !703, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !671, !26, !26, !409}
!705 = !DISubprogram(name: "insert", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6insertEiRKS3_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 161, type: !706, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !671, !26, !698}
!708 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6removeEii", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 171, type: !700, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubprogram(name: "removeLast", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE10removeLastEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 181, type: !710, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !671, !26}
!712 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE5clearEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 187, type: !713, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !671}
!715 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE4sizeEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 193, type: !716, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!716 = !DISubroutineType(types: !717)
!717 = !{!26, !675}
!718 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE6reSizeEi", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 205, type: !710, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!719 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE3maxEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 221, type: !716, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!720 = !DISubprogram(name: "reMax", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEE5reMaxEii", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 239, type: !721, isLocal: false, isDefinition: false, scopeLine: 239, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !671, !26, !26}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !724, line: 51, baseType: !108)
!724 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!725 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex9DataArrayINS_7SVector7ElementEEaSERKS3_", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 262, type: !726, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!726 = !DISubroutineType(types: !727)
!727 = !{!728, !671, !698}
!728 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE")
!729 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9DataArrayINS_7SVector7ElementEE12isConsistentEv", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 273, type: !730, isLocal: false, isDefinition: false, scopeLine: 273, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!730 = !DISubroutineType(types: !731)
!731 = !{!131, !675}
!732 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 286, type: !696, isLocal: false, isDefinition: false, scopeLine: 286, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!733 = !DISubprogram(name: "DataArray", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 309, type: !734, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !671, !26, !26, !133}
!736 = !DISubprogram(name: "~DataArray", scope: !"_ZTSN6soplex9DataArrayINS_7SVector7ElementEEE", file: !662, line: 325, type: !713, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!737 = !{!738}
!738 = !DITemplateTypeParameter(name: "T", type: !"_ZTSN6soplex7SVector7ElementE")
!739 = !DICompositeType(tag: DW_TAG_class_type, name: "DataSet<soplex::SVSet::DLPSV>", scope: !125, file: !740, line: 88, size: 256, align: 64, elements: !741, templateParams: !853, identifier: "_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEEE")
!740 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dataset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!741 = !{!742, !744, !745, !746, !747, !748, !749, !755, !758, !762, !765, !770, !773, !777, !780, !783, !786, !789, !792, !795, !798, !801, !804, !808, !812, !815, !818, !821, !822, !823, !826, !829, !832, !835, !836, !839, !840, !843, !846, !847, !848, !852}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "theitem", scope: !"_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEEE", file: !740, line: 96, baseType: !743, size: 64, align: 64, flags: DIFlagProtected)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEE4ItemE", size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "thekey", scope: !"_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEEE", file: !740, line: 98, baseType: !561, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "themax", scope: !"_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEEE", file: !740, line: 100, baseType: !26, size: 32, align: 32, offset: 128, flags: DIFlagProtected)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "thesize", scope: !"_ZTSN6soplex7DataSetINS_5SVSet5DLPSVEEE", file: !740, line: 101, baseType: !26, size: 32, align: 32, offset: 160, flags: DIFlagProtected)
