; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.soplex::Timer" = type { i32, i64, i64, i64, i64, i64, i64 }
%struct.tms = type { i64, i64, i64, i64 }

@_ZN6soplex5Timer13ticks_per_secE = constant i64 100, align 8

; Function Attrs: nounwind optsize ssp uwtable
define void @_ZNK6soplex5Timer11updateTicksEv(%"class.soplex::Timer"* nocapture %this) #0 align 2 {
  %now = alloca %struct.tms, align 16
  tail call void @llvm.dbg.value(metadata %"class.soplex::Timer"* %this, i64 0, metadata !172, metadata !1032), !dbg !1033
  tail call void @llvm.dbg.value(metadata %struct.tms* %now, i64 0, metadata !174, metadata !1032), !dbg !1034
  %1 = call i64 @times(%struct.tms* %now) #4, !dbg !1035
  tail call void @llvm.dbg.value(metadata i64 %1, i64 0, metadata !175, metadata !1032), !dbg !1036
  %2 = icmp eq i64 %1, -1, !dbg !1037
  br i1 %2, label %5, label %._crit_edge, !dbg !1039

._crit_edge:                                      ; preds = %0
  %3 = bitcast %struct.tms* %now to <2 x i64>*, !dbg !1040
  %4 = load <2 x i64>* %3, align 16, !dbg !1040, !tbaa !1041
  br label %7, !dbg !1039

; <label>:5                                       ; preds = %0
  tail call void @llvm.dbg.value(metadata i64 0, i64 0, metadata !175, metadata !1032), !dbg !1036
  %6 = bitcast %struct.tms* %now to i8*, !dbg !1045

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !169, globals: !205, imports: !207)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN6soplex5TimerE", file: !4, line: 100, size: 32, align: 32, elements: !5, identifier: "_ZTSN6soplex5TimerUt_E")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/timer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "RESET", value: 0)
!7 = !DIEnumerator(name: "STOPPED", value: 1)
!8 = !DIEnumerator(name: "RUNNING", value: 2)
!9 = !{!10, !67, !71, !72, !79, !86, !101, !106, !110, !114, !3, !158, !99, !130}
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !11, line: 122, size: 1216, align: 64, elements: !12, identifier: "_ZTS7__sFILE")
!11 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !{!13, !16, !18, !19, !21, !22, !23, !24, !26, !30, !36, !46, !52, !53, !55, !56, !60, !64, !65, !66}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !11, line: 123, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !11, line: 124, baseType: !17, size: 32, align: 32, offset: 64)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !11, line: 125, baseType: !17, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !11, line: 126, baseType: !20, size: 16, align: 16, offset: 128)
!20 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !11, line: 127, baseType: !20, size: 16, align: 16, offset: 144)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !11, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !11, line: 129, baseType: !17, size: 32, align: 32, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !11, line: 132, baseType: !25, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !11, line: 133, baseType: !27, size: 64, align: 64, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!17, !25}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !11, line: 134, baseType: !31, size: 64, align: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!17, !25, !34, !17}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !11, line: 135, baseType: !37, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !25, !40, !17}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !11, line: 77, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !42, line: 71, baseType: !43)
!42 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !44, line: 46, baseType: !45)
!44 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!45 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !11, line: 136, baseType: !47, size: 64, align: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!17, !25, !50, !17}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !11, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !11, line: 140, baseType: !54, size: 64, align: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !11, line: 141, baseType: !17, size: 32, align: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !11, line: 144, baseType: !57, size: 24, align: 8, offset: 928)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 24, align: 8, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 3)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !11, line: 145, baseType: !61, size: 8, align: 8, offset: 952)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, align: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !11, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !11, line: 151, baseType: !17, size: 32, align: 32, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !11, line: 152, baseType: !40, size: 64, align: 64, offset: 1152)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !11, line: 88, size: 128, align: 64, elements: !68, identifier: "_ZTS6__sbuf")
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !11, line: 89, baseType: !14, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !11, line: 90, baseType: !17, size: 32, align: 32, offset: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !11, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !73, identifier: "_ZTS13__va_list_tag")
!73 = !{!74, !76, !77, !78}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !75, size: 32, align: 32)
!75 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !75, size: 32, align: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !25, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !25, size: 64, align: 64, offset: 128)
!79 = !DICompositeType(tag: DW_TAG_union_type, file: !44, line: 76, size: 1024, align: 64, elements: !80, identifier: "_ZTS11__mbstate_t")
!80 = !{!81, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !44, line: 77, baseType: !82, size: 1024, align: 8)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, align: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !44, line: 78, baseType: !45, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !87, line: 73, size: 448, align: 64, elements: !88, identifier: "_ZTS2tm")
!87 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !100}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !87, line: 74, baseType: !17, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !87, line: 75, baseType: !17, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !87, line: 76, baseType: !17, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !87, line: 77, baseType: !17, size: 32, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !87, line: 78, baseType: !17, size: 32, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !87, line: 79, baseType: !17, size: 32, align: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !87, line: 80, baseType: !17, size: 32, align: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !87, line: 81, baseType: !17, size: 32, align: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !87, line: 82, baseType: !17, size: 32, align: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !87, line: 83, baseType: !99, size: 64, align: 64, offset: 320)
!99 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !87, line: 84, baseType: !34, size: 64, align: 64, offset: 384)
!101 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 82, size: 64, align: 32, elements: !103, identifier: "_ZTS5div_t")
!102 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !102, line: 83, baseType: !17, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !102, line: 84, baseType: !17, size: 32, align: 32, offset: 32)
!106 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 87, size: 128, align: 64, elements: !107, identifier: "_ZTS6ldiv_t")
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !102, line: 88, baseType: !99, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !102, line: 89, baseType: !99, size: 64, align: 64, offset: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 93, size: 128, align: 64, elements: !111, identifier: "_ZTS7lldiv_t")
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !102, line: 94, baseType: !45, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !102, line: 95, baseType: !45, size: 64, align: 64, offset: 64)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "Timer", scope: !115, file: !4, line: 95, size: 448, align: 64, elements: !117, identifier: "_ZTSN6soplex5TimerE")
!115 = !DINamespace(name: "soplex", scope: null, file: !116, line: 49)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !{!118, !120, !121, !122, !123, !124, !125, !126, !127, !134, !137, !141, !142, !143, !146, !150, !153, !154, !155}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_sec", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 98, baseType: !119, flags: DIFlagStaticMember)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 105, baseType: !"_ZTSN6soplex5TimerUt_E", size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "uAccount", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 107, baseType: !99, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sAccount", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 108, baseType: !99, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rAccount", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 109, baseType: !99, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "uTicks", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 110, baseType: !99, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sTicks", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 111, baseType: !99, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rTicks", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 112, baseType: !99, size: 64, align: 64, offset: 384)
!127 = !DISubprogram(name: "ticks2sec", linkageName: "_ZNK6soplex5Timer9ticks2secEl", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 115, type: !128, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !132, !99}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !115, file: !116, line: 127, baseType: !131)
!131 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5TimerE")
!134 = !DISubprogram(name: "updateTicks", linkageName: "_ZNK6soplex5Timer11updateTicksEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 121, type: !135, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !132}
!137 = !DISubprogram(name: "Timer", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 125, type: !138, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex5TimerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!141 = !DISubprogram(name: "reset", linkageName: "_ZN6soplex5Timer5resetEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 130, type: !138, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubprogram(name: "start", linkageName: "_ZN6soplex5Timer5startEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 137, type: !138, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubprogram(name: "stop", linkageName: "_ZN6soplex5Timer4stopEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 140, type: !144, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{!130, !140}
!146 = !DISubprogram(name: "getTimes", linkageName: "_ZNK6soplex5Timer8getTimesEPdS1_S1_", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 143, type: !147, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !132, !149, !149, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!150 = !DISubprogram(name: "userTime", linkageName: "_ZNK6soplex5Timer8userTimeEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 147, type: !151, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!151 = !DISubroutineType(types: !152)
!152 = !{!130, !132}
!153 = !DISubprogram(name: "systemTime", linkageName: "_ZNK6soplex5Timer10systemTimeEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 150, type: !151, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubprogram(name: "realTime", linkageName: "_ZNK6soplex5Timer8realTimeEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 153, type: !151, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!155 = !DISubprogram(name: "resolution", linkageName: "_ZNK6soplex5Timer10resolutionEv", scope: !"_ZTSN6soplex5TimerE", file: !4, line: 156, type: !156, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!156 = !DISubroutineType(types: !157)
!157 = !{!99, !132}
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "tms", file: !159, line: 82, size: 256, align: 64, elements: !160, identifier: "_ZTS3tms")
!159 = !DIFile(filename: "/usr/include/sys/times.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!160 = !{!161, !166, !167, !168}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !"_ZTS3tms", file: !159, line: 83, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !163, line: 30, baseType: !164)
!163 = !DIFile(filename: "/usr/include/sys/_types/_clock_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !44, line: 117, baseType: !165)
!165 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !"_ZTS3tms", file: !159, line: 84, baseType: !162, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !"_ZTS3tms", file: !159, line: 85, baseType: !162, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !"_ZTS3tms", file: !159, line: 86, baseType: !162, size: 64, align: 64, offset: 192)
!169 = !{!170, !176, !180, !183, !189, !193, !197, !201}
!170 = !DISubprogram(name: "updateTicks", linkageName: "_ZNK6soplex5Timer11updateTicksEv", scope: !"_ZTSN6soplex5TimerE", file: !1, line: 57, type: !135, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.soplex::Timer"*)* @_ZNK6soplex5Timer11updateTicksEv, declaration: !134, variables: !171)
!171 = !{!172, !174, !175}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !170, type: !173, flags: DIFlagArtificial | DIFlagObjectPointer)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !170, file: !1, line: 66, type: !"_ZTS3tms")
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !170, file: !1, line: 67, type: !162)
!176 = !DISubprogram(name: "start", linkageName: "_ZN6soplex5Timer5startEv", scope: !"_ZTSN6soplex5TimerE", file: !1, line: 80, type: !138, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.soplex::Timer"*)* @_ZN6soplex5Timer5startEv, declaration: !142, variables: !177)
!177 = !{!178}
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !176, type: !179, flags: DIFlagArtificial | DIFlagObjectPointer)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex5TimerE", size: 64, align: 64)
!180 = !DISubprogram(name: "stop", linkageName: "_ZN6soplex5Timer4stopEv", scope: !"_ZTSN6soplex5TimerE", file: !1, line: 95, type: !144, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: double (%"class.soplex::Timer"*)* @_ZN6soplex5Timer4stopEv, declaration: !143, variables: !181)
!181 = !{!182}
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !180, type: !179, flags: DIFlagArtificial | DIFlagObjectPointer)
!183 = !DISubprogram(name: "getTimes", linkageName: "_ZNK6soplex5Timer8getTimesEPdS1_S1_", scope: !"_ZTSN6soplex5TimerE", file: !1, line: 111, type: !147, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.soplex::Timer"*, double*, double*, double*)* @_ZNK6soplex5Timer8getTimesEPdS1_S1_, declaration: !146, variables: !184)
!184 = !{!185, !186, !187, !188}
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !183, type: !173, flags: DIFlagArtificial | DIFlagObjectPointer)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uTime", arg: 2, scope: !183, file: !1, line: 112, type: !149)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sTime", arg: 3, scope: !183, file: !1, line: 113, type: !149)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rTime", arg: 4, scope: !183, file: !1, line: 114, type: !149)
!189 = !DISubprogram(name: "userTime", linkageName: "_ZNK6soplex5Timer8userTimeEv", scope: !"_ZTSN6soplex5TimerE", file: !1, line: 142, type: !151, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: double (%"class.soplex::Timer"*)* @_ZNK6soplex5Timer8userTimeEv, declaration: !150, variables: !190)
!190 = !{!191, !192}
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !189, type: !173, flags: DIFlagArtificial | DIFlagObjectPointer)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uTime", scope: !189, file: !1, line: 144, type: !130)
