; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/unitvector.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.soplex::UnitVector" = type { %"class.soplex::SVector", %"struct.soplex::SVector::Element", %"struct.soplex::SVector::Element" }
%"class.soplex::SVector" = type { %"struct.soplex::SVector::Element"* }
%"struct.soplex::SVector::Element" = type { double, i32 }

@.str = private unnamed_addr constant [11 x i8] c"UnitVector\00", align 1
@.str1 = private unnamed_addr constant [70 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/unitvector.cc\00", align 1

; Function Attrs: optsize ssp uwtable
define zeroext i1 @_ZNK6soplex10UnitVector12isConsistentEv(%"class.soplex::UnitVector"* %this) #0 align 2 {
  tail call void @llvm.dbg.value(metadata %"class.soplex::UnitVector"* %this, i64 0, metadata !328, metadata !1169), !dbg !1170
  %1 = getelementptr inbounds %"class.soplex::UnitVector"* %this, i64 0, i32 0, !dbg !1171
  tail call void @llvm.dbg.value(metadata %"class.soplex::SVector"* %1, i64 0, metadata !332, metadata !1169), !dbg !1173
  %2 = getelementptr inbounds %"class.soplex::UnitVector"* %this, i64 0, i32 0, i32 0, !dbg !1175
  %3 = load %"struct.soplex::SVector::Element"** %2, align 8, !dbg !1175, !tbaa !1176
  %4 = getelementptr inbounds %"struct.soplex::SVector::Element"* %3, i64 -1, !dbg !1181

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !325, globals: !2, imports: !340)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/unitvector.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !61, !65, !66, !73, !80, !95, !100, !104, !108, !139, !243, !247, !324, !11}
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !5, line: 122, size: 1216, align: 64, elements: !6, identifier: "_ZTS7__sFILE")
!5 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !10, !12, !13, !15, !16, !17, !18, !20, !24, !30, !40, !46, !47, !49, !50, !54, !58, !59, !60}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !5, line: 123, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !5, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !5, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !5, line: 126, baseType: !14, size: 16, align: 16, offset: 128)
!14 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !5, line: 127, baseType: !14, size: 16, align: 16, offset: 144)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !5, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !5, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !5, line: 132, baseType: !19, size: 64, align: 64, offset: 384)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !5, line: 133, baseType: !21, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !19}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !5, line: 134, baseType: !25, size: 64, align: 64, offset: 512)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!11, !19, !28, !11}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !5, line: 135, baseType: !31, size: 64, align: 64, offset: 576)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !19, !34, !11}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !5, line: 77, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !36, line: 71, baseType: !37)
!36 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !38, line: 46, baseType: !39)
!38 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!39 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !5, line: 136, baseType: !41, size: 64, align: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!11, !19, !44, !11}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !5, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !5, line: 140, baseType: !48, size: 64, align: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !5, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !5, line: 144, baseType: !51, size: 24, align: 8, offset: 928)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 24, align: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !5, line: 145, baseType: !55, size: 8, align: 8, offset: 952)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, align: 8, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !5, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !5, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !5, line: 152, baseType: !34, size: 64, align: 64, offset: 1152)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !5, line: 88, size: 128, align: 64, elements: !62, identifier: "_ZTS6__sbuf")
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !5, line: 89, baseType: !8, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !5, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !5, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !67, identifier: "_ZTS13__va_list_tag")
!67 = !{!68, !70, !71, !72}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !69, size: 32, align: 32)
!69 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !69, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !19, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !19, size: 64, align: 64, offset: 128)
!73 = !DICompositeType(tag: DW_TAG_union_type, file: !38, line: 76, size: 1024, align: 64, elements: !74, identifier: "_ZTS11__mbstate_t")
!74 = !{!75, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !38, line: 77, baseType: !76, size: 1024, align: 8)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !38, line: 78, baseType: !39, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !81, line: 73, size: 448, align: 64, elements: !82, identifier: "_ZTS2tm")
!81 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !94}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !81, line: 74, baseType: !11, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !81, line: 75, baseType: !11, size: 32, align: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !81, line: 76, baseType: !11, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !81, line: 77, baseType: !11, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !81, line: 78, baseType: !11, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !81, line: 79, baseType: !11, size: 32, align: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !81, line: 80, baseType: !11, size: 32, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !81, line: 81, baseType: !11, size: 32, align: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !81, line: 82, baseType: !11, size: 32, align: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !81, line: 83, baseType: !93, size: 64, align: 64, offset: 320)
!93 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !81, line: 84, baseType: !28, size: 64, align: 64, offset: 384)
!95 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 82, size: 64, align: 32, elements: !97, identifier: "_ZTS5div_t")
!96 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !96, line: 83, baseType: !11, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !96, line: 84, baseType: !11, size: 32, align: 32, offset: 32)
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 87, size: 128, align: 64, elements: !101, identifier: "_ZTS6ldiv_t")
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !96, line: 88, baseType: !93, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !96, line: 89, baseType: !93, size: 64, align: 64, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 93, size: 128, align: 64, elements: !105, identifier: "_ZTS7lldiv_t")
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !96, line: 94, baseType: !39, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !96, line: 95, baseType: !39, size: 64, align: 64, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "UnitVector", scope: !110, file: !109, line: 46, size: 320, align: 64, elements: !112, identifier: "_ZTSN6soplex10UnitVectorE")
!109 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/unitvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !DINamespace(name: "soplex", scope: null, file: !111, line: 49)
!111 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !114, !115, !116, !123, !127, !131, !135}
!113 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex10UnitVectorE", baseType: !"_ZTSN6soplex7SVectorE", flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "themem", scope: !"_ZTSN6soplex10UnitVectorE", file: !109, line: 49, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 128, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "themem1", scope: !"_ZTSN6soplex10UnitVectorE", file: !109, line: 50, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 128, align: 64, offset: 192)
!116 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex10UnitVector5valueEi", scope: !"_ZTSN6soplex10UnitVectorE", file: !109, line: 57, type: !117, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !121, !11}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !110, file: !111, line: 127, baseType: !120)
!120 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10UnitVectorE")
!123 = !DISubprogram(name: "UnitVector", scope: !"_ZTSN6soplex10UnitVectorE", file: !109, line: 64, type: !124, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126, !11}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10UnitVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!127 = !DISubprogram(name: "UnitVector", scope: !"_ZTSN6soplex10UnitVectorE", file: !109, line: 71, type: !128, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !126, !130}
!130 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !122)
!131 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex10UnitVectoraSERKS0_", scope: !"_ZTSN6soplex10UnitVectorE", file: !109, line: 78, type: !132, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !126, !130}
!134 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex10UnitVectorE")
!135 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex10UnitVector12isConsistentEv", scope: !"_ZTSN6soplex10UnitVectorE", file: !109, line: 86, type: !136, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !121}
!138 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!139 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !110, file: !140, line: 98, size: 64, align: 64, elements: !141, identifier: "_ZTSN6soplex7SVectorE")
!140 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!141 = !{!142, !144, !148, !153, !160, !165, !168, !171, !174, !175, !179, !180, !181, !184, !187, !191, !195, !199, !200, !204, !205, !208, !209, !210, !211, !215, !220, !225, !228, !231, !234, !237, !240, !241, !242}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 120, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!144 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 127, type: !145, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147, !11, !119}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!148 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 138, type: !149, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !147, !151}
!151 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!153 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 144, type: !154, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !147, !11, !156, !158}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!160 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 147, type: !161, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !147, !11, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!165 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 150, type: !166, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !147, !11, !11}
!168 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 153, type: !169, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !147, !11}
!171 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 160, type: !172, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !147}
!174 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 165, type: !172, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!175 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 172, type: !176, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!11, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!179 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 181, type: !176, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 190, type: !176, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 197, type: !182, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubroutineType(types: !183)
!183 = !{!11, !178, !11}
!184 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 214, type: !185, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!185 = !DISubroutineType(types: !186)
!186 = !{!119, !178, !11}
!187 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 223, type: !188, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !147, !11}
!190 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!191 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 230, type: !192, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !178, !11}
!194 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !164)
!195 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 237, type: !196, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !147, !11}
!198 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !11)
!199 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 244, type: !182, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 251, type: !201, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !147, !11}
!203 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !119)
!204 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 258, type: !185, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 269, type: !206, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubroutineType(types: !207)
!207 = !{!119, !178}
!208 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 272, type: !206, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 275, type: !206, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 281, type: !206, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 284, type: !212, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !147, !119}
!214 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!215 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 287, type: !216, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!119, !178, !218}
!218 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!220 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 305, type: !221, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!214, !147, !223}
!223 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!225 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 307, type: !226, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!226 = !DISubroutineType(types: !227)
!227 = !{!214, !147, !151}
!228 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 309, type: !229, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubroutineType(types: !230)
!230 = !{!214, !147, !218}
!231 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 312, type: !232, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!232 = !DISubroutineType(types: !233)
!233 = !{!138, !178}
!234 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 324, type: !235, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !147, !11, !143}
!237 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 329, type: !238, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{!143, !178}
!240 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 334, type: !169, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!241 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 340, type: !169, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 346, type: !235, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !140, line: 109, size: 128, align: 64, elements: !244, identifier: "_ZTSN6soplex7SVector7ElementE")
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !140, line: 111, baseType: !119, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !140, line: 112, baseType: !11, size: 32, align: 32, offset: 64)
!247 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !110, file: !248, line: 82, size: 128, align: 64, elements: !249, identifier: "_ZTSN6soplex6VectorE")
!248 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!249 = !{!250, !251, !253, !257, !261, !264, !267, !268, !269, !273, !276, !279, !280, !281, !282, !283, !284, !285, !288, !291, !294, !297, !300, !301, !302, !305, !308, !311, !314, !317, !320, !323}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 90, baseType: !11, size: 32, align: 32, flags: DIFlagProtected)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 96, baseType: !252, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!253 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 107, type: !254, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !256, !11, !252}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!257 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 114, type: !258, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !256, !218}
!260 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!261 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 121, type: !262, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{!260, !256, !151}
!264 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 128, type: !265, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubroutineType(types: !266)
!266 = !{!260, !256, !223}
!267 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 134, type: !262, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 140, type: !265, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!269 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 146, type: !270, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{!11, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!273 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 151, type: !274, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{!203, !256, !11}
!276 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 158, type: !277, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{!119, !272, !11}
!279 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 168, type: !258, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !248, line: 170, type: !262, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
