; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/updatevector.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.soplex::UpdateVector" = type { %"class.soplex::DVector", double, %"class.soplex::SSVector" }
%"class.soplex::DVector" = type { %"class.soplex::Vector", i32, double* }
%"class.soplex::Vector" = type { i32, double* }
%"class.soplex::SSVector" = type { %"class.soplex::DVector", %"class.soplex::IdxSet", i8, double }
%"class.soplex::IdxSet" = type { i32, i32, i32* }

@.str = private unnamed_addr constant [13 x i8] c"UpdateVector\00", align 1
@.str1 = private unnamed_addr constant [72 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/updatevector.cc\00", align 1

; Function Attrs: optsize ssp uwtable
define dereferenceable(104) %"class.soplex::UpdateVector"* @_ZN6soplex12UpdateVectoraSERKS0_(%"class.soplex::UpdateVector"* %this, %"class.soplex::UpdateVector"* dereferenceable(104) %rhs) #0 align 2 {
  tail call void @llvm.dbg.value(metadata %"class.soplex::UpdateVector"* %this, i64 0, metadata !568, metadata !1417), !dbg !1418
  tail call void @llvm.dbg.value(metadata %"class.soplex::UpdateVector"* %rhs, i64 0, metadata !570, metadata !1417), !dbg !1419
  %1 = icmp eq %"class.soplex::UpdateVector"* %this, %rhs, !dbg !1420
  br i1 %1, label %14, label %2, !dbg !1422

; <label>:2                                       ; preds = %0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !565, globals: !2, imports: !588)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/updatevector.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !61, !65, !66, !73, !80, !95, !100, !104, !108, !167, !220, !298, !393, !397, !519, !564}
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !5, line: 122, size: 1216, align: 64, elements: !6, identifier: "_ZTS7__sFILE")
!5 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !10, !12, !13, !15, !16, !17, !18, !20, !24, !30, !40, !46, !47, !49, !50, !54, !58, !59, !60}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !5, line: 123, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !5, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !5, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !5, line: 126, baseType: !14, size: 16, align: 16, offset: 128)
!14 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !5, line: 127, baseType: !14, size: 16, align: 16, offset: 144)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !5, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !5, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !5, line: 132, baseType: !19, size: 64, align: 64, offset: 384)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !5, line: 133, baseType: !21, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !19}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !5, line: 134, baseType: !25, size: 64, align: 64, offset: 512)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!11, !19, !28, !11}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !5, line: 135, baseType: !31, size: 64, align: 64, offset: 576)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !19, !34, !11}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !5, line: 77, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !36, line: 71, baseType: !37)
!36 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !38, line: 46, baseType: !39)
!38 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!39 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !5, line: 136, baseType: !41, size: 64, align: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!11, !19, !44, !11}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !5, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !5, line: 140, baseType: !48, size: 64, align: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !5, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !5, line: 144, baseType: !51, size: 24, align: 8, offset: 928)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 24, align: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !5, line: 145, baseType: !55, size: 8, align: 8, offset: 952)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, align: 8, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !5, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !5, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !5, line: 152, baseType: !34, size: 64, align: 64, offset: 1152)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !5, line: 88, size: 128, align: 64, elements: !62, identifier: "_ZTS6__sbuf")
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !5, line: 89, baseType: !8, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !5, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !5, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !67, identifier: "_ZTS13__va_list_tag")
!67 = !{!68, !70, !71, !72}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !69, size: 32, align: 32)
!69 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !69, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !19, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !19, size: 64, align: 64, offset: 128)
!73 = !DICompositeType(tag: DW_TAG_union_type, file: !38, line: 76, size: 1024, align: 64, elements: !74, identifier: "_ZTS11__mbstate_t")
!74 = !{!75, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !38, line: 77, baseType: !76, size: 1024, align: 8)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !38, line: 78, baseType: !39, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !81, line: 73, size: 448, align: 64, elements: !82, identifier: "_ZTS2tm")
!81 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !94}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !81, line: 74, baseType: !11, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !81, line: 75, baseType: !11, size: 32, align: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !81, line: 76, baseType: !11, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !81, line: 77, baseType: !11, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !81, line: 78, baseType: !11, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !81, line: 79, baseType: !11, size: 32, align: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !81, line: 80, baseType: !11, size: 32, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !81, line: 81, baseType: !11, size: 32, align: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !81, line: 82, baseType: !11, size: 32, align: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !81, line: 83, baseType: !93, size: 64, align: 64, offset: 320)
!93 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !81, line: 84, baseType: !28, size: 64, align: 64, offset: 384)
!95 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 82, size: 64, align: 32, elements: !97, identifier: "_ZTS5div_t")
!96 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !96, line: 83, baseType: !11, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !96, line: 84, baseType: !11, size: 32, align: 32, offset: 32)
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 87, size: 128, align: 64, elements: !101, identifier: "_ZTS6ldiv_t")
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !96, line: 88, baseType: !93, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !96, line: 89, baseType: !93, size: 64, align: 64, offset: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 93, size: 128, align: 64, elements: !105, identifier: "_ZTS7lldiv_t")
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !96, line: 94, baseType: !39, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !96, line: 95, baseType: !39, size: 64, align: 64, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "UpdateVector", scope: !110, file: !109, line: 57, size: 832, align: 64, elements: !112, identifier: "_ZTSN6soplex12UpdateVectorE")
!109 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/updatevector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !DINamespace(name: "soplex", scope: null, file: !111, line: 49)
!111 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !114, !117, !118, !123, !128, !132, !137, !142, !145, !146, !147, !150, !156, !160, !163}
!113 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex12UpdateVectorE", baseType: !"_ZTSN6soplex7DVectorE", flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "theval", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 59, baseType: !115, size: 64, align: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !110, file: !111, line: 127, baseType: !116)
!116 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "thedelta", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 60, baseType: !"_ZTSN6soplex8SSVectorE", size: 512, align: 64, offset: 320)
!118 = !DISubprogram(name: "value", linkageName: "_ZN6soplex12UpdateVector5valueEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 64, type: !119, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !115)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex12UpdateVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!123 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex12UpdateVector5valueEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 69, type: !124, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!124 = !DISubroutineType(types: !125)
!125 = !{!115, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!128 = !DISubprogram(name: "delta", linkageName: "_ZN6soplex12UpdateVector5deltaEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 75, type: !129, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !122}
!131 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!132 = !DISubprogram(name: "delta", linkageName: "_ZNK6soplex12UpdateVector5deltaEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 80, type: !133, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !126}
!135 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!137 = !DISubprogram(name: "idx", linkageName: "_ZNK6soplex12UpdateVector3idxEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 86, type: !138, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !126}
!140 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6IdxSetE")
!142 = !DISubprogram(name: "update", linkageName: "_ZN6soplex12UpdateVector6updateEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 96, type: !143, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !122}
!145 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex12UpdateVector5clearEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 102, type: !143, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubprogram(name: "clearUpdate", linkageName: "_ZN6soplex12UpdateVector11clearUpdateEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 109, type: !143, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!147 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex12UpdateVector5reDimEi", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 117, type: !148, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !122, !11}
!150 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex12UpdateVectoraSERKNS_7DVectorE", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 124, type: !151, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !122, !154}
!153 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex12UpdateVectorE")
!154 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7DVectorE")
!156 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex12UpdateVectoraSERKS0_", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 132, type: !157, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!157 = !DISubroutineType(types: !158)
!158 = !{!153, !122, !159}
!159 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !127)
!160 = !DISubprogram(name: "UpdateVector", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 135, type: !161, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !122, !11, !115}
!163 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex12UpdateVector12isConsistentEv", scope: !"_ZTSN6soplex12UpdateVectorE", file: !109, line: 142, type: !164, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !126}
!166 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!167 = !DICompositeType(tag: DW_TAG_class_type, name: "DVector", scope: !110, file: !168, line: 55, size: 256, align: 64, elements: !169, identifier: "_ZTSN6soplex7DVectorE")
!168 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/dvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!169 = !{!170, !171, !172, !174, !181, !186, !187, !188, !191, !194, !195, !198, !202, !205, !206, !209, !212, !213, !216, !217}
!170 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex7DVectorE", baseType: !"_ZTSN6soplex6VectorE", flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "memsize", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 57, baseType: !11, size: 32, align: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 58, baseType: !173, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!174 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 92, type: !175, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7DVectorE")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7DVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!179 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!181 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex7DVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 98, type: !182, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubroutineType(types: !183)
!183 = !{!177, !178, !184}
!184 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!186 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 105, type: !175, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!187 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex7DVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 111, type: !182, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!188 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7DVectormLEd", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 118, type: !189, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{!177, !178, !115}
!191 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex7DVector5reDimEi", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 125, type: !192, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !178, !11}
!194 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEi", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 128, type: !192, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!195 = !DISubprogram(name: "reSize", linkageName: "_ZN6soplex7DVector6reSizeEii", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 131, type: !196, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !178, !11, !11}
!198 = !DISubprogram(name: "memSize", linkageName: "_ZNK6soplex7DVector7memSizeEv", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 134, type: !199, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{!11, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!202 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7DVector12isConsistentEv", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 140, type: !203, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{!166, !201}
!205 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 143, type: !192, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 146, type: !207, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !178, !179}
!209 = !DISubprogram(name: "DVector", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 148, type: !210, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !178, !154}
!212 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 151, type: !175, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKS0_", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 159, type: !214, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubroutineType(types: !215)
!215 = !{!177, !178, !154}
!216 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7DVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 170, type: !182, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!217 = !DISubprogram(name: "~DVector", scope: !"_ZTSN6soplex7DVectorE", file: !168, line: 180, type: !218, isLocal: false, isDefinition: false, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !178}
!220 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !110, file: !221, line: 82, size: 128, align: 64, elements: !222, identifier: "_ZTSN6soplex6VectorE")
!221 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!222 = !{!223, !224, !225, !229, !233, !236, !239, !240, !241, !245, !248, !251, !252, !253, !254, !255, !256, !257, !260, !263, !266, !269, !272, !273, !274, !277, !280, !283, !286, !291, !294, !297}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 90, baseType: !11, size: 32, align: 32, flags: DIFlagProtected)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 96, baseType: !173, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!225 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 107, type: !226, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228, !11, !173}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!229 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 114, type: !230, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !228, !179}
!232 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!233 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 121, type: !234, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{!232, !228, !184}
!236 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 128, type: !237, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{!232, !228, !135}
!239 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 134, type: !234, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!240 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 140, type: !237, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!241 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 146, type: !242, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!11, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!245 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 151, type: !246, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{!121, !228, !11}
!248 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 158, type: !249, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!249 = !DISubroutineType(types: !250)
!250 = !{!115, !244, !11}
!251 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 168, type: !230, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!252 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 170, type: !234, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!253 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 172, type: !237, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 175, type: !230, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 177, type: !234, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!256 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 179, type: !237, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!257 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex6VectormLEd", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 182, type: !258, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{!232, !228, !115}
!260 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 185, type: !261, isLocal: false, isDefinition: false, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!261 = !DISubroutineType(types: !262)
!262 = !{!115, !244, !135}
!263 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 187, type: !264, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{!115, !244, !184}
!266 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 189, type: !267, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{!115, !244, !179}
!269 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex6Vector6maxAbsEv", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 199, type: !270, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{!115, !244}
!272 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex6Vector6lengthEv", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 201, type: !270, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!273 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex6Vector7length2Ev", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 203, type: !270, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 206, type: !275, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{!232, !228, !115, !184}
!277 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 208, type: !278, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{!232, !228, !115, !135}
!280 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKS0_", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 210, type: !281, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{!232, !228, !115, !179}
!283 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex6Vector7get_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 229, type: !284, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!173, !228}
!286 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex6Vector13get_const_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 237, type: !287, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !244}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!291 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6Vector12isConsistentEv", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 245, type: !292, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{!166, !244}
!294 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6Vector5clearEv", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 248, type: !295, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !228}
!297 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !221, line: 256, type: !295, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !110, file: !299, line: 98, size: 64, align: 64, elements: !300, identifier: "_ZTSN6soplex7SVectorE")
!299 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!300 = !{!301, !303, !307, !310, !315, !320, !323, !326, !329, !330, !334, !335, !336, !339, !342, !346, !350, !354, !355, !358, !359, !362, !363, !364, !365, !369, !372, !375, !378, !381, !384, !387, !390, !391, !392}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 120, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!303 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 127, type: !304, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306, !11, !115}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!307 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 138, type: !308, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !306, !184}
!310 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 144, type: !311, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !306, !11, !313, !289}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!315 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 147, type: !316, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !306, !11, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!320 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 150, type: !321, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !306, !11, !11}
!323 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 153, type: !324, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !306, !11}
!326 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 160, type: !327, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !306}
!329 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 165, type: !327, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!330 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 172, type: !331, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!11, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!334 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 181, type: !331, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 190, type: !331, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!336 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 197, type: !337, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{!11, !333, !11}
!339 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 214, type: !340, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{!115, !333, !11}
!342 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 223, type: !343, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !306, !11}
!345 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!346 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 230, type: !347, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !333, !11}
!349 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !319)
!350 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 237, type: !351, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !306, !11}
!353 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !11)
!354 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 244, type: !337, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 251, type: !356, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!121, !306, !11}
!358 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 258, type: !340, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 269, type: !360, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{!115, !333}
!362 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 272, type: !360, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 275, type: !360, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 281, type: !360, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 284, type: !366, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!368, !306, !115}
!368 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!369 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 287, type: !370, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!370 = !DISubroutineType(types: !371)
!371 = !{!115, !333, !179}
!372 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 305, type: !373, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{!368, !306, !135}
!375 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 307, type: !376, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!368, !306, !184}
!378 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 309, type: !379, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!368, !306, !179}
!381 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 312, type: !382, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{!166, !333}
!384 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 324, type: !385, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !306, !11, !302}
!387 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 329, type: !388, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{!302, !333}
!390 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 334, type: !324, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!391 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 340, type: !324, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!392 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 346, type: !385, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !299, line: 109, size: 128, align: 64, elements: !394, identifier: "_ZTSN6soplex7SVector7ElementE")
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !299, line: 111, baseType: !115, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !299, line: 112, baseType: !11, size: 32, align: 32, offset: 64)
!397 = !DICompositeType(tag: DW_TAG_class_type, name: "SSVector", scope: !110, file: !398, line: 50, size: 512, align: 64, elements: !399, identifier: "_ZTSN6soplex8SSVectorE")
!398 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!399 = !{!400, !401, !402, !403, !404, !408, !411, !415, !418, !419, !420, !423, !426, !427, !430, !433, !434, !435, !436, !437, !440, !443, !446, !450, !451, !455, !458, !461, !464, !465, !466, !467, !470, !473, !476, !479, !484, !487, !490, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !505, !508, !511, !512, !513, !514, !515, !516, !517, !518}
!400 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex7DVectorE", flags: DIFlagProtected)
!401 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex6IdxSetE", offset: 256, flags: DIFlagProtected)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "setupStatus", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 53, baseType: !166, size: 8, align: 8, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 64, baseType: !115, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!404 = !DISubprogram(name: "setMax", linkageName: "_ZN6soplex8SSVector6setMaxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 59, type: !405, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !407, !11}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!408 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex8SSVector7get_ptrEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 85, type: !409, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!409 = !DISubroutineType(types: !410)
!410 = !{!173, !407}
!411 = !DISubprogram(name: "isSetup", linkageName: "_ZNK6soplex8SSVector7isSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 91, type: !412, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{!166, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!415 = !DISubprogram(name: "unSetup", linkageName: "_ZN6soplex8SSVector7unSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 97, type: !416, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !407}
!418 = !DISubprogram(name: "setup", linkageName: "_ZN6soplex8SSVector5setupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 106, type: !416, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!419 = !DISubprogram(name: "forceSetup", linkageName: "_ZN6soplex8SSVector10forceSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 109, type: !416, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!420 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex8SSVector5indexEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 119, type: !421, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!421 = !DISubroutineType(types: !422)
!422 = !{!11, !414, !11}
!423 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex8SSVector5valueEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 126, type: !424, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{!115, !414, !11}
!426 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex8SSVector6numberEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 134, type: !421, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!427 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex8SSVector4sizeEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 141, type: !428, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{!11, !414}
!430 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8SSVector3addEid", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 150, type: !431, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !407, !11, !115}
!433 = !DISubprogram(name: "setValue", linkageName: "_ZN6soplex8SSVector8setValueEid", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 159, type: !431, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!434 = !DISubprogram(name: "clearIdx", linkageName: "_ZN6soplex8SSVector8clearIdxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 162, type: !405, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!435 = !DISubprogram(name: "clearNum", linkageName: "_ZN6soplex8SSVector8clearNumEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 174, type: !405, isLocal: false, isDefinition: false, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!436 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex8SSVectorixEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 187, type: !424, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!437 = !DISubprogram(name: "indexMem", linkageName: "_ZNK6soplex8SSVector8indexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 193, type: !438, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!438 = !DISubroutineType(types: !439)
!439 = !{!313, !414}
!440 = !DISubprogram(name: "values", linkageName: "_ZNK6soplex8SSVector6valuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 199, type: !441, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{!289, !414}
!443 = !DISubprogram(name: "indices", linkageName: "_ZNK6soplex8SSVector7indicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 205, type: !444, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{!140, !414}
!446 = !DISubprogram(name: "altIndexMem", linkageName: "_ZN6soplex8SSVector11altIndexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 211, type: !447, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!447 = !DISubroutineType(types: !448)
!448 = !{!449, !407}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!450 = !DISubprogram(name: "altValues", linkageName: "_ZN6soplex8SSVector9altValuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 218, type: !409, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubprogram(name: "altIndices", linkageName: "_ZN6soplex8SSVector10altIndicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 225, type: !452, isLocal: false, isDefinition: false, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !407}
!454 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6IdxSetE")
!455 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 236, type: !456, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!131, !407, !179}
!458 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 238, type: !459, isLocal: false, isDefinition: false, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!459 = !DISubroutineType(types: !460)
!460 = !{!131, !407, !184}
!461 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 240, type: !462, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{!131, !407, !135}
!464 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 243, type: !456, isLocal: false, isDefinition: false, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 245, type: !459, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 247, type: !462, isLocal: false, isDefinition: false, scopeLine: 247, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex8SSVectormLEd", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 250, type: !468, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{!131, !407, !115}
!470 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 253, type: !471, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!471 = !DISubroutineType(types: !472)
!472 = !{!131, !407, !115, !135}
!473 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 255, type: !474, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubroutineType(types: !475)
!475 = !{!131, !407, !115, !184}
!476 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 257, type: !477, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubroutineType(types: !478)
!478 = !{!131, !407, !115, !179}
!479 = !DISubprogram(name: "assign2product", linkageName: "_ZN6soplex8SSVector14assign2productERKS0_RKNS_5SVSetE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 260, type: !480, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubroutineType(types: !481)
!481 = !{!131, !407, !135, !482}
!482 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!484 = !DISubprogram(name: "assign2product4setup", linkageName: "_ZN6soplex8SSVector20assign2product4setupERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 262, type: !485, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{!131, !407, !482, !135}
!487 = !DISubprogram(name: "assign2productAndSetup", linkageName: "_ZN6soplex8SSVector22assign2productAndSetupERKNS_5SVSetERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 264, type: !488, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{!131, !407, !482, !131}
!490 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex8SSVector6maxAbsEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 267, type: !491, isLocal: false, isDefinition: false, scopeLine: 267, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{!115, !414}
!493 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex8SSVector6lengthEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 269, type: !491, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex8SSVector7length2Ev", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 271, type: !491, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!495 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex8SSVector3dimEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 278, type: !428, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!496 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SSVector5reDimEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 284, type: !405, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!497 = !DISubprogram(name: "setSize", linkageName: "_ZN6soplex8SSVector7setSizeEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 287, type: !405, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubprogram(name: "reMem", linkageName: "_ZN6soplex8SSVector5reMemEi", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 296, type: !405, isLocal: false, isDefinition: false, scopeLine: 296, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex8SSVector5clearEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 299, type: !416, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!500 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SSVector12isConsistentEv", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 302, type: !412, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!501 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 309, type: !431, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!502 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 322, type: !503, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !407, !135}
!505 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 334, type: !506, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !407, !179, !115}
!508 = !DISubprogram(name: "setup_and_assign", linkageName: "_ZN6soplex8SSVector16setup_and_assignERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 345, type: !509, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !407, !131}
!511 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex8SSVector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 348, type: !459, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 351, type: !462, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 353, type: !459, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 355, type: !456, isLocal: false, isDefinition: false, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubprogram(name: "~SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 362, type: !416, isLocal: false, isDefinition: false, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubprogram(name: "assign2product1", linkageName: "_ZN6soplex8SSVector15assign2product1ERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 371, type: !485, isLocal: false, isDefinition: false, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true)
!517 = !DISubprogram(name: "assign2productShort", linkageName: "_ZN6soplex8SSVector19assign2productShortERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 372, type: !485, isLocal: false, isDefinition: false, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DISubprogram(name: "assign2productFull", linkageName: "_ZN6soplex8SSVector18assign2productFullERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !398, line: 373, type: !485, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPrototyped, isOptimized: true)
!519 = !DICompositeType(tag: DW_TAG_class_type, name: "IdxSet", scope: !110, file: !520, line: 58, size: 128, align: 64, elements: !521, identifier: "_ZTSN6soplex6IdxSetE")
!520 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/idxset.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!521 = !{!522, !523, !524, !525, !529, !532, !533, !534, !535, !539, !542, !545, !546, !549, !550, !553, !556, !557, !560, !563}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 61, baseType: !11, size: 32, align: 32, flags: DIFlagProtected)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 62, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 63, baseType: !449, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!525 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex6IdxSet5indexEi", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 67, type: !526, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{!11, !528, !11}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!529 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex6IdxSet4sizeEv", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 73, type: !530, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{!11, !528}
!532 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex6IdxSet3maxEv", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 78, type: !530, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6IdxSet3dimEv", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 84, type: !530, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex6IdxSet6numberEi", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 91, type: !526, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addEi", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 94, type: !536, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !538, !11}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6IdxSetE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!539 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addERKS0_", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 101, type: !540, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !538, !140}
!542 = !DISubprogram(name: "add", linkageName: "_ZN6soplex6IdxSet3addEiPKi", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 107, type: !543, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !538, !11, !313}
!545 = !DISubprogram(name: "addIdx", linkageName: "_ZN6soplex6IdxSet6addIdxEi", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 110, type: !536, isLocal: false, isDefinition: false, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex6IdxSet6removeEii", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 116, type: !547, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !538, !11, !11}
!549 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex6IdxSet6removeEi", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 119, type: !536, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!550 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6IdxSet5clearEv", scope: !"_ZTSN6soplex6IdxSetE", file: !520, line: 127, type: !551, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !538}
