; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vsolve.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.soplex::CLUFactor" = type { i32, i32, i32, double, double, double, double, double, %"struct.soplex::CLUFactor::Perm", %"struct.soplex::CLUFactor::Perm", %"struct.soplex::CLUFactor::L", double*, %"struct.soplex::CLUFactor::U", double*, double*, i32, %"class.soplex::CLUFactor::Temp" }
%"struct.soplex::CLUFactor::Perm" = type { i32*, i32* }
%"struct.soplex::CLUFactor::L" = type { i32, double*, i32*, i32, i32, i32, i32*, i32*, i32, double*, i32*, i32*, i32*, i32* }
%"struct.soplex::CLUFactor::U" = type { %"struct.soplex::CLUFactor::U::Row", %"struct.soplex::CLUFactor::U::Col", i32, i32 }
%"struct.soplex::CLUFactor::U::Row" = type { %"struct.soplex::CLUFactor::Dring", %"struct.soplex::CLUFactor::Dring"*, i32, i32, double*, i32*, i32*, i32*, i32* }
%"struct.soplex::CLUFactor::Dring" = type { %"struct.soplex::CLUFactor::Dring"*, %"struct.soplex::CLUFactor::Dring"*, i32 }
%"struct.soplex::CLUFactor::U::Col" = type { %"struct.soplex::CLUFactor::Dring", %"struct.soplex::CLUFactor::Dring"*, i32, i32, i32*, double*, i32*, i32*, i32* }
%"class.soplex::CLUFactor::Temp" = type { i32*, double*, i32*, i32, [4 x i8], %"class.soplex::CLUFactor::Pring", %"class.soplex::CLUFactor::Pring"*, %"class.soplex::CLUFactor::Pring"*, %"class.soplex::CLUFactor::Pring"*, %"class.soplex::CLUFactor::Pring"* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !898, globals: !1393, imports: !1396)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vsolve.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 50, size: 32, align: 32, elements: !5, identifier: "_ZTSN6soplex10SLinSolver6StatusE")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/slinsolver.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "OK", value: 0)
!7 = !DIEnumerator(name: "INSTABLE", value: 1)
!8 = !DIEnumerator(name: "SINGULAR", value: 2)
!9 = !DIEnumerator(name: "UNLOADED", value: 4)
!10 = !DIEnumerator(name: "ERROR", value: 8)
!11 = !{!12, !69, !73, !74, !81, !88, !103, !108, !112, !116, !321, !3, !401, !496, !500, !575, !698, !748, !793, !794, !798, !814, !820, !832, !837, !848, !878}
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !13, line: 122, size: 1216, align: 64, elements: !14, identifier: "_ZTS7__sFILE")
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !{!15, !18, !20, !21, !23, !24, !25, !26, !28, !32, !38, !48, !54, !55, !57, !58, !62, !66, !67, !68}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !13, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !13, line: 124, baseType: !19, size: 32, align: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !13, line: 125, baseType: !19, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !13, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !13, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !13, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !13, line: 129, baseType: !19, size: 32, align: 32, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !13, line: 132, baseType: !27, size: 64, align: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !13, line: 133, baseType: !29, size: 64, align: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!19, !27}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !13, line: 134, baseType: !33, size: 64, align: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!19, !27, !36, !19}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !13, line: 135, baseType: !39, size: 64, align: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !27, !42, !19}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !13, line: 77, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !44, line: 71, baseType: !45)
!44 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !46, line: 46, baseType: !47)
!46 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !13, line: 136, baseType: !49, size: 64, align: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!19, !27, !52, !19}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !13, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !13, line: 140, baseType: !56, size: 64, align: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !13, line: 141, baseType: !19, size: 32, align: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !13, line: 144, baseType: !59, size: 24, align: 8, offset: 928)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !13, line: 145, baseType: !63, size: 8, align: 8, offset: 952)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !13, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !13, line: 151, baseType: !19, size: 32, align: 32, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !13, line: 152, baseType: !42, size: 64, align: 64, offset: 1152)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !13, line: 88, size: 128, align: 64, elements: !70, identifier: "_ZTS6__sbuf")
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !13, line: 89, baseType: !16, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !13, line: 90, baseType: !19, size: 32, align: 32, offset: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !13, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !75, identifier: "_ZTS13__va_list_tag")
!75 = !{!76, !78, !79, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !77, size: 32, align: 32)
!77 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !77, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !27, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !27, size: 64, align: 64, offset: 128)
!81 = !DICompositeType(tag: DW_TAG_union_type, file: !46, line: 76, size: 1024, align: 64, elements: !82, identifier: "_ZTS11__mbstate_t")
!82 = !{!83, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !46, line: 77, baseType: !84, size: 1024, align: 8)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !46, line: 78, baseType: !47, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !89, line: 73, size: 448, align: 64, elements: !90, identifier: "_ZTS2tm")
!89 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !102}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !89, line: 74, baseType: !19, size: 32, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !89, line: 75, baseType: !19, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !89, line: 76, baseType: !19, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !89, line: 77, baseType: !19, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !89, line: 78, baseType: !19, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !89, line: 79, baseType: !19, size: 32, align: 32, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !89, line: 80, baseType: !19, size: 32, align: 32, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !89, line: 81, baseType: !19, size: 32, align: 32, offset: 224)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !89, line: 82, baseType: !19, size: 32, align: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !89, line: 83, baseType: !101, size: 64, align: 64, offset: 320)
!101 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !89, line: 84, baseType: !36, size: 64, align: 64, offset: 384)
!103 = !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 82, size: 64, align: 32, elements: !105, identifier: "_ZTS5div_t")
!104 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !104, line: 83, baseType: !19, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !104, line: 84, baseType: !19, size: 32, align: 32, offset: 32)
!108 = !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 87, size: 128, align: 64, elements: !109, identifier: "_ZTS6ldiv_t")
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !104, line: 88, baseType: !101, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !104, line: 89, baseType: !101, size: 64, align: 64, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 93, size: 128, align: 64, elements: !113, identifier: "_ZTS7lldiv_t")
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !104, line: 94, baseType: !47, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !104, line: 95, baseType: !47, size: 64, align: 64, offset: 64)
!116 = !DICompositeType(tag: DW_TAG_class_type, name: "CLUFactor", scope: !118, file: !117, line: 36, size: 3904, align: 64, elements: !120, identifier: "_ZTSN6soplex9CLUFactorE")
!117 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/clufactor.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!118 = !DINamespace(name: "soplex", scope: null, file: !119, line: 49)
!119 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/spxdefines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!120 = !{!121, !122, !123, !124, !127, !128, !129, !130, !131, !132, !133, !134, !136, !137, !138, !139, !140, !141, !145, !149, !152, !155, !156, !159, !160, !161, !162, !165, !168, !171, !172, !173, !174, !175, !178, !181, !184, !187, !190, !191, !194, !197, !200, !203, !204, !205, !206, !207, !210, !213, !216, !217, !223, !224, !228, !229, !230, !231, !232, !235, !236, !237, !238, !241, !244, !247, !250, !251, !252, !253, !254, !255, !256, !259, !264, !268, !269, !270, !273, !274, !277, !278, !279, !282, !285, !288, !291, !294, !295, !296, !299, !302, !306, !310, !313, !317}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 164, baseType: !"_ZTSN6soplex10SLinSolver6StatusE", size: 32, align: 32, flags: DIFlagProtected)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "thedim", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 166, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nzCnt", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 167, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagProtected)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "initMaxabs", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 168, baseType: !125, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !118, file: !119, line: 127, baseType: !126)
!126 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "maxabs", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 169, baseType: !125, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rowMemMult", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 171, baseType: !125, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "colMemMult", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 172, baseType: !125, size: 64, align: 64, offset: 320, flags: DIFlagProtected)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lMemMult", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 173, baseType: !125, size: 64, align: 64, offset: 384, flags: DIFlagProtected)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 175, baseType: !"_ZTSN6soplex9CLUFactor4PermE", size: 128, align: 64, offset: 448, flags: DIFlagProtected)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 176, baseType: !"_ZTSN6soplex9CLUFactor4PermE", size: 128, align: 64, offset: 576, flags: DIFlagProtected)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 178, baseType: !"_ZTSN6soplex9CLUFactor1LE", size: 832, align: 64, offset: 704, flags: DIFlagProtected)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 179, baseType: !135, size: 64, align: 64, offset: 1536, flags: DIFlagProtected)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 180, baseType: !"_ZTSN6soplex9CLUFactor1UE", size: 1344, align: 64, offset: 1600, flags: DIFlagProtected)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 182, baseType: !135, size: 64, align: 64, offset: 2944, flags: DIFlagProtected)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "work2", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 183, baseType: !135, size: 64, align: 64, offset: 3008, flags: DIFlagProtected)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "factorCount", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 185, baseType: !19, size: 32, align: 32, offset: 3072, flags: DIFlagProtected)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 188, baseType: !"_ZTSN6soplex9CLUFactor4TempE", size: 768, align: 64, offset: 3136)
!141 = !DISubprogram(name: "solveUright", linkageName: "_ZN6soplex9CLUFactor11solveUrightEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 192, type: !142, isLocal: false, isDefinition: false, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !135, !135}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex9CLUFactorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!145 = !DISubprogram(name: "solveUrightEps", linkageName: "_ZN6soplex9CLUFactor14solveUrightEpsEPdPidS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 194, type: !146, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true)
!146 = !DISubroutineType(types: !147)
!147 = !{!19, !144, !135, !148, !125, !135}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!149 = !DISubprogram(name: "solveUright2", linkageName: "_ZN6soplex9CLUFactor12solveUright2EPdS1_S1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 196, type: !150, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !144, !135, !135, !135, !135}
!152 = !DISubprogram(name: "solveUright2eps", linkageName: "_ZN6soplex9CLUFactor15solveUright2epsEPdS1_S1_S1_Pid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 198, type: !153, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true)
!153 = !DISubroutineType(types: !154)
!154 = !{!19, !144, !135, !135, !135, !135, !148, !125}
!155 = !DISubprogram(name: "solveLright2", linkageName: "_ZN6soplex9CLUFactor12solveLright2EPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 201, type: !142, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true)
!156 = !DISubprogram(name: "solveUpdateRight", linkageName: "_ZN6soplex9CLUFactor16solveUpdateRightEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 203, type: !157, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !144, !135}
!159 = !DISubprogram(name: "solveUpdateRight2", linkageName: "_ZN6soplex9CLUFactor17solveUpdateRight2EPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 205, type: !142, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true)
!160 = !DISubprogram(name: "solveUleft", linkageName: "_ZN6soplex9CLUFactor10solveUleftEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 207, type: !142, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true)
!161 = !DISubprogram(name: "solveUleft2", linkageName: "_ZN6soplex9CLUFactor11solveUleft2EPdS1_S1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 209, type: !150, isLocal: false, isDefinition: false, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true)
!162 = !DISubprogram(name: "solveLleft2forest", linkageName: "_ZN6soplex9CLUFactor17solveLleft2forestEPdPiS1_d", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 212, type: !163, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{!19, !144, !135, !148, !135, !125}
!165 = !DISubprogram(name: "solveLleft2", linkageName: "_ZN6soplex9CLUFactor11solveLleft2EPdPiS1_d", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 215, type: !166, isLocal: false, isDefinition: false, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !144, !135, !148, !135, !125}
!168 = !DISubprogram(name: "solveLleftForest", linkageName: "_ZN6soplex9CLUFactor16solveLleftForestEPdPid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 218, type: !169, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true)
!169 = !DISubroutineType(types: !170)
!170 = !{!19, !144, !135, !148, !125}
!171 = !DISubprogram(name: "solveLleft", linkageName: "_ZN6soplex9CLUFactor10solveLleftEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 220, type: !157, isLocal: false, isDefinition: false, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: true)
!172 = !DISubprogram(name: "solveLleftEps", linkageName: "_ZN6soplex9CLUFactor13solveLleftEpsEPdPid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 222, type: !169, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true)
!173 = !DISubprogram(name: "solveUpdateLeft", linkageName: "_ZN6soplex9CLUFactor15solveUpdateLeftEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 224, type: !157, isLocal: false, isDefinition: false, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true)
!174 = !DISubprogram(name: "solveUpdateLeft2", linkageName: "_ZN6soplex9CLUFactor16solveUpdateLeft2EPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 226, type: !142, isLocal: false, isDefinition: false, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true)
!175 = !DISubprogram(name: "vSolveLright", linkageName: "_ZN6soplex9CLUFactor12vSolveLrightEPdPiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 230, type: !176, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!19, !144, !135, !148, !19, !125}
!178 = !DISubprogram(name: "vSolveLright2", linkageName: "_ZN6soplex9CLUFactor13vSolveLright2EPdPiS2_dS1_S2_S2_d", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 231, type: !179, isLocal: false, isDefinition: false, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !144, !135, !148, !148, !125, !135, !148, !148, !125}
!181 = !DISubprogram(name: "vSolveUright", linkageName: "_ZN6soplex9CLUFactor12vSolveUrightEPdPiS1_S2_id", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 234, type: !182, isLocal: false, isDefinition: false, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true)
!182 = !DISubroutineType(types: !183)
!183 = !{!19, !144, !135, !148, !135, !148, !19, !125}
!184 = !DISubprogram(name: "vSolveUrightNoNZ", linkageName: "_ZN6soplex9CLUFactor16vSolveUrightNoNZEPdS1_Piid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 237, type: !185, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !144, !135, !135, !148, !19, !125}
!187 = !DISubprogram(name: "vSolveUright2", linkageName: "_ZN6soplex9CLUFactor13vSolveUright2EPdPiS1_S2_idS1_S1_S2_id", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 240, type: !188, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true)
!188 = !DISubroutineType(types: !189)
!189 = !{!19, !144, !135, !148, !135, !148, !19, !125, !135, !135, !148, !19, !125}
!190 = !DISubprogram(name: "vSolveUpdateRight", linkageName: "_ZN6soplex9CLUFactor17vSolveUpdateRightEPdPiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 244, type: !176, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true)
!191 = !DISubprogram(name: "vSolveUpdateRightNoNZ", linkageName: "_ZN6soplex9CLUFactor21vSolveUpdateRightNoNZEPdd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 246, type: !192, isLocal: false, isDefinition: false, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !144, !135, !125}
!194 = !DISubprogram(name: "solveUleft", linkageName: "_ZN6soplex9CLUFactor10solveUleftEdPdPiS1_S2_i", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 248, type: !195, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true)
!195 = !DISubroutineType(types: !196)
!196 = !{!19, !144, !125, !135, !148, !135, !148, !19}
!197 = !DISubprogram(name: "solveUleftNoNZ", linkageName: "_ZN6soplex9CLUFactor14solveUleftNoNZEdPdS1_Pii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 251, type: !198, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !144, !125, !135, !135, !148, !19}
!200 = !DISubprogram(name: "solveLleftForest", linkageName: "_ZN6soplex9CLUFactor16solveLleftForestEdPdPii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 254, type: !201, isLocal: false, isDefinition: false, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true)
!201 = !DISubroutineType(types: !202)
!202 = !{!19, !144, !125, !135, !148, !19}
!203 = !DISubprogram(name: "solveLleftForestNoNZ", linkageName: "_ZN6soplex9CLUFactor20solveLleftForestNoNZEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 256, type: !157, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!204 = !DISubprogram(name: "solveLleft", linkageName: "_ZN6soplex9CLUFactor10solveLleftEdPdPii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 258, type: !201, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true)
!205 = !DISubprogram(name: "solveLleftNoNZ", linkageName: "_ZN6soplex9CLUFactor14solveLleftNoNZEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 260, type: !157, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true)
!206 = !DISubprogram(name: "solveUpdateLeft", linkageName: "_ZN6soplex9CLUFactor15solveUpdateLeftEdPdPii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 262, type: !201, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true)
!207 = !DISubprogram(name: "forestPackColumns", linkageName: "_ZN6soplex9CLUFactor17forestPackColumnsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 266, type: !208, isLocal: false, isDefinition: false, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !144}
!210 = !DISubprogram(name: "forestMinColMem", linkageName: "_ZN6soplex9CLUFactor15forestMinColMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 268, type: !211, isLocal: false, isDefinition: false, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !144, !19}
!213 = !DISubprogram(name: "forestReMaxCol", linkageName: "_ZN6soplex9CLUFactor14forestReMaxColEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 270, type: !214, isLocal: false, isDefinition: false, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !144, !19, !19}
!216 = !DISubprogram(name: "initPerm", linkageName: "_ZN6soplex9CLUFactor8initPermEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 274, type: !208, isLocal: false, isDefinition: false, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true)
!217 = !DISubprogram(name: "initFactorMatrix", linkageName: "_ZN6soplex9CLUFactor16initFactorMatrixEPPNS_7SVectorEd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 276, type: !218, isLocal: false, isDefinition: false, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !144, !220, !222}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!223 = !DISubprogram(name: "minLMem", linkageName: "_ZN6soplex9CLUFactor7minLMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 278, type: !211, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: true)
!224 = !DISubprogram(name: "setPivot", linkageName: "_ZN6soplex9CLUFactor8setPivotEiiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 280, type: !225, isLocal: false, isDefinition: false, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !144, !227, !227, !227, !222}
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!228 = !DISubprogram(name: "colSingletons", linkageName: "_ZN6soplex9CLUFactor13colSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 283, type: !208, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true)
!229 = !DISubprogram(name: "rowSingletons", linkageName: "_ZN6soplex9CLUFactor13rowSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 285, type: !208, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true)
!230 = !DISubprogram(name: "initFactorRings", linkageName: "_ZN6soplex9CLUFactor15initFactorRingsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 288, type: !208, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: true)
!231 = !DISubprogram(name: "freeFactorRings", linkageName: "_ZN6soplex9CLUFactor15freeFactorRingsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 290, type: !208, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true)
!232 = !DISubprogram(name: "setupColVals", linkageName: "_ZN6soplex9CLUFactor12setupColValsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 293, type: !233, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{!19, !144}
!235 = !DISubprogram(name: "setupRowVals", linkageName: "_ZN6soplex9CLUFactor12setupRowValsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 295, type: !208, isLocal: false, isDefinition: false, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true)
!236 = !DISubprogram(name: "eliminateRowSingletons", linkageName: "_ZN6soplex9CLUFactor22eliminateRowSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 298, type: !208, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true)
!237 = !DISubprogram(name: "eliminateColSingletons", linkageName: "_ZN6soplex9CLUFactor22eliminateColSingletonsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 300, type: !208, isLocal: false, isDefinition: false, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true)
!238 = !DISubprogram(name: "selectPivots", linkageName: "_ZN6soplex9CLUFactor12selectPivotsEd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 302, type: !239, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !144, !125}
!241 = !DISubprogram(name: "updateRow", linkageName: "_ZN6soplex9CLUFactor9updateRowEiiiidd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 304, type: !242, isLocal: false, isDefinition: false, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!19, !144, !19, !19, !19, !19, !125, !125}
!244 = !DISubprogram(name: "eliminatePivot", linkageName: "_ZN6soplex9CLUFactor14eliminatePivotEiid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 307, type: !245, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !144, !19, !19, !125}
!247 = !DISubprogram(name: "eliminateNucleus", linkageName: "_ZN6soplex9CLUFactor16eliminateNucleusEdd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 309, type: !248, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !144, !222, !222}
!250 = !DISubprogram(name: "minRowMem", linkageName: "_ZN6soplex9CLUFactor9minRowMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 311, type: !211, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true)
!251 = !DISubprogram(name: "minColMem", linkageName: "_ZN6soplex9CLUFactor9minColMemEi", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 313, type: !211, isLocal: false, isDefinition: false, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true)
!252 = !DISubprogram(name: "remaxCol", linkageName: "_ZN6soplex9CLUFactor8remaxColEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 315, type: !214, isLocal: false, isDefinition: false, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true)
!253 = !DISubprogram(name: "packRows", linkageName: "_ZN6soplex9CLUFactor8packRowsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 317, type: !208, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DISubprogram(name: "packColumns", linkageName: "_ZN6soplex9CLUFactor11packColumnsEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 319, type: !208, isLocal: false, isDefinition: false, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true)
!255 = !DISubprogram(name: "remaxRow", linkageName: "_ZN6soplex9CLUFactor8remaxRowEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 321, type: !214, isLocal: false, isDefinition: false, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: true)
!256 = !DISubprogram(name: "makeLvec", linkageName: "_ZN6soplex9CLUFactor8makeLvecEii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 323, type: !257, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true)
!257 = !DISubroutineType(types: !258)
!258 = !{!19, !144, !19, !19}
!259 = !DISubprogram(name: "CLUFactor", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 326, type: !260, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !144, !262}
!262 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex9CLUFactorE")
!264 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex9CLUFactoraSERKS0_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 328, type: !265, isLocal: false, isDefinition: false, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !144, !262}
!267 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex9CLUFactorE")
!268 = !DISubprogram(name: "CLUFactor", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 335, type: !208, isLocal: false, isDefinition: false, scopeLine: 335, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!269 = !DISubprogram(name: "solveLright", linkageName: "_ZN6soplex9CLUFactor11solveLrightEPd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 340, type: !157, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubprogram(name: "solveRight4update", linkageName: "_ZN6soplex9CLUFactor17solveRight4updateEPdPidS1_S1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 342, type: !271, isLocal: false, isDefinition: false, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{!19, !144, !135, !148, !125, !135, !135, !148, !148}
!273 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex9CLUFactor10solveRightEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 345, type: !142, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubprogram(name: "solveRight2update", linkageName: "_ZN6soplex9CLUFactor17solveRight2updateEPdS1_S1_S1_PidS1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 347, type: !275, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{!19, !144, !135, !135, !135, !135, !148, !125, !135, !148, !148}
!277 = !DISubprogram(name: "solveRight2", linkageName: "_ZN6soplex9CLUFactor11solveRight2EPdS1_S1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 351, type: !150, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex9CLUFactor9solveLeftEPdS1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 353, type: !142, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!279 = !DISubprogram(name: "solveLeftEps", linkageName: "_ZN6soplex9CLUFactor12solveLeftEpsEPdS1_Pid", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 355, type: !280, isLocal: false, isDefinition: false, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubroutineType(types: !281)
!281 = !{!19, !144, !135, !135, !148, !125}
!282 = !DISubprogram(name: "solveLeft2", linkageName: "_ZN6soplex9CLUFactor10solveLeft2EPdPiS1_dS1_S1_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 357, type: !283, isLocal: false, isDefinition: false, scopeLine: 357, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!283 = !DISubroutineType(types: !284)
!284 = !{!19, !144, !135, !148, !135, !125, !135, !135}
!285 = !DISubprogram(name: "vSolveRight4update", linkageName: "_ZN6soplex9CLUFactor18vSolveRight4updateEdPdPiS1_S2_iS1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 362, type: !286, isLocal: false, isDefinition: false, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!286 = !DISubroutineType(types: !287)
!287 = !{!19, !144, !125, !135, !148, !135, !148, !19, !135, !148, !148}
!288 = !DISubprogram(name: "vSolveRight4update2", linkageName: "_ZN6soplex9CLUFactor19vSolveRight4update2EdPdPiS1_S2_iS1_dS1_S2_iS1_S2_S2_", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 366, type: !289, isLocal: false, isDefinition: false, scopeLine: 366, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!289 = !DISubroutineType(types: !290)
!290 = !{!19, !144, !125, !135, !148, !135, !148, !19, !135, !125, !135, !148, !19, !135, !148, !148}
!291 = !DISubprogram(name: "vSolveRightNoNZ", linkageName: "_ZN6soplex9CLUFactor15vSolveRightNoNZEPddS1_Pii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 373, type: !292, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !144, !135, !125, !135, !148, !19}
!294 = !DISubprogram(name: "vSolveLeft", linkageName: "_ZN6soplex9CLUFactor10vSolveLeftEdPdPiS1_S2_i", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 376, type: !195, isLocal: false, isDefinition: false, scopeLine: 376, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubprogram(name: "vSolveLeftNoNZ", linkageName: "_ZN6soplex9CLUFactor14vSolveLeftNoNZEdPdS1_Pii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 380, type: !198, isLocal: false, isDefinition: false, scopeLine: 380, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!296 = !DISubprogram(name: "vSolveLeft2", linkageName: "_ZN6soplex9CLUFactor11vSolveLeft2EdPdPiS1_S2_iS1_S1_S2_i", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 384, type: !297, isLocal: false, isDefinition: false, scopeLine: 384, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{!19, !144, !125, !135, !148, !135, !148, !19, !135, !135, !148, !19}
!299 = !DISubprogram(name: "forestUpdate", linkageName: "_ZN6soplex9CLUFactor12forestUpdateEiPdiPi", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 391, type: !300, isLocal: false, isDefinition: false, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !144, !19, !135, !19, !148}
!302 = !DISubprogram(name: "update", linkageName: "_ZN6soplex9CLUFactor6updateEiPdPKii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 394, type: !303, isLocal: false, isDefinition: false, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !144, !19, !135, !305, !19}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!306 = !DISubprogram(name: "updateNoClear", linkageName: "_ZN6soplex9CLUFactor13updateNoClearEiPKdPKii", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 395, type: !307, isLocal: false, isDefinition: false, scopeLine: 395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !144, !19, !309, !305, !19}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!310 = !DISubprogram(name: "factor", linkageName: "_ZN6soplex9CLUFactor6factorEPPNS_7SVectorEdd", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 401, type: !311, isLocal: false, isDefinition: false, scopeLine: 401, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !144, !220, !125, !125}
!313 = !DISubprogram(name: "dump", linkageName: "_ZNK6soplex9CLUFactor4dumpEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 406, type: !314, isLocal: false, isDefinition: false, scopeLine: 406, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!317 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex9CLUFactor12isConsistentEv", scope: !"_ZTSN6soplex9CLUFactorE", file: !117, line: 408, type: !318, isLocal: false, isDefinition: false, scopeLine: 408, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{!320, !316}
!320 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!321 = !DICompositeType(tag: DW_TAG_class_type, name: "SLinSolver", scope: !118, file: !4, line: 46, size: 64, align: 64, elements: !322, vtableHolder: !"_ZTSN6soplex10SLinSolverE", identifier: "_ZTSN6soplex10SLinSolverE")
!322 = !{!323, !328, !333, !337, !340, !341, !347, !350, !356, !359, !363, !367, !370, !373, !378, !381, !384, !387, !388, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$SLinSolver", scope: !4, file: !4, baseType: !324, size: 64, flags: DIFlagArtificial)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!19}
!328 = !DISubprogram(name: "status", linkageName: "_ZNK6soplex10SLinSolver6statusEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 69, type: !329, isLocal: false, isDefinition: false, scopeLine: 69, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex10SLinSolverE")
!333 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex10SLinSolver5clearEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 72, type: !334, isLocal: false, isDefinition: false, scopeLine: 72, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex10SLinSolverE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!337 = !DISubprogram(name: "memory", linkageName: "_ZNK6soplex10SLinSolver6memoryEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 75, type: !338, isLocal: false, isDefinition: false, scopeLine: 75, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{!19, !331}
!340 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex10SLinSolver3dimEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 78, type: !338, isLocal: false, isDefinition: false, scopeLine: 78, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubprogram(name: "load", linkageName: "_ZN6soplex10SLinSolver4loadEPPKNS_7SVectorEi", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 84, type: !342, isLocal: false, isDefinition: false, scopeLine: 84, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !336, !344, !19}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVectorE")
!347 = !DISubprogram(name: "stability", linkageName: "_ZNK6soplex10SLinSolver9stabilityEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 90, type: !348, isLocal: false, isDefinition: false, scopeLine: 90, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{!125, !331}
!350 = !DISubprogram(name: "change", linkageName: "_ZN6soplex10SLinSolver6changeEiRKNS_7SVectorEPKNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 98, type: !351, isLocal: false, isDefinition: false, scopeLine: 98, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{!"_ZTSN6soplex10SLinSolver6StatusE", !336, !19, !353, !354}
!353 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !346)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex8SSVectorE")
!356 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex10SLinSolver12isConsistentEv", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 102, type: !357, isLocal: false, isDefinition: false, scopeLine: 102, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!357 = !DISubroutineType(types: !358)
!358 = !{!320, !331}
!359 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_6VectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 130, type: !360, isLocal: false, isDefinition: false, scopeLine: 130, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !336, !362, !362}
!362 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6VectorE")
!363 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 132, type: !364, isLocal: false, isDefinition: false, scopeLine: 132, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !336, !362, !366}
!366 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex8SSVectorE")
!367 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 134, type: !368, isLocal: false, isDefinition: false, scopeLine: 134, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !336, !366, !362}
!370 = !DISubprogram(name: "solve2right", linkageName: "_ZN6soplex10SLinSolver11solve2rightERNS_8SSVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 136, type: !371, isLocal: false, isDefinition: false, scopeLine: 136, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !336, !366, !366}
!373 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_6VectorERKS1_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 139, type: !374, isLocal: false, isDefinition: false, scopeLine: 139, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !336, !362, !376}
!376 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6VectorE")
!378 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 141, type: !379, isLocal: false, isDefinition: false, scopeLine: 141, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !336, !362, !353}
!381 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 143, type: !382, isLocal: false, isDefinition: false, scopeLine: 143, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !336, !366, !376}
!384 = !DISubprogram(name: "solveRight", linkageName: "_ZN6soplex10SLinSolver10solveRightERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 145, type: !385, isLocal: false, isDefinition: false, scopeLine: 145, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !336, !366, !353}
!387 = !DISubprogram(name: "solveRight4update", linkageName: "_ZN6soplex10SLinSolver17solveRight4updateERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 152, type: !385, isLocal: false, isDefinition: false, scopeLine: 152, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!388 = !DISubprogram(name: "solve2right4update", linkageName: "_ZN6soplex10SLinSolver18solve2right4updateERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 155, type: !389, isLocal: false, isDefinition: false, scopeLine: 155, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !336, !366, !362, !353, !366}
!391 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_6VectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 161, type: !360, isLocal: false, isDefinition: false, scopeLine: 161, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!392 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_6VectorERNS_8SSVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 163, type: !364, isLocal: false, isDefinition: false, scopeLine: 163, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_8SSVectorERNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 165, type: !368, isLocal: false, isDefinition: false, scopeLine: 165, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 20, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubprogram(name: "solve2left", linkageName: "_ZN6soplex10SLinSolver10solve2leftERNS_8SSVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 167, type: !371, isLocal: false, isDefinition: false, scopeLine: 167, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!395 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_6VectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 170, type: !379, isLocal: false, isDefinition: false, scopeLine: 170, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!396 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_6VectorERKS1_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 172, type: !374, isLocal: false, isDefinition: false, scopeLine: 172, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERKNS_7SVectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 174, type: !385, isLocal: false, isDefinition: false, scopeLine: 174, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 24, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!398 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERKNS_6VectorE", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 176, type: !382, isLocal: false, isDefinition: false, scopeLine: 176, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!399 = !DISubprogram(name: "solveLeft", linkageName: "_ZN6soplex10SLinSolver9solveLeftERNS_8SSVectorERNS_6VectorERKNS_7SVectorES2_", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 179, type: !389, isLocal: false, isDefinition: false, scopeLine: 179, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 26, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!400 = !DISubprogram(name: "~SLinSolver", scope: !"_ZTSN6soplex10SLinSolverE", file: !4, line: 189, type: !334, isLocal: false, isDefinition: false, scopeLine: 189, containingType: !"_ZTSN6soplex10SLinSolverE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!401 = !DICompositeType(tag: DW_TAG_class_type, name: "SVector", scope: !118, file: !402, line: 98, size: 64, align: 64, elements: !403, identifier: "_ZTSN6soplex7SVectorE")
!402 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/svector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!403 = !{!404, !406, !410, !413, !416, !421, !424, !427, !430, !431, !435, !436, !437, !440, !443, !447, !451, !455, !456, !460, !461, !464, !465, !466, !467, !471, !474, !478, !481, !484, !487, !490, !493, !494, !495}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "m_elem", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 120, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVector7ElementE", size: 64, align: 64)
!406 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEid", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 127, type: !407, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !409, !19, !125}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex7SVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!410 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 138, type: !411, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !409, !353}
!413 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKiPKd", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 144, type: !414, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !409, !19, !305, !309}
!416 = !DISubprogram(name: "add", linkageName: "_ZN6soplex7SVector3addEiPKNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 147, type: !417, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !409, !19, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!421 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEii", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 150, type: !422, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !409, !19, !19}
!424 = !DISubprogram(name: "remove", linkageName: "_ZN6soplex7SVector6removeEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 153, type: !425, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !409, !19}
!427 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex7SVector5clearEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 160, type: !428, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !409}
!430 = !DISubprogram(name: "sort", linkageName: "_ZN6soplex7SVector4sortEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 165, type: !428, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!431 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex7SVector4sizeEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 172, type: !432, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!19, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!435 = !DISubprogram(name: "max", linkageName: "_ZNK6soplex7SVector3maxEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 181, type: !432, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!436 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex7SVector3dimEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 190, type: !432, isLocal: false, isDefinition: false, scopeLine: 190, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!437 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex7SVector6numberEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 197, type: !438, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!438 = !DISubroutineType(types: !439)
!439 = !{!19, !434, !19}
!440 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex7SVectorixEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 214, type: !441, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{!125, !434, !19}
!443 = !DISubprogram(name: "element", linkageName: "_ZN6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 223, type: !444, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !409, !19}
!446 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVector7ElementE")
!447 = !DISubprogram(name: "element", linkageName: "_ZNK6soplex7SVector7elementEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 230, type: !448, isLocal: false, isDefinition: false, scopeLine: 230, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !434, !19}
!450 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !420)
!451 = !DISubprogram(name: "index", linkageName: "_ZN6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 237, type: !452, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !409, !19}
!454 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !19)
!455 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex7SVector5indexEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 244, type: !438, isLocal: false, isDefinition: false, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubprogram(name: "value", linkageName: "_ZN6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 251, type: !457, isLocal: false, isDefinition: false, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !409, !19}
!459 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !125)
!460 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex7SVector5valueEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 258, type: !441, isLocal: false, isDefinition: false, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex7SVector6maxAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 269, type: !462, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{!125, !434}
!464 = !DISubprogram(name: "minAbs", linkageName: "_ZNK6soplex7SVector6minAbsEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 272, type: !462, isLocal: false, isDefinition: false, scopeLine: 272, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex7SVector6lengthEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 275, type: !462, isLocal: false, isDefinition: false, scopeLine: 275, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex7SVector7length2Ev", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 281, type: !462, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!467 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex7SVectormLEd", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 284, type: !468, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !409, !125}
!470 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex7SVectorE")
!471 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex7SVectormlERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 287, type: !472, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{!125, !434, !376}
!474 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 305, type: !475, isLocal: false, isDefinition: false, scopeLine: 305, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!470, !409, !477}
!477 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !355)
!478 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKS0_", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 307, type: !479, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubroutineType(types: !480)
!480 = !{!470, !409, !353}
!481 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex7SVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 309, type: !482, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{!470, !409, !376}
!484 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex7SVector12isConsistentEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 312, type: !485, isLocal: false, isDefinition: false, scopeLine: 312, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{!320, !434}
!487 = !DISubprogram(name: "SVector", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 324, type: !488, isLocal: false, isDefinition: false, scopeLine: 324, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !409, !19, !405}
!490 = !DISubprogram(name: "mem", linkageName: "_ZNK6soplex7SVector3memEv", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 329, type: !491, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{!405, !434}
!493 = !DISubprogram(name: "set_size", linkageName: "_ZN6soplex7SVector8set_sizeEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 334, type: !425, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubprogram(name: "set_max", linkageName: "_ZN6soplex7SVector7set_maxEi", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 340, type: !425, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!495 = !DISubprogram(name: "setMem", linkageName: "_ZN6soplex7SVector6setMemEiPNS0_7ElementE", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 346, type: !488, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Element", scope: !"_ZTSN6soplex7SVectorE", file: !402, line: 109, size: 128, align: 64, elements: !497, identifier: "_ZTSN6soplex7SVector7ElementE")
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex7SVector7ElementE", file: !402, line: 111, baseType: !125, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !"_ZTSN6soplex7SVector7ElementE", file: !402, line: 112, baseType: !19, size: 32, align: 32, offset: 64)
!500 = !DICompositeType(tag: DW_TAG_class_type, name: "Vector", scope: !118, file: !501, line: 82, size: 128, align: 64, elements: !502, identifier: "_ZTSN6soplex6VectorE")
!501 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/vector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!502 = !{!503, !504, !505, !509, !512, !515, !518, !519, !520, !524, !527, !530, !531, !532, !533, !534, !535, !536, !539, !542, !545, !548, !551, !552, !553, !556, !559, !562, !565, !568, !571, !574}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dimen", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 90, baseType: !19, size: 32, align: 32, flags: DIFlagProtected)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 96, baseType: !135, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!505 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 107, type: !506, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508, !19, !135}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex6VectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!509 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 114, type: !510, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{!362, !508, !376}
!512 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 121, type: !513, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubroutineType(types: !514)
!514 = !{!362, !508, !353}
!515 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex6VectoraSERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 128, type: !516, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubroutineType(types: !517)
!517 = !{!362, !508, !477}
!518 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 134, type: !513, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex6Vector6assignERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 140, type: !516, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex6Vector3dimEv", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 146, type: !521, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{!19, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!524 = !DISubprogram(name: "operator[]", linkageName: "_ZN6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 151, type: !525, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{!459, !508, !19}
!527 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex6VectorixEi", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 158, type: !528, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubroutineType(types: !529)
!529 = !{!125, !523, !19}
!530 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 168, type: !510, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 170, type: !513, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!532 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex6VectorpLERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 172, type: !516, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 175, type: !510, isLocal: false, isDefinition: false, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 177, type: !513, isLocal: false, isDefinition: false, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex6VectormIERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 179, type: !516, isLocal: false, isDefinition: false, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex6VectormLEd", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 182, type: !537, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubroutineType(types: !538)
!538 = !{!362, !508, !125}
!539 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 185, type: !540, isLocal: false, isDefinition: false, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{!125, !523, !477}
!542 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 187, type: !543, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{!125, !523, !353}
!545 = !DISubprogram(name: "operator*", linkageName: "_ZNK6soplex6VectormlERKS0_", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 189, type: !546, isLocal: false, isDefinition: false, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!546 = !DISubroutineType(types: !547)
!547 = !{!125, !523, !376}
!548 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex6Vector6maxAbsEv", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 199, type: !549, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubroutineType(types: !550)
!550 = !{!125, !523}
!551 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex6Vector6lengthEv", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 201, type: !549, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!552 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex6Vector7length2Ev", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 203, type: !549, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!553 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 206, type: !554, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{!362, !508, !125, !353}
!556 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKNS_8SSVectorE", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 208, type: !557, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!557 = !DISubroutineType(types: !558)
!558 = !{!362, !508, !125, !477}
!559 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex6Vector7multAddEdRKS0_", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 210, type: !560, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubroutineType(types: !561)
!561 = !{!362, !508, !125, !376}
!562 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex6Vector7get_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 229, type: !563, isLocal: false, isDefinition: false, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!563 = !DISubroutineType(types: !564)
!564 = !{!135, !508}
!565 = !DISubprogram(name: "get_const_ptr", linkageName: "_ZNK6soplex6Vector13get_const_ptrEv", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 237, type: !566, isLocal: false, isDefinition: false, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{!309, !523}
!568 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex6Vector12isConsistentEv", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 245, type: !569, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{!320, !523}
!571 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex6Vector5clearEv", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 248, type: !572, isLocal: false, isDefinition: false, scopeLine: 248, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !508}
!574 = !DISubprogram(name: "Vector", scope: !"_ZTSN6soplex6VectorE", file: !501, line: 256, type: !572, isLocal: false, isDefinition: false, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true)
!575 = !DICompositeType(tag: DW_TAG_class_type, name: "SSVector", scope: !118, file: !576, line: 50, size: 512, align: 64, elements: !577, identifier: "_ZTSN6soplex8SSVectorE")
!576 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/450.soplex/src/ssvector.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!577 = !{!578, !579, !580, !581, !582, !586, !589, !593, !596, !597, !598, !601, !604, !605, !608, !611, !612, !613, !614, !615, !618, !621, !626, !629, !630, !634, !637, !640, !643, !644, !645, !646, !649, !652, !655, !658, !663, !666, !669, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !684, !687, !690, !691, !692, !693, !694, !695, !696, !697}
!578 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex7DVectorE", flags: DIFlagProtected)
!579 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN6soplex8SSVectorE", baseType: !"_ZTSN6soplex6IdxSetE", offset: 256, flags: DIFlagProtected)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "setupStatus", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 53, baseType: !320, size: 8, align: 8, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 64, baseType: !125, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!582 = !DISubprogram(name: "setMax", linkageName: "_ZN6soplex8SSVector6setMaxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 59, type: !583, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !585, !19}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN6soplex8SSVectorE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!586 = !DISubprogram(name: "get_ptr", linkageName: "_ZN6soplex8SSVector7get_ptrEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 85, type: !587, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubroutineType(types: !588)
!588 = !{!135, !585}
!589 = !DISubprogram(name: "isSetup", linkageName: "_ZNK6soplex8SSVector7isSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 91, type: !590, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{!320, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!593 = !DISubprogram(name: "unSetup", linkageName: "_ZN6soplex8SSVector7unSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 97, type: !594, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !585}
!596 = !DISubprogram(name: "setup", linkageName: "_ZN6soplex8SSVector5setupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 106, type: !594, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubprogram(name: "forceSetup", linkageName: "_ZN6soplex8SSVector10forceSetupEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 109, type: !594, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubprogram(name: "index", linkageName: "_ZNK6soplex8SSVector5indexEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 119, type: !599, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!599 = !DISubroutineType(types: !600)
!600 = !{!19, !592, !19}
!601 = !DISubprogram(name: "value", linkageName: "_ZNK6soplex8SSVector5valueEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 126, type: !602, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubroutineType(types: !603)
!603 = !{!125, !592, !19}
!604 = !DISubprogram(name: "number", linkageName: "_ZNK6soplex8SSVector6numberEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 134, type: !599, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "size", linkageName: "_ZNK6soplex8SSVector4sizeEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 141, type: !606, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{!19, !592}
!608 = !DISubprogram(name: "add", linkageName: "_ZN6soplex8SSVector3addEid", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 150, type: !609, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !585, !19, !125}
!611 = !DISubprogram(name: "setValue", linkageName: "_ZN6soplex8SSVector8setValueEid", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 159, type: !609, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubprogram(name: "clearIdx", linkageName: "_ZN6soplex8SSVector8clearIdxEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 162, type: !583, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubprogram(name: "clearNum", linkageName: "_ZN6soplex8SSVector8clearNumEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 174, type: !583, isLocal: false, isDefinition: false, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6soplex8SSVectorixEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 187, type: !602, isLocal: false, isDefinition: false, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "indexMem", linkageName: "_ZNK6soplex8SSVector8indexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 193, type: !616, isLocal: false, isDefinition: false, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubroutineType(types: !617)
!617 = !{!305, !592}
!618 = !DISubprogram(name: "values", linkageName: "_ZNK6soplex8SSVector6valuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 199, type: !619, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!619 = !DISubroutineType(types: !620)
!620 = !{!309, !592}
!621 = !DISubprogram(name: "indices", linkageName: "_ZNK6soplex8SSVector7indicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 205, type: !622, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{!624, !592}
!624 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex6IdxSetE")
!626 = !DISubprogram(name: "altIndexMem", linkageName: "_ZN6soplex8SSVector11altIndexMemEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 211, type: !627, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubroutineType(types: !628)
!628 = !{!148, !585}
!629 = !DISubprogram(name: "altValues", linkageName: "_ZN6soplex8SSVector9altValuesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 218, type: !587, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!630 = !DISubprogram(name: "altIndices", linkageName: "_ZN6soplex8SSVector10altIndicesEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 225, type: !631, isLocal: false, isDefinition: false, scopeLine: 225, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!631 = !DISubroutineType(types: !632)
!632 = !{!633, !585}
!633 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN6soplex6IdxSetE")
!634 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 236, type: !635, isLocal: false, isDefinition: false, scopeLine: 236, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{!366, !585, !376}
!637 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 238, type: !638, isLocal: false, isDefinition: false, scopeLine: 238, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!638 = !DISubroutineType(types: !639)
!639 = !{!366, !585, !353}
!640 = !DISubprogram(name: "operator+=", linkageName: "_ZN6soplex8SSVectorpLERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 240, type: !641, isLocal: false, isDefinition: false, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!641 = !DISubroutineType(types: !642)
!642 = !{!366, !585, !477}
!643 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 243, type: !635, isLocal: false, isDefinition: false, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!644 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 245, type: !638, isLocal: false, isDefinition: false, scopeLine: 245, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubprogram(name: "operator-=", linkageName: "_ZN6soplex8SSVectormIERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 247, type: !641, isLocal: false, isDefinition: false, scopeLine: 247, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubprogram(name: "operator*=", linkageName: "_ZN6soplex8SSVectormLEd", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 250, type: !647, isLocal: false, isDefinition: false, scopeLine: 250, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{!366, !585, !125}
!649 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 253, type: !650, isLocal: false, isDefinition: false, scopeLine: 253, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{!366, !585, !125, !477}
!652 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 255, type: !653, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!653 = !DISubroutineType(types: !654)
!654 = !{!366, !585, !125, !353}
!655 = !DISubprogram(name: "multAdd", linkageName: "_ZN6soplex8SSVector7multAddEdRKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 257, type: !656, isLocal: false, isDefinition: false, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!656 = !DISubroutineType(types: !657)
!657 = !{!366, !585, !125, !376}
!658 = !DISubprogram(name: "assign2product", linkageName: "_ZN6soplex8SSVector14assign2productERKS0_RKNS_5SVSetE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 260, type: !659, isLocal: false, isDefinition: false, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{!366, !585, !477, !661}
!661 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN6soplex5SVSetE")
!663 = !DISubprogram(name: "assign2product4setup", linkageName: "_ZN6soplex8SSVector20assign2product4setupERKNS_5SVSetERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 262, type: !664, isLocal: false, isDefinition: false, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{!366, !585, !661, !477}
!666 = !DISubprogram(name: "assign2productAndSetup", linkageName: "_ZN6soplex8SSVector22assign2productAndSetupERKNS_5SVSetERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 264, type: !667, isLocal: false, isDefinition: false, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!667 = !DISubroutineType(types: !668)
!668 = !{!366, !585, !661, !366}
!669 = !DISubprogram(name: "maxAbs", linkageName: "_ZNK6soplex8SSVector6maxAbsEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 267, type: !670, isLocal: false, isDefinition: false, scopeLine: 267, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!670 = !DISubroutineType(types: !671)
!671 = !{!125, !592}
!672 = !DISubprogram(name: "length", linkageName: "_ZNK6soplex8SSVector6lengthEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 269, type: !670, isLocal: false, isDefinition: false, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!673 = !DISubprogram(name: "length2", linkageName: "_ZNK6soplex8SSVector7length2Ev", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 271, type: !670, isLocal: false, isDefinition: false, scopeLine: 271, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubprogram(name: "dim", linkageName: "_ZNK6soplex8SSVector3dimEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 278, type: !606, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubprogram(name: "reDim", linkageName: "_ZN6soplex8SSVector5reDimEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 284, type: !583, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!676 = !DISubprogram(name: "setSize", linkageName: "_ZN6soplex8SSVector7setSizeEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 287, type: !583, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!677 = !DISubprogram(name: "reMem", linkageName: "_ZN6soplex8SSVector5reMemEi", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 296, type: !583, isLocal: false, isDefinition: false, scopeLine: 296, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubprogram(name: "clear", linkageName: "_ZN6soplex8SSVector5clearEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 299, type: !594, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubprogram(name: "isConsistent", linkageName: "_ZNK6soplex8SSVector12isConsistentEv", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 302, type: !590, isLocal: false, isDefinition: false, scopeLine: 302, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!680 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 309, type: !609, isLocal: false, isDefinition: false, scopeLine: 309, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!681 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 322, type: !682, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !585, !477}
!684 = !DISubprogram(name: "SSVector", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 334, type: !685, isLocal: false, isDefinition: false, scopeLine: 334, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !585, !376, !125}
!687 = !DISubprogram(name: "setup_and_assign", linkageName: "_ZN6soplex8SSVector16setup_and_assignERS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 345, type: !688, isLocal: false, isDefinition: false, scopeLine: 345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !585, !366}
!690 = !DISubprogram(name: "assign", linkageName: "_ZN6soplex8SSVector6assignERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 348, type: !638, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!691 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKS0_", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 351, type: !641, isLocal: false, isDefinition: false, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_7SVectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 353, type: !638, isLocal: false, isDefinition: false, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubprogram(name: "operator=", linkageName: "_ZN6soplex8SSVectoraSERKNS_6VectorE", scope: !"_ZTSN6soplex8SSVectorE", file: !576, line: 355, type: !635, isLocal: false, isDefinition: false, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
