; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Library.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.wayobj = type <{ i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, float, float, %struct.createwaymnginfot, %struct.createwayinfot, [4 x i8], i16*, %struct.waymapcellt*, i32*, i32*, i32, i32, i8, [3 x i8], i32, i16, i16, [4 x i8] }>
%struct.createwaymnginfot = type { float, float, float, float, i32, i32, float, float }
%struct.createwayinfot = type <{ %class.rvectort, %class.rvectort, i8, [3 x i8] }>
%class.rvectort = type { float, float, float }
%struct.waymapcellt = type { i16, i16 }
%class.way2obj = type { i8*, %"struct.way2obj::waymapcellt"*, i16, [256 x i8], [256 x %class.flexarray], i32, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32 }
%"struct.way2obj::waymapcellt" = type { i16, i16 }
%class.flexarray = type { %struct.pointt*, i32, i32 }
%struct.pointt = type { i32, i32 }
%class.regmngobj = type { i16*, i16, i32, i32, i8, i32, %class.regobj**, i8*, [256 x i8], i32, i32, float, i32, i32, i32, i32, %class.largesolidarray }
%class.regobj = type { i32, i8, i8, %class.regmngobj*, i32, %struct.pointt, i32, i32, i32, %class.flexarray.0 }
%class.flexarray.0 = type { %class.regobj**, i32, i32 }
%class.largesolidarray = type { %class.regobj**, %class.flexstack, %class.flexarray.1, %class.flexarray.1, i32, i32 }
%class.flexstack = type { i32*, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !773, globals: !931, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Library.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !157, !167, !172, !236, !237, !241, !249, !257, !264, !336, !340, !379, !390, !466, !501, !540, !571, !597, !633, !676, !23, !701, !718, !768, !772, !8}
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "wayobj", file: !5, line: 35, size: 1408, align: 64, elements: !6, identifier: "_ZTS6wayobj")
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !25, !26, !27, !28, !29, !30, !37, !40, !43, !44, !45, !46, !48, !49, !50, !55, !59, !60, !63, !64, !67, !70, !74, !77, !80, !83, !84, !87, !90, !94, !101, !102, !103, !109, !112, !115, !116, !120, !121, !124, !129, !134, !137, !138, !141, !142, !145, !151, !152, !155, !156}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "mapxshift", scope: !"_ZTS6wayobj", file: !5, line: 37, baseType: !8, size: 32, align: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !9, line: 28, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "/usr/include/sys/_types/_int32_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "mapyshift", scope: !"_ZTS6wayobj", file: !5, line: 37, baseType: !8, size: 32, align: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !"_ZTS6wayobj", file: !5, line: 38, baseType: !8, size: 32, align: 32, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS6wayobj", file: !5, line: 39, baseType: !8, size: 32, align: 32, offset: 96)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS6wayobj", file: !5, line: 39, baseType: !8, size: 32, align: 32, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx1", scope: !"_ZTS6wayobj", file: !5, line: 40, baseType: !8, size: 32, align: 32, offset: 160)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy1", scope: !"_ZTS6wayobj", file: !5, line: 40, baseType: !8, size: 32, align: 32, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "maplx", scope: !"_ZTS6wayobj", file: !5, line: 41, baseType: !8, size: 32, align: 32, offset: 224)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "maply", scope: !"_ZTS6wayobj", file: !5, line: 41, baseType: !8, size: 32, align: 32, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "xcoef1", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 288)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "rnumt", file: !9, line: 57, baseType: !23)
!23 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "xcoef2", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ycoef1", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 352)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ycoef2", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cellr", scope: !"_ZTS6wayobj", file: !5, line: 43, baseType: !22, size: 32, align: 32, offset: 416)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !"_ZTS6wayobj", file: !5, line: 44, baseType: !"_ZTS17createwaymnginfot", size: 256, align: 32, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "createwayinfo", scope: !"_ZTS6wayobj", file: !5, line: 45, baseType: !"_ZTS14createwayinfot", size: 224, align: 32, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "maparp", scope: !"_ZTS6wayobj", file: !5, line: 46, baseType: !31, size: 64, align: 64, offset: 960)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "i16pt", file: !9, line: 49, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "i16", file: !9, line: 27, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !35, line: 30, baseType: !36)
!35 = !DIFile(filename: "/usr/include/sys/_types/_int16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "waymap", scope: !"_ZTS6wayobj", file: !5, line: 47, baseType: !38, size: 64, align: 64, offset: 1024)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "waymapcellpt", file: !5, line: 22, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS11waymapcellt", size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bound1p", scope: !"_ZTS6wayobj", file: !5, line: 48, baseType: !41, size: 64, align: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32pt", file: !9, line: 50, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bound2p", scope: !"_ZTS6wayobj", file: !5, line: 48, baseType: !41, size: 64, align: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "maxboundlength", scope: !"_ZTS6wayobj", file: !5, line: 49, baseType: !8, size: 32, align: 32, offset: 1216)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "indexxmask", scope: !"_ZTS6wayobj", file: !5, line: 50, baseType: !8, size: 32, align: 32, offset: 1248)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flend", scope: !"_ZTS6wayobj", file: !5, line: 51, baseType: !47, size: 8, align: 8, offset: 1280)
!47 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "endindex", scope: !"_ZTS6wayobj", file: !5, line: 52, baseType: !8, size: 32, align: 32, offset: 1312)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !"_ZTS6wayobj", file: !5, line: 53, baseType: !33, size: 16, align: 16, offset: 1344)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS6wayobj", file: !5, line: 54, baseType: !51, size: 16, align: 16, offset: 1360)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16", file: !9, line: 22, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !53, line: 31, baseType: !54)
!53 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!55 = !DISubprogram(name: "getx", linkageName: "_ZN6wayobj4getxEf", scope: !"_ZTS6wayobj", file: !5, line: 56, type: !56, isLocal: false, isDefinition: false, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true)
!56 = !DISubroutineType(types: !57)
!57 = !{!8, !58, !22}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6wayobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!59 = !DISubprogram(name: "gety", linkageName: "_ZN6wayobj4getyEf", scope: !"_ZTS6wayobj", file: !5, line: 57, type: !56, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true)
!60 = !DISubprogram(name: "getxcoord", linkageName: "_ZN6wayobj9getxcoordEi", scope: !"_ZTS6wayobj", file: !5, line: 58, type: !61, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true)
!61 = !DISubroutineType(types: !62)
!62 = !{!22, !58, !8}
!63 = !DISubprogram(name: "getycoord", linkageName: "_ZN6wayobj9getycoordEi", scope: !"_ZTS6wayobj", file: !5, line: 59, type: !61, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!64 = !DISubprogram(name: "ismap", linkageName: "_ZN6wayobj5ismapEii", scope: !"_ZTS6wayobj", file: !5, line: 61, type: !65, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true)
!65 = !DISubroutineType(types: !66)
!66 = !{!47, !58, !8, !8}
!67 = !DISubprogram(name: "getpoint", linkageName: "_ZN6wayobj8getpointEi", scope: !"_ZTS6wayobj", file: !5, line: 62, type: !68, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true)
!68 = !DISubroutineType(types: !69)
!69 = !{!"_ZTS8rvectort", !58, !8}
!70 = !DISubprogram(name: "map", linkageName: "_ZN6wayobj3mapEii", scope: !"_ZTS6wayobj", file: !5, line: 64, type: !71, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !58, !8, !8}
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !33)
!74 = !DISubprogram(name: "map", linkageName: "_ZN6wayobj3mapEss", scope: !"_ZTS6wayobj", file: !5, line: 65, type: !75, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true)
!75 = !DISubroutineType(types: !76)
!76 = !{!73, !58, !33, !33}
!77 = !DISubprogram(name: "index", linkageName: "_ZN6wayobj5indexEii", scope: !"_ZTS6wayobj", file: !5, line: 67, type: !78, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true)
!78 = !DISubroutineType(types: !79)
!79 = !{!8, !58, !8, !8}
!80 = !DISubprogram(name: "indexx", linkageName: "_ZN6wayobj6indexxEi", scope: !"_ZTS6wayobj", file: !5, line: 68, type: !81, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!81 = !DISubroutineType(types: !82)
!82 = !{!8, !58, !8}
!83 = !DISubprogram(name: "indexy", linkageName: "_ZN6wayobj6indexyEi", scope: !"_ZTS6wayobj", file: !5, line: 69, type: !81, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true)
!84 = !DISubprogram(name: "makebound2", linkageName: "_ZN6wayobj10makebound2EPiiS0_", scope: !"_ZTS6wayobj", file: !5, line: 71, type: !85, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true)
!85 = !DISubroutineType(types: !86)
!86 = !{!8, !58, !41, !8, !41}
!87 = !DISubprogram(name: "fill", linkageName: "_ZN6wayobj4fillEiiii", scope: !"_ZTS6wayobj", file: !5, line: 72, type: !88, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true)
!88 = !DISubroutineType(types: !89)
!89 = !{!47, !58, !8, !8, !8, !8}
!90 = !DISubprogram(name: "createwayar", linkageName: "_ZN6wayobj11createwayarEiiR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 73, type: !91, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true)
!91 = !DISubroutineType(types: !92)
!92 = !{!47, !58, !8, !8, !93}
!93 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS8wayinfot")
!94 = !DISubprogram(name: "createwayar", linkageName: "_ZN6wayobj11createwayarEiiRP8point16tRi", scope: !"_ZTS6wayobj", file: !5, line: 74, type: !95, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true)
!95 = !DISubroutineType(types: !96)
!96 = !{!47, !58, !8, !8, !97, !100}
!97 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "point16pt", file: !5, line: 15, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8point16t", size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!101 = !DISubprogram(name: "createwayar2", linkageName: "_ZN6wayobj12createwayar2EiiR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 75, type: !91, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true)
!102 = !DISubprogram(name: "makeobstaclebound2", linkageName: "_ZN6wayobj18makeobstaclebound2EPiiS0_", scope: !"_ZTS6wayobj", file: !5, line: 77, type: !85, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true)
!103 = !DISubprogram(name: "findfreepoints", linkageName: "_ZN6wayobj14findfreepointsE8rvectortiRi", scope: !"_ZTS6wayobj", file: !5, line: 81, type: !104, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !58, !"_ZTS8rvectort", !8, !100}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "levelplacept", file: !107, line: 12, baseType: !108)
!107 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/WayTypes_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS11levelplacet", size: 64, align: 64)
!109 = !DISubprogram(name: "findverticalline", linkageName: "_ZN6wayobj16findverticallineEiiRiS0_", scope: !"_ZTS6wayobj", file: !5, line: 82, type: !110, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubroutineType(types: !111)
!111 = !{!47, !58, !8, !8, !100, !100}
!112 = !DISubprogram(name: "ismoveable", linkageName: "_ZN6wayobj10ismoveableEff", scope: !"_ZTS6wayobj", file: !5, line: 84, type: !113, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!113 = !DISubroutineType(types: !114)
!114 = !{!47, !58, !22, !22}
!115 = !DISubprogram(name: "findfreepoint", linkageName: "_ZN6wayobj13findfreepointEiiRiS0_", scope: !"_ZTS6wayobj", file: !5, line: 86, type: !110, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!116 = !DISubprogram(name: "findfreepoint", linkageName: "_ZN6wayobj13findfreepointEffRfS0_", scope: !"_ZTS6wayobj", file: !5, line: 87, type: !117, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubroutineType(types: !118)
!118 = !{!47, !58, !22, !22, !119, !119}
!119 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !22)
!120 = !DISubprogram(name: "wayexist", linkageName: "_ZN6wayobj8wayexistEiiii", scope: !"_ZTS6wayobj", file: !5, line: 88, type: !88, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!121 = !DISubprogram(name: "createway", linkageName: "_ZN6wayobj9createwayEiiiiRP8point16tRi", scope: !"_ZTS6wayobj", file: !5, line: 89, type: !122, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!122 = !DISubroutineType(types: !123)
!123 = !{!47, !58, !8, !8, !8, !8, !97, !100}
!124 = !DISubprogram(name: "createway", linkageName: "_ZN6wayobj9createwayERK8rvectortS2_bR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 90, type: !125, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!125 = !DISubroutineType(types: !126)
!126 = !{!47, !58, !127, !127, !47, !93}
!127 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS8rvectort")
!129 = !DISubprogram(name: "createway", linkageName: "_ZN6wayobj9createwayERK14createwayinfotR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 91, type: !130, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{!47, !58, !132, !93}
!132 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS14createwayinfot")
!134 = !DISubprogram(name: "addsphere", linkageName: "_ZN6wayobj9addsphereERK8rvectortf", scope: !"_ZTS6wayobj", file: !5, line: 93, type: !135, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !58, !127, !22}
!137 = !DISubprogram(name: "removesphere", linkageName: "_ZN6wayobj12removesphereERK8rvectortf", scope: !"_ZTS6wayobj", file: !5, line: 94, type: !135, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubprogram(name: "addpoint", linkageName: "_ZN6wayobj8addpointEii", scope: !"_ZTS6wayobj", file: !5, line: 95, type: !139, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !58, !8, !8}
!141 = !DISubprogram(name: "removepoint", linkageName: "_ZN6wayobj11removepointEii", scope: !"_ZTS6wayobj", file: !5, line: 96, type: !139, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubprogram(name: "clear", linkageName: "_ZN6wayobj5clearEv", scope: !"_ZTS6wayobj", file: !5, line: 97, type: !143, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !58}
!145 = !DISubprogram(name: "loadmap", linkageName: "_ZN6wayobj7loadmapEPKc", scope: !"_ZTS6wayobj", file: !5, line: 99, type: !146, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubroutineType(types: !147)
!147 = !{!47, !58, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!151 = !DISubprogram(name: "initmap", linkageName: "_ZN6wayobj7initmapEii", scope: !"_ZTS6wayobj", file: !5, line: 100, type: !65, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!152 = !DISubprogram(name: "create", linkageName: "_ZN6wayobj6createE17createwaymnginfot", scope: !"_ZTS6wayobj", file: !5, line: 102, type: !153, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !58, !"_ZTS17createwaymnginfot"}
!155 = !DISubprogram(name: "create", linkageName: "_ZN6wayobj6createEv", scope: !"_ZTS6wayobj", file: !5, line: 103, type: !143, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!156 = !DISubprogram(name: "destroy", linkageName: "_ZN6wayobj7destroyEv", scope: !"_ZTS6wayobj", file: !5, line: 104, type: !143, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "createwaymnginfot", file: !5, line: 25, size: 256, align: 32, elements: !158, identifier: "_ZTS17createwaymnginfot")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "minx", scope: !"_ZTS17createwaymnginfot", file: !5, line: 27, baseType: !22, size: 32, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "maxx", scope: !"_ZTS17createwaymnginfot", file: !5, line: 27, baseType: !22, size: 32, align: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "miny", scope: !"_ZTS17createwaymnginfot", file: !5, line: 28, baseType: !22, size: 32, align: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "maxy", scope: !"_ZTS17createwaymnginfot", file: !5, line: 28, baseType: !22, size: 32, align: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "xshift", scope: !"_ZTS17createwaymnginfot", file: !5, line: 29, baseType: !8, size: 32, align: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "yshift", scope: !"_ZTS17createwaymnginfot", file: !5, line: 30, baseType: !8, size: 32, align: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "height1", scope: !"_ZTS17createwaymnginfot", file: !5, line: 31, baseType: !22, size: 32, align: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "height2", scope: !"_ZTS17createwaymnginfot", file: !5, line: 31, baseType: !22, size: 32, align: 32, offset: 224)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "createwayinfot", file: !107, line: 15, size: 224, align: 32, elements: !168, identifier: "_ZTS14createwayinfot")
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !"_ZTS14createwayinfot", file: !107, line: 17, baseType: !"_ZTS8rvectort", size: 96, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "finishp", scope: !"_ZTS14createwayinfot", file: !107, line: 18, baseType: !"_ZTS8rvectort", size: 96, align: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flcorrect", scope: !"_ZTS14createwayinfot", file: !107, line: 19, baseType: !47, size: 8, align: 8, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_class_type, name: "rvectort", file: !9, line: 105, size: 96, align: 32, elements: !173, identifier: "_ZTS8rvectort")
!173 = !{!174, !175, !176, !177, !181, !182, !186, !190, !191, !195, !198, !201, !204, !208, !211, !212, !213, !214, !215, !216, !217, !218, !223, !228, !232, !233}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS8rvectort", file: !9, line: 109, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS8rvectort", file: !9, line: 109, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !"_ZTS8rvectort", file: !9, line: 109, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!177 = !DISubprogram(name: "norm", linkageName: "_ZNK8rvectort4normEv", scope: !"_ZTS8rvectort", file: !9, line: 110, type: !178, isLocal: false, isDefinition: false, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{!22, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!181 = !DISubprogram(name: "norm2", linkageName: "_ZNK8rvectort5norm2Ev", scope: !"_ZTS8rvectort", file: !9, line: 111, type: !178, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubprogram(name: "normalize", linkageName: "_ZN8rvectort9normalizeEv", scope: !"_ZTS8rvectort", file: !9, line: 112, type: !183, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{!22, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8rvectort", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!186 = !DISubprogram(name: "ortbasis", linkageName: "_ZNK8rvectort8ortbasisERS_S0_", scope: !"_ZTS8rvectort", file: !9, line: 114, type: !187, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !180, !189, !189}
!189 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS8rvectort")
!190 = !DISubprogram(name: "ortbasisz", linkageName: "_ZNK8rvectort9ortbasiszERS_S0_", scope: !"_ZTS8rvectort", file: !9, line: 115, type: !187, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!191 = !DISubprogram(name: "rotmatrix", linkageName: "_ZNK8rvectort9rotmatrixER6rmatrt", scope: !"_ZTS8rvectort", file: !9, line: 117, type: !192, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !180, !194}
!194 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS6rmatrt")
!195 = !DISubprogram(name: "rotmatrix", linkageName: "_ZNK8rvectort9rotmatrixER6rmatrtf", scope: !"_ZTS8rvectort", file: !9, line: 118, type: !196, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !180, !194, !22}
!198 = !DISubprogram(name: "definerandom", linkageName: "_ZN8rvectort12definerandomEv", scope: !"_ZTS8rvectort", file: !9, line: 120, type: !199, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !185}
!201 = !DISubprogram(name: "randomvariation", linkageName: "_ZN8rvectort15randomvariationEf", scope: !"_ZTS8rvectort", file: !9, line: 121, type: !202, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !185, !22}
!204 = !DISubprogram(name: "operator()", linkageName: "_ZN8rvectortclEi", scope: !"_ZTS8rvectort", file: !9, line: 139, type: !205, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubroutineType(types: !206)
!206 = !{!119, !185, !207}
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!208 = !DISubprogram(name: "r", linkageName: "_ZN8rvectort1rEv", scope: !"_ZTS8rvectort", file: !9, line: 141, type: !209, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubroutineType(types: !210)
!210 = !{!119, !185}
!211 = !DISubprogram(name: "g", linkageName: "_ZN8rvectort1gEv", scope: !"_ZTS8rvectort", file: !9, line: 142, type: !209, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubprogram(name: "b", linkageName: "_ZN8rvectort1bEv", scope: !"_ZTS8rvectort", file: !9, line: 143, type: !209, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubprogram(name: "r", linkageName: "_ZNK8rvectort1rEv", scope: !"_ZTS8rvectort", file: !9, line: 144, type: !178, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubprogram(name: "g", linkageName: "_ZNK8rvectort1gEv", scope: !"_ZTS8rvectort", file: !9, line: 145, type: !178, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubprogram(name: "b", linkageName: "_ZNK8rvectort1bEv", scope: !"_ZTS8rvectort", file: !9, line: 146, type: !178, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubprogram(name: "bright", linkageName: "_ZN8rvectort6brightEv", scope: !"_ZTS8rvectort", file: !9, line: 148, type: !183, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!217 = !DISubprogram(name: "set0", linkageName: "_ZN8rvectort4set0Ev", scope: !"_ZTS8rvectort", file: !9, line: 150, type: !199, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubprogram(name: "operator=", linkageName: "_ZN8rvectortaSEPKf", scope: !"_ZTS8rvectort", file: !9, line: 152, type: !219, isLocal: false, isDefinition: false, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !185, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!223 = !DISubprogram(name: "operator const float *", linkageName: "_ZNK8rvectortcvPKfEv", scope: !"_ZTS8rvectort", file: !9, line: 155, type: !224, isLocal: false, isDefinition: false, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !180}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!228 = !DISubprogram(name: "operator float *", linkageName: "_ZN8rvectortcvPfEv", scope: !"_ZTS8rvectort", file: !9, line: 156, type: !229, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !185}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!232 = !DISubprogram(name: "rvectort", scope: !"_ZTS8rvectort", file: !9, line: 158, type: !199, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubprogram(name: "rvectort", scope: !"_ZTS8rvectort", file: !9, line: 159, type: !234, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !185, !22, !22, !22}
!236 = !DICompositeType(tag: DW_TAG_class_type, name: "rmatrt", file: !9, line: 103, flags: DIFlagFwdDecl, identifier: "_ZTS6rmatrt")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "waymapcellt", file: !5, line: 17, size: 32, align: 16, elements: !238, identifier: "_ZTS11waymapcellt")
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS11waymapcellt", file: !5, line: 19, baseType: !51, size: 16, align: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTS11waymapcellt", file: !5, line: 20, baseType: !51, size: 16, align: 16, offset: 16)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "wayinfot", file: !107, line: 22, size: 192, align: 64, elements: !242, identifier: "_ZTS8wayinfot")
!242 = !{!243, !244, !247, !248}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flexist", scope: !"_ZTS8wayinfot", file: !107, line: 24, baseType: !47, size: 8, align: 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wayarp", scope: !"_ZTS8wayinfot", file: !107, line: 25, baseType: !245, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvectorpt", file: !9, line: 161, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8rvectort", size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wayarsize", scope: !"_ZTS8wayinfot", file: !107, line: 26, baseType: !8, size: 32, align: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flcorrect", scope: !"_ZTS8wayinfot", file: !107, line: 27, baseType: !47, size: 8, align: 8, offset: 160)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "point16t", file: !5, line: 10, size: 32, align: 16, elements: !250, identifier: "_ZTS8point16t")
!250 = !{!251, !252, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS8point16t", file: !5, line: 12, baseType: !33, size: 16, align: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS8point16t", file: !5, line: 12, baseType: !33, size: 16, align: 16, offset: 16)
!253 = !DISubprogram(name: "point16t", scope: !"_ZTS8point16t", file: !5, line: 13, type: !254, isLocal: false, isDefinition: false, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !256, !33, !33}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8point16t", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "levelplacet", file: !107, line: 6, size: 128, align: 32, elements: !258, identifier: "_ZTS11levelplacet")
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS11levelplacet", file: !107, line: 8, baseType: !33, size: 16, align: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS11levelplacet", file: !107, line: 8, baseType: !33, size: 16, align: 16, offset: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !"_ZTS11levelplacet", file: !107, line: 9, baseType: !22, size: 32, align: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !"_ZTS11levelplacet", file: !107, line: 9, baseType: !22, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "hiding", scope: !"_ZTS11levelplacet", file: !107, line: 10, baseType: !22, size: 32, align: 32, offset: 96)
!264 = !DICompositeType(tag: DW_TAG_class_type, name: "way2obj", file: !265, line: 12, size: 35392, align: 64, elements: !266, identifier: "_ZTS7way2obj")
!265 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way2_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!266 = !{!267, !274, !277, !278, !279, !283, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !303, !306, !309, !312, !313, !316, !317, !323, !324, !327, !330, !333, !334, !335}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mapp", scope: !"_ZTS7way2obj", file: !265, line: 14, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytept", file: !9, line: 21, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !9, line: 20, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !272, line: 31, baseType: !273)
!272 = !DIFile(filename: "/usr/include/_types/_uint8_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!273 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "waymap", scope: !"_ZTS7way2obj", file: !265, line: 22, baseType: !275, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "waymapcellpt", scope: !"_ZTS7way2obj", file: !265, line: 21, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN7way2obj11waymapcelltE", size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS7way2obj", file: !265, line: 23, baseType: !51, size: 16, align: 16, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "maxmovetact", scope: !"_ZTS7way2obj", file: !265, line: 26, baseType: !207, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 255)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "movetimear", scope: !"_ZTS7way2obj", file: !265, line: 29, baseType: !280, size: 2048, align: 8, offset: 144)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 2048, align: 8, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "boundar", scope: !"_ZTS7way2obj", file: !265, line: 32, baseType: !284, size: 32768, align: 64, offset: 2240)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 32768, align: 64, elements: !281)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "boundart", scope: !"_ZTS7way2obj", file: !265, line: 31, baseType: !"_ZTS9flexarrayI6pointtE")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "curbound", scope: !"_ZTS7way2obj", file: !265, line: 34, baseType: !8, size: 32, align: 32, offset: 35008)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nonboundqu", scope: !"_ZTS7way2obj", file: !265, line: 35, baseType: !8, size: 32, align: 32, offset: 35040)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filltact", scope: !"_ZTS7way2obj", file: !265, line: 36, baseType: !8, size: 32, align: 32, offset: 35072)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "endx", scope: !"_ZTS7way2obj", file: !265, line: 37, baseType: !8, size: 32, align: 32, offset: 35104)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "endy", scope: !"_ZTS7way2obj", file: !265, line: 37, baseType: !8, size: 32, align: 32, offset: 35136)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "startx", scope: !"_ZTS7way2obj", file: !265, line: 38, baseType: !8, size: 32, align: 32, offset: 35168)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "starty", scope: !"_ZTS7way2obj", file: !265, line: 38, baseType: !8, size: 32, align: 32, offset: 35200)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flend", scope: !"_ZTS7way2obj", file: !265, line: 39, baseType: !47, size: 8, align: 8, offset: 35232)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS7way2obj", file: !265, line: 41, baseType: !8, size: 32, align: 32, offset: 35264)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS7way2obj", file: !265, line: 41, baseType: !8, size: 32, align: 32, offset: 35296)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizex", scope: !"_ZTS7way2obj", file: !265, line: 78, baseType: !8, size: 32, align: 32, offset: 35328, flags: DIFlagPublic)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizey", scope: !"_ZTS7way2obj", file: !265, line: 78, baseType: !8, size: 32, align: 32, offset: 35360, flags: DIFlagPublic)
!298 = !DISubprogram(name: "map", linkageName: "_ZN7way2obj3mapEii", scope: !"_ZTS7way2obj", file: !265, line: 43, type: !299, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !302, !8, !8}
!301 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !270)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS7way2obj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!303 = !DISubprogram(name: "movetime", linkageName: "_ZN7way2obj8movetimeEii", scope: !"_ZTS7way2obj", file: !265, line: 44, type: !304, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!270, !302, !8, !8}
!306 = !DISubprogram(name: "isaddtobound", linkageName: "_ZN7way2obj12isaddtoboundEii", scope: !"_ZTS7way2obj", file: !265, line: 47, type: !307, isLocal: false, isDefinition: false, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{!47, !302, !8, !8}
!309 = !DISubprogram(name: "addtobound", linkageName: "_ZN7way2obj10addtoboundEii", scope: !"_ZTS7way2obj", file: !265, line: 48, type: !310, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !302, !8, !8}
!312 = !DISubprogram(name: "releasepoint", linkageName: "_ZN7way2obj12releasepointEii", scope: !"_ZTS7way2obj", file: !265, line: 49, type: !310, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true)
!313 = !DISubprogram(name: "releasebound", linkageName: "_ZN7way2obj12releaseboundEv", scope: !"_ZTS7way2obj", file: !265, line: 50, type: !314, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !302}
!316 = !DISubprogram(name: "fill", linkageName: "_ZN7way2obj4fillEii", scope: !"_ZTS7way2obj", file: !265, line: 51, type: !307, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true)
!317 = !DISubprogram(name: "createwayar", linkageName: "_ZN7way2obj11createwayarERP6pointtRi", scope: !"_ZTS7way2obj", file: !265, line: 52, type: !318, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{!47, !302, !320, !100}
!320 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointpt", file: !9, line: 100, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64)
!323 = !DISubprogram(name: "getterrain", linkageName: "_ZN7way2obj10getterrainEii", scope: !"_ZTS7way2obj", file: !265, line: 80, type: !304, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!324 = !DISubprogram(name: "setterrain", linkageName: "_ZN7way2obj10setterrainEiih", scope: !"_ZTS7way2obj", file: !265, line: 81, type: !325, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !302, !8, !8, !270}
!327 = !DISubprogram(name: "createway", linkageName: "_ZN7way2obj9createwayEiiiiPhRP6pointtRi", scope: !"_ZTS7way2obj", file: !265, line: 83, type: !328, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!328 = !DISubroutineType(types: !329)
!329 = !{!47, !302, !8, !8, !8, !8, !268, !320, !100}
!330 = !DISubprogram(name: "loadmap", linkageName: "_ZN7way2obj7loadmapEPKc", scope: !"_ZTS7way2obj", file: !265, line: 85, type: !331, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!47, !302, !148}
!333 = !DISubprogram(name: "initmap", linkageName: "_ZN7way2obj7initmapEii", scope: !"_ZTS7way2obj", file: !265, line: 86, type: !307, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubprogram(name: "create", linkageName: "_ZN7way2obj6createEv", scope: !"_ZTS7way2obj", file: !265, line: 88, type: !314, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubprogram(name: "destroy", linkageName: "_ZN7way2obj7destroyEv", scope: !"_ZTS7way2obj", file: !265, line: 89, type: !314, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "waymapcellt", scope: !"_ZTS7way2obj", file: !265, line: 16, size: 32, align: 16, elements: !337, identifier: "_ZTSN7way2obj11waymapcelltE")
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTSN7way2obj11waymapcelltE", file: !265, line: 18, baseType: !51, size: 16, align: 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTSN7way2obj11waymapcelltE", file: !265, line: 19, baseType: !51, size: 16, align: 16, offset: 16)
!340 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<pointt>", file: !341, line: 9, size: 128, align: 64, elements: !342, templateParams: !377, identifier: "_ZTS9flexarrayI6pointtE")
!341 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Arrays.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!342 = !{!343, !344, !345, !346, !352, !355, !358, !359, !362, !365, !368, !371, !375, !376}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 13, baseType: !322, size: 64, align: 64, flags: DIFlagPublic)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 16, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!346 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayI6pointtE9isincludeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 19, type: !347, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{!47, !349, !350}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayI6pointtE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!350 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS6pointt")
!352 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 21, type: !353, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !349, !350}
!355 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addEv", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 22, type: !356, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!322, !349}
!358 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayI6pointtE6removeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 23, type: !353, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayI6pointtE8iselemquEib", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 25, type: !360, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !349, !8, !47}
!362 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayI6pointtE7enlargeEi", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 27, type: !363, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !349, !8}
!365 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayI6pointtE8doublingEb", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 29, type: !366, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !349, !47}
!368 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayI6pointtE5clearEv", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 31, type: !369, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !349}
!371 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayI6pointtEixEi", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 33, type: !372, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!374, !349, !8}
!374 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS6pointt")
!375 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayI6pointtE6createEi", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 38, type: !363, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayI6pointtE7destroyEv", scope: !"_ZTS9flexarrayI6pointtE", file: !341, line: 39, type: !369, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!377 = !{!378}
!378 = !DITemplateTypeParameter(name: "eobj", type: !"_ZTS6pointt")
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointt", file: !9, line: 93, size: 64, align: 32, elements: !380, identifier: "_ZTS6pointt")
!380 = !{!381, !382, !383, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS6pointt", file: !9, line: 95, baseType: !8, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS6pointt", file: !9, line: 95, baseType: !8, size: 32, align: 32, offset: 32)
!383 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !9, line: 97, type: !384, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!387 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !9, line: 98, type: !388, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !386, !8, !8}
!390 = !DICompositeType(tag: DW_TAG_class_type, name: "regmngobj", file: !391, line: 60, size: 3200, align: 64, elements: !392, identifier: "_ZTS9regmngobj")
!391 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegMng_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!392 = !{!393, !396, !397, !398, !399, !400, !401, !406, !407, !409, !410, !411, !412, !413, !414, !415, !416, !417, !421, !424, !425, !426, !427, !428, !429, !430, !433, !434, !435, !436, !441, !444, !447, !451, !454, !457, !458, !461, !464, !465}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mmapp", scope: !"_ZTS9regmngobj", file: !391, line: 75, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16pt", file: !9, line: 44, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS9regmngobj", file: !391, line: 76, baseType: !51, size: 16, align: 16, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "freepointx", scope: !"_ZTS9regmngobj", file: !391, line: 77, baseType: !8, size: 32, align: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "freepointy", scope: !"_ZTS9regmngobj", file: !391, line: 77, baseType: !8, size: 32, align: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flfind", scope: !"_ZTS9regmngobj", file: !391, line: 78, baseType: !47, size: 8, align: 8, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "regfillnum", scope: !"_ZTS9regmngobj", file: !391, line: 84, baseType: !8, size: 32, align: 32, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "regionmapp", scope: !"_ZTS9regmngobj", file: !391, line: 88, baseType: !402, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjppt", file: !391, line: 12, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjpt", file: !391, line: 11, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "landscapemapp", scope: !"_ZTS9regmngobj", file: !391, line: 89, baseType: !268, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flpasablear", scope: !"_ZTS9regmngobj", file: !391, line: 90, baseType: !408, size: 2048, align: 8, offset: 384, flags: DIFlagPublic)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, align: 8, elements: !281)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius", scope: !"_ZTS9regmngobj", file: !391, line: 91, baseType: !8, size: 32, align: 32, offset: 2432, flags: DIFlagPublic)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius2", scope: !"_ZTS9regmngobj", file: !391, line: 91, baseType: !8, size: 32, align: 32, offset: 2464, flags: DIFlagPublic)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "radiuscoef", scope: !"_ZTS9regmngobj", file: !391, line: 92, baseType: !22, size: 32, align: 32, offset: 2496, flags: DIFlagPublic)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS9regmngobj", file: !391, line: 95, baseType: !8, size: 32, align: 32, offset: 2528, flags: DIFlagPublic)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS9regmngobj", file: !391, line: 95, baseType: !8, size: 32, align: 32, offset: 2560, flags: DIFlagPublic)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizex", scope: !"_ZTS9regmngobj", file: !391, line: 118, baseType: !8, size: 32, align: 32, offset: 2592, flags: DIFlagPublic)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizey", scope: !"_ZTS9regmngobj", file: !391, line: 118, baseType: !8, size: 32, align: 32, offset: 2624, flags: DIFlagPublic)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rarp", scope: !"_ZTS9regmngobj", file: !391, line: 120, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 512, align: 64, offset: 2688, flags: DIFlagPublic)
!417 = !DISubprogram(name: "foundemptyregions", linkageName: "_ZN9regmngobj17foundemptyregionsEv", scope: !"_ZTS9regmngobj", file: !391, line: 62, type: !418, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!421 = !DISubprogram(name: "newregion", linkageName: "_ZN9regmngobj9newregionEii", scope: !"_ZTS9regmngobj", file: !391, line: 63, type: !422, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{!404, !420, !8, !8}
!424 = !DISubprogram(name: "deleteregions", linkageName: "_ZN9regmngobj13deleteregionsEv", scope: !"_ZTS9regmngobj", file: !391, line: 64, type: !418, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true)
!425 = !DISubprogram(name: "defineregions", linkageName: "_ZN9regmngobj13defineregionsEv", scope: !"_ZTS9regmngobj", file: !391, line: 65, type: !418, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true)
!426 = !DISubprogram(name: "addallregions", linkageName: "_ZN9regmngobj13addallregionsEv", scope: !"_ZTS9regmngobj", file: !391, line: 66, type: !418, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true)
!427 = !DISubprogram(name: "addregions", linkageName: "_ZN9regmngobj10addregionsEv", scope: !"_ZTS9regmngobj", file: !391, line: 67, type: !418, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true)
!428 = !DISubprogram(name: "redefineregions", linkageName: "_ZN9regmngobj15redefineregionsEv", scope: !"_ZTS9regmngobj", file: !391, line: 68, type: !418, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!429 = !DISubprogram(name: "enlargeregions", linkageName: "_ZN9regmngobj14enlargeregionsEv", scope: !"_ZTS9regmngobj", file: !391, line: 69, type: !418, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true)
!430 = !DISubprogram(name: "enlargeneighborses", linkageName: "_ZN9regmngobj18enlargeneighborsesEi", scope: !"_ZTS9regmngobj", file: !391, line: 70, type: !431, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !420, !8}
!433 = !DISubprogram(name: "defineneighborhood1", linkageName: "_ZN9regmngobj19defineneighborhood1Ev", scope: !"_ZTS9regmngobj", file: !391, line: 71, type: !418, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true)
!434 = !DISubprogram(name: "definemiddleregpoint", linkageName: "_ZN9regmngobj20definemiddleregpointEv", scope: !"_ZTS9regmngobj", file: !391, line: 72, type: !418, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true)
!435 = !DISubprogram(name: "normalizemiddlepoint", linkageName: "_ZN9regmngobj20normalizemiddlepointEv", scope: !"_ZTS9regmngobj", file: !391, line: 73, type: !418, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true)
!436 = !DISubprogram(name: "addtobound", linkageName: "_ZN9regmngobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS9regmngobj", file: !391, line: 80, type: !437, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !420, !439, !8, !8}
!439 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "boundart", file: !391, line: 17, baseType: !"_ZTS9flexarrayI6pointtE")
!441 = !DISubprogram(name: "makebound2", linkageName: "_ZN9regmngobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS9regmngobj", file: !391, line: 81, type: !442, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !420, !439, !439}
!444 = !DISubprogram(name: "findfreeplace", linkageName: "_ZN9regmngobj13findfreeplaceEiiRiS0_", scope: !"_ZTS9regmngobj", file: !391, line: 82, type: !445, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!445 = !DISubroutineType(types: !446)
!446 = !{!47, !420, !8, !8, !100, !100}
!447 = !DISubprogram(name: "regmapp", linkageName: "_ZN9regmngobj7regmappEii", scope: !"_ZTS9regmngobj", file: !391, line: 93, type: !448, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !420, !8, !8}
!450 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !404)
!451 = !DISubprogram(name: "mapp", linkageName: "_ZN9regmngobj4mappEii", scope: !"_ZTS9regmngobj", file: !391, line: 94, type: !452, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!452 = !DISubroutineType(types: !453)
!453 = !{!270, !420, !8, !8}
!454 = !DISubprogram(name: "getregfillnum", linkageName: "_ZN9regmngobj13getregfillnumEv", scope: !"_ZTS9regmngobj", file: !391, line: 122, type: !455, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!455 = !DISubroutineType(types: !456)
!456 = !{!8, !420}
!457 = !DISubprogram(name: "createregions", linkageName: "_ZN9regmngobj13createregionsEi", scope: !"_ZTS9regmngobj", file: !391, line: 124, type: !431, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!458 = !DISubprogram(name: "loadmap", linkageName: "_ZN9regmngobj7loadmapEPKc", scope: !"_ZTS9regmngobj", file: !391, line: 126, type: !459, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!459 = !DISubroutineType(types: !460)
!460 = !{!47, !420, !148}
!461 = !DISubprogram(name: "initmap", linkageName: "_ZN9regmngobj7initmapEii", scope: !"_ZTS9regmngobj", file: !391, line: 127, type: !462, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{!47, !420, !8, !8}
!464 = !DISubprogram(name: "create", linkageName: "_ZN9regmngobj6createEv", scope: !"_ZTS9regmngobj", file: !391, line: 129, type: !418, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubprogram(name: "destroy", linkageName: "_ZN9regmngobj7destroyEv", scope: !"_ZTS9regmngobj", file: !391, line: 130, type: !418, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DICompositeType(tag: DW_TAG_class_type, name: "regobj", file: !391, line: 21, size: 448, align: 64, elements: !467, identifier: "_ZTS6regobj")
!467 = !{!468, !469, !470, !471, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !488, !491, !494, !497, !498}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "internalnum", scope: !"_ZTS6regobj", file: !391, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flexist", scope: !"_ZTS6regobj", file: !391, line: 26, baseType: !47, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flredefine", scope: !"_ZTS6regobj", file: !391, line: 27, baseType: !47, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "regmngp", scope: !"_ZTS6regobj", file: !391, line: 28, baseType: !472, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmngobjpt", file: !391, line: 15, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "square", scope: !"_ZTS6regobj", file: !391, line: 30, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "centerp", scope: !"_ZTS6regobj", file: !391, line: 31, baseType: !"_ZTS6pointt", size: 64, align: 32, offset: 160, flags: DIFlagPublic)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !"_ZTS6regobj", file: !391, line: 32, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS6regobj", file: !391, line: 33, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "waydist", scope: !"_ZTS6regobj", file: !391, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nb1ar", scope: !"_ZTS6regobj", file: !391, line: 36, baseType: !"_ZTS9flexarrayIP6regobjE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bound1arp", scope: !"_ZTS6regobj", file: !391, line: 40, baseType: !440, flags: DIFlagStaticMember)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bound2arp", scope: !"_ZTS6regobj", file: !391, line: 40, baseType: !440, flags: DIFlagStaticMember)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "boundl", scope: !"_ZTS6regobj", file: !391, line: 41, baseType: !8, flags: DIFlagStaticMember)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flodd", scope: !"_ZTS6regobj", file: !391, line: 42, baseType: !47, flags: DIFlagStaticMember)
!484 = !DISubprogram(name: "addtobound", linkageName: "_ZN6regobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS6regobj", file: !391, line: 44, type: !485, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487, !439, !8, !8}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!488 = !DISubprogram(name: "makebound2", linkageName: "_ZN6regobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS6regobj", file: !391, line: 45, type: !489, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !487, !439, !439}
!491 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEii", scope: !"_ZTS6regobj", file: !391, line: 49, type: !492, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !487, !8, !8}
!494 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEv", scope: !"_ZTS6regobj", file: !391, line: 50, type: !495, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !487}
!497 = !DISubprogram(name: "destroy", linkageName: "_ZN6regobj7destroyEv", scope: !"_ZTS6regobj", file: !391, line: 51, type: !495, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubprogram(name: "regobj", scope: !"_ZTS6regobj", file: !391, line: 53, type: !499, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !487, !472}
!501 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<regobj *>", file: !341, line: 9, size: 128, align: 64, elements: !502, templateParams: !538, identifier: "_ZTS9flexarrayIP6regobjE")
!502 = !{!503, !505, !506, !507, !513, !516, !519, !520, !523, !526, !529, !532, !536, !537}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 13, baseType: !504, size: 64, align: 64, flags: DIFlagPublic)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 16, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!507 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 19, type: !508, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{!47, !510, !511}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!511 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!513 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 21, type: !514, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !510, !511}
!516 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 22, type: !517, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubroutineType(types: !518)
!518 = !{!504, !510}
!519 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIP6regobjE6removeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 23, type: !514, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIP6regobjE8iselemquEib", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 25, type: !521, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !510, !8, !47}
!523 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIP6regobjE7enlargeEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 27, type: !524, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !510, !8}
!526 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIP6regobjE8doublingEb", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 29, type: !527, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !510, !47}
!529 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIP6regobjE5clearEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 31, type: !530, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !510}
!532 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIP6regobjEixEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 33, type: !533, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !510, !8}
!535 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !405)
!536 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIP6regobjE6createEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 38, type: !524, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIP6regobjE7destroyEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !341, line: 39, type: !530, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !{!539}
!539 = !DITemplateTypeParameter(name: "eobj", type: !405)
!540 = !DICompositeType(tag: DW_TAG_class_type, name: "largesolidarray<regobj *>", file: !341, line: 101, size: 512, align: 64, elements: !541, templateParams: !538, identifier: "_ZTS15largesolidarrayIP6regobjE")
!541 = !{!542, !543, !544, !545, !546, !547, !548, !552, !555, !558, !561, !564, !567, !568, !569, !570}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 105, baseType: !504, size: 64, align: 64, flags: DIFlagPublic)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "freecellholder", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 107, baseType: !"_ZTS9flexstackIiE", size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 192, flags: DIFlagPublic)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 110, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 111, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!548 = !DISubprogram(name: "elem", linkageName: "_ZN15largesolidarrayIP6regobjE4elemEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 113, type: !549, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubroutineType(types: !550)
!550 = !{!535, !551, !8}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!552 = !DISubprogram(name: "isinclude", linkageName: "_ZN15largesolidarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 114, type: !553, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!553 = !DISubroutineType(types: !554)
!554 = !{!47, !551, !511}
!555 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 116, type: !556, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!556 = !DISubroutineType(types: !557)
!557 = !{!8, !551, !511}
!558 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 117, type: !559, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{!8, !551}
!561 = !DISubprogram(name: "remove", linkageName: "_ZN15largesolidarrayIP6regobjE6removeEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 118, type: !562, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !551, !8}
!564 = !DISubprogram(name: "doubling", linkageName: "_ZN15largesolidarrayIP6regobjE8doublingEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 120, type: !565, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !551}
!567 = !DISubprogram(name: "clear", linkageName: "_ZN15largesolidarrayIP6regobjE5clearEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 122, type: !565, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubprogram(name: "operator[]", linkageName: "_ZN15largesolidarrayIP6regobjEixEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 124, type: !549, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubprogram(name: "create", linkageName: "_ZN15largesolidarrayIP6regobjE6createEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 129, type: !562, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!570 = !DISubprogram(name: "destroy", linkageName: "_ZN15largesolidarrayIP6regobjE7destroyEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !341, line: 130, type: !565, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DICompositeType(tag: DW_TAG_class_type, name: "flexstack<int>", file: !341, line: 43, size: 128, align: 64, elements: !572, templateParams: !595, identifier: "_ZTS9flexstackIiE")
!572 = !{!573, !575, !576, !577, !581, !584, !587, !590, !591, !594}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexstackIiE", file: !341, line: 47, baseType: !574, size: 64, align: 64, flags: DIFlagPublic)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexstackIiE", file: !341, line: 49, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexstackIiE", file: !341, line: 50, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!577 = !DISubprogram(name: "get", linkageName: "_ZN9flexstackIiE3getEv", scope: !"_ZTS9flexstackIiE", file: !341, line: 52, type: !578, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubroutineType(types: !579)
!579 = !{!12, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexstackIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!581 = !DISubprogram(name: "put", linkageName: "_ZN9flexstackIiE3putEi", scope: !"_ZTS9flexstackIiE", file: !341, line: 53, type: !582, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !580, !12}
!584 = !DISubprogram(name: "isempty", linkageName: "_ZN9flexstackIiE7isemptyEv", scope: !"_ZTS9flexstackIiE", file: !341, line: 55, type: !585, isLocal: false, isDefinition: false, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{!47, !580}
!587 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexstackIiE8doublingEv", scope: !"_ZTS9flexstackIiE", file: !341, line: 57, type: !588, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !580}
!590 = !DISubprogram(name: "clear", linkageName: "_ZN9flexstackIiE5clearEv", scope: !"_ZTS9flexstackIiE", file: !341, line: 58, type: !588, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!591 = !DISubprogram(name: "create", linkageName: "_ZN9flexstackIiE6createEi", scope: !"_ZTS9flexstackIiE", file: !341, line: 59, type: !592, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !580, !8}
!594 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexstackIiE7destroyEv", scope: !"_ZTS9flexstackIiE", file: !341, line: 60, type: !588, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !{!596}
!596 = !DITemplateTypeParameter(name: "eobj", type: !12)
!597 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<int>", file: !341, line: 9, size: 128, align: 64, elements: !598, templateParams: !595, identifier: "_ZTS9flexarrayIiE")
!598 = !{!599, !600, !601, !602, !608, !611, !614, !615, !618, !621, !624, !627, !631, !632}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIiE", file: !341, line: 13, baseType: !574, size: 64, align: 64, flags: DIFlagPublic)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIiE", file: !341, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIiE", file: !341, line: 16, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!602 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIiE9isincludeERKi", scope: !"_ZTS9flexarrayIiE", file: !341, line: 19, type: !603, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubroutineType(types: !604)
!604 = !{!47, !605, !606}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!606 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!608 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addERKi", scope: !"_ZTS9flexarrayIiE", file: !341, line: 21, type: !609, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !605, !606}
!611 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addEv", scope: !"_ZTS9flexarrayIiE", file: !341, line: 22, type: !612, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{!574, !605}
!614 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIiE6removeERKi", scope: !"_ZTS9flexarrayIiE", file: !341, line: 23, type: !609, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIiE8iselemquEib", scope: !"_ZTS9flexarrayIiE", file: !341, line: 25, type: !616, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !605, !8, !47}
!618 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIiE7enlargeEi", scope: !"_ZTS9flexarrayIiE", file: !341, line: 27, type: !619, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !605, !8}
!621 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIiE8doublingEb", scope: !"_ZTS9flexarrayIiE", file: !341, line: 29, type: !622, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !605, !47}
!624 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIiE5clearEv", scope: !"_ZTS9flexarrayIiE", file: !341, line: 31, type: !625, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !605}
!627 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIiEixEi", scope: !"_ZTS9flexarrayIiE", file: !341, line: 33, type: !628, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !605, !8}
!630 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !12)
!631 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIiE6createEi", scope: !"_ZTS9flexarrayIiE", file: !341, line: 38, type: !619, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIiE7destroyEv", scope: !"_ZTS9flexarrayIiE", file: !341, line: 39, type: !625, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DICompositeType(tag: DW_TAG_class_type, name: "regwayobj", file: !634, line: 11, size: 640, align: 64, elements: !635, vtableHolder: !"_ZTS9regwayobj", identifier: "_ZTS9regwayobj")
!634 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegWay_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!635 = !{!636, !641, !643, !644, !645, !646, !648, !649, !650, !651, !655, !659, !662, !663, !667, !670, !673}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$regwayobj", scope: !634, file: !634, baseType: !637, size: 64, flags: DIFlagArtificial)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!12}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bound1arp", scope: !"_ZTS9regwayobj", file: !634, line: 13, baseType: !642, size: 128, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "regboundart", file: !634, line: 9, baseType: !"_ZTS9flexarrayIP6regobjE")
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bound2arp", scope: !"_ZTS9regwayobj", file: !634, line: 13, baseType: !642, size: 128, align: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "filltact", scope: !"_ZTS9regwayobj", file: !634, line: 14, baseType: !8, size: 32, align: 32, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "regfillnum", scope: !"_ZTS9regwayobj", file: !634, line: 15, baseType: !8, size: 32, align: 32, offset: 352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "regmngp", scope: !"_ZTS9regwayobj", file: !634, line: 16, baseType: !647, size: 64, align: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmngobjpt", file: !391, line: 132, baseType: !473)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flend", scope: !"_ZTS9regwayobj", file: !634, line: 17, baseType: !47, size: 8, align: 8, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !"_ZTS9regwayobj", file: !634, line: 18, baseType: !404, size: 64, align: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !"_ZTS9regwayobj", file: !634, line: 19, baseType: !404, size: 64, align: 64, offset: 576)
!651 = !DISubprogram(name: "isaddtobound", linkageName: "_ZN9regwayobj12isaddtoboundEP6regobjS1_", scope: !"_ZTS9regwayobj", file: !634, line: 21, type: !652, isLocal: false, isDefinition: false, scopeLine: 21, containingType: !"_ZTS9regwayobj", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{!47, !654, !404, !404}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regwayobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!655 = !DISubprogram(name: "addtobound", linkageName: "_ZN9regwayobj10addtoboundER9flexarrayIP6regobjES2_", scope: !"_ZTS9regwayobj", file: !634, line: 22, type: !656, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !654, !658, !404}
!658 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !642)
!659 = !DISubprogram(name: "makebound2", linkageName: "_ZN9regwayobj10makebound2ER9flexarrayIP6regobjES4_", scope: !"_ZTS9regwayobj", file: !634, line: 23, type: !660, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !654, !658, !658}
!662 = !DISubprogram(name: "fill", linkageName: "_ZN9regwayobj4fillEP6regobjS1_", scope: !"_ZTS9regwayobj", file: !634, line: 25, type: !652, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true)
!663 = !DISubprogram(name: "getway", linkageName: "_ZN9regwayobj6getwayEP6regobjRPS1_", scope: !"_ZTS9regwayobj", file: !634, line: 26, type: !664, isLocal: false, isDefinition: false, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{!8, !654, !404, !666}
!666 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !402)
!667 = !DISubprogram(name: "createway", linkageName: "_ZN9regwayobj9createwayEP6regobjS1_RPS1_Ri", scope: !"_ZTS9regwayobj", file: !634, line: 30, type: !668, isLocal: false, isDefinition: false, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{!47, !654, !404, !404, !666, !100}
!670 = !DISubprogram(name: "create", linkageName: "_ZN9regwayobj6createEP9regmngobj", scope: !"_ZTS9regwayobj", file: !634, line: 31, type: !671, isLocal: false, isDefinition: false, scopeLine: 31, containingType: !"_ZTS9regwayobj", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !654, !647}
!673 = !DISubprogram(name: "destroy", linkageName: "_ZN9regwayobj7destroyEv", scope: !"_ZTS9regwayobj", file: !634, line: 32, type: !674, isLocal: false, isDefinition: false, scopeLine: 32, containingType: !"_ZTS9regwayobj", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !654}
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "statinfot", file: !1, line: 52, size: 832, align: 64, elements: !677, identifier: "_ZTS9statinfot")
!677 = !{!678, !680, !681, !682, !683, !684, !689, !690, !691, !692, !693, !694, !695, !696, !700}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "createregtime", scope: !"_ZTS9statinfot", file: !1, line: 54, baseType: !679, size: 64, align: 64)
!679 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "createwaytime", scope: !"_ZTS9statinfot", file: !1, line: 55, baseType: !679, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "createriverwaytime", scope: !"_ZTS9statinfot", file: !1, line: 56, baseType: !679, size: 64, align: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "createlandwaytime", scope: !"_ZTS9statinfot", file: !1, line: 57, baseType: !679, size: 64, align: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "createregwaytime", scope: !"_ZTS9statinfot", file: !1, line: 58, baseType: !679, size: 64, align: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "waylength", scope: !"_ZTS9statinfot", file: !1, line: 59, baseType: !685, size: 64, align: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "i64", file: !9, line: 29, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !687, line: 30, baseType: !688)
!687 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!688 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "riverwaylength", scope: !"_ZTS9statinfot", file: !1, line: 60, baseType: !685, size: 64, align: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "landwaylength", scope: !"_ZTS9statinfot", file: !1, line: 61, baseType: !685, size: 64, align: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "wayqu", scope: !"_ZTS9statinfot", file: !1, line: 62, baseType: !685, size: 64, align: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "riverwayqu", scope: !"_ZTS9statinfot", file: !1, line: 63, baseType: !685, size: 64, align: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "landwayqu", scope: !"_ZTS9statinfot", file: !1, line: 64, baseType: !685, size: 64, align: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "regwaylength", scope: !"_ZTS9statinfot", file: !1, line: 65, baseType: !685, size: 64, align: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "regwayqu", scope: !"_ZTS9statinfot", file: !1, line: 66, baseType: !685, size: 64, align: 64, offset: 768)
!696 = !DISubprogram(name: "print", linkageName: "_ZN9statinfot5printEv", scope: !"_ZTS9statinfot", file: !1, line: 68, type: !697, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9statinfot", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!700 = !DISubprogram(name: "init", linkageName: "_ZN9statinfot4initEv", scope: !"_ZTS9statinfot", file: !1, line: 70, type: !697, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "workinfot", file: !1, line: 36, size: 33120, align: 32, elements: !702, identifier: "_ZTS9workinfot")
!702 = !{!703, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mapfilename", scope: !"_ZTS9workinfot", file: !1, line: 38, baseType: !704, size: 32768, align: 8)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 32768, align: 8, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 4096)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "regionsize", scope: !"_ZTS9workinfot", file: !1, line: 39, baseType: !12, size: 32, align: 32, offset: 32768)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "wayqu", scope: !"_ZTS9workinfot", file: !1, line: 40, baseType: !12, size: 32, align: 32, offset: 32800)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "riverwayqu", scope: !"_ZTS9workinfot", file: !1, line: 41, baseType: !12, size: 32, align: 32, offset: 32832)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "landwayqu", scope: !"_ZTS9workinfot", file: !1, line: 42, baseType: !12, size: 32, align: 32, offset: 32864)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "regwayqu", scope: !"_ZTS9workinfot", file: !1, line: 43, baseType: !12, size: 32, align: 32, offset: 32896)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "randommaplx", scope: !"_ZTS9workinfot", file: !1, line: 44, baseType: !12, size: 32, align: 32, offset: 32928)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "randommaply", scope: !"_ZTS9workinfot", file: !1, line: 45, baseType: !12, size: 32, align: 32, offset: 32960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "randommapdensity", scope: !"_ZTS9workinfot", file: !1, line: 46, baseType: !23, size: 32, align: 32, offset: 32992)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "randommapregionsize", scope: !"_ZTS9workinfot", file: !1, line: 47, baseType: !12, size: 32, align: 32, offset: 33024)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "randommapwayqu", scope: !"_ZTS9workinfot", file: !1, line: 48, baseType: !12, size: 32, align: 32, offset: 33056)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "randommapregwayqu", scope: !"_ZTS9workinfot", file: !1, line: 49, baseType: !12, size: 32, align: 32, offset: 33088)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !719, line: 122, size: 1216, align: 64, elements: !720, identifier: "_ZTS7__sFILE")
!719 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!720 = !{!721, !723, !724, !725, !726, !727, !728, !729, !731, !735, !740, !749, !753, !754, !756, !757, !761, !765, !766, !767}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !719, line: 123, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !719, line: 124, baseType: !12, size: 32, align: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !719, line: 125, baseType: !12, size: 32, align: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !719, line: 126, baseType: !36, size: 16, align: 16, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !719, line: 127, baseType: !36, size: 16, align: 16, offset: 144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !719, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !719, line: 129, baseType: !12, size: 32, align: 32, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !719, line: 132, baseType: !730, size: 64, align: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !719, line: 133, baseType: !732, size: 64, align: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!12, !730}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !719, line: 134, baseType: !736, size: 64, align: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!12, !730, !739, !12}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !719, line: 135, baseType: !741, size: 64, align: 64, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!744, !730, !744, !12}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !719, line: 77, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !746, line: 71, baseType: !747)
!746 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !748, line: 46, baseType: !688)
!748 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !719, line: 136, baseType: !750, size: 64, align: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!12, !730, !148, !12}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !719, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !719, line: 140, baseType: !755, size: 64, align: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !719, line: 141, baseType: !12, size: 32, align: 32, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !719, line: 144, baseType: !758, size: 24, align: 8, offset: 928)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 24, align: 8, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 3)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !719, line: 145, baseType: !762, size: 8, align: 8, offset: 952)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 8, align: 8, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 1)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !719, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
