; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Region_.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.flexarray = type { %struct.pointt*, i32, i32 }
%struct.pointt = type { i32, i32 }
%class.regobj = type { i32, i8, i8, %class.regmngobj*, i32, %struct.pointt, i32, i32, i32, %class.flexarray.1 }
%class.regmngobj = type { i16*, i16, i32, i32, i8, i32, %class.regobj**, i8*, [256 x i8], i32, i32, float, i32, i32, i32, i32, %class.largesolidarray }
%class.largesolidarray = type { %class.regobj**, %class.flexstack, %class.flexarray.0, %class.flexarray.0, i32, i32 }
%class.flexstack = type { i32*, i32, i32 }
%class.flexarray.0 = type { i32*, i32, i32 }
%class.flexarray.1 = type { %class.regobj**, i32, i32 }

@_ZN6regobj9bound1arpE = global %class.flexarray zeroinitializer, align 8
@_ZN6regobj9bound2arpE = global %class.flexarray zeroinitializer, align 8
@_ZN6regobj6boundlE = global i32 0, align 4
@_ZN6regobj5floddE = global i8 0, align 1

; Function Attrs: nounwind optsize ssp uwtable
define void @_ZN6regobj10addtoboundER9flexarrayI6pointtEii(%class.regobj* %this, %class.flexarray* nocapture dereferenceable(16) %barp, i32 %x, i32 %y) #0 align 2 {
  %1 = alloca %struct.pointt, align 4
  tail call void @llvm.dbg.value(metadata %class.regobj* %this, i64 0, metadata !325, metadata !443), !dbg !444

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !322, globals: !434, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Region_.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !50, !61, !99, !190, !227, !253, !289, !10, !8, !193}
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<pointt>", file: !5, line: 9, size: 128, align: 64, elements: !6, templateParams: !48, identifier: "_ZTS9flexarrayI6pointtE")
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Arrays.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !9, !15, !16, !23, !26, !29, !30, !33, !36, !39, !42, !46, !47}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 13, baseType: !8, size: 64, align: 64, flags: DIFlagPublic)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 15, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !11, line: 28, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 30, baseType: !14)
!13 = !DIFile(filename: "/usr/include/sys/_types/_int32_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 16, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!16 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayI6pointtE9isincludeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 19, type: !17, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !20, !21}
!19 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayI6pointtE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS6pointt")
!23 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 21, type: !24, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !20, !21}
!26 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addEv", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 22, type: !27, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!27 = !DISubroutineType(types: !28)
!28 = !{!8, !20}
!29 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayI6pointtE6removeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 23, type: !24, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!30 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayI6pointtE8iselemquEib", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 25, type: !31, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !20, !10, !19}
!33 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayI6pointtE7enlargeEi", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 27, type: !34, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !20, !10}
!36 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayI6pointtE8doublingEb", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 29, type: !37, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !20, !19}
!39 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayI6pointtE5clearEv", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 31, type: !40, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !20}
!42 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayI6pointtEixEi", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 33, type: !43, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !20, !10}
!45 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS6pointt")
!46 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayI6pointtE6createEi", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 38, type: !34, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!47 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayI6pointtE7destroyEv", scope: !"_ZTS9flexarrayI6pointtE", file: !5, line: 39, type: !40, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "eobj", type: !"_ZTS6pointt")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointt", file: !11, line: 93, size: 64, align: 32, elements: !51, identifier: "_ZTS6pointt")
!51 = !{!52, !53, !54, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS6pointt", file: !11, line: 95, baseType: !10, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS6pointt", file: !11, line: 95, baseType: !10, size: 32, align: 32, offset: 32)
!54 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !11, line: 97, type: !55, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!58 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !11, line: 98, type: !59, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !57, !10, !10}
!61 = !DICompositeType(tag: DW_TAG_class_type, name: "regobj", file: !62, line: 21, size: 448, align: 64, elements: !63, identifier: "_ZTS6regobj")
!62 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegMng_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !{!64, !65, !66, !67, !70, !71, !72, !73, !74, !75, !76, !78, !79, !80, !81, !86, !89, !92, !95, !96}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "internalnum", scope: !"_ZTS6regobj", file: !62, line: 25, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flexist", scope: !"_ZTS6regobj", file: !62, line: 26, baseType: !19, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flredefine", scope: !"_ZTS6regobj", file: !62, line: 27, baseType: !19, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "regmngp", scope: !"_ZTS6regobj", file: !62, line: 28, baseType: !68, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmngobjpt", file: !62, line: 15, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "square", scope: !"_ZTS6regobj", file: !62, line: 30, baseType: !10, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "centerp", scope: !"_ZTS6regobj", file: !62, line: 31, baseType: !"_ZTS6pointt", size: 64, align: 32, offset: 160, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !"_ZTS6regobj", file: !62, line: 32, baseType: !10, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS6regobj", file: !62, line: 33, baseType: !10, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "waydist", scope: !"_ZTS6regobj", file: !62, line: 34, baseType: !10, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "nb1ar", scope: !"_ZTS6regobj", file: !62, line: 36, baseType: !"_ZTS9flexarrayIP6regobjE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bound1arp", scope: !"_ZTS6regobj", file: !62, line: 40, baseType: !77, flags: DIFlagStaticMember)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "boundart", file: !62, line: 17, baseType: !"_ZTS9flexarrayI6pointtE")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bound2arp", scope: !"_ZTS6regobj", file: !62, line: 40, baseType: !77, flags: DIFlagStaticMember)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "boundl", scope: !"_ZTS6regobj", file: !62, line: 41, baseType: !10, flags: DIFlagStaticMember)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flodd", scope: !"_ZTS6regobj", file: !62, line: 42, baseType: !19, flags: DIFlagStaticMember)
!81 = !DISubprogram(name: "addtobound", linkageName: "_ZN6regobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS6regobj", file: !62, line: 44, type: !82, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84, !85, !10, !10}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!85 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !77)
!86 = !DISubprogram(name: "makebound2", linkageName: "_ZN6regobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS6regobj", file: !62, line: 45, type: !87, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !84, !85, !85}
!89 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEii", scope: !"_ZTS6regobj", file: !62, line: 49, type: !90, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !84, !10, !10}
!92 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEv", scope: !"_ZTS6regobj", file: !62, line: 50, type: !93, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !84}
!95 = !DISubprogram(name: "destroy", linkageName: "_ZN6regobj7destroyEv", scope: !"_ZTS6regobj", file: !62, line: 51, type: !93, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!96 = !DISubprogram(name: "regobj", scope: !"_ZTS6regobj", file: !62, line: 53, type: !97, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !84, !68}
!99 = !DICompositeType(tag: DW_TAG_class_type, name: "regmngobj", file: !62, line: 60, size: 3200, align: 64, elements: !100, identifier: "_ZTS9regmngobj")
!100 = !{!101, !108, !109, !110, !111, !112, !113, !118, !125, !129, !130, !131, !134, !135, !136, !137, !138, !139, !143, !146, !147, !148, !149, !150, !151, !152, !155, !156, !157, !158, !161, !164, !168, !172, !175, !178, !179, !185, !188, !189}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mmapp", scope: !"_ZTS9regmngobj", file: !62, line: 75, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16pt", file: !11, line: 44, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16", file: !11, line: 22, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !106, line: 31, baseType: !107)
!106 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!107 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS9regmngobj", file: !62, line: 76, baseType: !104, size: 16, align: 16, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "freepointx", scope: !"_ZTS9regmngobj", file: !62, line: 77, baseType: !10, size: 32, align: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "freepointy", scope: !"_ZTS9regmngobj", file: !62, line: 77, baseType: !10, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flfind", scope: !"_ZTS9regmngobj", file: !62, line: 78, baseType: !19, size: 8, align: 8, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "regfillnum", scope: !"_ZTS9regmngobj", file: !62, line: 84, baseType: !10, size: 32, align: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "regionmapp", scope: !"_ZTS9regmngobj", file: !62, line: 88, baseType: !114, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjppt", file: !62, line: 12, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjpt", file: !62, line: 11, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "landscapemapp", scope: !"_ZTS9regmngobj", file: !62, line: 89, baseType: !119, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytept", file: !11, line: 21, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !11, line: 20, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !123, line: 31, baseType: !124)
!123 = !DIFile(filename: "/usr/include/_types/_uint8_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!124 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flpasablear", scope: !"_ZTS9regmngobj", file: !62, line: 90, baseType: !126, size: 2048, align: 8, offset: 384, flags: DIFlagPublic)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius", scope: !"_ZTS9regmngobj", file: !62, line: 91, baseType: !10, size: 32, align: 32, offset: 2432, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius2", scope: !"_ZTS9regmngobj", file: !62, line: 91, baseType: !10, size: 32, align: 32, offset: 2464, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "radiuscoef", scope: !"_ZTS9regmngobj", file: !62, line: 92, baseType: !132, size: 32, align: 32, offset: 2496, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "rnumt", file: !11, line: 57, baseType: !133)
!133 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS9regmngobj", file: !62, line: 95, baseType: !10, size: 32, align: 32, offset: 2528, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS9regmngobj", file: !62, line: 95, baseType: !10, size: 32, align: 32, offset: 2560, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizex", scope: !"_ZTS9regmngobj", file: !62, line: 118, baseType: !10, size: 32, align: 32, offset: 2592, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizey", scope: !"_ZTS9regmngobj", file: !62, line: 118, baseType: !10, size: 32, align: 32, offset: 2624, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rarp", scope: !"_ZTS9regmngobj", file: !62, line: 120, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 512, align: 64, offset: 2688, flags: DIFlagPublic)
!139 = !DISubprogram(name: "foundemptyregions", linkageName: "_ZN9regmngobj17foundemptyregionsEv", scope: !"_ZTS9regmngobj", file: !62, line: 62, type: !140, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!143 = !DISubprogram(name: "newregion", linkageName: "_ZN9regmngobj9newregionEii", scope: !"_ZTS9regmngobj", file: !62, line: 63, type: !144, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{!116, !142, !10, !10}
!146 = !DISubprogram(name: "deleteregions", linkageName: "_ZN9regmngobj13deleteregionsEv", scope: !"_ZTS9regmngobj", file: !62, line: 64, type: !140, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true)
!147 = !DISubprogram(name: "defineregions", linkageName: "_ZN9regmngobj13defineregionsEv", scope: !"_ZTS9regmngobj", file: !62, line: 65, type: !140, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true)
!148 = !DISubprogram(name: "addallregions", linkageName: "_ZN9regmngobj13addallregionsEv", scope: !"_ZTS9regmngobj", file: !62, line: 66, type: !140, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true)
!149 = !DISubprogram(name: "addregions", linkageName: "_ZN9regmngobj10addregionsEv", scope: !"_ZTS9regmngobj", file: !62, line: 67, type: !140, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true)
!150 = !DISubprogram(name: "redefineregions", linkageName: "_ZN9regmngobj15redefineregionsEv", scope: !"_ZTS9regmngobj", file: !62, line: 68, type: !140, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!151 = !DISubprogram(name: "enlargeregions", linkageName: "_ZN9regmngobj14enlargeregionsEv", scope: !"_ZTS9regmngobj", file: !62, line: 69, type: !140, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true)
!152 = !DISubprogram(name: "enlargeneighborses", linkageName: "_ZN9regmngobj18enlargeneighborsesEi", scope: !"_ZTS9regmngobj", file: !62, line: 70, type: !153, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !142, !10}
!155 = !DISubprogram(name: "defineneighborhood1", linkageName: "_ZN9regmngobj19defineneighborhood1Ev", scope: !"_ZTS9regmngobj", file: !62, line: 71, type: !140, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true)
!156 = !DISubprogram(name: "definemiddleregpoint", linkageName: "_ZN9regmngobj20definemiddleregpointEv", scope: !"_ZTS9regmngobj", file: !62, line: 72, type: !140, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true)
!157 = !DISubprogram(name: "normalizemiddlepoint", linkageName: "_ZN9regmngobj20normalizemiddlepointEv", scope: !"_ZTS9regmngobj", file: !62, line: 73, type: !140, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true)
!158 = !DISubprogram(name: "addtobound", linkageName: "_ZN9regmngobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS9regmngobj", file: !62, line: 80, type: !159, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !142, !85, !10, !10}
!161 = !DISubprogram(name: "makebound2", linkageName: "_ZN9regmngobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS9regmngobj", file: !62, line: 81, type: !162, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !142, !85, !85}
!164 = !DISubprogram(name: "findfreeplace", linkageName: "_ZN9regmngobj13findfreeplaceEiiRiS0_", scope: !"_ZTS9regmngobj", file: !62, line: 82, type: !165, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!165 = !DISubroutineType(types: !166)
!166 = !{!19, !142, !10, !10, !167, !167}
!167 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !10)
!168 = !DISubprogram(name: "regmapp", linkageName: "_ZN9regmngobj7regmappEii", scope: !"_ZTS9regmngobj", file: !62, line: 93, type: !169, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !142, !10, !10}
!171 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !116)
!172 = !DISubprogram(name: "mapp", linkageName: "_ZN9regmngobj4mappEii", scope: !"_ZTS9regmngobj", file: !62, line: 94, type: !173, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{!121, !142, !10, !10}
!175 = !DISubprogram(name: "getregfillnum", linkageName: "_ZN9regmngobj13getregfillnumEv", scope: !"_ZTS9regmngobj", file: !62, line: 122, type: !176, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!10, !142}
!178 = !DISubprogram(name: "createregions", linkageName: "_ZN9regmngobj13createregionsEi", scope: !"_ZTS9regmngobj", file: !62, line: 124, type: !153, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!179 = !DISubprogram(name: "loadmap", linkageName: "_ZN9regmngobj7loadmapEPKc", scope: !"_ZTS9regmngobj", file: !62, line: 126, type: !180, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubroutineType(types: !181)
!181 = !{!19, !142, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!185 = !DISubprogram(name: "initmap", linkageName: "_ZN9regmngobj7initmapEii", scope: !"_ZTS9regmngobj", file: !62, line: 127, type: !186, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!19, !142, !10, !10}
!188 = !DISubprogram(name: "create", linkageName: "_ZN9regmngobj6createEv", scope: !"_ZTS9regmngobj", file: !62, line: 129, type: !140, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubprogram(name: "destroy", linkageName: "_ZN9regmngobj7destroyEv", scope: !"_ZTS9regmngobj", file: !62, line: 130, type: !140, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DICompositeType(tag: DW_TAG_class_type, name: "largesolidarray<regobj *>", file: !5, line: 101, size: 512, align: 64, elements: !191, templateParams: !225, identifier: "_ZTS15largesolidarrayIP6regobjE")
!191 = !{!192, !194, !195, !196, !197, !198, !199, !204, !209, !212, !215, !218, !221, !222, !223, !224}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 105, baseType: !193, size: 64, align: 64, flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "freecellholder", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 107, baseType: !"_ZTS9flexstackIiE", size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 192, flags: DIFlagPublic)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 110, baseType: !10, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 111, baseType: !10, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!199 = !DISubprogram(name: "elem", linkageName: "_ZN15largesolidarrayIP6regobjE4elemEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 113, type: !200, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !203, !10}
!202 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !117)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!204 = !DISubprogram(name: "isinclude", linkageName: "_ZN15largesolidarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 114, type: !205, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubroutineType(types: !206)
!206 = !{!19, !203, !207}
!207 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!209 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 116, type: !210, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubroutineType(types: !211)
!211 = !{!10, !203, !207}
!212 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 117, type: !213, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubroutineType(types: !214)
!214 = !{!10, !203}
!215 = !DISubprogram(name: "remove", linkageName: "_ZN15largesolidarrayIP6regobjE6removeEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 118, type: !216, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !203, !10}
!218 = !DISubprogram(name: "doubling", linkageName: "_ZN15largesolidarrayIP6regobjE8doublingEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 120, type: !219, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !203}
!221 = !DISubprogram(name: "clear", linkageName: "_ZN15largesolidarrayIP6regobjE5clearEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 122, type: !219, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!222 = !DISubprogram(name: "operator[]", linkageName: "_ZN15largesolidarrayIP6regobjEixEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 124, type: !200, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!223 = !DISubprogram(name: "create", linkageName: "_ZN15largesolidarrayIP6regobjE6createEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 129, type: !216, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubprogram(name: "destroy", linkageName: "_ZN15largesolidarrayIP6regobjE7destroyEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !5, line: 130, type: !219, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!225 = !{!226}
!226 = !DITemplateTypeParameter(name: "eobj", type: !117)
!227 = !DICompositeType(tag: DW_TAG_class_type, name: "flexstack<int>", file: !5, line: 43, size: 128, align: 64, elements: !228, templateParams: !251, identifier: "_ZTS9flexstackIiE")
!228 = !{!229, !231, !232, !233, !237, !240, !243, !246, !247, !250}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexstackIiE", file: !5, line: 47, baseType: !230, size: 64, align: 64, flags: DIFlagPublic)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexstackIiE", file: !5, line: 49, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexstackIiE", file: !5, line: 50, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!233 = !DISubprogram(name: "get", linkageName: "_ZN9flexstackIiE3getEv", scope: !"_ZTS9flexstackIiE", file: !5, line: 52, type: !234, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{!14, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexstackIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!237 = !DISubprogram(name: "put", linkageName: "_ZN9flexstackIiE3putEi", scope: !"_ZTS9flexstackIiE", file: !5, line: 53, type: !238, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !236, !14}
!240 = !DISubprogram(name: "isempty", linkageName: "_ZN9flexstackIiE7isemptyEv", scope: !"_ZTS9flexstackIiE", file: !5, line: 55, type: !241, isLocal: false, isDefinition: false, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!241 = !DISubroutineType(types: !242)
!242 = !{!19, !236}
!243 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexstackIiE8doublingEv", scope: !"_ZTS9flexstackIiE", file: !5, line: 57, type: !244, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !236}
!246 = !DISubprogram(name: "clear", linkageName: "_ZN9flexstackIiE5clearEv", scope: !"_ZTS9flexstackIiE", file: !5, line: 58, type: !244, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubprogram(name: "create", linkageName: "_ZN9flexstackIiE6createEi", scope: !"_ZTS9flexstackIiE", file: !5, line: 59, type: !248, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !236, !10}
!250 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexstackIiE7destroyEv", scope: !"_ZTS9flexstackIiE", file: !5, line: 60, type: !244, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !{!252}
!252 = !DITemplateTypeParameter(name: "eobj", type: !14)
!253 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<int>", file: !5, line: 9, size: 128, align: 64, elements: !254, templateParams: !251, identifier: "_ZTS9flexarrayIiE")
!254 = !{!255, !256, !257, !258, !264, !267, !270, !271, !274, !277, !280, !283, !287, !288}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIiE", file: !5, line: 13, baseType: !230, size: 64, align: 64, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIiE", file: !5, line: 15, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIiE", file: !5, line: 16, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!258 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIiE9isincludeERKi", scope: !"_ZTS9flexarrayIiE", file: !5, line: 19, type: !259, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubroutineType(types: !260)
!260 = !{!19, !261, !262}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!262 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!264 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addERKi", scope: !"_ZTS9flexarrayIiE", file: !5, line: 21, type: !265, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !261, !262}
!267 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addEv", scope: !"_ZTS9flexarrayIiE", file: !5, line: 22, type: !268, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{!230, !261}
!270 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIiE6removeERKi", scope: !"_ZTS9flexarrayIiE", file: !5, line: 23, type: !265, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIiE8iselemquEib", scope: !"_ZTS9flexarrayIiE", file: !5, line: 25, type: !272, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !261, !10, !19}
!274 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIiE7enlargeEi", scope: !"_ZTS9flexarrayIiE", file: !5, line: 27, type: !275, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !261, !10}
!277 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIiE8doublingEb", scope: !"_ZTS9flexarrayIiE", file: !5, line: 29, type: !278, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !261, !19}
!280 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIiE5clearEv", scope: !"_ZTS9flexarrayIiE", file: !5, line: 31, type: !281, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !261}
!283 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIiEixEi", scope: !"_ZTS9flexarrayIiE", file: !5, line: 33, type: !284, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!286, !261, !10}
!286 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !14)
!287 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIiE6createEi", scope: !"_ZTS9flexarrayIiE", file: !5, line: 38, type: !275, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!288 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIiE7destroyEv", scope: !"_ZTS9flexarrayIiE", file: !5, line: 39, type: !281, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!289 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<regobj *>", file: !5, line: 9, size: 128, align: 64, elements: !290, templateParams: !225, identifier: "_ZTS9flexarrayIP6regobjE")
!290 = !{!291, !292, !293, !294, !298, !301, !304, !305, !308, !311, !314, !317, !320, !321}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 13, baseType: !193, size: 64, align: 64, flags: DIFlagPublic)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 15, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 16, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!294 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 19, type: !295, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!19, !297, !207}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!298 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 21, type: !299, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !297, !207}
!301 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 22, type: !302, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!302 = !DISubroutineType(types: !303)
!303 = !{!193, !297}
!304 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIP6regobjE6removeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 23, type: !299, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!305 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIP6regobjE8iselemquEib", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 25, type: !306, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !297, !10, !19}
!308 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIP6regobjE7enlargeEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 27, type: !309, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !297, !10}
!311 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIP6regobjE8doublingEb", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 29, type: !312, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !297, !19}
!314 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIP6regobjE5clearEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 31, type: !315, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !297}
!317 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIP6regobjEixEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 33, type: !318, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{!202, !297, !10}
!320 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIP6regobjE6createEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 38, type: !309, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIP6regobjE7destroyEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !5, line: 39, type: !315, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !{!323, !329, !341, !353, !356, !359, !364, !369, !374, !379, !384, !389, !394, !400, !407, !412, !415, !419, !423, !428, !431}
