; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegMng_.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.regmngobj = type { i16*, i16, i32, i32, i8, i32, %class.regobj**, i8*, [256 x i8], i32, i32, float, i32, i32, i32, i32, %class.largesolidarray }
%class.regobj = type { i32, i8, i8, %class.regmngobj*, i32, %struct.pointt, i32, i32, i32, %class.flexarray }
%struct.pointt = type { i32, i32 }
%class.flexarray = type { %class.regobj**, i32, i32 }
%class.largesolidarray = type { %class.regobj**, %class.flexstack, %class.flexarray.0, %class.flexarray.0, i32, i32 }
%class.flexstack = type { i32*, i32, i32 }
%class.flexarray.0 = type { i32*, i32, i32 }
%class.flexarray.1 = type { %class.regboundobj*, i32, i32 }
%class.regboundobj = type <{ %class.flexarray.2, %class.flexarray.2, i8, [3 x i8], i32, %class.regobj*, i32, i32, i32, i32, %class.regobj**, i8*, i32, i32, i32, i32, %class.regmngobj*, i8, [7 x i8] }>
%class.flexarray.2 = type { %struct.pointt*, i32, i32 }

@.str = private unnamed_addr constant [23 x i8] c"Error in createregions\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define void @_ZN9regmngobj6createEv(%class.regmngobj* nocapture %this) #0 align 2 {
  tail call void @llvm.dbg.value(metadata %class.regmngobj* %this, i64 0, metadata !407, metadata !675), !dbg !676
  %1 = getelementptr inbounds %class.regmngobj* %this, i64 0, i32 16, !dbg !677

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !404, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegMng_.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !104, !139, !150, !190, !229, !260, !286, !26, !31, !8, !322, !361, !44, !17, !403, !154, !263, !325}
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "regmngobj", file: !5, line: 60, size: 3200, align: 64, elements: !6, identifier: "_ZTS9regmngobj")
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegMng_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !15, !16, !21, !22, !24, !25, !30, !37, !41, !42, !43, !46, !47, !48, !49, !50, !51, !55, !58, !59, !60, !61, !62, !63, !64, !67, !68, !69, !70, !75, !78, !82, !86, !89, !92, !93, !99, !102, !103}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "mmapp", scope: !"_ZTS9regmngobj", file: !5, line: 75, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16pt", file: !9, line: 44, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16", file: !9, line: 22, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 31, baseType: !14)
!13 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS9regmngobj", file: !5, line: 76, baseType: !11, size: 16, align: 16, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "freepointx", scope: !"_ZTS9regmngobj", file: !5, line: 77, baseType: !17, size: 32, align: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !9, line: 28, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !19, line: 30, baseType: !20)
!19 = !DIFile(filename: "/usr/include/sys/_types/_int32_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "freepointy", scope: !"_ZTS9regmngobj", file: !5, line: 77, baseType: !17, size: 32, align: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flfind", scope: !"_ZTS9regmngobj", file: !5, line: 78, baseType: !23, size: 8, align: 8, offset: 160)
!23 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "regfillnum", scope: !"_ZTS9regmngobj", file: !5, line: 84, baseType: !17, size: 32, align: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "regionmapp", scope: !"_ZTS9regmngobj", file: !5, line: 88, baseType: !26, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjppt", file: !5, line: 12, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjpt", file: !5, line: 11, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "landscapemapp", scope: !"_ZTS9regmngobj", file: !5, line: 89, baseType: !31, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytept", file: !9, line: 21, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !9, line: 20, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 31, baseType: !36)
!35 = !DIFile(filename: "/usr/include/_types/_uint8_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "flpasablear", scope: !"_ZTS9regmngobj", file: !5, line: 90, baseType: !38, size: 2048, align: 8, offset: 384, flags: DIFlagPublic)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, align: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius", scope: !"_ZTS9regmngobj", file: !5, line: 91, baseType: !17, size: 32, align: 32, offset: 2432, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius2", scope: !"_ZTS9regmngobj", file: !5, line: 91, baseType: !17, size: 32, align: 32, offset: 2464, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "radiuscoef", scope: !"_ZTS9regmngobj", file: !5, line: 92, baseType: !44, size: 32, align: 32, offset: 2496, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "rnumt", file: !9, line: 57, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS9regmngobj", file: !5, line: 95, baseType: !17, size: 32, align: 32, offset: 2528, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS9regmngobj", file: !5, line: 95, baseType: !17, size: 32, align: 32, offset: 2560, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizex", scope: !"_ZTS9regmngobj", file: !5, line: 118, baseType: !17, size: 32, align: 32, offset: 2592, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizey", scope: !"_ZTS9regmngobj", file: !5, line: 118, baseType: !17, size: 32, align: 32, offset: 2624, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "rarp", scope: !"_ZTS9regmngobj", file: !5, line: 120, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 512, align: 64, offset: 2688, flags: DIFlagPublic)
!51 = !DISubprogram(name: "foundemptyregions", linkageName: "_ZN9regmngobj17foundemptyregionsEv", scope: !"_ZTS9regmngobj", file: !5, line: 62, type: !52, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!55 = !DISubprogram(name: "newregion", linkageName: "_ZN9regmngobj9newregionEii", scope: !"_ZTS9regmngobj", file: !5, line: 63, type: !56, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true)
!56 = !DISubroutineType(types: !57)
!57 = !{!28, !54, !17, !17}
!58 = !DISubprogram(name: "deleteregions", linkageName: "_ZN9regmngobj13deleteregionsEv", scope: !"_ZTS9regmngobj", file: !5, line: 64, type: !52, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true)
!59 = !DISubprogram(name: "defineregions", linkageName: "_ZN9regmngobj13defineregionsEv", scope: !"_ZTS9regmngobj", file: !5, line: 65, type: !52, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true)
!60 = !DISubprogram(name: "addallregions", linkageName: "_ZN9regmngobj13addallregionsEv", scope: !"_ZTS9regmngobj", file: !5, line: 66, type: !52, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true)
!61 = !DISubprogram(name: "addregions", linkageName: "_ZN9regmngobj10addregionsEv", scope: !"_ZTS9regmngobj", file: !5, line: 67, type: !52, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true)
!62 = !DISubprogram(name: "redefineregions", linkageName: "_ZN9regmngobj15redefineregionsEv", scope: !"_ZTS9regmngobj", file: !5, line: 68, type: !52, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!63 = !DISubprogram(name: "enlargeregions", linkageName: "_ZN9regmngobj14enlargeregionsEv", scope: !"_ZTS9regmngobj", file: !5, line: 69, type: !52, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true)
!64 = !DISubprogram(name: "enlargeneighborses", linkageName: "_ZN9regmngobj18enlargeneighborsesEi", scope: !"_ZTS9regmngobj", file: !5, line: 70, type: !65, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !54, !17}
!67 = !DISubprogram(name: "defineneighborhood1", linkageName: "_ZN9regmngobj19defineneighborhood1Ev", scope: !"_ZTS9regmngobj", file: !5, line: 71, type: !52, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true)
!68 = !DISubprogram(name: "definemiddleregpoint", linkageName: "_ZN9regmngobj20definemiddleregpointEv", scope: !"_ZTS9regmngobj", file: !5, line: 72, type: !52, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true)
!69 = !DISubprogram(name: "normalizemiddlepoint", linkageName: "_ZN9regmngobj20normalizemiddlepointEv", scope: !"_ZTS9regmngobj", file: !5, line: 73, type: !52, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true)
!70 = !DISubprogram(name: "addtobound", linkageName: "_ZN9regmngobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS9regmngobj", file: !5, line: 80, type: !71, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !54, !73, !17, !17}
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "boundart", file: !5, line: 17, baseType: !"_ZTS9flexarrayI6pointtE")
!75 = !DISubprogram(name: "makebound2", linkageName: "_ZN9regmngobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS9regmngobj", file: !5, line: 81, type: !76, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !54, !73, !73}
!78 = !DISubprogram(name: "findfreeplace", linkageName: "_ZN9regmngobj13findfreeplaceEiiRiS0_", scope: !"_ZTS9regmngobj", file: !5, line: 82, type: !79, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!79 = !DISubroutineType(types: !80)
!80 = !{!23, !54, !17, !17, !81, !81}
!81 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !17)
!82 = !DISubprogram(name: "regmapp", linkageName: "_ZN9regmngobj7regmappEii", scope: !"_ZTS9regmngobj", file: !5, line: 93, type: !83, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !54, !17, !17}
!85 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !28)
!86 = !DISubprogram(name: "mapp", linkageName: "_ZN9regmngobj4mappEii", scope: !"_ZTS9regmngobj", file: !5, line: 94, type: !87, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!87 = !DISubroutineType(types: !88)
!88 = !{!33, !54, !17, !17}
!89 = !DISubprogram(name: "getregfillnum", linkageName: "_ZN9regmngobj13getregfillnumEv", scope: !"_ZTS9regmngobj", file: !5, line: 122, type: !90, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!90 = !DISubroutineType(types: !91)
!91 = !{!17, !54}
!92 = !DISubprogram(name: "createregions", linkageName: "_ZN9regmngobj13createregionsEi", scope: !"_ZTS9regmngobj", file: !5, line: 124, type: !65, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!93 = !DISubprogram(name: "loadmap", linkageName: "_ZN9regmngobj7loadmapEPKc", scope: !"_ZTS9regmngobj", file: !5, line: 126, type: !94, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!94 = !DISubroutineType(types: !95)
!95 = !{!23, !54, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DISubprogram(name: "initmap", linkageName: "_ZN9regmngobj7initmapEii", scope: !"_ZTS9regmngobj", file: !5, line: 127, type: !100, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!100 = !DISubroutineType(types: !101)
!101 = !{!23, !54, !17, !17}
!102 = !DISubprogram(name: "create", linkageName: "_ZN9regmngobj6createEv", scope: !"_ZTS9regmngobj", file: !5, line: 129, type: !52, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!103 = !DISubprogram(name: "destroy", linkageName: "_ZN9regmngobj7destroyEv", scope: !"_ZTS9regmngobj", file: !5, line: 130, type: !52, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!104 = !DICompositeType(tag: DW_TAG_class_type, name: "regobj", file: !5, line: 21, size: 448, align: 64, elements: !105, identifier: "_ZTS6regobj")
!105 = !{!106, !107, !108, !109, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !126, !129, !132, !135, !136}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "internalnum", scope: !"_ZTS6regobj", file: !5, line: 25, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flexist", scope: !"_ZTS6regobj", file: !5, line: 26, baseType: !23, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flredefine", scope: !"_ZTS6regobj", file: !5, line: 27, baseType: !23, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "regmngp", scope: !"_ZTS6regobj", file: !5, line: 28, baseType: !110, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmngobjpt", file: !5, line: 15, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "square", scope: !"_ZTS6regobj", file: !5, line: 30, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "centerp", scope: !"_ZTS6regobj", file: !5, line: 31, baseType: !"_ZTS6pointt", size: 64, align: 32, offset: 160, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !"_ZTS6regobj", file: !5, line: 32, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS6regobj", file: !5, line: 33, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "waydist", scope: !"_ZTS6regobj", file: !5, line: 34, baseType: !17, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nb1ar", scope: !"_ZTS6regobj", file: !5, line: 36, baseType: !"_ZTS9flexarrayIP6regobjE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bound1arp", scope: !"_ZTS6regobj", file: !5, line: 40, baseType: !74, flags: DIFlagStaticMember)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bound2arp", scope: !"_ZTS6regobj", file: !5, line: 40, baseType: !74, flags: DIFlagStaticMember)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "boundl", scope: !"_ZTS6regobj", file: !5, line: 41, baseType: !17, flags: DIFlagStaticMember)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flodd", scope: !"_ZTS6regobj", file: !5, line: 42, baseType: !23, flags: DIFlagStaticMember)
!122 = !DISubprogram(name: "addtobound", linkageName: "_ZN6regobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS6regobj", file: !5, line: 44, type: !123, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !125, !73, !17, !17}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!126 = !DISubprogram(name: "makebound2", linkageName: "_ZN6regobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS6regobj", file: !5, line: 45, type: !127, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !125, !73, !73}
!129 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEii", scope: !"_ZTS6regobj", file: !5, line: 49, type: !130, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !125, !17, !17}
!132 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEv", scope: !"_ZTS6regobj", file: !5, line: 50, type: !133, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !125}
!135 = !DISubprogram(name: "destroy", linkageName: "_ZN6regobj7destroyEv", scope: !"_ZTS6regobj", file: !5, line: 51, type: !133, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!136 = !DISubprogram(name: "regobj", scope: !"_ZTS6regobj", file: !5, line: 53, type: !137, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !125, !110}
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointt", file: !9, line: 93, size: 64, align: 32, elements: !140, identifier: "_ZTS6pointt")
!140 = !{!141, !142, !143, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS6pointt", file: !9, line: 95, baseType: !17, size: 32, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS6pointt", file: !9, line: 95, baseType: !17, size: 32, align: 32, offset: 32)
!143 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !9, line: 97, type: !144, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!147 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !9, line: 98, type: !148, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !146, !17, !17}
!150 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<regobj *>", file: !151, line: 9, size: 128, align: 64, elements: !152, templateParams: !188, identifier: "_ZTS9flexarrayIP6regobjE")
!151 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Arrays.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!152 = !{!153, !155, !156, !157, !163, !166, !169, !170, !173, !176, !179, !182, !186, !187}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 13, baseType: !154, size: 64, align: 64, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 15, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 16, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!157 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 19, type: !158, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!158 = !DISubroutineType(types: !159)
!159 = !{!23, !160, !161}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!161 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!163 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 21, type: !164, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !160, !161}
!166 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 22, type: !167, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!167 = !DISubroutineType(types: !168)
!168 = !{!154, !160}
!169 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIP6regobjE6removeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 23, type: !164, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIP6regobjE8iselemquEib", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 25, type: !171, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !160, !17, !23}
!173 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIP6regobjE7enlargeEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 27, type: !174, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !160, !17}
!176 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIP6regobjE8doublingEb", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 29, type: !177, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !160, !23}
!179 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIP6regobjE5clearEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 31, type: !180, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !160}
!182 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIP6regobjEixEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 33, type: !183, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !160, !17}
!185 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !29)
!186 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIP6regobjE6createEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 38, type: !174, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!187 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIP6regobjE7destroyEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !151, line: 39, type: !180, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "eobj", type: !29)
!190 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<pointt>", file: !151, line: 9, size: 128, align: 64, elements: !191, templateParams: !227, identifier: "_ZTS9flexarrayI6pointtE")
!191 = !{!192, !194, !195, !196, !202, !205, !208, !209, !212, !215, !218, !221, !225, !226}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 13, baseType: !193, size: 64, align: 64, flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 15, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 16, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!196 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayI6pointtE9isincludeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 19, type: !197, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{!23, !199, !200}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayI6pointtE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!200 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS6pointt")
!202 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 21, type: !203, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !199, !200}
!205 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addEv", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 22, type: !206, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubroutineType(types: !207)
!207 = !{!193, !199}
!208 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayI6pointtE6removeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 23, type: !203, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayI6pointtE8iselemquEib", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 25, type: !210, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !199, !17, !23}
!212 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayI6pointtE7enlargeEi", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 27, type: !213, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !199, !17}
!215 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayI6pointtE8doublingEb", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 29, type: !216, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !199, !23}
!218 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayI6pointtE5clearEv", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 31, type: !219, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !199}
!221 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayI6pointtEixEi", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 33, type: !222, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !199, !17}
!224 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS6pointt")
!225 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayI6pointtE6createEi", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 38, type: !213, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!226 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayI6pointtE7destroyEv", scope: !"_ZTS9flexarrayI6pointtE", file: !151, line: 39, type: !219, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!227 = !{!228}
!228 = !DITemplateTypeParameter(name: "eobj", type: !"_ZTS6pointt")
!229 = !DICompositeType(tag: DW_TAG_class_type, name: "largesolidarray<regobj *>", file: !151, line: 101, size: 512, align: 64, elements: !230, templateParams: !188, identifier: "_ZTS15largesolidarrayIP6regobjE")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !241, !244, !247, !250, !253, !256, !257, !258, !259}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 105, baseType: !154, size: 64, align: 64, flags: DIFlagPublic)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "freecellholder", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 107, baseType: !"_ZTS9flexstackIiE", size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 192, flags: DIFlagPublic)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "rccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 110, baseType: !17, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 111, baseType: !17, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!237 = !DISubprogram(name: "elem", linkageName: "_ZN15largesolidarrayIP6regobjE4elemEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 113, type: !238, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{!185, !240, !17}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!241 = !DISubprogram(name: "isinclude", linkageName: "_ZN15largesolidarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 114, type: !242, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!23, !240, !161}
!244 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 116, type: !245, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!17, !240, !161}
!247 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 117, type: !248, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!17, !240}
!250 = !DISubprogram(name: "remove", linkageName: "_ZN15largesolidarrayIP6regobjE6removeEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 118, type: !251, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !240, !17}
!253 = !DISubprogram(name: "doubling", linkageName: "_ZN15largesolidarrayIP6regobjE8doublingEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 120, type: !254, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !240}
!256 = !DISubprogram(name: "clear", linkageName: "_ZN15largesolidarrayIP6regobjE5clearEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 122, type: !254, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!257 = !DISubprogram(name: "operator[]", linkageName: "_ZN15largesolidarrayIP6regobjEixEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 124, type: !238, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubprogram(name: "create", linkageName: "_ZN15largesolidarrayIP6regobjE6createEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 129, type: !251, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubprogram(name: "destroy", linkageName: "_ZN15largesolidarrayIP6regobjE7destroyEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !151, line: 130, type: !254, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DICompositeType(tag: DW_TAG_class_type, name: "flexstack<int>", file: !151, line: 43, size: 128, align: 64, elements: !261, templateParams: !284, identifier: "_ZTS9flexstackIiE")
!261 = !{!262, !264, !265, !266, !270, !273, !276, !279, !280, !283}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexstackIiE", file: !151, line: 47, baseType: !263, size: 64, align: 64, flags: DIFlagPublic)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexstackIiE", file: !151, line: 49, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexstackIiE", file: !151, line: 50, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!266 = !DISubprogram(name: "get", linkageName: "_ZN9flexstackIiE3getEv", scope: !"_ZTS9flexstackIiE", file: !151, line: 52, type: !267, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{!20, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexstackIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!270 = !DISubprogram(name: "put", linkageName: "_ZN9flexstackIiE3putEi", scope: !"_ZTS9flexstackIiE", file: !151, line: 53, type: !271, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !269, !20}
!273 = !DISubprogram(name: "isempty", linkageName: "_ZN9flexstackIiE7isemptyEv", scope: !"_ZTS9flexstackIiE", file: !151, line: 55, type: !274, isLocal: false, isDefinition: false, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{!23, !269}
!276 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexstackIiE8doublingEv", scope: !"_ZTS9flexstackIiE", file: !151, line: 57, type: !277, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !269}
!279 = !DISubprogram(name: "clear", linkageName: "_ZN9flexstackIiE5clearEv", scope: !"_ZTS9flexstackIiE", file: !151, line: 58, type: !277, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubprogram(name: "create", linkageName: "_ZN9flexstackIiE6createEi", scope: !"_ZTS9flexstackIiE", file: !151, line: 59, type: !281, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !269, !17}
!283 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexstackIiE7destroyEv", scope: !"_ZTS9flexstackIiE", file: !151, line: 60, type: !277, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "eobj", type: !20)
!286 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<int>", file: !151, line: 9, size: 128, align: 64, elements: !287, templateParams: !284, identifier: "_ZTS9flexarrayIiE")
!287 = !{!288, !289, !290, !291, !297, !300, !303, !304, !307, !310, !313, !316, !320, !321}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIiE", file: !151, line: 13, baseType: !263, size: 64, align: 64, flags: DIFlagPublic)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIiE", file: !151, line: 15, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIiE", file: !151, line: 16, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!291 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIiE9isincludeERKi", scope: !"_ZTS9flexarrayIiE", file: !151, line: 19, type: !292, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{!23, !294, !295}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!295 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!297 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addERKi", scope: !"_ZTS9flexarrayIiE", file: !151, line: 21, type: !298, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !294, !295}
!300 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addEv", scope: !"_ZTS9flexarrayIiE", file: !151, line: 22, type: !301, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubroutineType(types: !302)
!302 = !{!263, !294}
!303 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIiE6removeERKi", scope: !"_ZTS9flexarrayIiE", file: !151, line: 23, type: !298, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIiE8iselemquEib", scope: !"_ZTS9flexarrayIiE", file: !151, line: 25, type: !305, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !294, !17, !23}
!307 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIiE7enlargeEi", scope: !"_ZTS9flexarrayIiE", file: !151, line: 27, type: !308, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !294, !17}
!310 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIiE8doublingEb", scope: !"_ZTS9flexarrayIiE", file: !151, line: 29, type: !311, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !294, !23}
!313 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIiE5clearEv", scope: !"_ZTS9flexarrayIiE", file: !151, line: 31, type: !314, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !294}
!316 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIiEixEi", scope: !"_ZTS9flexarrayIiE", file: !151, line: 33, type: !317, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !294, !17}
!319 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !20)
!320 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIiE6createEi", scope: !"_ZTS9flexarrayIiE", file: !151, line: 38, type: !308, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIiE7destroyEv", scope: !"_ZTS9flexarrayIiE", file: !151, line: 39, type: !314, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<regboundobj>", file: !151, line: 9, size: 128, align: 64, elements: !323, templateParams: !359, identifier: "_ZTS9flexarrayI11regboundobjE")
!323 = !{!324, !326, !327, !328, !334, !337, !340, !341, !344, !347, !350, !353, !357, !358}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 13, baseType: !325, size: 64, align: 64, flags: DIFlagPublic)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS11regboundobj", size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 15, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 16, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!328 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayI11regboundobjE9isincludeERKS0_", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 19, type: !329, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{!23, !331, !332}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayI11regboundobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!332 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS11regboundobj")
!334 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI11regboundobjE3addERKS0_", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 21, type: !335, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !331, !332}
!337 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI11regboundobjE3addEv", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 22, type: !338, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{!325, !331}
!340 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayI11regboundobjE6removeERKS0_", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 23, type: !335, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayI11regboundobjE8iselemquEib", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 25, type: !342, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !331, !17, !23}
!344 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayI11regboundobjE7enlargeEi", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 27, type: !345, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !331, !17}
!347 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayI11regboundobjE8doublingEb", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 29, type: !348, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !331, !23}
!350 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayI11regboundobjE5clearEv", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 31, type: !351, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !331}
!353 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayI11regboundobjEixEi", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 33, type: !354, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{!356, !331, !17}
!356 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS11regboundobj")
!357 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayI11regboundobjE6createEi", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 38, type: !345, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayI11regboundobjE7destroyEv", scope: !"_ZTS9flexarrayI11regboundobjE", file: !151, line: 39, type: !351, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !{!360}
!360 = !DITemplateTypeParameter(name: "eobj", type: !"_ZTS11regboundobj")
!361 = !DICompositeType(tag: DW_TAG_class_type, name: "regboundobj", file: !5, line: 135, size: 896, align: 64, elements: !362, identifier: "_ZTS11regboundobj")
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !380, !381, !385, !388, !391, !394, !397, !400}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "boundar", scope: !"_ZTS11regboundobj", file: !5, line: 137, baseType: !74, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bound2arp", scope: !"_ZTS11regboundobj", file: !5, line: 138, baseType: !74, size: 128, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flodd", scope: !"_ZTS11regboundobj", file: !5, line: 139, baseType: !23, size: 8, align: 8, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "boundl", scope: !"_ZTS11regboundobj", file: !5, line: 140, baseType: !17, size: 32, align: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "regionp", scope: !"_ZTS11regboundobj", file: !5, line: 141, baseType: !28, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "xc", scope: !"_ZTS11regboundobj", file: !5, line: 143, baseType: !17, size: 32, align: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "yc", scope: !"_ZTS11regboundobj", file: !5, line: 143, baseType: !17, size: 32, align: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius", scope: !"_ZTS11regboundobj", file: !5, line: 144, baseType: !17, size: 32, align: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius2", scope: !"_ZTS11regboundobj", file: !5, line: 144, baseType: !17, size: 32, align: 32, offset: 480)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "regionmapp", scope: !"_ZTS11regboundobj", file: !5, line: 145, baseType: !26, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "landscapemapp", scope: !"_ZTS11regboundobj", file: !5, line: 146, baseType: !31, size: 64, align: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizex", scope: !"_ZTS11regboundobj", file: !5, line: 149, baseType: !17, size: 32, align: 32, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizey", scope: !"_ZTS11regboundobj", file: !5, line: 149, baseType: !17, size: 32, align: 32, offset: 672)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS11regboundobj", file: !5, line: 150, baseType: !17, size: 32, align: 32, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS11regboundobj", file: !5, line: 150, baseType: !17, size: 32, align: 32, offset: 736)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "regmngp", scope: !"_ZTS11regboundobj", file: !5, line: 151, baseType: !379, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmngobjpt", file: !5, line: 132, baseType: !111)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flexist", scope: !"_ZTS11regboundobj", file: !5, line: 158, baseType: !23, size: 8, align: 8, offset: 832, flags: DIFlagPublic)
!381 = !DISubprogram(name: "regmapp", linkageName: "_ZN11regboundobj7regmappEii", scope: !"_ZTS11regboundobj", file: !5, line: 147, type: !382, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{!85, !384, !17, !17}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS11regboundobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!385 = !DISubprogram(name: "mapp", linkageName: "_ZN11regboundobj4mappEii", scope: !"_ZTS11regboundobj", file: !5, line: 148, type: !386, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{!33, !384, !17, !17}
!388 = !DISubprogram(name: "addtobound", linkageName: "_ZN11regboundobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS11regboundobj", file: !5, line: 153, type: !389, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !384, !73, !17, !17}
!391 = !DISubprogram(name: "makebound2", linkageName: "_ZN11regboundobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS11regboundobj", file: !5, line: 154, type: !392, isLocal: false, isDefinition: false, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !384, !73, !73}
!394 = !DISubprogram(name: "step", linkageName: "_ZN11regboundobj4stepEv", scope: !"_ZTS11regboundobj", file: !5, line: 160, type: !395, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!395 = !DISubroutineType(types: !396)
!396 = !{!23, !384}
!397 = !DISubprogram(name: "firststep", linkageName: "_ZN11regboundobj9firststepEiiP6regobjP9regmngobj", scope: !"_ZTS11regboundobj", file: !5, line: 161, type: !398, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !384, !17, !17, !28, !379}
!400 = !DISubprogram(name: "destroy", linkageName: "_ZN11regboundobj7destroyEv", scope: !"_ZTS11regboundobj", file: !5, line: 163, type: !401, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !384}
!403 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!404 = !{!405, !408, !412, !418, !424, !428, !434, !439, !458, !463, !469, !476, !481, !490, !497, !501, !512, !519, !526, !530, !534, !537, !540, !545, !550, !556, !561, !568, !573, !577, !582, !586, !589, !592, !597, !600, !605, !611, !617, !620, !625, !629, !635, !640, !644, !647, !652, !655, !661, !665, !668}
!405 = !DISubprogram(name: "create", linkageName: "_ZN9regmngobj6createEv", scope: !"_ZTS9regmngobj", file: !1, line: 22, type: !52, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, function: void (%class.regmngobj*)* @_ZN9regmngobj6createEv, declaration: !102, variables: !406)
!406 = !{!407}
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !405, type: !111, flags: DIFlagArtificial | DIFlagObjectPointer)
!408 = !DISubprogram(name: "destroy", linkageName: "_ZN9regmngobj7destroyEv", scope: !"_ZTS9regmngobj", file: !1, line: 32, type: !52, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: void (%class.regmngobj*)* @_ZN9regmngobj7destroyEv, declaration: !103, variables: !409)
!409 = !{!410, !411}
!410 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !408, type: !111, flags: DIFlagArtificial | DIFlagObjectPointer)
