; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegWay_.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.regwayobj = type { i32 (...)**, %class.flexarray, %class.flexarray, i32, i32, %class.regmngobj*, i8, %class.regobj*, %class.regobj* }
%class.flexarray = type { %class.regobj**, i32, i32 }
%class.regmngobj = type { i16*, i16, i32, i32, i8, i32, %class.regobj**, i8*, [256 x i8], i32, i32, float, i32, i32, i32, i32, %class.largesolidarray }
%class.largesolidarray = type { %class.regobj**, %class.flexstack, %class.flexarray.0, %class.flexarray.0, i32, i32 }
%class.flexstack = type { i32*, i32, i32 }
%class.flexarray.0 = type { i32*, i32, i32 }
%class.regobj = type { i32, i8, i8, %class.regmngobj*, i32, %struct.pointt, i32, i32, i32, %class.flexarray }
%struct.pointt = type { i32, i32 }

@_ZTV9regwayobj = unnamed_addr constant [5 x i8*] [i8* null, i8* bitcast ({ i8*, i8* }* @_ZTI9regwayobj to i8*), i8* bitcast (i1 (%class.regwayobj*, %class.regobj*, %class.regobj*)* @_ZN9regwayobj12isaddtoboundEP6regobjS1_ to i8*), i8* bitcast (void (%class.regwayobj*, %class.regmngobj*)* @_ZN9regwayobj6createEP9regmngobj to i8*), i8* bitcast (void (%class.regwayobj*)* @_ZN9regwayobj7destroyEv to i8*)], align 8
@_ZTVN10__cxxabiv117__class_type_infoE = external global i8*
@_ZTS9regwayobj = constant [11 x i8] c"9regwayobj\00"

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !365, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegWay_.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !60, !100, !136, !222, !253, !279, !315, !354, !48, !165, !64, !17}
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "regwayobj", file: !5, line: 11, size: 640, align: 64, elements: !6, vtableHolder: !"_ZTS9regwayobj", identifier: "_ZTS9regwayobj")
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegWay_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !13, !15, !16, !21, !22, !26, !28, !31, !32, !36, !40, !43, !44, !50, !54, !57}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$regwayobj", scope: !5, file: !5, baseType: !8, size: 64, flags: DIFlagArtificial)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !10, size: 64)
!10 = !DISubroutineType(types: !11)
!11 = !{!12}
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "bound1arp", scope: !"_ZTS9regwayobj", file: !5, line: 13, baseType: !14, size: 128, align: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "regboundart", file: !5, line: 9, baseType: !"_ZTS9flexarrayIP6regobjE")
!15 = !DIDerivedType(tag: DW_TAG_member, name: "bound2arp", scope: !"_ZTS9regwayobj", file: !5, line: 13, baseType: !14, size: 128, align: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "filltact", scope: !"_ZTS9regwayobj", file: !5, line: 14, baseType: !17, size: 32, align: 32, offset: 320)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !18, line: 28, baseType: !19)
!18 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !20, line: 30, baseType: !12)
!20 = !DIFile(filename: "/usr/include/sys/_types/_int32_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DIDerivedType(tag: DW_TAG_member, name: "regfillnum", scope: !"_ZTS9regwayobj", file: !5, line: 15, baseType: !17, size: 32, align: 32, offset: 352)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "regmngp", scope: !"_ZTS9regwayobj", file: !5, line: 16, baseType: !23, size: 64, align: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmngobjpt", file: !24, line: 132, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/RegMng_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flend", scope: !"_ZTS9regwayobj", file: !5, line: 17, baseType: !27, size: 8, align: 8, offset: 448)
!27 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !"_ZTS9regwayobj", file: !5, line: 18, baseType: !29, size: 64, align: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjpt", file: !24, line: 11, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !"_ZTS9regwayobj", file: !5, line: 19, baseType: !29, size: 64, align: 64, offset: 576)
!32 = !DISubprogram(name: "isaddtobound", linkageName: "_ZN9regwayobj12isaddtoboundEP6regobjS1_", scope: !"_ZTS9regwayobj", file: !5, line: 21, type: !33, isLocal: false, isDefinition: false, scopeLine: 21, containingType: !"_ZTS9regwayobj", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPrototyped, isOptimized: true)
!33 = !DISubroutineType(types: !34)
!34 = !{!27, !35, !29, !29}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regwayobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!36 = !DISubprogram(name: "addtobound", linkageName: "_ZN9regwayobj10addtoboundER9flexarrayIP6regobjES2_", scope: !"_ZTS9regwayobj", file: !5, line: 22, type: !37, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !35, !39, !29}
!39 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !14)
!40 = !DISubprogram(name: "makebound2", linkageName: "_ZN9regwayobj10makebound2ER9flexarrayIP6regobjES4_", scope: !"_ZTS9regwayobj", file: !5, line: 23, type: !41, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !35, !39, !39}
!43 = !DISubprogram(name: "fill", linkageName: "_ZN9regwayobj4fillEP6regobjS1_", scope: !"_ZTS9regwayobj", file: !5, line: 25, type: !33, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true)
!44 = !DISubprogram(name: "getway", linkageName: "_ZN9regwayobj6getwayEP6regobjRPS1_", scope: !"_ZTS9regwayobj", file: !5, line: 26, type: !45, isLocal: false, isDefinition: false, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true)
!45 = !DISubroutineType(types: !46)
!46 = !{!17, !35, !29, !47}
!47 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "regobjppt", file: !24, line: 12, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!50 = !DISubprogram(name: "createway", linkageName: "_ZN9regwayobj9createwayEP6regobjS1_RPS1_Ri", scope: !"_ZTS9regwayobj", file: !5, line: 30, type: !51, isLocal: false, isDefinition: false, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!51 = !DISubroutineType(types: !52)
!52 = !{!27, !35, !29, !29, !47, !53}
!53 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !17)
!54 = !DISubprogram(name: "create", linkageName: "_ZN9regwayobj6createEP9regmngobj", scope: !"_ZTS9regwayobj", file: !5, line: 31, type: !55, isLocal: false, isDefinition: false, scopeLine: 31, containingType: !"_ZTS9regwayobj", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !35, !23}
!57 = !DISubprogram(name: "destroy", linkageName: "_ZN9regwayobj7destroyEv", scope: !"_ZTS9regwayobj", file: !5, line: 32, type: !58, isLocal: false, isDefinition: false, scopeLine: 32, containingType: !"_ZTS9regwayobj", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !35}
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<regobj *>", file: !61, line: 9, size: 128, align: 64, elements: !62, templateParams: !98, identifier: "_ZTS9flexarrayIP6regobjE")
!61 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Arrays.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !{!63, !65, !66, !67, !73, !76, !79, !80, !83, !86, !89, !92, !96, !97}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 13, baseType: !64, size: 64, align: 64, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 15, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 16, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!67 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 19, type: !68, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!68 = !DISubroutineType(types: !69)
!69 = !{!27, !70, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!71 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!73 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 21, type: !74, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !70, !71}
!76 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIP6regobjE3addEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 22, type: !77, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!77 = !DISubroutineType(types: !78)
!78 = !{!64, !70}
!79 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIP6regobjE6removeERKS1_", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 23, type: !74, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!80 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIP6regobjE8iselemquEib", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 25, type: !81, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !70, !17, !27}
!83 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIP6regobjE7enlargeEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 27, type: !84, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !70, !17}
!86 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIP6regobjE8doublingEb", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 29, type: !87, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !70, !27}
!89 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIP6regobjE5clearEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 31, type: !90, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !70}
!92 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIP6regobjEixEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 33, type: !93, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !70, !17}
!95 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !30)
!96 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIP6regobjE6createEi", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 38, type: !84, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!97 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIP6regobjE7destroyEv", scope: !"_ZTS9flexarrayIP6regobjE", file: !61, line: 39, type: !90, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "eobj", type: !30)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "regobj", file: !24, line: 21, size: 448, align: 64, elements: !101, identifier: "_ZTS6regobj")
!101 = !{!102, !103, !104, !105, !107, !108, !109, !110, !111, !112, !113, !115, !116, !117, !118, !123, !126, !129, !132, !133}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "internalnum", scope: !"_ZTS6regobj", file: !24, line: 25, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flexist", scope: !"_ZTS6regobj", file: !24, line: 26, baseType: !27, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flredefine", scope: !"_ZTS6regobj", file: !24, line: 27, baseType: !27, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "regmngp", scope: !"_ZTS6regobj", file: !24, line: 28, baseType: !106, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmngobjpt", file: !24, line: 15, baseType: !25)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "square", scope: !"_ZTS6regobj", file: !24, line: 30, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "centerp", scope: !"_ZTS6regobj", file: !24, line: 31, baseType: !"_ZTS6pointt", size: 64, align: 32, offset: 160, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !"_ZTS6regobj", file: !24, line: 32, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS6regobj", file: !24, line: 33, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "waydist", scope: !"_ZTS6regobj", file: !24, line: 34, baseType: !17, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nb1ar", scope: !"_ZTS6regobj", file: !24, line: 36, baseType: !"_ZTS9flexarrayIP6regobjE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "bound1arp", scope: !"_ZTS6regobj", file: !24, line: 40, baseType: !114, flags: DIFlagStaticMember)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "boundart", file: !24, line: 17, baseType: !"_ZTS9flexarrayI6pointtE")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bound2arp", scope: !"_ZTS6regobj", file: !24, line: 40, baseType: !114, flags: DIFlagStaticMember)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "boundl", scope: !"_ZTS6regobj", file: !24, line: 41, baseType: !17, flags: DIFlagStaticMember)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flodd", scope: !"_ZTS6regobj", file: !24, line: 42, baseType: !27, flags: DIFlagStaticMember)
!118 = !DISubprogram(name: "addtobound", linkageName: "_ZN6regobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS6regobj", file: !24, line: 44, type: !119, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !121, !122, !17, !17}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6regobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!122 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !114)
!123 = !DISubprogram(name: "makebound2", linkageName: "_ZN6regobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS6regobj", file: !24, line: 45, type: !124, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !121, !122, !122}
!126 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEii", scope: !"_ZTS6regobj", file: !24, line: 49, type: !127, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !121, !17, !17}
!129 = !DISubprogram(name: "create", linkageName: "_ZN6regobj6createEv", scope: !"_ZTS6regobj", file: !24, line: 50, type: !130, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !121}
!132 = !DISubprogram(name: "destroy", linkageName: "_ZN6regobj7destroyEv", scope: !"_ZTS6regobj", file: !24, line: 51, type: !130, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!133 = !DISubprogram(name: "regobj", scope: !"_ZTS6regobj", file: !24, line: 53, type: !134, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !121, !106}
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "regmngobj", file: !24, line: 60, size: 3200, align: 64, elements: !137, identifier: "_ZTS9regmngobj")
!137 = !{!138, !145, !146, !147, !148, !149, !150, !151, !158, !162, !163, !164, !167, !168, !169, !170, !171, !172, !176, !179, !180, !181, !182, !183, !184, !185, !188, !189, !190, !191, !194, !197, !200, !204, !207, !210, !211, !217, !220, !221}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mmapp", scope: !"_ZTS9regmngobj", file: !24, line: 75, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16pt", file: !18, line: 44, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16", file: !18, line: 22, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !143, line: 31, baseType: !144)
!143 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!144 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS9regmngobj", file: !24, line: 76, baseType: !141, size: 16, align: 16, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "freepointx", scope: !"_ZTS9regmngobj", file: !24, line: 77, baseType: !17, size: 32, align: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "freepointy", scope: !"_ZTS9regmngobj", file: !24, line: 77, baseType: !17, size: 32, align: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flfind", scope: !"_ZTS9regmngobj", file: !24, line: 78, baseType: !27, size: 8, align: 8, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "regfillnum", scope: !"_ZTS9regmngobj", file: !24, line: 84, baseType: !17, size: 32, align: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionmapp", scope: !"_ZTS9regmngobj", file: !24, line: 88, baseType: !48, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "landscapemapp", scope: !"_ZTS9regmngobj", file: !24, line: 89, baseType: !152, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytept", file: !18, line: 21, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !18, line: 20, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !156, line: 31, baseType: !157)
!156 = !DIFile(filename: "/usr/include/_types/_uint8_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!157 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flpasablear", scope: !"_ZTS9regmngobj", file: !24, line: 90, baseType: !159, size: 2048, align: 8, offset: 384, flags: DIFlagPublic)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, align: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius", scope: !"_ZTS9regmngobj", file: !24, line: 91, baseType: !17, size: 32, align: 32, offset: 2432, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "regionradius2", scope: !"_ZTS9regmngobj", file: !24, line: 91, baseType: !17, size: 32, align: 32, offset: 2464, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "radiuscoef", scope: !"_ZTS9regmngobj", file: !24, line: 92, baseType: !165, size: 32, align: 32, offset: 2496, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "rnumt", file: !18, line: 57, baseType: !166)
!166 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS9regmngobj", file: !24, line: 95, baseType: !17, size: 32, align: 32, offset: 2528, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS9regmngobj", file: !24, line: 95, baseType: !17, size: 32, align: 32, offset: 2560, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizex", scope: !"_ZTS9regmngobj", file: !24, line: 118, baseType: !17, size: 32, align: 32, offset: 2592, flags: DIFlagPublic)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizey", scope: !"_ZTS9regmngobj", file: !24, line: 118, baseType: !17, size: 32, align: 32, offset: 2624, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rarp", scope: !"_ZTS9regmngobj", file: !24, line: 120, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 512, align: 64, offset: 2688, flags: DIFlagPublic)
!172 = !DISubprogram(name: "foundemptyregions", linkageName: "_ZN9regmngobj17foundemptyregionsEv", scope: !"_ZTS9regmngobj", file: !24, line: 62, type: !173, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regmngobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!176 = !DISubprogram(name: "newregion", linkageName: "_ZN9regmngobj9newregionEii", scope: !"_ZTS9regmngobj", file: !24, line: 63, type: !177, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{!29, !175, !17, !17}
!179 = !DISubprogram(name: "deleteregions", linkageName: "_ZN9regmngobj13deleteregionsEv", scope: !"_ZTS9regmngobj", file: !24, line: 64, type: !173, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true)
!180 = !DISubprogram(name: "defineregions", linkageName: "_ZN9regmngobj13defineregionsEv", scope: !"_ZTS9regmngobj", file: !24, line: 65, type: !173, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true)
!181 = !DISubprogram(name: "addallregions", linkageName: "_ZN9regmngobj13addallregionsEv", scope: !"_ZTS9regmngobj", file: !24, line: 66, type: !173, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true)
!182 = !DISubprogram(name: "addregions", linkageName: "_ZN9regmngobj10addregionsEv", scope: !"_ZTS9regmngobj", file: !24, line: 67, type: !173, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true)
!183 = !DISubprogram(name: "redefineregions", linkageName: "_ZN9regmngobj15redefineregionsEv", scope: !"_ZTS9regmngobj", file: !24, line: 68, type: !173, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!184 = !DISubprogram(name: "enlargeregions", linkageName: "_ZN9regmngobj14enlargeregionsEv", scope: !"_ZTS9regmngobj", file: !24, line: 69, type: !173, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true)
!185 = !DISubprogram(name: "enlargeneighborses", linkageName: "_ZN9regmngobj18enlargeneighborsesEi", scope: !"_ZTS9regmngobj", file: !24, line: 70, type: !186, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !175, !17}
!188 = !DISubprogram(name: "defineneighborhood1", linkageName: "_ZN9regmngobj19defineneighborhood1Ev", scope: !"_ZTS9regmngobj", file: !24, line: 71, type: !173, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true)
!189 = !DISubprogram(name: "definemiddleregpoint", linkageName: "_ZN9regmngobj20definemiddleregpointEv", scope: !"_ZTS9regmngobj", file: !24, line: 72, type: !173, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true)
!190 = !DISubprogram(name: "normalizemiddlepoint", linkageName: "_ZN9regmngobj20normalizemiddlepointEv", scope: !"_ZTS9regmngobj", file: !24, line: 73, type: !173, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true)
!191 = !DISubprogram(name: "addtobound", linkageName: "_ZN9regmngobj10addtoboundER9flexarrayI6pointtEii", scope: !"_ZTS9regmngobj", file: !24, line: 80, type: !192, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !175, !122, !17, !17}
!194 = !DISubprogram(name: "makebound2", linkageName: "_ZN9regmngobj10makebound2ER9flexarrayI6pointtES3_", scope: !"_ZTS9regmngobj", file: !24, line: 81, type: !195, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !175, !122, !122}
!197 = !DISubprogram(name: "findfreeplace", linkageName: "_ZN9regmngobj13findfreeplaceEiiRiS0_", scope: !"_ZTS9regmngobj", file: !24, line: 82, type: !198, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{!27, !175, !17, !17, !53, !53}
!200 = !DISubprogram(name: "regmapp", linkageName: "_ZN9regmngobj7regmappEii", scope: !"_ZTS9regmngobj", file: !24, line: 93, type: !201, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !175, !17, !17}
!203 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !29)
!204 = !DISubprogram(name: "mapp", linkageName: "_ZN9regmngobj4mappEii", scope: !"_ZTS9regmngobj", file: !24, line: 94, type: !205, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubroutineType(types: !206)
!206 = !{!154, !175, !17, !17}
!207 = !DISubprogram(name: "getregfillnum", linkageName: "_ZN9regmngobj13getregfillnumEv", scope: !"_ZTS9regmngobj", file: !24, line: 122, type: !208, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!208 = !DISubroutineType(types: !209)
!209 = !{!17, !175}
!210 = !DISubprogram(name: "createregions", linkageName: "_ZN9regmngobj13createregionsEi", scope: !"_ZTS9regmngobj", file: !24, line: 124, type: !186, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubprogram(name: "loadmap", linkageName: "_ZN9regmngobj7loadmapEPKc", scope: !"_ZTS9regmngobj", file: !24, line: 126, type: !212, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{!27, !175, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!217 = !DISubprogram(name: "initmap", linkageName: "_ZN9regmngobj7initmapEii", scope: !"_ZTS9regmngobj", file: !24, line: 127, type: !218, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubroutineType(types: !219)
!219 = !{!27, !175, !17, !17}
!220 = !DISubprogram(name: "create", linkageName: "_ZN9regmngobj6createEv", scope: !"_ZTS9regmngobj", file: !24, line: 129, type: !173, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!221 = !DISubprogram(name: "destroy", linkageName: "_ZN9regmngobj7destroyEv", scope: !"_ZTS9regmngobj", file: !24, line: 130, type: !173, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!222 = !DICompositeType(tag: DW_TAG_class_type, name: "largesolidarray<regobj *>", file: !61, line: 101, size: 512, align: 64, elements: !223, templateParams: !98, identifier: "_ZTS15largesolidarrayIP6regobjE")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !234, !237, !240, !243, !246, !249, !250, !251, !252}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 105, baseType: !64, size: 64, align: 64, flags: DIFlagPublic)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "freecellholder", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 107, baseType: !"_ZTS9flexstackIiE", size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "dccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 192, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rccellar", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 108, baseType: !"_ZTS9flexarrayIiE", size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 110, baseType: !17, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 111, baseType: !17, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!230 = !DISubprogram(name: "elem", linkageName: "_ZN15largesolidarrayIP6regobjE4elemEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 113, type: !231, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{!95, !233, !17}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15largesolidarrayIP6regobjE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!234 = !DISubprogram(name: "isinclude", linkageName: "_ZN15largesolidarrayIP6regobjE9isincludeERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 114, type: !235, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{!27, !233, !71}
!237 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addERKS1_", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 116, type: !238, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{!17, !233, !71}
!240 = !DISubprogram(name: "add", linkageName: "_ZN15largesolidarrayIP6regobjE3addEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 117, type: !241, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!241 = !DISubroutineType(types: !242)
!242 = !{!17, !233}
!243 = !DISubprogram(name: "remove", linkageName: "_ZN15largesolidarrayIP6regobjE6removeEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 118, type: !244, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !233, !17}
!246 = !DISubprogram(name: "doubling", linkageName: "_ZN15largesolidarrayIP6regobjE8doublingEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 120, type: !247, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !233}
!249 = !DISubprogram(name: "clear", linkageName: "_ZN15largesolidarrayIP6regobjE5clearEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 122, type: !247, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!250 = !DISubprogram(name: "operator[]", linkageName: "_ZN15largesolidarrayIP6regobjEixEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 124, type: !231, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubprogram(name: "create", linkageName: "_ZN15largesolidarrayIP6regobjE6createEi", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 129, type: !244, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!252 = !DISubprogram(name: "destroy", linkageName: "_ZN15largesolidarrayIP6regobjE7destroyEv", scope: !"_ZTS15largesolidarrayIP6regobjE", file: !61, line: 130, type: !247, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!253 = !DICompositeType(tag: DW_TAG_class_type, name: "flexstack<int>", file: !61, line: 43, size: 128, align: 64, elements: !254, templateParams: !277, identifier: "_ZTS9flexstackIiE")
!254 = !{!255, !257, !258, !259, !263, !266, !269, !272, !273, !276}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexstackIiE", file: !61, line: 47, baseType: !256, size: 64, align: 64, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexstackIiE", file: !61, line: 49, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexstackIiE", file: !61, line: 50, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!259 = !DISubprogram(name: "get", linkageName: "_ZN9flexstackIiE3getEv", scope: !"_ZTS9flexstackIiE", file: !61, line: 52, type: !260, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DISubroutineType(types: !261)
!261 = !{!12, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexstackIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!263 = !DISubprogram(name: "put", linkageName: "_ZN9flexstackIiE3putEi", scope: !"_ZTS9flexstackIiE", file: !61, line: 53, type: !264, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !262, !12}
!266 = !DISubprogram(name: "isempty", linkageName: "_ZN9flexstackIiE7isemptyEv", scope: !"_ZTS9flexstackIiE", file: !61, line: 55, type: !267, isLocal: false, isDefinition: false, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{!27, !262}
!269 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexstackIiE8doublingEv", scope: !"_ZTS9flexstackIiE", file: !61, line: 57, type: !270, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !262}
!272 = !DISubprogram(name: "clear", linkageName: "_ZN9flexstackIiE5clearEv", scope: !"_ZTS9flexstackIiE", file: !61, line: 58, type: !270, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!273 = !DISubprogram(name: "create", linkageName: "_ZN9flexstackIiE6createEi", scope: !"_ZTS9flexstackIiE", file: !61, line: 59, type: !274, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !262, !17}
!276 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexstackIiE7destroyEv", scope: !"_ZTS9flexstackIiE", file: !61, line: 60, type: !270, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !{!278}
!278 = !DITemplateTypeParameter(name: "eobj", type: !12)
!279 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<int>", file: !61, line: 9, size: 128, align: 64, elements: !280, templateParams: !277, identifier: "_ZTS9flexarrayIiE")
!280 = !{!281, !282, !283, !284, !290, !293, !296, !297, !300, !303, !306, !309, !313, !314}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayIiE", file: !61, line: 13, baseType: !256, size: 64, align: 64, flags: DIFlagPublic)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayIiE", file: !61, line: 15, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayIiE", file: !61, line: 16, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!284 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayIiE9isincludeERKi", scope: !"_ZTS9flexarrayIiE", file: !61, line: 19, type: !285, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!285 = !DISubroutineType(types: !286)
!286 = !{!27, !287, !288}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayIiE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!288 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!290 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addERKi", scope: !"_ZTS9flexarrayIiE", file: !61, line: 21, type: !291, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !287, !288}
!293 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayIiE3addEv", scope: !"_ZTS9flexarrayIiE", file: !61, line: 22, type: !294, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{!256, !287}
!296 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayIiE6removeERKi", scope: !"_ZTS9flexarrayIiE", file: !61, line: 23, type: !291, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!297 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayIiE8iselemquEib", scope: !"_ZTS9flexarrayIiE", file: !61, line: 25, type: !298, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !287, !17, !27}
!300 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayIiE7enlargeEi", scope: !"_ZTS9flexarrayIiE", file: !61, line: 27, type: !301, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !287, !17}
!303 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayIiE8doublingEb", scope: !"_ZTS9flexarrayIiE", file: !61, line: 29, type: !304, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !287, !27}
!306 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayIiE5clearEv", scope: !"_ZTS9flexarrayIiE", file: !61, line: 31, type: !307, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !287}
!309 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayIiEixEi", scope: !"_ZTS9flexarrayIiE", file: !61, line: 33, type: !310, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !287, !17}
!312 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !12)
!313 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayIiE6createEi", scope: !"_ZTS9flexarrayIiE", file: !61, line: 38, type: !301, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!314 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayIiE7destroyEv", scope: !"_ZTS9flexarrayIiE", file: !61, line: 39, type: !307, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!315 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<pointt>", file: !61, line: 9, size: 128, align: 64, elements: !316, templateParams: !352, identifier: "_ZTS9flexarrayI6pointtE")
!316 = !{!317, !319, !320, !321, !327, !330, !333, !334, !337, !340, !343, !346, !350, !351}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 13, baseType: !318, size: 64, align: 64, flags: DIFlagPublic)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 15, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 16, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!321 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayI6pointtE9isincludeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 19, type: !322, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{!27, !324, !325}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayI6pointtE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!325 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS6pointt")
!327 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 21, type: !328, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !324, !325}
!330 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addEv", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 22, type: !331, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!318, !324}
!333 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayI6pointtE6removeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 23, type: !328, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayI6pointtE8iselemquEib", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 25, type: !335, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !324, !17, !27}
!337 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayI6pointtE7enlargeEi", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 27, type: !338, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !324, !17}
!340 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayI6pointtE8doublingEb", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 29, type: !341, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !324, !27}
!343 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayI6pointtE5clearEv", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 31, type: !344, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !324}
!346 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayI6pointtEixEi", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 33, type: !347, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !324, !17}
!349 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS6pointt")
!350 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayI6pointtE6createEi", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 38, type: !338, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayI6pointtE7destroyEv", scope: !"_ZTS9flexarrayI6pointtE", file: !61, line: 39, type: !344, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !{!353}
!353 = !DITemplateTypeParameter(name: "eobj", type: !"_ZTS6pointt")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointt", file: !18, line: 93, size: 64, align: 32, elements: !355, identifier: "_ZTS6pointt")
!355 = !{!356, !357, !358, !362}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS6pointt", file: !18, line: 95, baseType: !17, size: 32, align: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS6pointt", file: !18, line: 95, baseType: !17, size: 32, align: 32, offset: 32)
!358 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !18, line: 97, type: !359, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!362 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !18, line: 98, type: !363, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !361, !17, !17}
!365 = !{!366, !372, !377, !386, !394, !407, !414, !418, !421, !427, !432, !437, !443, !450, !455, !458, !462, !466}
!366 = !DISubprogram(name: "isaddtobound", linkageName: "_ZN9regwayobj12isaddtoboundEP6regobjS1_", scope: !"_ZTS9regwayobj", file: !1, line: 8, type: !33, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: true, function: i1 (%class.regwayobj*, %class.regobj*, %class.regobj*)* @_ZN9regwayobj12isaddtoboundEP6regobjS1_, declaration: !32, variables: !367)
!367 = !{!368, !370, !371}
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !366, type: !369, flags: DIFlagArtificial | DIFlagObjectPointer)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9regwayobj", size: 64, align: 64)
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "initialregionp", arg: 2, scope: !366, file: !1, line: 8, type: !29)
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "regionp", arg: 3, scope: !366, file: !1, line: 8, type: !29)
!372 = !DISubprogram(name: "addtobound", linkageName: "_ZN9regwayobj10addtoboundER9flexarrayIP6regobjES2_", scope: !"_ZTS9regwayobj", file: !1, line: 18, type: !37, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: void (%class.regwayobj*, %class.flexarray*, %class.regobj*)* @_ZN9regwayobj10addtoboundER9flexarrayIP6regobjES2_, declaration: !36, variables: !373)
!373 = !{!374, !375, !376}
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !372, type: !369, flags: DIFlagArtificial | DIFlagObjectPointer)
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "barp", arg: 2, scope: !372, file: !1, line: 18, type: !39)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "regionp", arg: 3, scope: !372, file: !1, line: 18, type: !29)
!377 = !DISubprogram(name: "makebound2", linkageName: "_ZN9regwayobj10makebound2ER9flexarrayIP6regobjES4_", scope: !"_ZTS9regwayobj", file: !1, line: 28, type: !41, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: void (%class.regwayobj*, %class.flexarray*, %class.flexarray*)* @_ZN9regwayobj10makebound2ER9flexarrayIP6regobjES4_, declaration: !40, variables: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385}
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !377, type: !369, flags: DIFlagArtificial | DIFlagObjectPointer)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b1arp", arg: 2, scope: !377, file: !1, line: 28, type: !39)
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b2arp", arg: 3, scope: !377, file: !1, line: 28, type: !39)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !377, file: !1, line: 30, type: !17)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !377, file: !1, line: 30, type: !17)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "region1p", scope: !377, file: !1, line: 31, type: !29)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "region2p", scope: !377, file: !1, line: 31, type: !29)
