; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way2_.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.way2obj = type { i8*, %"struct.way2obj::waymapcellt"*, i16, [256 x i8], [256 x %class.flexarray], i32, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32 }
%"struct.way2obj::waymapcellt" = type { i16, i16 }
%class.flexarray = type { %struct.pointt*, i32, i32 }
%struct.pointt = type { i32, i32 }

; Function Attrs: nounwind optsize readonly ssp uwtable
define zeroext i1 @_ZN7way2obj12isaddtoboundEii(%class.way2obj* nocapture readonly %this, i32 %x, i32 %y) #0 align 2 {
  tail call void @llvm.dbg.value(metadata %class.way2obj* %this, i64 0, metadata !148, metadata !293), !dbg !294
  tail call void @llvm.dbg.value(metadata i32 %x, i64 0, metadata !150, metadata !293), !dbg !295
  tail call void @llvm.dbg.value(metadata i32 %y, i64 0, metadata !151, metadata !293), !dbg !296
  tail call void @llvm.dbg.value(metadata %class.way2obj* %this, i64 0, metadata !234, metadata !293), !dbg !297
  tail call void @llvm.dbg.value(metadata i32 %x, i64 0, metadata !235, metadata !293), !dbg !300
  tail call void @llvm.dbg.value(metadata i32 %y, i64 0, metadata !236, metadata !293), !dbg !301
  %1 = getelementptr inbounds %class.way2obj* %this, i64 0, i32 15, !dbg !302
  %2 = load i32* %1, align 4, !dbg !302, !tbaa !303
  %3 = mul nsw i32 %2, %y, !dbg !311
  %4 = add nsw i32 %3, %x, !dbg !312

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !145, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way2_.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !91, !95, !134, !72, !16, !8, !73, !25}
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "way2obj", file: !5, line: 12, size: 35392, align: 64, elements: !6, identifier: "_ZTS7way2obj")
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way2_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !15, !18, !23, !29, !33, !36, !37, !38, !39, !40, !41, !42, !43, !45, !46, !47, !48, !49, !54, !57, !60, !63, !64, !67, !68, !75, !76, !79, !82, !88, !89, !90}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "mapp", scope: !"_ZTS7way2obj", file: !5, line: 14, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytept", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !9, line: 20, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 31, baseType: !14)
!13 = !DIFile(filename: "/usr/include/_types/_uint8_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "waymap", scope: !"_ZTS7way2obj", file: !5, line: 22, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "waymapcellpt", scope: !"_ZTS7way2obj", file: !5, line: 21, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN7way2obj11waymapcelltE", size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS7way2obj", file: !5, line: 23, baseType: !19, size: 16, align: 16, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16", file: !9, line: 22, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "maxmovetact", scope: !"_ZTS7way2obj", file: !5, line: 26, baseType: !24, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 255)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !9, line: 28, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !27, line: 30, baseType: !28)
!27 = !DIFile(filename: "/usr/include/sys/_types/_int32_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "movetimear", scope: !"_ZTS7way2obj", file: !5, line: 29, baseType: !30, size: 2048, align: 8, offset: 144)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, align: 8, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "boundar", scope: !"_ZTS7way2obj", file: !5, line: 32, baseType: !34, size: 32768, align: 64, offset: 2240)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32768, align: 64, elements: !31)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "boundart", scope: !"_ZTS7way2obj", file: !5, line: 31, baseType: !"_ZTS9flexarrayI6pointtE")
!36 = !DIDerivedType(tag: DW_TAG_member, name: "curbound", scope: !"_ZTS7way2obj", file: !5, line: 34, baseType: !25, size: 32, align: 32, offset: 35008)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nonboundqu", scope: !"_ZTS7way2obj", file: !5, line: 35, baseType: !25, size: 32, align: 32, offset: 35040)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "filltact", scope: !"_ZTS7way2obj", file: !5, line: 36, baseType: !25, size: 32, align: 32, offset: 35072)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "endx", scope: !"_ZTS7way2obj", file: !5, line: 37, baseType: !25, size: 32, align: 32, offset: 35104)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "endy", scope: !"_ZTS7way2obj", file: !5, line: 37, baseType: !25, size: 32, align: 32, offset: 35136)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "startx", scope: !"_ZTS7way2obj", file: !5, line: 38, baseType: !25, size: 32, align: 32, offset: 35168)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "starty", scope: !"_ZTS7way2obj", file: !5, line: 38, baseType: !25, size: 32, align: 32, offset: 35200)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flend", scope: !"_ZTS7way2obj", file: !5, line: 39, baseType: !44, size: 8, align: 8, offset: 35232)
!44 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS7way2obj", file: !5, line: 41, baseType: !25, size: 32, align: 32, offset: 35264)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS7way2obj", file: !5, line: 41, baseType: !25, size: 32, align: 32, offset: 35296)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizex", scope: !"_ZTS7way2obj", file: !5, line: 78, baseType: !25, size: 32, align: 32, offset: 35328, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mapsizey", scope: !"_ZTS7way2obj", file: !5, line: 78, baseType: !25, size: 32, align: 32, offset: 35360, flags: DIFlagPublic)
!49 = !DISubprogram(name: "map", linkageName: "_ZN7way2obj3mapEii", scope: !"_ZTS7way2obj", file: !5, line: 43, type: !50, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !53, !25, !25}
!52 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !11)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS7way2obj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!54 = !DISubprogram(name: "movetime", linkageName: "_ZN7way2obj8movetimeEii", scope: !"_ZTS7way2obj", file: !5, line: 44, type: !55, isLocal: false, isDefinition: false, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true)
!55 = !DISubroutineType(types: !56)
!56 = !{!11, !53, !25, !25}
!57 = !DISubprogram(name: "isaddtobound", linkageName: "_ZN7way2obj12isaddtoboundEii", scope: !"_ZTS7way2obj", file: !5, line: 47, type: !58, isLocal: false, isDefinition: false, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true)
!58 = !DISubroutineType(types: !59)
!59 = !{!44, !53, !25, !25}
!60 = !DISubprogram(name: "addtobound", linkageName: "_ZN7way2obj10addtoboundEii", scope: !"_ZTS7way2obj", file: !5, line: 48, type: !61, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !53, !25, !25}
!63 = !DISubprogram(name: "releasepoint", linkageName: "_ZN7way2obj12releasepointEii", scope: !"_ZTS7way2obj", file: !5, line: 49, type: !61, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true)
!64 = !DISubprogram(name: "releasebound", linkageName: "_ZN7way2obj12releaseboundEv", scope: !"_ZTS7way2obj", file: !5, line: 50, type: !65, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !53}
!67 = !DISubprogram(name: "fill", linkageName: "_ZN7way2obj4fillEii", scope: !"_ZTS7way2obj", file: !5, line: 51, type: !58, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true)
!68 = !DISubprogram(name: "createwayar", linkageName: "_ZN7way2obj11createwayarERP6pointtRi", scope: !"_ZTS7way2obj", file: !5, line: 52, type: !69, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true)
!69 = !DISubroutineType(types: !70)
!70 = !{!44, !53, !71, !74}
!71 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointpt", file: !9, line: 100, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !25)
!75 = !DISubprogram(name: "getterrain", linkageName: "_ZN7way2obj10getterrainEii", scope: !"_ZTS7way2obj", file: !5, line: 80, type: !55, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!76 = !DISubprogram(name: "setterrain", linkageName: "_ZN7way2obj10setterrainEiih", scope: !"_ZTS7way2obj", file: !5, line: 81, type: !77, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !53, !25, !25, !11}
!79 = !DISubprogram(name: "createway", linkageName: "_ZN7way2obj9createwayEiiiiPhRP6pointtRi", scope: !"_ZTS7way2obj", file: !5, line: 83, type: !80, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!80 = !DISubroutineType(types: !81)
!81 = !{!44, !53, !25, !25, !25, !25, !8, !71, !74}
!82 = !DISubprogram(name: "loadmap", linkageName: "_ZN7way2obj7loadmapEPKc", scope: !"_ZTS7way2obj", file: !5, line: 85, type: !83, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!83 = !DISubroutineType(types: !84)
!84 = !{!44, !53, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !DISubprogram(name: "initmap", linkageName: "_ZN7way2obj7initmapEii", scope: !"_ZTS7way2obj", file: !5, line: 86, type: !58, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!89 = !DISubprogram(name: "create", linkageName: "_ZN7way2obj6createEv", scope: !"_ZTS7way2obj", file: !5, line: 88, type: !65, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!90 = !DISubprogram(name: "destroy", linkageName: "_ZN7way2obj7destroyEv", scope: !"_ZTS7way2obj", file: !5, line: 89, type: !65, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "waymapcellt", scope: !"_ZTS7way2obj", file: !5, line: 16, size: 32, align: 16, elements: !92, identifier: "_ZTSN7way2obj11waymapcelltE")
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTSN7way2obj11waymapcelltE", file: !5, line: 18, baseType: !19, size: 16, align: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTSN7way2obj11waymapcelltE", file: !5, line: 19, baseType: !19, size: 16, align: 16, offset: 16)
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "flexarray<pointt>", file: !96, line: 9, size: 128, align: 64, elements: !97, templateParams: !132, identifier: "_ZTS9flexarrayI6pointtE")
!96 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Arrays.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !{!98, !99, !100, !101, !107, !110, !113, !114, !117, !120, !123, !126, !130, !131}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 13, baseType: !73, size: 64, align: 64, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "elemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 15, baseType: !25, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "maxelemqu", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 16, baseType: !25, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!101 = !DISubprogram(name: "isinclude", linkageName: "_ZN9flexarrayI6pointtE9isincludeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 19, type: !102, isLocal: false, isDefinition: false, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!102 = !DISubroutineType(types: !103)
!103 = !{!44, !104, !105}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9flexarrayI6pointtE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!105 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS6pointt")
!107 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 21, type: !108, isLocal: false, isDefinition: false, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !104, !105}
!110 = !DISubprogram(name: "add", linkageName: "_ZN9flexarrayI6pointtE3addEv", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 22, type: !111, isLocal: false, isDefinition: false, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!111 = !DISubroutineType(types: !112)
!112 = !{!73, !104}
!113 = !DISubprogram(name: "remove", linkageName: "_ZN9flexarrayI6pointtE6removeERKS0_", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 23, type: !108, isLocal: false, isDefinition: false, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!114 = !DISubprogram(name: "iselemqu", linkageName: "_ZN9flexarrayI6pointtE8iselemquEib", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 25, type: !115, isLocal: false, isDefinition: false, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !104, !25, !44}
!117 = !DISubprogram(name: "enlarge", linkageName: "_ZN9flexarrayI6pointtE7enlargeEi", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 27, type: !118, isLocal: false, isDefinition: false, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !104, !25}
!120 = !DISubprogram(name: "doubling", linkageName: "_ZN9flexarrayI6pointtE8doublingEb", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 29, type: !121, isLocal: false, isDefinition: false, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !104, !44}
!123 = !DISubprogram(name: "clear", linkageName: "_ZN9flexarrayI6pointtE5clearEv", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 31, type: !124, isLocal: false, isDefinition: false, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !104}
!126 = !DISubprogram(name: "operator[]", linkageName: "_ZN9flexarrayI6pointtEixEi", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 33, type: !127, isLocal: false, isDefinition: false, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !104, !25}
!129 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS6pointt")
!130 = !DISubprogram(name: "create", linkageName: "_ZN9flexarrayI6pointtE6createEi", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 38, type: !118, isLocal: false, isDefinition: false, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!131 = !DISubprogram(name: "destroy", linkageName: "_ZN9flexarrayI6pointtE7destroyEv", scope: !"_ZTS9flexarrayI6pointtE", file: !96, line: 39, type: !124, isLocal: false, isDefinition: false, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!132 = !{!133}
!133 = !DITemplateTypeParameter(name: "eobj", type: !"_ZTS6pointt")
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointt", file: !9, line: 93, size: 64, align: 32, elements: !135, identifier: "_ZTS6pointt")
!135 = !{!136, !137, !138, !142}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS6pointt", file: !9, line: 95, baseType: !25, size: 32, align: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS6pointt", file: !9, line: 95, baseType: !25, size: 32, align: 32, offset: 32)
!138 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !9, line: 97, type: !139, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6pointt", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!142 = !DISubprogram(name: "pointt", scope: !"_ZTS6pointt", file: !9, line: 98, type: !143, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !141, !25, !25}
!145 = !{!146, !152, !158, !172, !176, !182, !202, !213, !219, !225, !228, !232, !237, !242, !247, !252, !257, !263, !270, !275, !279, !282, !286}
!146 = !DISubprogram(name: "isaddtobound", linkageName: "_ZN7way2obj12isaddtoboundEii", scope: !"_ZTS7way2obj", file: !1, line: 20, type: !58, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: i1 (%class.way2obj*, i32, i32)* @_ZN7way2obj12isaddtoboundEii, declaration: !57, variables: !147)
!147 = !{!148, !150, !151}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !146, type: !149, flags: DIFlagArtificial | DIFlagObjectPointer)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS7way2obj", size: 64, align: 64)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !146, file: !1, line: 20, type: !25)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !146, file: !1, line: 20, type: !25)
!152 = !DISubprogram(name: "addtobound", linkageName: "_ZN7way2obj10addtoboundEii", scope: !"_ZTS7way2obj", file: !1, line: 28, type: !61, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: void (%class.way2obj*, i32, i32)* @_ZN7way2obj10addtoboundEii, declaration: !60, variables: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !152, type: !149, flags: DIFlagArtificial | DIFlagObjectPointer)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !152, file: !1, line: 28, type: !25)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !152, file: !1, line: 28, type: !25)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "boundnum", scope: !152, file: !1, line: 30, type: !25)
!158 = !DISubprogram(name: "releasepoint", linkageName: "_ZN7way2obj12releasepointEii", scope: !"_ZTS7way2obj", file: !1, line: 37, type: !61, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, function: void (%class.way2obj*, i32, i32)* @_ZN7way2obj12releasepointEii, declaration: !63, variables: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !158, type: !149, flags: DIFlagArtificial | DIFlagObjectPointer)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "px", arg: 2, scope: !158, file: !1, line: 37, type: !25)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "py", arg: 3, scope: !158, file: !1, line: 37, type: !25)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !158, file: !1, line: 39, type: !25)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !158, file: !1, line: 39, type: !25)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x1", scope: !158, file: !1, line: 40, type: !25)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y1", scope: !158, file: !1, line: 40, type: !25)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x2", scope: !158, file: !1, line: 40, type: !25)
