; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way_.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.wayobj = type <{ i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, float, float, %struct.createwaymnginfot, %struct.createwayinfot, [4 x i8], i16*, %struct.waymapcellt*, i32*, i32*, i32, i32, i8, [3 x i8], i32, i16, i16, [4 x i8] }>
%struct.createwaymnginfot = type { float, float, float, float, i32, i32, float, float }
%struct.createwayinfot = type <{ %class.rvectort, %class.rvectort, i8, [3 x i8] }>
%class.rvectort = type { float, float, float }
%struct.waymapcellt = type { i16, i16 }

; Function Attrs: nounwind optsize readonly ssp uwtable
define zeroext i1 @_ZN6wayobj5ismapEii(%class.wayobj* nocapture readonly %this, i32 %x, i32 %y) #0 align 2 {
  tail call void @llvm.dbg.value(metadata %class.wayobj* %this, i64 0, metadata !267, metadata !383), !dbg !384
  tail call void @llvm.dbg.value(metadata i32 %x, i64 0, metadata !269, metadata !383), !dbg !385
  tail call void @llvm.dbg.value(metadata i32 %y, i64 0, metadata !270, metadata !383), !dbg !386
  %1 = icmp slt i32 %x, 1, !dbg !387
  %2 = icmp slt i32 %y, 1, !dbg !389
  %or.cond = or i1 %1, %2, !dbg !391
  br i1 %or.cond, label %10, label %3, !dbg !391

; <label>:3                                       ; preds = %0
  %4 = getelementptr inbounds %class.wayobj* %this, i64 0, i32 5, !dbg !392

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !264, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way_.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !157, !167, !172, !236, !237, !241, !249, !257, !22, !8}
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "wayobj", file: !5, line: 35, size: 1408, align: 64, elements: !6, identifier: "_ZTS6wayobj")
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Way_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !13, !14, !15, !16, !17, !18, !19, !20, !21, !24, !25, !26, !27, !28, !29, !30, !37, !40, !43, !44, !45, !46, !48, !49, !50, !55, !59, !60, !63, !64, !67, !70, !74, !77, !80, !83, !84, !87, !90, !94, !101, !102, !103, !109, !112, !115, !116, !120, !121, !124, !129, !134, !137, !138, !141, !142, !145, !151, !152, !155, !156}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "mapxshift", scope: !"_ZTS6wayobj", file: !5, line: 37, baseType: !8, size: 32, align: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !9, line: 28, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "/usr/include/sys/_types/_int32_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "mapyshift", scope: !"_ZTS6wayobj", file: !5, line: 37, baseType: !8, size: 32, align: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !"_ZTS6wayobj", file: !5, line: 38, baseType: !8, size: 32, align: 32, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx", scope: !"_ZTS6wayobj", file: !5, line: 39, baseType: !8, size: 32, align: 32, offset: 96)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy", scope: !"_ZTS6wayobj", file: !5, line: 39, baseType: !8, size: 32, align: 32, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxx1", scope: !"_ZTS6wayobj", file: !5, line: 40, baseType: !8, size: 32, align: 32, offset: 160)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mapmaxy1", scope: !"_ZTS6wayobj", file: !5, line: 40, baseType: !8, size: 32, align: 32, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "maplx", scope: !"_ZTS6wayobj", file: !5, line: 41, baseType: !8, size: 32, align: 32, offset: 224)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "maply", scope: !"_ZTS6wayobj", file: !5, line: 41, baseType: !8, size: 32, align: 32, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "xcoef1", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 288)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "rnumt", file: !9, line: 57, baseType: !23)
!23 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "xcoef2", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ycoef1", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 352)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ycoef2", scope: !"_ZTS6wayobj", file: !5, line: 42, baseType: !22, size: 32, align: 32, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cellr", scope: !"_ZTS6wayobj", file: !5, line: 43, baseType: !22, size: 32, align: 32, offset: 416)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !"_ZTS6wayobj", file: !5, line: 44, baseType: !"_ZTS17createwaymnginfot", size: 256, align: 32, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "createwayinfo", scope: !"_ZTS6wayobj", file: !5, line: 45, baseType: !"_ZTS14createwayinfot", size: 224, align: 32, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "maparp", scope: !"_ZTS6wayobj", file: !5, line: 46, baseType: !31, size: 64, align: 64, offset: 960)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "i16pt", file: !9, line: 49, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "i16", file: !9, line: 27, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !35, line: 30, baseType: !36)
!35 = !DIFile(filename: "/usr/include/sys/_types/_int16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "waymap", scope: !"_ZTS6wayobj", file: !5, line: 47, baseType: !38, size: 64, align: 64, offset: 1024)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "waymapcellpt", file: !5, line: 22, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS11waymapcellt", size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bound1p", scope: !"_ZTS6wayobj", file: !5, line: 48, baseType: !41, size: 64, align: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32pt", file: !9, line: 50, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bound2p", scope: !"_ZTS6wayobj", file: !5, line: 48, baseType: !41, size: 64, align: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "maxboundlength", scope: !"_ZTS6wayobj", file: !5, line: 49, baseType: !8, size: 32, align: 32, offset: 1216)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "indexxmask", scope: !"_ZTS6wayobj", file: !5, line: 50, baseType: !8, size: 32, align: 32, offset: 1248)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flend", scope: !"_ZTS6wayobj", file: !5, line: 51, baseType: !47, size: 8, align: 8, offset: 1280)
!47 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "endindex", scope: !"_ZTS6wayobj", file: !5, line: 52, baseType: !8, size: 32, align: 32, offset: 1312)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !"_ZTS6wayobj", file: !5, line: 53, baseType: !33, size: 16, align: 16, offset: 1344)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS6wayobj", file: !5, line: 54, baseType: !51, size: 16, align: 16, offset: 1360)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "w16", file: !9, line: 22, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !53, line: 31, baseType: !54)
!53 = !DIFile(filename: "/usr/include/_types/_uint16_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!55 = !DISubprogram(name: "getx", linkageName: "_ZN6wayobj4getxEf", scope: !"_ZTS6wayobj", file: !5, line: 56, type: !56, isLocal: false, isDefinition: false, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true)
!56 = !DISubroutineType(types: !57)
!57 = !{!8, !58, !22}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6wayobj", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!59 = !DISubprogram(name: "gety", linkageName: "_ZN6wayobj4getyEf", scope: !"_ZTS6wayobj", file: !5, line: 57, type: !56, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true)
!60 = !DISubprogram(name: "getxcoord", linkageName: "_ZN6wayobj9getxcoordEi", scope: !"_ZTS6wayobj", file: !5, line: 58, type: !61, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true)
!61 = !DISubroutineType(types: !62)
!62 = !{!22, !58, !8}
!63 = !DISubprogram(name: "getycoord", linkageName: "_ZN6wayobj9getycoordEi", scope: !"_ZTS6wayobj", file: !5, line: 59, type: !61, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!64 = !DISubprogram(name: "ismap", linkageName: "_ZN6wayobj5ismapEii", scope: !"_ZTS6wayobj", file: !5, line: 61, type: !65, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true)
!65 = !DISubroutineType(types: !66)
!66 = !{!47, !58, !8, !8}
!67 = !DISubprogram(name: "getpoint", linkageName: "_ZN6wayobj8getpointEi", scope: !"_ZTS6wayobj", file: !5, line: 62, type: !68, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true)
!68 = !DISubroutineType(types: !69)
!69 = !{!"_ZTS8rvectort", !58, !8}
!70 = !DISubprogram(name: "map", linkageName: "_ZN6wayobj3mapEii", scope: !"_ZTS6wayobj", file: !5, line: 64, type: !71, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !58, !8, !8}
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !33)
!74 = !DISubprogram(name: "map", linkageName: "_ZN6wayobj3mapEss", scope: !"_ZTS6wayobj", file: !5, line: 65, type: !75, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true)
!75 = !DISubroutineType(types: !76)
!76 = !{!73, !58, !33, !33}
!77 = !DISubprogram(name: "index", linkageName: "_ZN6wayobj5indexEii", scope: !"_ZTS6wayobj", file: !5, line: 67, type: !78, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true)
!78 = !DISubroutineType(types: !79)
!79 = !{!8, !58, !8, !8}
!80 = !DISubprogram(name: "indexx", linkageName: "_ZN6wayobj6indexxEi", scope: !"_ZTS6wayobj", file: !5, line: 68, type: !81, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!81 = !DISubroutineType(types: !82)
!82 = !{!8, !58, !8}
!83 = !DISubprogram(name: "indexy", linkageName: "_ZN6wayobj6indexyEi", scope: !"_ZTS6wayobj", file: !5, line: 69, type: !81, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true)
!84 = !DISubprogram(name: "makebound2", linkageName: "_ZN6wayobj10makebound2EPiiS0_", scope: !"_ZTS6wayobj", file: !5, line: 71, type: !85, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true)
!85 = !DISubroutineType(types: !86)
!86 = !{!8, !58, !41, !8, !41}
!87 = !DISubprogram(name: "fill", linkageName: "_ZN6wayobj4fillEiiii", scope: !"_ZTS6wayobj", file: !5, line: 72, type: !88, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true)
!88 = !DISubroutineType(types: !89)
!89 = !{!47, !58, !8, !8, !8, !8}
!90 = !DISubprogram(name: "createwayar", linkageName: "_ZN6wayobj11createwayarEiiR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 73, type: !91, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true)
!91 = !DISubroutineType(types: !92)
!92 = !{!47, !58, !8, !8, !93}
!93 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS8wayinfot")
!94 = !DISubprogram(name: "createwayar", linkageName: "_ZN6wayobj11createwayarEiiRP8point16tRi", scope: !"_ZTS6wayobj", file: !5, line: 74, type: !95, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true)
!95 = !DISubroutineType(types: !96)
!96 = !{!47, !58, !8, !8, !97, !100}
!97 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "point16pt", file: !5, line: 15, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8point16t", size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!101 = !DISubprogram(name: "createwayar2", linkageName: "_ZN6wayobj12createwayar2EiiR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 75, type: !91, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true)
!102 = !DISubprogram(name: "makeobstaclebound2", linkageName: "_ZN6wayobj18makeobstaclebound2EPiiS0_", scope: !"_ZTS6wayobj", file: !5, line: 77, type: !85, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true)
!103 = !DISubprogram(name: "findfreepoints", linkageName: "_ZN6wayobj14findfreepointsE8rvectortiRi", scope: !"_ZTS6wayobj", file: !5, line: 81, type: !104, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !58, !"_ZTS8rvectort", !8, !100}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "levelplacept", file: !107, line: 12, baseType: !108)
!107 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/473.astar/src/WayTypes_.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS11levelplacet", size: 64, align: 64)
!109 = !DISubprogram(name: "findverticalline", linkageName: "_ZN6wayobj16findverticallineEiiRiS0_", scope: !"_ZTS6wayobj", file: !5, line: 82, type: !110, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubroutineType(types: !111)
!111 = !{!47, !58, !8, !8, !100, !100}
!112 = !DISubprogram(name: "ismoveable", linkageName: "_ZN6wayobj10ismoveableEff", scope: !"_ZTS6wayobj", file: !5, line: 84, type: !113, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!113 = !DISubroutineType(types: !114)
!114 = !{!47, !58, !22, !22}
!115 = !DISubprogram(name: "findfreepoint", linkageName: "_ZN6wayobj13findfreepointEiiRiS0_", scope: !"_ZTS6wayobj", file: !5, line: 86, type: !110, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!116 = !DISubprogram(name: "findfreepoint", linkageName: "_ZN6wayobj13findfreepointEffRfS0_", scope: !"_ZTS6wayobj", file: !5, line: 87, type: !117, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubroutineType(types: !118)
!118 = !{!47, !58, !22, !22, !119, !119}
!119 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !22)
!120 = !DISubprogram(name: "wayexist", linkageName: "_ZN6wayobj8wayexistEiiii", scope: !"_ZTS6wayobj", file: !5, line: 88, type: !88, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!121 = !DISubprogram(name: "createway", linkageName: "_ZN6wayobj9createwayEiiiiRP8point16tRi", scope: !"_ZTS6wayobj", file: !5, line: 89, type: !122, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!122 = !DISubroutineType(types: !123)
!123 = !{!47, !58, !8, !8, !8, !8, !97, !100}
!124 = !DISubprogram(name: "createway", linkageName: "_ZN6wayobj9createwayERK8rvectortS2_bR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 90, type: !125, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!125 = !DISubroutineType(types: !126)
!126 = !{!47, !58, !127, !127, !47, !93}
!127 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS8rvectort")
!129 = !DISubprogram(name: "createway", linkageName: "_ZN6wayobj9createwayERK14createwayinfotR8wayinfot", scope: !"_ZTS6wayobj", file: !5, line: 91, type: !130, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{!47, !58, !132, !93}
!132 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS14createwayinfot")
!134 = !DISubprogram(name: "addsphere", linkageName: "_ZN6wayobj9addsphereERK8rvectortf", scope: !"_ZTS6wayobj", file: !5, line: 93, type: !135, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !58, !127, !22}
!137 = !DISubprogram(name: "removesphere", linkageName: "_ZN6wayobj12removesphereERK8rvectortf", scope: !"_ZTS6wayobj", file: !5, line: 94, type: !135, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubprogram(name: "addpoint", linkageName: "_ZN6wayobj8addpointEii", scope: !"_ZTS6wayobj", file: !5, line: 95, type: !139, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !58, !8, !8}
!141 = !DISubprogram(name: "removepoint", linkageName: "_ZN6wayobj11removepointEii", scope: !"_ZTS6wayobj", file: !5, line: 96, type: !139, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubprogram(name: "clear", linkageName: "_ZN6wayobj5clearEv", scope: !"_ZTS6wayobj", file: !5, line: 97, type: !143, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !58}
!145 = !DISubprogram(name: "loadmap", linkageName: "_ZN6wayobj7loadmapEPKc", scope: !"_ZTS6wayobj", file: !5, line: 99, type: !146, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubroutineType(types: !147)
!147 = !{!47, !58, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!151 = !DISubprogram(name: "initmap", linkageName: "_ZN6wayobj7initmapEii", scope: !"_ZTS6wayobj", file: !5, line: 100, type: !65, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!152 = !DISubprogram(name: "create", linkageName: "_ZN6wayobj6createE17createwaymnginfot", scope: !"_ZTS6wayobj", file: !5, line: 102, type: !153, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !58, !"_ZTS17createwaymnginfot"}
!155 = !DISubprogram(name: "create", linkageName: "_ZN6wayobj6createEv", scope: !"_ZTS6wayobj", file: !5, line: 103, type: !143, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!156 = !DISubprogram(name: "destroy", linkageName: "_ZN6wayobj7destroyEv", scope: !"_ZTS6wayobj", file: !5, line: 104, type: !143, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "createwaymnginfot", file: !5, line: 25, size: 256, align: 32, elements: !158, identifier: "_ZTS17createwaymnginfot")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "minx", scope: !"_ZTS17createwaymnginfot", file: !5, line: 27, baseType: !22, size: 32, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "maxx", scope: !"_ZTS17createwaymnginfot", file: !5, line: 27, baseType: !22, size: 32, align: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "miny", scope: !"_ZTS17createwaymnginfot", file: !5, line: 28, baseType: !22, size: 32, align: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "maxy", scope: !"_ZTS17createwaymnginfot", file: !5, line: 28, baseType: !22, size: 32, align: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "xshift", scope: !"_ZTS17createwaymnginfot", file: !5, line: 29, baseType: !8, size: 32, align: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "yshift", scope: !"_ZTS17createwaymnginfot", file: !5, line: 30, baseType: !8, size: 32, align: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "height1", scope: !"_ZTS17createwaymnginfot", file: !5, line: 31, baseType: !22, size: 32, align: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "height2", scope: !"_ZTS17createwaymnginfot", file: !5, line: 31, baseType: !22, size: 32, align: 32, offset: 224)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "createwayinfot", file: !107, line: 15, size: 224, align: 32, elements: !168, identifier: "_ZTS14createwayinfot")
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !"_ZTS14createwayinfot", file: !107, line: 17, baseType: !"_ZTS8rvectort", size: 96, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "finishp", scope: !"_ZTS14createwayinfot", file: !107, line: 18, baseType: !"_ZTS8rvectort", size: 96, align: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flcorrect", scope: !"_ZTS14createwayinfot", file: !107, line: 19, baseType: !47, size: 8, align: 8, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_class_type, name: "rvectort", file: !9, line: 105, size: 96, align: 32, elements: !173, identifier: "_ZTS8rvectort")
!173 = !{!174, !175, !176, !177, !181, !182, !186, !190, !191, !195, !198, !201, !204, !208, !211, !212, !213, !214, !215, !216, !217, !218, !223, !228, !232, !233}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS8rvectort", file: !9, line: 109, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS8rvectort", file: !9, line: 109, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !"_ZTS8rvectort", file: !9, line: 109, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!177 = !DISubprogram(name: "norm", linkageName: "_ZNK8rvectort4normEv", scope: !"_ZTS8rvectort", file: !9, line: 110, type: !178, isLocal: false, isDefinition: false, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{!22, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!181 = !DISubprogram(name: "norm2", linkageName: "_ZNK8rvectort5norm2Ev", scope: !"_ZTS8rvectort", file: !9, line: 111, type: !178, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubprogram(name: "normalize", linkageName: "_ZN8rvectort9normalizeEv", scope: !"_ZTS8rvectort", file: !9, line: 112, type: !183, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{!22, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8rvectort", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!186 = !DISubprogram(name: "ortbasis", linkageName: "_ZNK8rvectort8ortbasisERS_S0_", scope: !"_ZTS8rvectort", file: !9, line: 114, type: !187, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !180, !189, !189}
!189 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS8rvectort")
!190 = !DISubprogram(name: "ortbasisz", linkageName: "_ZNK8rvectort9ortbasiszERS_S0_", scope: !"_ZTS8rvectort", file: !9, line: 115, type: !187, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!191 = !DISubprogram(name: "rotmatrix", linkageName: "_ZNK8rvectort9rotmatrixER6rmatrt", scope: !"_ZTS8rvectort", file: !9, line: 117, type: !192, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !180, !194}
!194 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS6rmatrt")
!195 = !DISubprogram(name: "rotmatrix", linkageName: "_ZNK8rvectort9rotmatrixER6rmatrtf", scope: !"_ZTS8rvectort", file: !9, line: 118, type: !196, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !180, !194, !22}
!198 = !DISubprogram(name: "definerandom", linkageName: "_ZN8rvectort12definerandomEv", scope: !"_ZTS8rvectort", file: !9, line: 120, type: !199, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !185}
!201 = !DISubprogram(name: "randomvariation", linkageName: "_ZN8rvectort15randomvariationEf", scope: !"_ZTS8rvectort", file: !9, line: 121, type: !202, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !185, !22}
!204 = !DISubprogram(name: "operator()", linkageName: "_ZN8rvectortclEi", scope: !"_ZTS8rvectort", file: !9, line: 139, type: !205, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubroutineType(types: !206)
!206 = !{!119, !185, !207}
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!208 = !DISubprogram(name: "r", linkageName: "_ZN8rvectort1rEv", scope: !"_ZTS8rvectort", file: !9, line: 141, type: !209, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubroutineType(types: !210)
!210 = !{!119, !185}
!211 = !DISubprogram(name: "g", linkageName: "_ZN8rvectort1gEv", scope: !"_ZTS8rvectort", file: !9, line: 142, type: !209, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubprogram(name: "b", linkageName: "_ZN8rvectort1bEv", scope: !"_ZTS8rvectort", file: !9, line: 143, type: !209, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubprogram(name: "r", linkageName: "_ZNK8rvectort1rEv", scope: !"_ZTS8rvectort", file: !9, line: 144, type: !178, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubprogram(name: "g", linkageName: "_ZNK8rvectort1gEv", scope: !"_ZTS8rvectort", file: !9, line: 145, type: !178, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubprogram(name: "b", linkageName: "_ZNK8rvectort1bEv", scope: !"_ZTS8rvectort", file: !9, line: 146, type: !178, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubprogram(name: "bright", linkageName: "_ZN8rvectort6brightEv", scope: !"_ZTS8rvectort", file: !9, line: 148, type: !183, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!217 = !DISubprogram(name: "set0", linkageName: "_ZN8rvectort4set0Ev", scope: !"_ZTS8rvectort", file: !9, line: 150, type: !199, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubprogram(name: "operator=", linkageName: "_ZN8rvectortaSEPKf", scope: !"_ZTS8rvectort", file: !9, line: 152, type: !219, isLocal: false, isDefinition: false, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !185, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!223 = !DISubprogram(name: "operator const float *", linkageName: "_ZNK8rvectortcvPKfEv", scope: !"_ZTS8rvectort", file: !9, line: 155, type: !224, isLocal: false, isDefinition: false, scopeLine: 155, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !180}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!228 = !DISubprogram(name: "operator float *", linkageName: "_ZN8rvectortcvPfEv", scope: !"_ZTS8rvectort", file: !9, line: 156, type: !229, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !185}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!232 = !DISubprogram(name: "rvectort", scope: !"_ZTS8rvectort", file: !9, line: 158, type: !199, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubprogram(name: "rvectort", scope: !"_ZTS8rvectort", file: !9, line: 159, type: !234, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !185, !22, !22, !22}
!236 = !DICompositeType(tag: DW_TAG_class_type, name: "rmatrt", file: !9, line: 103, flags: DIFlagFwdDecl, identifier: "_ZTS6rmatrt")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "waymapcellt", file: !5, line: 17, size: 32, align: 16, elements: !238, identifier: "_ZTS11waymapcellt")
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fillnum", scope: !"_ZTS11waymapcellt", file: !5, line: 19, baseType: !51, size: 16, align: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !"_ZTS11waymapcellt", file: !5, line: 20, baseType: !51, size: 16, align: 16, offset: 16)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "wayinfot", file: !107, line: 22, size: 192, align: 64, elements: !242, identifier: "_ZTS8wayinfot")
!242 = !{!243, !244, !247, !248}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flexist", scope: !"_ZTS8wayinfot", file: !107, line: 24, baseType: !47, size: 8, align: 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wayarp", scope: !"_ZTS8wayinfot", file: !107, line: 25, baseType: !245, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvectorpt", file: !9, line: 161, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8rvectort", size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wayarsize", scope: !"_ZTS8wayinfot", file: !107, line: 26, baseType: !8, size: 32, align: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flcorrect", scope: !"_ZTS8wayinfot", file: !107, line: 27, baseType: !47, size: 8, align: 8, offset: 160)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "point16t", file: !5, line: 10, size: 32, align: 16, elements: !250, identifier: "_ZTS8point16t")
!250 = !{!251, !252, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS8point16t", file: !5, line: 12, baseType: !33, size: 16, align: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS8point16t", file: !5, line: 12, baseType: !33, size: 16, align: 16, offset: 16)
!253 = !DISubprogram(name: "point16t", scope: !"_ZTS8point16t", file: !5, line: 13, type: !254, isLocal: false, isDefinition: false, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !256, !33, !33}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8point16t", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "levelplacet", file: !107, line: 6, size: 128, align: 32, elements: !258, identifier: "_ZTS11levelplacet")
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTS11levelplacet", file: !107, line: 8, baseType: !33, size: 16, align: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTS11levelplacet", file: !107, line: 8, baseType: !33, size: 16, align: 16, offset: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !"_ZTS11levelplacet", file: !107, line: 9, baseType: !22, size: 32, align: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !"_ZTS11levelplacet", file: !107, line: 9, baseType: !22, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "hiding", scope: !"_ZTS11levelplacet", file: !107, line: 10, baseType: !22, size: 32, align: 32, offset: 96)
!264 = !{!265, !271, !278, !285, !297, !306, !318, !327, !339, !343, !347, !352, !355, !358, !363, !367, !371, !375}
!265 = !DISubprogram(name: "ismap", linkageName: "_ZN6wayobj5ismapEii", scope: !"_ZTS6wayobj", file: !1, line: 7, type: !65, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: true, function: i1 (%class.wayobj*, i32, i32)* @_ZN6wayobj5ismapEii, declaration: !64, variables: !266)
!266 = !{!267, !269, !270}
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !265, type: !268, flags: DIFlagArtificial | DIFlagObjectPointer)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS6wayobj", size: 64, align: 64)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !265, file: !1, line: 7, type: !8)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !265, file: !1, line: 7, type: !8)
!271 = !DISubprogram(name: "ismoveable", linkageName: "_ZN6wayobj10ismoveableEff", scope: !"_ZTS6wayobj", file: !1, line: 16, type: !113, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, function: i1 (%class.wayobj*, float, float)* @_ZN6wayobj10ismoveableEff, declaration: !112, variables: !272)
!272 = !{!273, !274, !275, !276, !277}
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !271, type: !268, flags: DIFlagArtificial | DIFlagObjectPointer)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !271, file: !1, line: 16, type: !22)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !271, file: !1, line: 16, type: !22)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapx", scope: !271, file: !1, line: 18, type: !8)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapy", scope: !271, file: !1, line: 18, type: !8)
!278 = !DISubprogram(name: "getpoint", linkageName: "_ZN6wayobj8getpointEi", scope: !"_ZTS6wayobj", file: !1, line: 30, type: !68, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: { <2 x float>, float } (%class.wayobj*, i32)* @_ZN6wayobj8getpointEi, declaration: !67, variables: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !278, type: !268, flags: DIFlagArtificial | DIFlagObjectPointer)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !278, file: !1, line: 30, type: !8)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !278, file: !1, line: 32, type: !"_ZTS8rvectort")
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !278, file: !1, line: 33, type: !8)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !278, file: !1, line: 33, type: !8)
!285 = !DISubprogram(name: "makebound2", linkageName: "_ZN6wayobj10makebound2EPiiS0_", scope: !"_ZTS6wayobj", file: !1, line: 45, type: !85, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%class.wayobj*, i32*, i32, i32*)* @_ZN6wayobj10makebound2EPiiS0_, declaration: !84, variables: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !285, type: !268, flags: DIFlagArtificial | DIFlagObjectPointer)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bound1p", arg: 2, scope: !285, file: !1, line: 45, type: !41)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bound1l", arg: 3, scope: !285, file: !1, line: 45, type: !8)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bound2p", arg: 4, scope: !285, file: !1, line: 45, type: !41)
