; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/A2_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [45 x i8] c"\0A error in A2_readFromFile(%p,%s)\0A bad input\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [55 x i8] c"\0A error in A2_readFromFile(%s)\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [97 x i8] c"\0A error in A2_readFromFile(%s)\0A bad A2 file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str5 = private unnamed_addr constant [54 x i8] c"\0A error in A2_readFromFormattedFile(%p,%p)\0A bad input\00", align 1
@.str6 = private unnamed_addr constant [60 x i8] c"\0A error in A2_readFromFormattedFile()\0A %d items of %d read\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !170, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/A2_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !{!8, !93, !105, !112, !121, !128, !133, !142, !146}
!8 = !DISubprogram(name: "A2_readFromFile", scope: !1, file: !1, line: 23, type: !9, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._A2*, i8*)* @A2_readFromFile, variables: !26)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !12, !5}
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !14, line: 49, baseType: !15)
!14 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/../A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !14, line: 41, size: 256, align: 64, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !14, line: 42, baseType: !11, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !15, file: !14, line: 43, baseType: !11, size: 32, align: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !15, file: !14, line: 44, baseType: !11, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !15, file: !14, line: 45, baseType: !11, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !15, file: !14, line: 46, baseType: !11, size: 32, align: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !15, file: !14, line: 47, baseType: !11, size: 32, align: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !15, file: !14, line: 48, baseType: !24, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!26 = !{!27, !28, !29, !90, !91, !92}
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !8, file: !1, line: 24, type: !12)
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !8, file: !1, line: 25, type: !5)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !8, file: !1, line: 27, type: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 153, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !32, line: 122, size: 1216, align: 64, elements: !34)
!34 = !{!35, !38, !39, !40, !42, !43, !48, !49, !50, !54, !58, !68, !74, !75, !78, !79, !83, !87, !88, !89}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !33, file: !32, line: 123, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !33, file: !32, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !33, file: !32, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !33, file: !32, line: 126, baseType: !41, size: 16, align: 16, offset: 128)
!41 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !33, file: !32, line: 127, baseType: !41, size: 16, align: 16, offset: 144)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !33, file: !32, line: 128, baseType: !44, size: 128, align: 64, offset: 192)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !32, line: 88, size: 128, align: 64, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !44, file: !32, line: 89, baseType: !36, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !44, file: !32, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !33, file: !32, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !33, file: !32, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !33, file: !32, line: 133, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!11, !4}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !33, file: !32, line: 134, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!11, !4, !5, !11}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !33, file: !32, line: 135, baseType: !59, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !4, !62, !11}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !32, line: 77, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !64, line: 71, baseType: !65)
!64 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !33, file: !32, line: 136, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!11, !4, !72, !11}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !33, file: !32, line: 139, baseType: !44, size: 128, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !33, file: !32, line: 140, baseType: !76, size: 64, align: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !32, line: 94, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !33, file: !32, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !33, file: !32, line: 144, baseType: !80, size: 24, align: 8, offset: 928)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !33, file: !32, line: 145, baseType: !84, size: 8, align: 8, offset: 952)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !33, file: !32, line: 148, baseType: !44, size: 128, align: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !33, file: !32, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !33, file: !32, line: 152, baseType: !62, size: 64, align: 64, offset: 1152)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !8, file: !1, line: 28, type: !11)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !8, file: !1, line: 28, type: !11)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !8, file: !1, line: 28, type: !11)
!93 = !DISubprogram(name: "A2_readFromFormattedFile", scope: !1, file: !1, line: 90, type: !94, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._A2*, %struct.__sFILE*)* @A2_readFromFormattedFile, variables: !96)
!94 = !DISubroutineType(types: !95)
!95 = !{!11, !12, !30}
!96 = !{!97, !98, !99, !100, !101}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !93, file: !1, line: 91, type: !12)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !93, file: !1, line: 92, type: !30)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !93, file: !1, line: 94, type: !11)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !93, file: !1, line: 94, type: !11)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !93, file: !1, line: 95, type: !102)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, align: 32, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 5)
!105 = !DISubprogram(name: "A2_readFromBinaryFile", scope: !1, file: !1, line: 162, type: !94, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._A2*, %struct.__sFILE*)* @A2_readFromBinaryFile, variables: !106)
!106 = !{!107, !108, !109, !110, !111}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !105, file: !1, line: 163, type: !12)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !105, file: !1, line: 164, type: !30)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !105, file: !1, line: 166, type: !11)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !105, file: !1, line: 166, type: !11)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !105, file: !1, line: 167, type: !102)
!112 = !DISubprogram(name: "A2_writeToFile", scope: !1, file: !1, line: 244, type: !113, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, i8*)* @A2_writeToFile, variables: !115)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !12, !5}
!115 = !{!116, !117, !118, !119, !120}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !112, file: !1, line: 245, type: !12)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !112, file: !1, line: 246, type: !5)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !112, file: !1, line: 248, type: !30)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !112, file: !1, line: 249, type: !11)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !112, file: !1, line: 249, type: !11)
!121 = !DISubprogram(name: "A2_writeToFormattedFile", scope: !1, file: !1, line: 312, type: !122, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct.__sFILE*)* @A2_writeToFormattedFile, variables: !124)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !12, !30}
!124 = !{!125, !126, !127}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !121, file: !1, line: 313, type: !12)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !121, file: !1, line: 314, type: !30)
