; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/A2_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }
%struct._DV = type { i32, i32, i32, double* }
%struct._ZV = type { i32, i32, i32, double* }
%struct._Drand = type { double, double, double, double, double, double, double, double, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [43 x i8] c"\0A fatal error in A2_sizeOf(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [86 x i8] c"\0A fatal error in A2_sizeOf(%p)\0A bad type %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1
@.str2 = private unnamed_addr constant [52 x i8] c"\0A fatal error in A2_shiftbase(%p,%d,%d)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [95 x i8] c"\0A fatal error in A2_shiftBase(%p,%d,%d)\0A bad type %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1
@.str4 = private unnamed_addr constant [45 x i8] c"\0A fatal error in A2_rowMajor(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/A2_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !27, !34, !37, !40, !47, !59, !69, !79, !89, !111, !133, !144, !155, !166, !177, !188, !199, !229, !244, !254, !265, !307, !327, !339}
!6 = !DISubprogram(name: "A2_sizeOf", scope: !1, file: !1, line: 15, type: !7, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._A2*)* @A2_sizeOf, variables: !24)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !12, line: 49, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/../A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !12, line: 41, size: 256, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 42, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !13, file: !12, line: 43, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !13, file: !12, line: 44, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !13, file: !12, line: 45, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !13, file: !12, line: 46, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !13, file: !12, line: 47, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 48, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!24 = !{!25, !26}
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !6, file: !1, line: 16, type: !10)
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !6, file: !1, line: 18, type: !9)
!27 = !DISubprogram(name: "A2_shiftBase", scope: !1, file: !1, line: 53, type: !28, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, i32, i32)* @A2_shiftBase, variables: !30)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !10, !9, !9}
!30 = !{!31, !32, !33}
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !27, file: !1, line: 54, type: !10)
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowoff", arg: 2, scope: !27, file: !1, line: 55, type: !9)
!33 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coloff", arg: 3, scope: !27, file: !1, line: 56, type: !9)
!34 = !DISubprogram(name: "A2_rowMajor", scope: !1, file: !1, line: 92, type: !7, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._A2*)* @A2_rowMajor, variables: !35)
!35 = !{!36}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !34, file: !1, line: 93, type: !10)
!37 = !DISubprogram(name: "A2_columnMajor", scope: !1, file: !1, line: 126, type: !7, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._A2*)* @A2_columnMajor, variables: !38)
!38 = !{!39}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !37, file: !1, line: 127, type: !10)
!40 = !DISubprogram(name: "A2_transpose", scope: !1, file: !1, line: 160, type: !41, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*)* @A2_transpose, variables: !43)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !10}
!43 = !{!44, !45, !46}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !40, file: !1, line: 161, type: !10)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !40, file: !1, line: 163, type: !9)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !40, file: !1, line: 163, type: !9)
!47 = !DISubprogram(name: "A2_extractRow", scope: !1, file: !1, line: 198, type: !48, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, double*, i32)* @A2_extractRow, variables: !50)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !10, !22, !9}
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !47, file: !1, line: 199, type: !10)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "row", arg: 2, scope: !47, file: !1, line: 200, type: !22)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 3, scope: !47, file: !1, line: 201, type: !9)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !47, file: !1, line: 203, type: !22)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !47, file: !1, line: 204, type: !9)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !47, file: !1, line: 204, type: !9)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !47, file: !1, line: 204, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !47, file: !1, line: 204, type: !9)
!59 = !DISubprogram(name: "A2_extractColumn", scope: !1, file: !1, line: 247, type: !48, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, double*, i32)* @A2_extractColumn, variables: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68}
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !59, file: !1, line: 248, type: !10)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col", arg: 2, scope: !59, file: !1, line: 249, type: !22)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jcol", arg: 3, scope: !59, file: !1, line: 250, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !59, file: !1, line: 252, type: !22)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !59, file: !1, line: 253, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !59, file: !1, line: 253, type: !9)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !59, file: !1, line: 253, type: !9)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !59, file: !1, line: 253, type: !9)
!69 = !DISubprogram(name: "A2_setRow", scope: !1, file: !1, line: 296, type: !48, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, double*, i32)* @A2_setRow, variables: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !69, file: !1, line: 297, type: !10)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "row", arg: 2, scope: !69, file: !1, line: 298, type: !22)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 3, scope: !69, file: !1, line: 299, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !69, file: !1, line: 301, type: !22)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !69, file: !1, line: 302, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !69, file: !1, line: 302, type: !9)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !69, file: !1, line: 302, type: !9)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !69, file: !1, line: 302, type: !9)
!79 = !DISubprogram(name: "A2_setColumn", scope: !1, file: !1, line: 344, type: !48, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, double*, i32)* @A2_setColumn, variables: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !79, file: !1, line: 345, type: !10)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col", arg: 2, scope: !79, file: !1, line: 346, type: !22)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jcol", arg: 3, scope: !79, file: !1, line: 347, type: !9)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !79, file: !1, line: 349, type: !22)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !79, file: !1, line: 350, type: !9)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !79, file: !1, line: 350, type: !9)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !79, file: !1, line: 350, type: !9)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !79, file: !1, line: 350, type: !9)
!89 = !DISubprogram(name: "A2_extractRowDV", scope: !1, file: !1, line: 392, type: !90, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._DV*, i32)* @A2_extractRowDV, variables: !101)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !10, !92, !9}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !94, line: 20, baseType: !95)
!94 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !94, line: 21, size: 192, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !94, line: 22, baseType: !9, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !95, file: !94, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !95, file: !94, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !95, file: !94, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !89, file: !1, line: 393, type: !10)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowDV", arg: 2, scope: !89, file: !1, line: 394, type: !92)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 3, scope: !89, file: !1, line: 395, type: !9)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !89, file: !1, line: 397, type: !22)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !89, file: !1, line: 397, type: !22)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !89, file: !1, line: 398, type: !9)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !89, file: !1, line: 398, type: !9)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !89, file: !1, line: 398, type: !9)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !89, file: !1, line: 398, type: !9)
!111 = !DISubprogram(name: "A2_extractRowZV", scope: !1, file: !1, line: 437, type: !112, isLocal: false, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._ZV*, i32)* @A2_extractRowZV, variables: !123)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !10, !114, !9}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZV", file: !116, line: 20, baseType: !117)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/../../ZV/ZV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ZV", file: !116, line: 21, size: 192, align: 64, elements: !118)
!118 = !{!119, !120, !121, !122}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !117, file: !116, line: 22, baseType: !9, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !117, file: !116, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !117, file: !116, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !117, file: !116, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !111, file: !1, line: 438, type: !10)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowZV", arg: 2, scope: !111, file: !1, line: 439, type: !114)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 3, scope: !111, file: !1, line: 440, type: !9)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !111, file: !1, line: 442, type: !22)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !111, file: !1, line: 442, type: !22)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !111, file: !1, line: 443, type: !9)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !111, file: !1, line: 443, type: !9)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !111, file: !1, line: 443, type: !9)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !111, file: !1, line: 443, type: !9)
!133 = !DISubprogram(name: "A2_extractColumnDV", scope: !1, file: !1, line: 483, type: !90, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._DV*, i32)* @A2_extractColumnDV, variables: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !133, file: !1, line: 484, type: !10)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colDV", arg: 2, scope: !133, file: !1, line: 485, type: !92)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jcol", arg: 3, scope: !133, file: !1, line: 486, type: !9)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !133, file: !1, line: 488, type: !22)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !133, file: !1, line: 488, type: !22)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !133, file: !1, line: 489, type: !9)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !133, file: !1, line: 489, type: !9)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !133, file: !1, line: 489, type: !9)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !133, file: !1, line: 489, type: !9)
!144 = !DISubprogram(name: "A2_extractColumnZV", scope: !1, file: !1, line: 528, type: !112, isLocal: false, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._ZV*, i32)* @A2_extractColumnZV, variables: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !144, file: !1, line: 529, type: !10)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colZV", arg: 2, scope: !144, file: !1, line: 530, type: !114)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jcol", arg: 3, scope: !144, file: !1, line: 531, type: !9)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !144, file: !1, line: 533, type: !22)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !144, file: !1, line: 533, type: !22)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !144, file: !1, line: 534, type: !9)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !144, file: !1, line: 534, type: !9)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !144, file: !1, line: 534, type: !9)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !144, file: !1, line: 534, type: !9)
!155 = !DISubprogram(name: "A2_setRowDV", scope: !1, file: !1, line: 574, type: !90, isLocal: false, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._DV*, i32)* @A2_setRowDV, variables: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !155, file: !1, line: 575, type: !10)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowDV", arg: 2, scope: !155, file: !1, line: 576, type: !92)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 3, scope: !155, file: !1, line: 577, type: !9)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !155, file: !1, line: 579, type: !22)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !155, file: !1, line: 579, type: !22)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !155, file: !1, line: 580, type: !9)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !155, file: !1, line: 580, type: !9)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !155, file: !1, line: 580, type: !9)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !155, file: !1, line: 580, type: !9)
!166 = !DISubprogram(name: "A2_setRowZV", scope: !1, file: !1, line: 616, type: !112, isLocal: false, isDefinition: true, scopeLine: 620, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._ZV*, i32)* @A2_setRowZV, variables: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !166, file: !1, line: 617, type: !10)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowZV", arg: 2, scope: !166, file: !1, line: 618, type: !114)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 3, scope: !166, file: !1, line: 619, type: !9)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !166, file: !1, line: 621, type: !22)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !166, file: !1, line: 621, type: !22)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !166, file: !1, line: 622, type: !9)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !166, file: !1, line: 622, type: !9)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !166, file: !1, line: 622, type: !9)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !166, file: !1, line: 622, type: !9)
!177 = !DISubprogram(name: "A2_setColumnDV", scope: !1, file: !1, line: 659, type: !90, isLocal: false, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._DV*, i32)* @A2_setColumnDV, variables: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !177, file: !1, line: 660, type: !10)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colDV", arg: 2, scope: !177, file: !1, line: 661, type: !92)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jcol", arg: 3, scope: !177, file: !1, line: 662, type: !9)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !177, file: !1, line: 664, type: !22)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !177, file: !1, line: 664, type: !22)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !177, file: !1, line: 665, type: !9)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !177, file: !1, line: 665, type: !9)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !177, file: !1, line: 665, type: !9)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !177, file: !1, line: 665, type: !9)
!188 = !DISubprogram(name: "A2_setColumnZV", scope: !1, file: !1, line: 701, type: !112, isLocal: false, isDefinition: true, scopeLine: 705, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, %struct._ZV*, i32)* @A2_setColumnZV, variables: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !188, file: !1, line: 702, type: !10)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colZV", arg: 2, scope: !188, file: !1, line: 703, type: !114)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jcol", arg: 3, scope: !188, file: !1, line: 704, type: !9)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !188, file: !1, line: 706, type: !22)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !188, file: !1, line: 706, type: !22)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !188, file: !1, line: 707, type: !9)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !188, file: !1, line: 707, type: !9)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !188, file: !1, line: 707, type: !9)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !188, file: !1, line: 707, type: !9)
!199 = !DISubprogram(name: "A2_fillRandomUniform", scope: !1, file: !1, line: 744, type: !200, isLocal: false, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, double, double, i32)* @A2_fillRandomUniform, variables: !202)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !10, !23, !23, !9}
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215}
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !199, file: !1, line: 745, type: !10)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 2, scope: !199, file: !1, line: 746, type: !23)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 3, scope: !199, file: !1, line: 747, type: !23)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 4, scope: !199, file: !1, line: 748, type: !9)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !199, file: !1, line: 750, type: !22)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !199, file: !1, line: 751, type: !9)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !199, file: !1, line: 751, type: !9)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !199, file: !1, line: 751, type: !9)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !199, file: !1, line: 751, type: !9)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !199, file: !1, line: 751, type: !9)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !199, file: !1, line: 751, type: !9)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !199, file: !1, line: 751, type: !9)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "drand", scope: !199, file: !1, line: 752, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drand", file: !217, line: 27, baseType: !218)
!217 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/A2/src/../../Drand/Drand.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Drand", file: !217, line: 17, size: 576, align: 64, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !218, file: !217, line: 18, baseType: !23, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !218, file: !217, line: 19, baseType: !23, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "base1", scope: !218, file: !217, line: 20, baseType: !23, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !218, file: !217, line: 21, baseType: !23, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !218, file: !217, line: 22, baseType: !23, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !218, file: !217, line: 23, baseType: !23, size: 64, align: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !218, file: !217, line: 24, baseType: !23, size: 64, align: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !218, file: !217, line: 25, baseType: !23, size: 64, align: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !218, file: !217, line: 26, baseType: !9, size: 32, align: 32, offset: 512)
!229 = !DISubprogram(name: "A2_fillRandomNormal", scope: !1, file: !1, line: 807, type: !200, isLocal: false, isDefinition: true, scopeLine: 812, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*, double, double, i32)* @A2_fillRandomNormal, variables: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !229, file: !1, line: 808, type: !10)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mean", arg: 2, scope: !229, file: !1, line: 809, type: !23)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "variance", arg: 3, scope: !229, file: !1, line: 810, type: !23)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 4, scope: !229, file: !1, line: 811, type: !9)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !229, file: !1, line: 813, type: !22)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !229, file: !1, line: 814, type: !9)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !229, file: !1, line: 814, type: !9)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !229, file: !1, line: 814, type: !9)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !229, file: !1, line: 814, type: !9)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !229, file: !1, line: 814, type: !9)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !229, file: !1, line: 814, type: !9)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !229, file: !1, line: 814, type: !9)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "drand", scope: !229, file: !1, line: 815, type: !216)
!244 = !DISubprogram(name: "A2_fillWithIdentity", scope: !1, file: !1, line: 870, type: !41, isLocal: false, isDefinition: true, scopeLine: 872, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*)* @A2_fillWithIdentity, variables: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !244, file: !1, line: 871, type: !10)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !244, file: !1, line: 873, type: !22)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !244, file: !1, line: 874, type: !9)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc", scope: !244, file: !1, line: 874, type: !9)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !244, file: !1, line: 874, type: !9)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !244, file: !1, line: 874, type: !9)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !244, file: !1, line: 874, type: !9)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !244, file: !1, line: 874, type: !9)
!254 = !DISubprogram(name: "A2_zero", scope: !1, file: !1, line: 917, type: !41, isLocal: false, isDefinition: true, scopeLine: 919, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._A2*)* @A2_zero, variables: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264}
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !254, file: !1, line: 918, type: !10)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !254, file: !1, line: 920, type: !22)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !254, file: !1, line: 921, type: !9)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !254, file: !1, line: 921, type: !9)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !254, file: !1, line: 921, type: !9)
