; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/BKL_evalfcn.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._BKL = type { %struct._BPG*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32*, [3 x i32], i32*, float }
%struct._BPG = type { i32, i32, %struct._Graph* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [45 x i8] c"\0A fatal error in BKL_evalfcn(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [58 x i8] c"\0A fatal error in BKL_evalGain(%p,%d,%p,%p,%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define float @BKL_evalfcn(%struct._BKL* %bkl) #0 {
  tail call void @llvm.dbg.value(metadata %struct._BKL* %bkl, i64 0, metadata !79, metadata !116), !dbg !117
  %1 = icmp eq %struct._BKL* %bkl, null, !dbg !118
  br i1 %1, label %2, label %5, !dbg !120


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/BKL_evalfcn.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !{!7, !83, !94}
!7 = !DISubprogram(name: "BKL_evalfcn", scope: !1, file: !1, line: 16, type: !8, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct._BKL*)* @BKL_evalfcn, variables: !78)
!8 = !DISubroutineType(types: !9)
!9 = !{!5, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "BKL", file: !12, line: 45, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../BKL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BKL", file: !12, line: 46, size: 704, align: 64, elements: !14)
!14 = !{!15, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !76, !77}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "bpg", scope: !13, file: !12, line: 47, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPG", file: !18, line: 21, baseType: !19)
!18 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../BPG/BPG.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BPG", file: !18, line: 22, size: 128, align: 64, elements: !20)
!20 = !{!21, !23, !24}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nX", scope: !19, file: !18, line: 23, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "nY", scope: !19, file: !18, line: 24, baseType: !22, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !19, file: !18, line: 25, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !27, line: 49, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !27, line: 50, size: 384, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !60, !61}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !27, line: 51, baseType: !22, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !28, file: !27, line: 52, baseType: !22, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !28, file: !27, line: 53, baseType: !22, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !28, file: !27, line: 54, baseType: !22, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !28, file: !27, line: 55, baseType: !22, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !28, file: !27, line: 56, baseType: !22, size: 32, align: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !28, file: !27, line: 57, baseType: !37, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !39, line: 55, baseType: !40)
!39 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !39, line: 79, size: 384, align: 64, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !48, !50, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 80, baseType: !22, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !40, file: !39, line: 81, baseType: !22, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !40, file: !39, line: 82, baseType: !22, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !40, file: !39, line: 83, baseType: !22, size: 32, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !40, file: !39, line: 84, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !40, file: !39, line: 85, baseType: !49, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !40, file: !39, line: 86, baseType: !22, size: 32, align: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !40, file: !39, line: 87, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !39, line: 56, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !39, line: 102, size: 192, align: 64, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !39, line: 103, baseType: !22, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !54, file: !39, line: 104, baseType: !22, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !54, file: !39, line: 105, baseType: !47, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !39, line: 106, baseType: !52, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !28, file: !27, line: 58, baseType: !47, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !28, file: !27, line: 59, baseType: !37, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ndom", scope: !13, file: !12, line: 48, baseType: !22, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nseg", scope: !13, file: !12, line: 49, baseType: !22, size: 32, align: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "nreg", scope: !13, file: !12, line: 50, baseType: !22, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !13, file: !12, line: 51, baseType: !22, size: 32, align: 32, offset: 160)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "npass", scope: !13, file: !12, line: 52, baseType: !22, size: 32, align: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "npatch", scope: !13, file: !12, line: 53, baseType: !22, size: 32, align: 32, offset: 224)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nflips", scope: !13, file: !12, line: 54, baseType: !22, size: 32, align: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nimprove", scope: !13, file: !12, line: 55, baseType: !22, size: 32, align: 32, offset: 288)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ngaineval", scope: !13, file: !12, line: 56, baseType: !22, size: 32, align: 32, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !13, file: !12, line: 57, baseType: !47, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cweights", scope: !13, file: !12, line: 58, baseType: !73, size: 96, align: 32, offset: 448)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, align: 32, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "regwghts", scope: !13, file: !12, line: 59, baseType: !47, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !13, file: !12, line: 60, baseType: !5, size: 32, align: 32, offset: 640)
!78 = !{!79, !80, !81, !82}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !7, file: !1, line: 17, type: !10)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !7, file: !1, line: 19, type: !5)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wmax", scope: !7, file: !1, line: 20, type: !22)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wmin", scope: !7, file: !1, line: 20, type: !22)
!83 = !DISubprogram(name: "BKL_eval", scope: !1, file: !1, line: 54, type: !84, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct._BKL*, i32, i32, i32)* @BKL_eval, variables: !86)
!84 = !DISubroutineType(types: !85)
!85 = !{!5, !10, !22, !22, !22}
!86 = !{!87, !88, !89, !90, !91, !92, !93}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !83, file: !1, line: 55, type: !10)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Sweight", arg: 2, scope: !83, file: !1, line: 56, type: !22)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Bweight", arg: 3, scope: !83, file: !1, line: 57, type: !22)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Wweight", arg: 4, scope: !83, file: !1, line: 58, type: !22)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !83, file: !1, line: 60, type: !5)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wmax", scope: !83, file: !1, line: 61, type: !22)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wmin", scope: !83, file: !1, line: 61, type: !22)
!94 = !DISubprogram(name: "BKL_evalgain", scope: !1, file: !1, line: 95, type: !95, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._BKL*, i32, i32*, i32*, i32*)* @BKL_evalgain, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !10, !22, !47, !47, !47}
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !94, file: !1, line: 96, type: !10)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dom", arg: 2, scope: !94, file: !1, line: 97, type: !22)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdeltaS", arg: 3, scope: !94, file: !1, line: 98, type: !47)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdeltaB", arg: 4, scope: !94, file: !1, line: 99, type: !47)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdeltaW", arg: 5, scope: !94, file: !1, line: 100, type: !47)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !94, file: !1, line: 102, type: !22)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newc", scope: !94, file: !1, line: 102, type: !22)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldc", scope: !94, file: !1, line: 102, type: !22)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seg", scope: !94, file: !1, line: 102, type: !22)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !94, file: !1, line: 102, type: !22)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !94, file: !1, line: 103, type: !47)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colors", scope: !94, file: !1, line: 103, type: !47)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "regwghts", scope: !94, file: !1, line: 103, type: !47)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stats", scope: !94, file: !1, line: 104, type: !73)
!112 = !{i32 2, !"Dwarf Version", i32 2}
!113 = !{i32 2, !"Debug Info Version", i32 700000003}
!114 = !{i32 1, !"PIC Level", i32 2}
!115 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!116 = !DIExpression()
!117 = !DILocation(line: 17, column: 11, scope: !7)
