; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/BKL_fidmat.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._cell = type { i32, i32, i32, i32, %struct._cell*, %struct._cell* }
%struct._BKL = type { %struct._BPG*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32*, [3 x i32], i32*, float }
%struct._BPG = type { i32, i32, %struct._Graph* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [44 x i8] c"\0A fatal error in BKL_fidmat(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str2 = private unnamed_addr constant [87 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/BKL_fidmat.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !20, globals: !128, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/BKL_fidmat.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !17, !18}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cell", file: !1, line: 15, size: 256, align: 64, elements: !7)
!7 = !{!8, !10, !11, !12, !13, !16}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "domid", scope: !6, file: !1, line: 16, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "deltaS", scope: !6, file: !1, line: 17, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "deltaB", scope: !6, file: !1, line: 18, baseType: !9, size: 32, align: 32, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "deltaW", scope: !6, file: !1, line: 19, baseType: !9, size: 32, align: 32, offset: 96)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !6, file: !1, line: 20, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cell", file: !1, line: 14, baseType: !6)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !6, file: !1, line: 21, baseType: !14, size: 64, align: 64, offset: 192)
!17 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !{!21, !108}
!21 = !DISubprogram(name: "BKL_fidmat", scope: !1, file: !1, line: 47, type: !22, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct._BKL*)* @BKL_fidmat, variables: !92)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !25}
!24 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "BKL", file: !27, line: 45, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../BKL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BKL", file: !27, line: 46, size: 704, align: 64, elements: !29)
!29 = !{!30, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !90, !91}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "bpg", scope: !28, file: !27, line: 47, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPG", file: !33, line: 21, baseType: !34)
!33 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../BPG/BPG.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BPG", file: !33, line: 22, size: 128, align: 64, elements: !35)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nX", scope: !34, file: !33, line: 23, baseType: !9, size: 32, align: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nY", scope: !34, file: !33, line: 24, baseType: !9, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !34, file: !33, line: 25, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !41, line: 49, baseType: !42)
!41 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !41, line: 50, size: 384, align: 64, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !74, !75}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !41, line: 51, baseType: !9, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !42, file: !41, line: 52, baseType: !9, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !42, file: !41, line: 53, baseType: !9, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !42, file: !41, line: 54, baseType: !9, size: 32, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !42, file: !41, line: 55, baseType: !9, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !42, file: !41, line: 56, baseType: !9, size: 32, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !42, file: !41, line: 57, baseType: !51, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !53, line: 55, baseType: !54)
!53 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !53, line: 79, size: 384, align: 64, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !62, !64, !65}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !53, line: 80, baseType: !9, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !54, file: !53, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !54, file: !53, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !54, file: !53, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !54, file: !53, line: 84, baseType: !61, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !54, file: !53, line: 85, baseType: !63, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !54, file: !53, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !54, file: !53, line: 87, baseType: !66, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !53, line: 56, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !53, line: 102, size: 192, align: 64, elements: !69)
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !53, line: 103, baseType: !9, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !68, file: !53, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !68, file: !53, line: 105, baseType: !61, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !53, line: 106, baseType: !66, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !42, file: !41, line: 58, baseType: !61, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !42, file: !41, line: 59, baseType: !51, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ndom", scope: !28, file: !27, line: 48, baseType: !9, size: 32, align: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nseg", scope: !28, file: !27, line: 49, baseType: !9, size: 32, align: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nreg", scope: !28, file: !27, line: 50, baseType: !9, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !28, file: !27, line: 51, baseType: !9, size: 32, align: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "npass", scope: !28, file: !27, line: 52, baseType: !9, size: 32, align: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "npatch", scope: !28, file: !27, line: 53, baseType: !9, size: 32, align: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nflips", scope: !28, file: !27, line: 54, baseType: !9, size: 32, align: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nimprove", scope: !28, file: !27, line: 55, baseType: !9, size: 32, align: 32, offset: 288)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ngaineval", scope: !28, file: !27, line: 56, baseType: !9, size: 32, align: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !28, file: !27, line: 57, baseType: !61, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cweights", scope: !28, file: !27, line: 58, baseType: !87, size: 96, align: 32, offset: 448)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 96, align: 32, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 3)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "regwghts", scope: !28, file: !27, line: 59, baseType: !61, size: 64, align: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !28, file: !27, line: 60, baseType: !24, size: 32, align: 32, offset: 640)
!92 = !{!93, !94, !95, !96, !99, !100, !101, !103, !104, !105, !106, !107}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !21, file: !1, line: 48, type: !25)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !21, file: !1, line: 50, type: !24)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !21, file: !1, line: 51, type: !9)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mdom", scope: !97, file: !1, line: 73, type: !9)
!97 = distinct !DILexicalBlock(scope: !98, file: !1, line: 72, column: 46)
!98 = distinct !DILexicalBlock(scope: !21, file: !1, line: 72, column: 6)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domids", scope: !97, file: !1, line: 73, type: !61)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tcolors", scope: !97, file: !1, line: 73, type: !61)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cell", scope: !102, file: !1, line: 88, type: !14)
!102 = distinct !DILexicalBlock(scope: !98, file: !1, line: 87, column: 8)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cells", scope: !102, file: !1, line: 88, type: !14)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bestcost", scope: !102, file: !1, line: 89, type: !24)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DomByDom", scope: !102, file: !1, line: 90, type: !39)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idom", scope: !102, file: !1, line: 91, type: !9)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tags", scope: !102, file: !1, line: 92, type: !61)
!108 = !DISubprogram(name: "BKL_fidmatPass", scope: !1, file: !1, line: 176, type: !109, isLocal: true, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct._BKL*, %struct._cell*, i32*, %struct._Graph*, i32)* @BKL_fidmatPass, variables: !111)
!109 = !DISubroutineType(types: !110)
!110 = !{!24, !25, !14, !61, !39, !9}
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !108, file: !1, line: 177, type: !25)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cells", arg: 2, scope: !108, file: !1, line: 178, type: !14)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tags", arg: 3, scope: !108, file: !1, line: 179, type: !61)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DomByDom", arg: 4, scope: !108, file: !1, line: 180, type: !39)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npass", arg: 5, scope: !108, file: !1, line: 181, type: !9)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cell", scope: !108, file: !1, line: 183, type: !14)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bestcost", scope: !108, file: !1, line: 184, type: !24)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bettercost", scope: !108, file: !1, line: 184, type: !24)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !108, file: !1, line: 184, type: !24)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dom", scope: !108, file: !1, line: 185, type: !9)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dom2", scope: !108, file: !1, line: 185, type: !9)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !108, file: !1, line: 185, type: !9)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !108, file: !1, line: 185, type: !9)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !108, file: !1, line: 185, type: !9)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cweights", scope: !108, file: !1, line: 186, type: !61)
