; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/BKL_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._BKL = type { %struct._BPG*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32*, [3 x i32], i32*, float }
%struct._BPG = type { i32, i32, %struct._Graph* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._Drand = type { double, double, double, double, double, double, double, double, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [56 x i8] c"\0A fatal error in BKL_setRandomColors(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [54 x i8] c"\0A fatal error in BKL_setColorsWeights(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [65 x i8] c"\0A fatal error in BKL_setColorWeights(%p)\0A region %d has color %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/BKL_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !100, !108, !119, !133, !140, !174}
!6 = !DISubprogram(name: "BKL_setRandomColors", scope: !1, file: !1, line: 18, type: !7, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._BKL*, i32)* @BKL_setRandomColors, variables: !78)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !21}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "BKL", file: !11, line: 45, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../BKL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BKL", file: !11, line: 46, size: 704, align: 64, elements: !13)
!13 = !{!14, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !75, !76}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "bpg", scope: !12, file: !11, line: 47, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPG", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../BPG/BPG.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BPG", file: !17, line: 22, size: 128, align: 64, elements: !19)
!19 = !{!20, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "nX", scope: !18, file: !17, line: 23, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "nY", scope: !18, file: !17, line: 24, baseType: !21, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !18, file: !17, line: 25, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !26, line: 49, baseType: !27)
!26 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !26, line: 50, size: 384, align: 64, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !59, !60}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !26, line: 51, baseType: !21, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !27, file: !26, line: 52, baseType: !21, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !27, file: !26, line: 53, baseType: !21, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !27, file: !26, line: 54, baseType: !21, size: 32, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !27, file: !26, line: 55, baseType: !21, size: 32, align: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !27, file: !26, line: 56, baseType: !21, size: 32, align: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !27, file: !26, line: 57, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !38, line: 55, baseType: !39)
!38 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !38, line: 79, size: 384, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44, !45, !47, !49, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !38, line: 80, baseType: !21, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !39, file: !38, line: 81, baseType: !21, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !39, file: !38, line: 82, baseType: !21, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !39, file: !38, line: 83, baseType: !21, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !39, file: !38, line: 84, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !39, file: !38, line: 85, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !39, file: !38, line: 86, baseType: !21, size: 32, align: 32, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !39, file: !38, line: 87, baseType: !51, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !38, line: 56, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !38, line: 102, size: 192, align: 64, elements: !54)
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !53, file: !38, line: 103, baseType: !21, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !53, file: !38, line: 104, baseType: !21, size: 32, align: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !53, file: !38, line: 105, baseType: !46, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !38, line: 106, baseType: !51, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !27, file: !26, line: 58, baseType: !46, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !27, file: !26, line: 59, baseType: !36, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ndom", scope: !12, file: !11, line: 48, baseType: !21, size: 32, align: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nseg", scope: !12, file: !11, line: 49, baseType: !21, size: 32, align: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nreg", scope: !12, file: !11, line: 50, baseType: !21, size: 32, align: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !12, file: !11, line: 51, baseType: !21, size: 32, align: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "npass", scope: !12, file: !11, line: 52, baseType: !21, size: 32, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "npatch", scope: !12, file: !11, line: 53, baseType: !21, size: 32, align: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nflips", scope: !12, file: !11, line: 54, baseType: !21, size: 32, align: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nimprove", scope: !12, file: !11, line: 55, baseType: !21, size: 32, align: 32, offset: 288)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ngaineval", scope: !12, file: !11, line: 56, baseType: !21, size: 32, align: 32, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !12, file: !11, line: 57, baseType: !46, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cweights", scope: !12, file: !11, line: 58, baseType: !72, size: 96, align: 32, offset: 448)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 96, align: 32, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "regwghts", scope: !12, file: !11, line: 59, baseType: !46, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !12, file: !11, line: 60, baseType: !77, size: 32, align: 32, offset: 640)
!77 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!78 = !{!79, !80, !81, !82, !83, !84, !85}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !6, file: !1, line: 19, type: !9)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 2, scope: !6, file: !1, line: 20, type: !21)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ireg", scope: !6, file: !1, line: 22, type: !21)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !6, file: !1, line: 22, type: !21)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nreg", scope: !6, file: !1, line: 22, type: !21)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colors", scope: !6, file: !1, line: 23, type: !46)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "drand", scope: !6, file: !1, line: 24, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drand", file: !87, line: 27, baseType: !88)
!87 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BKL/src/../../Drand/Drand.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Drand", file: !87, line: 17, size: 576, align: 64, elements: !89)
!89 = !{!90, !92, !93, !94, !95, !96, !97, !98, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !88, file: !87, line: 18, baseType: !91, size: 64, align: 64)
!91 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !88, file: !87, line: 19, baseType: !91, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "base1", scope: !88, file: !87, line: 20, baseType: !91, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !88, file: !87, line: 21, baseType: !91, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !88, file: !87, line: 22, baseType: !91, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !88, file: !87, line: 23, baseType: !91, size: 64, align: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !88, file: !87, line: 24, baseType: !91, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !88, file: !87, line: 25, baseType: !91, size: 64, align: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !88, file: !87, line: 26, baseType: !21, size: 32, align: 32, offset: 512)
!100 = !DISubprogram(name: "BKL_setColorWeights", scope: !1, file: !1, line: 78, type: !101, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._BKL*)* @BKL_setColorWeights, variables: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !9}
!103 = !{!104, !105, !106, !107}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !100, file: !1, line: 79, type: !9)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !100, file: !1, line: 81, type: !21)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ireg", scope: !100, file: !1, line: 81, type: !21)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colors", scope: !100, file: !1, line: 82, type: !46)
!108 = !DISubprogram(name: "BKL_segColor", scope: !1, file: !1, line: 134, type: !109, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BKL*, i32)* @BKL_segColor, variables: !111)
!109 = !DISubroutineType(types: !110)
!110 = !{!21, !9, !21}
!111 = !{!112, !113, !114, !115, !116, !117, !118}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !108, file: !1, line: 135, type: !9)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iseg", arg: 2, scope: !108, file: !1, line: 136, type: !21)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !108, file: !1, line: 138, type: !21)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !108, file: !1, line: 138, type: !21)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !108, file: !1, line: 138, type: !21)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !108, file: !1, line: 139, type: !46)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colors", scope: !108, file: !1, line: 139, type: !46)
!119 = !DISubprogram(name: "BKL_flipDomain", scope: !1, file: !1, line: 181, type: !7, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._BKL*, i32)* @BKL_flipDomain, variables: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bkl", arg: 1, scope: !119, file: !1, line: 182, type: !9)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idom", arg: 2, scope: !119, file: !1, line: 183, type: !21)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !119, file: !1, line: 185, type: !21)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iseg", scope: !119, file: !1, line: 185, type: !21)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newcolor", scope: !119, file: !1, line: 185, type: !21)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldcolor", scope: !119, file: !1, line: 185, type: !21)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !119, file: !1, line: 185, type: !21)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wdom", scope: !119, file: !1, line: 185, type: !21)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wseg", scope: !119, file: !1, line: 185, type: !21)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !119, file: !1, line: 186, type: !46)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colors", scope: !119, file: !1, line: 186, type: !46)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "regwghts", scope: !119, file: !1, line: 186, type: !46)
!133 = !DISubprogram(name: "BKL_greyCodeDomain", scope: !1, file: !1, line: 261, type: !109, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BKL*, i32)* @BKL_greyCodeDomain, variables: !134)
