; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._BPG = type { i32, i32, %struct._Graph* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [51 x i8] c"\0A fatal error in BPG_init(%p,%d,%d,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [69 x i8] c"\0A fatal error in BPG_initFromColoring(%p,%p,%p,%d,%d,%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [56 x i8] c"\0A fatal error in BPG_initFromColoring\0A nX = %d, nY = %d\00", align 1
@.str3 = private unnamed_addr constant [9 x i8] c"\0A colors\00", align 1
@.str4 = private unnamed_addr constant [8 x i8] c"\0A graph\00", align 1

; Function Attrs: nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !68}
!6 = !DISubprogram(name: "BPG_init", scope: !1, file: !1, line: 19, type: !7, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._BPG*, i32, i32, %struct._Graph*)* @BPG_init, variables: !55)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15, !15, !18}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPG", file: !11, line: 21, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../BPG.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BPG", file: !11, line: 22, size: 128, align: 64, elements: !13)
!13 = !{!14, !16, !17}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "nX", scope: !12, file: !11, line: 23, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nY", scope: !12, file: !11, line: 24, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !12, file: !11, line: 25, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !20, line: 49, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !20, line: 50, size: 384, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !53, !54}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !20, line: 51, baseType: !15, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !21, file: !20, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !21, file: !20, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !21, file: !20, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !21, file: !20, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !21, file: !20, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !21, file: !20, line: 57, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !32, line: 55, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !32, line: 79, size: 384, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !41, !43, !44}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !32, line: 80, baseType: !15, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !33, file: !32, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !33, file: !32, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !33, file: !32, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !33, file: !32, line: 84, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !33, file: !32, line: 85, baseType: !42, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !33, file: !32, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !33, file: !32, line: 87, baseType: !45, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !32, line: 56, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !32, line: 102, size: 192, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !47, file: !32, line: 103, baseType: !15, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !47, file: !32, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !47, file: !32, line: 105, baseType: !40, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !32, line: 106, baseType: !45, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !21, file: !20, line: 58, baseType: !40, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !21, file: !20, line: 59, baseType: !30, size: 64, align: 64, offset: 320)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !6, file: !1, line: 20, type: !9)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nX", arg: 2, scope: !6, file: !1, line: 21, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nY", arg: 3, scope: !6, file: !1, line: 22, type: !15)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "graph", arg: 4, scope: !6, file: !1, line: 23, type: !18)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !6, file: !1, line: 25, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 25, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !6, file: !1, line: 25, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !6, file: !1, line: 25, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !6, file: !1, line: 25, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !6, file: !1, line: 25, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !6, file: !1, line: 26, type: !40)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adjIVL", scope: !6, file: !1, line: 27, type: !30)
!68 = !DISubprogram(name: "BPG_initFromColoring", scope: !1, file: !1, line: 129, type: !69, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._BPG*, %struct._Graph*, i32*, i32, i32, i32*, i32*, i32*)* @BPG_initFromColoring, variables: !71)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !9, !18, !40, !15, !15, !40, !40, !40}
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !68, file: !1, line: 130, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "graph", arg: 2, scope: !68, file: !1, line: 131, type: !18)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colors", arg: 3, scope: !68, file: !1, line: 132, type: !40)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cX", arg: 4, scope: !68, file: !1, line: 133, type: !15)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cY", arg: 5, scope: !68, file: !1, line: 134, type: !15)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cmap", arg: 6, scope: !68, file: !1, line: 135, type: !40)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indX", arg: 7, scope: !68, file: !1, line: 136, type: !40)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indY", arg: 8, scope: !68, file: !1, line: 137, type: !40)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bpg_g", scope: !68, file: !1, line: 139, type: !18)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !68, file: !1, line: 140, type: !15)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !68, file: !1, line: 140, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !68, file: !1, line: 140, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iX", scope: !68, file: !1, line: 140, type: !15)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !68, file: !1, line: 140, type: !15)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msize", scope: !68, file: !1, line: 140, type: !15)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nV", scope: !68, file: !1, line: 140, type: !15)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nX", scope: !68, file: !1, line: 140, type: !15)
