; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._BPG = type { i32, i32, %struct._Graph* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [47 x i8] c"\0A error in BPG_readFromFile(%p,%s)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [59 x i8] c"\0A error in BPG_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [102 x i8] c"\0A error in BPG_readFromFile(%p,%s)\0A bad BPG file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !181, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !124, !138, !147, !155, !161, !170, !176}
!6 = !DISubprogram(name: "BPG_readFromFile", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BPG*, i8*)* @BPG_readFromFile, variables: !57)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !55}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPG", file: !12, line: 21, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../BPG.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BPG", file: !12, line: 22, size: 128, align: 64, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nX", scope: !13, file: !12, line: 23, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nY", scope: !13, file: !12, line: 24, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !13, file: !12, line: 25, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !20, line: 49, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !20, line: 50, size: 384, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !53, !54}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !20, line: 51, baseType: !9, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !21, file: !20, line: 52, baseType: !9, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !21, file: !20, line: 53, baseType: !9, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !21, file: !20, line: 54, baseType: !9, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !21, file: !20, line: 55, baseType: !9, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !21, file: !20, line: 56, baseType: !9, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !21, file: !20, line: 57, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !32, line: 55, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !32, line: 79, size: 384, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !41, !43, !44}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !32, line: 80, baseType: !9, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !33, file: !32, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !33, file: !32, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !33, file: !32, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !33, file: !32, line: 84, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !33, file: !32, line: 85, baseType: !42, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !33, file: !32, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !33, file: !32, line: 87, baseType: !45, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !32, line: 56, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !32, line: 102, size: 192, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !47, file: !32, line: 103, baseType: !9, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !47, file: !32, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !47, file: !32, line: 105, baseType: !40, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !32, line: 106, baseType: !45, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !21, file: !20, line: 58, baseType: !40, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !21, file: !20, line: 59, baseType: !30, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !{!58, !59, !60, !121, !122, !123}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !6, file: !1, line: 24, type: !10)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !6, file: !1, line: 25, type: !55)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !6, file: !1, line: 27, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 153, baseType: !64)
!63 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !63, line: 122, size: 1216, align: 64, elements: !65)
!65 = !{!66, !69, !70, !71, !73, !74, !79, !80, !81, !85, !89, !99, !105, !106, !109, !110, !114, !118, !119, !120}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !64, file: !63, line: 123, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !64, file: !63, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !64, file: !63, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !63, line: 126, baseType: !72, size: 16, align: 16, offset: 128)
!72 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !64, file: !63, line: 127, baseType: !72, size: 16, align: 16, offset: 144)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !64, file: !63, line: 128, baseType: !75, size: 128, align: 64, offset: 192)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !63, line: 88, size: 128, align: 64, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !75, file: !63, line: 89, baseType: !67, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !75, file: !63, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !64, file: !63, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !64, file: !63, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !64, file: !63, line: 133, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!9, !4}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !64, file: !63, line: 134, baseType: !86, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!9, !4, !55, !9}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !64, file: !63, line: 135, baseType: !90, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !4, !93, !9}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !63, line: 77, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !95, line: 71, baseType: !96)
!95 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!98 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !64, file: !63, line: 136, baseType: !100, size: 64, align: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!9, !4, !103, !9}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !64, file: !63, line: 139, baseType: !75, size: 128, align: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !64, file: !63, line: 140, baseType: !107, size: 64, align: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !63, line: 94, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !64, file: !63, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !64, file: !63, line: 144, baseType: !111, size: 24, align: 8, offset: 928)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 24, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 3)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !64, file: !63, line: 145, baseType: !115, size: 8, align: 8, offset: 952)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !64, file: !63, line: 148, baseType: !75, size: 128, align: 64, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !64, file: !63, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !63, line: 152, baseType: !93, size: 64, align: 64, offset: 1152)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !6, file: !1, line: 28, type: !9)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !6, file: !1, line: 28, type: !9)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !6, file: !1, line: 28, type: !9)
!124 = !DISubprogram(name: "BPG_readFromFormattedFile", scope: !1, file: !1, line: 92, type: !125, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BPG*, %struct.__sFILE*)* @BPG_readFromFormattedFile, variables: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{!9, !10, !61}
!127 = !{!128, !129, !130, !131, !132, !133, !134}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !124, file: !1, line: 93, type: !10)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !124, file: !1, line: 94, type: !61)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "graph", scope: !124, file: !1, line: 96, type: !18)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nX", scope: !124, file: !1, line: 97, type: !9)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nY", scope: !124, file: !1, line: 97, type: !9)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !124, file: !1, line: 97, type: !9)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !124, file: !1, line: 98, type: !135)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 64, align: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 2)
!138 = !DISubprogram(name: "BPG_readFromBinaryFile", scope: !1, file: !1, line: 162, type: !125, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BPG*, %struct.__sFILE*)* @BPG_readFromBinaryFile, variables: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !138, file: !1, line: 163, type: !10)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !138, file: !1, line: 164, type: !61)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "graph", scope: !138, file: !1, line: 166, type: !18)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nX", scope: !138, file: !1, line: 167, type: !9)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nY", scope: !138, file: !1, line: 167, type: !9)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !138, file: !1, line: 167, type: !9)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !138, file: !1, line: 168, type: !135)
!147 = !DISubprogram(name: "BPG_writeToFile", scope: !1, file: !1, line: 239, type: !7, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BPG*, i8*)* @BPG_writeToFile, variables: !148)
!148 = !{!149, !150, !151, !152, !153, !154}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !147, file: !1, line: 240, type: !10)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !147, file: !1, line: 241, type: !55)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !147, file: !1, line: 243, type: !61)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !147, file: !1, line: 244, type: !9)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !147, file: !1, line: 244, type: !9)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !147, file: !1, line: 244, type: !9)
