; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_makeGraphs.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._BPG = type { i32, i32, %struct._Graph* }

@__stdoutp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [51 x i8] c"\0A fatal error in BPG_makeGraphXbyX(%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define %struct._Graph* @BPG_makeGraphXbyX(%struct._BPG* %bpg) #0 {
  %xsize = alloca i32, align 4
  %ysize = alloca i32, align 4
  %xadj = alloca i32*, align 8
  %yadj = alloca i32*, align 8
  tail call void @llvm.dbg.value(metadata %struct._BPG* %bpg, i64 0, metadata !56, metadata !95), !dbg !96
  %1 = icmp eq %struct._BPG* %bpg, null, !dbg !97
  br i1 %1, label %2, label %5, !dbg !99

; <label>:2                                       ; preds = %0

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_makeGraphs.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !72}
!6 = !DISubprogram(name: "BPG_makeGraphXbyX", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Graph* (%struct._BPG*)* @BPG_makeGraphXbyX, variables: !55)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !47}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !11, line: 49, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !11, line: 50, size: 384, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !45, !46}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !12, file: !11, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !12, file: !11, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !12, file: !11, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !12, file: !11, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !12, file: !11, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !12, file: !11, line: 57, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !24, line: 79, size: 384, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !33, !35, !36}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !24, line: 80, baseType: !15, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !25, file: !24, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !25, file: !24, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !25, file: !24, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !25, file: !24, line: 84, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !25, file: !24, line: 85, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !25, file: !24, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !25, file: !24, line: 87, baseType: !37, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !24, line: 56, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !24, line: 102, size: 192, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !24, line: 103, baseType: !15, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !39, file: !24, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !39, file: !24, line: 105, baseType: !32, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !24, line: 106, baseType: !37, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !12, file: !11, line: 58, baseType: !32, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !12, file: !11, line: 59, baseType: !22, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPG", file: !49, line: 21, baseType: !50)
!49 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../BPG.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BPG", file: !49, line: 22, size: 128, align: 64, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nX", scope: !50, file: !49, line: 23, baseType: !15, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nY", scope: !50, file: !49, line: 24, baseType: !15, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !50, file: !49, line: 25, baseType: !9, size: 64, align: 64, offset: 64)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !6, file: !1, line: 18, type: !47)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "graph", scope: !6, file: !1, line: 20, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gXbyX", scope: !6, file: !1, line: 20, type: !9)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !6, file: !1, line: 21, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 21, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !6, file: !1, line: 21, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nX", scope: !6, file: !1, line: 21, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !6, file: !1, line: 21, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsize", scope: !6, file: !1, line: 21, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !6, file: !1, line: 21, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ysize", scope: !6, file: !1, line: 21, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !6, file: !1, line: 21, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !6, file: !1, line: 22, type: !32)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !6, file: !1, line: 22, type: !32)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xadj", scope: !6, file: !1, line: 22, type: !32)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yadj", scope: !6, file: !1, line: 22, type: !32)
!72 = !DISubprogram(name: "BPG_makeGraphYbyY", scope: !1, file: !1, line: 98, type: !7, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Graph* (%struct._BPG*)* @BPG_makeGraphYbyY, variables: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !72, file: !1, line: 99, type: !47)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "graph", scope: !72, file: !1, line: 101, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gYbyY", scope: !72, file: !1, line: 101, type: !9)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !72, file: !1, line: 102, type: !15)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !72, file: !1, line: 102, type: !15)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !72, file: !1, line: 102, type: !15)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nX", scope: !72, file: !1, line: 102, type: !15)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nY", scope: !72, file: !1, line: 102, type: !15)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !72, file: !1, line: 102, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsize", scope: !72, file: !1, line: 102, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !72, file: !1, line: 102, type: !15)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ysize", scope: !72, file: !1, line: 102, type: !15)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !72, file: !1, line: 102, type: !15)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !72, file: !1, line: 103, type: !32)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !72, file: !1, line: 103, type: !32)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xadj", scope: !72, file: !1, line: 103, type: !32)
