; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_pseudo.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._BPG = type { i32, i32, %struct._Graph* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [61 x i8] c"\0A fatal error in BPG_pseudoperipheralnode(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [67 x i8] c"\0A fatal error in BPG_levelStructure(%p,%d,%p,%p,%p,%d)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define i32 @BPG_pseudoperipheralnode(%struct._BPG* %bpg, i32 %seed) #0 {
  tail call void @llvm.dbg.value(metadata %struct._BPG* %bpg, i64 0, metadata !56, metadata !92), !dbg !93
  tail call void @llvm.dbg.value(metadata i32 %seed, i64 0, metadata !57, metadata !92), !dbg !94
  %1 = icmp eq %struct._BPG* %bpg, null, !dbg !95

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/BPG_pseudo.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !67}
!6 = !DISubprogram(name: "BPG_pseudoperipheralnode", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BPG*, i32)* @BPG_pseudoperipheralnode, variables: !55)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPG", file: !12, line: 21, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../BPG.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BPG", file: !12, line: 22, size: 128, align: 64, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nX", scope: !13, file: !12, line: 23, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nY", scope: !13, file: !12, line: 24, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !13, file: !12, line: 25, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !20, line: 49, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !20, line: 50, size: 384, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !53, !54}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !20, line: 51, baseType: !9, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !21, file: !20, line: 52, baseType: !9, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !21, file: !20, line: 53, baseType: !9, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !21, file: !20, line: 54, baseType: !9, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !21, file: !20, line: 55, baseType: !9, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !21, file: !20, line: 56, baseType: !9, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !21, file: !20, line: 57, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !32, line: 55, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/BPG/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !32, line: 79, size: 384, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !41, !43, !44}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !32, line: 80, baseType: !9, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !33, file: !32, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !33, file: !32, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !33, file: !32, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !33, file: !32, line: 84, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !33, file: !32, line: 85, baseType: !42, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !33, file: !32, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !33, file: !32, line: 87, baseType: !45, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !32, line: 56, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !32, line: 102, size: 192, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !47, file: !32, line: 103, baseType: !9, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !47, file: !32, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !47, file: !32, line: 105, baseType: !40, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !32, line: 106, baseType: !45, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !21, file: !20, line: 58, baseType: !40, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !21, file: !20, line: 59, baseType: !30, size: 64, align: 64, offset: 320)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !6, file: !1, line: 17, type: !10)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 2, scope: !6, file: !1, line: 18, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !6, file: !1, line: 20, type: !9)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mate", scope: !6, file: !1, line: 20, type: !9)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldrad", scope: !6, file: !1, line: 20, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rad", scope: !6, file: !1, line: 20, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "root", scope: !6, file: !1, line: 20, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tag", scope: !6, file: !1, line: 20, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dist", scope: !6, file: !1, line: 21, type: !40)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !6, file: !1, line: 21, type: !40)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !6, file: !1, line: 21, type: !40)
!67 = !DISubprogram(name: "BPG_levelStructure", scope: !1, file: !1, line: 103, type: !68, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._BPG*, i32, i32*, i32*, i32*, i32)* @BPG_levelStructure, variables: !70)
!68 = !DISubroutineType(types: !69)
!69 = !{!9, !10, !9, !40, !40, !40, !9}
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpg", arg: 1, scope: !67, file: !1, line: 104, type: !10)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "root", arg: 2, scope: !67, file: !1, line: 105, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 3, scope: !67, file: !1, line: 106, type: !40)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dist", arg: 4, scope: !67, file: !1, line: 107, type: !40)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mark", arg: 5, scope: !67, file: !1, line: 108, type: !40)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 6, scope: !67, file: !1, line: 109, type: !9)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !67, file: !1, line: 111, type: !9)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !67, file: !1, line: 111, type: !9)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !67, file: !1, line: 111, type: !9)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !67, file: !1, line: 111, type: !9)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !67, file: !1, line: 111, type: !9)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "usize", scope: !67, file: !1, line: 111, type: !9)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !67, file: !1, line: 111, type: !9)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !67, file: !1, line: 111, type: !9)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !67, file: !1, line: 111, type: !9)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uadj", scope: !67, file: !1, line: 112, type: !40)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !67, file: !1, line: 112, type: !40)
!88 = !{i32 2, !"Dwarf Version", i32 2}
!89 = !{i32 2, !"Debug Info Version", i32 700000003}
!90 = !{i32 1, !"PIC Level", i32 2}
!91 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!92 = !DIExpression()
!93 = !DILocation(line: 17, column: 11, scope: !6)
!94 = !DILocation(line: 18, column: 10, scope: !6)
