; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_search.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [65 x i8] c"\0A fatal error in Chv_maxabsInDiagonal11(%p,%p,%d,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [92 x i8] c"\0A fatal error in Chv_maxabsInDiagonal11(%p,%p,%d,%p)\0A type = SPOOLES_REAL, bad symflag %d \0A\00", align 1
@.str2 = private unnamed_addr constant [95 x i8] c"\0A fatal error in Chv_maxabsInDiagonal11(%p,%p,%d,%p)\0A type = SPOOLES_COMPLEX, bad symflag %d \0A\00", align 1
@.str3 = private unnamed_addr constant [105 x i8] c"\0A fatal error in Chv_maxabsInDiagonal11(%p,%p,%d,%p)\0A bad type, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1
@.str4 = private unnamed_addr constant [63 x i8] c"\0A fatal error in Chv_maxabsInRow11(%p,%d,%p,%d,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_search.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !52, !71, !88, !106, !122, !138}
!6 = !DISubprogram(name: "Chv_maxabsInDiagonal11", scope: !1, file: !1, line: 20, type: !7, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*, i32*, i32, double*)* @Chv_maxabsInDiagonal11, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !22, !9, !25}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !12, line: 30, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !12, line: 31, size: 640, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !13, file: !12, line: 32, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !13, file: !12, line: 33, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !13, file: !12, line: 34, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !13, file: !12, line: 35, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 36, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !13, file: !12, line: 37, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !13, file: !12, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !13, file: !12, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !13, file: !12, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !9, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !12, line: 42, baseType: !10, size: 64, align: 64, offset: 576)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 21, type: !10)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mark", arg: 2, scope: !6, file: !1, line: 22, type: !22)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 3, scope: !6, file: !1, line: 23, type: !9)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pmaxval", arg: 4, scope: !6, file: !1, line: 24, type: !25)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !6, file: !1, line: 26, type: !26)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !6, file: !1, line: 26, type: !26)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !6, file: !1, line: 27, type: !25)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !6, file: !1, line: 28, type: !9)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !6, file: !1, line: 28, type: !9)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !6, file: !1, line: 28, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !6, file: !1, line: 28, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !6, file: !1, line: 28, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "off", scope: !6, file: !1, line: 28, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !6, file: !1, line: 28, type: !9)
!52 = !DISubprogram(name: "Chv_maxabsInRow11", scope: !1, file: !1, line: 163, type: !53, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*, i32, i32*, i32, double*)* @Chv_maxabsInRow11, variables: !55)
!53 = !DISubroutineType(types: !54)
!54 = !{!9, !10, !9, !22, !9, !25}
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !52, file: !1, line: 164, type: !10)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 2, scope: !52, file: !1, line: 165, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colmark", arg: 3, scope: !52, file: !1, line: 166, type: !22)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 4, scope: !52, file: !1, line: 167, type: !9)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pmaxval", arg: 5, scope: !52, file: !1, line: 168, type: !25)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !52, file: !1, line: 170, type: !26)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !52, file: !1, line: 170, type: !26)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !52, file: !1, line: 171, type: !25)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !52, file: !1, line: 172, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !52, file: !1, line: 172, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !52, file: !1, line: 172, type: !9)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !52, file: !1, line: 172, type: !9)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !52, file: !1, line: 172, type: !9)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "off", scope: !52, file: !1, line: 172, type: !9)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !52, file: !1, line: 172, type: !9)
