; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_assemble.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [63 x i8] c"\0A fatal error in Chv_addChevron(%p,%p,%d,%d,%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [122 x i8] c"\0A fatal error in Chv_addChevron()\0A type is SPOOLES_REAL, symflag = %d\0A must be SPOOLES_SYMMETRIC or SPOOLES_NONSYMMETRIC\0A\00", align 1
@.str2 = private unnamed_addr constant [142 x i8] c"\0A fatal error in Chv_addChevron()\0A type is SPOOLES_REAL, symflag = %d\0A must be SPOOLES_SYMMETRIC, SPOOLES_HERMITIAN\0A or SPOOLES_NONSYMMETRIC\0A\00", align 1
@.str3 = private unnamed_addr constant [88 x i8] c"\0A fatal error in Chv_addChevron()\0A type is %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_assemble.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !82, !109}
!6 = !DISubprogram(name: "Chv_addChevron", scope: !1, file: !1, line: 21, type: !7, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, double*, i32, i32, i32*, double*)* @Chv_addChevron, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !25, !15, !15, !22, !25}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !11, line: 31, size: 640, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !12, file: !11, line: 37, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 42, baseType: !9, size: 64, align: 64, offset: 576)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !67, !68, !69, !70, !79, !80, !81}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 22, type: !9)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 2, scope: !6, file: !1, line: 23, type: !25)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ichv", arg: 3, scope: !6, file: !1, line: 24, type: !15)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvsize", arg: 4, scope: !6, file: !1, line: 25, type: !15)
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvind", arg: 5, scope: !6, file: !1, line: 26, type: !22)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvent", arg: 6, scope: !6, file: !1, line: 27, type: !25)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 29, type: !15)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iloc", scope: !6, file: !1, line: 29, type: !15)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !6, file: !1, line: 29, type: !15)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !6, file: !1, line: 29, type: !15)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jjfirst", scope: !6, file: !1, line: 29, type: !15)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jjlast", scope: !6, file: !1, line: 29, type: !15)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !6, file: !1, line: 30, type: !15)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !6, file: !1, line: 30, type: !15)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !6, file: !1, line: 30, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !6, file: !1, line: 30, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !6, file: !1, line: 30, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !6, file: !1, line: 31, type: !22)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diag", scope: !6, file: !1, line: 32, type: !25)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alphareal", scope: !58, file: !1, line: 228, type: !26)
!58 = distinct !DILexicalBlock(scope: !59, file: !1, line: 227, column: 43)
!59 = distinct !DILexicalBlock(scope: !60, file: !1, line: 227, column: 19)
!60 = distinct !DILexicalBlock(scope: !61, file: !1, line: 222, column: 19)
!61 = distinct !DILexicalBlock(scope: !62, file: !1, line: 212, column: 12)
!62 = distinct !DILexicalBlock(scope: !63, file: !1, line: 203, column: 38)
!63 = distinct !DILexicalBlock(scope: !64, file: !1, line: 203, column: 16)
!64 = distinct !DILexicalBlock(scope: !65, file: !1, line: 180, column: 9)
!65 = distinct !DILexicalBlock(scope: !66, file: !1, line: 127, column: 55)
!66 = distinct !DILexicalBlock(scope: !6, file: !1, line: 127, column: 6)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alphaimag", scope: !58, file: !1, line: 228, type: !26)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xreal", scope: !58, file: !1, line: 228, type: !26)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ximag", scope: !58, file: !1, line: 228, type: !26)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alphareal", scope: !71, file: !1, line: 350, type: !26)
!71 = distinct !DILexicalBlock(scope: !72, file: !1, line: 349, column: 14)
!72 = distinct !DILexicalBlock(scope: !73, file: !1, line: 344, column: 19)
!73 = distinct !DILexicalBlock(scope: !74, file: !1, line: 334, column: 12)
!74 = distinct !DILexicalBlock(scope: !75, file: !1, line: 333, column: 38)
!75 = distinct !DILexicalBlock(scope: !76, file: !1, line: 333, column: 16)
