; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [75 x i8] c"\0A fatal error in Chv_nbytesNeeded()\0A bad input, nD = %d, nL = %d, nU = %d\0A\00", align 1
@.str1 = private unnamed_addr constant [131 x i8] c"\0A fatal error in Chv_nbytesNeeded()\0A type = SPOOLES_REAL, invalid symflag = %d\0A must be SPOOLES_SYMMETRIC or SPOOLES_NONSYMMETRIC\0A\00", align 1
@.str2 = private unnamed_addr constant [154 x i8] c"\0A fatal error in Chv_nbytesNeeded()\0A type = SPOOLES_COMPLEX, invalid symflag = %d\0A must be SPOOLES_SYMMETRIC, SPOOLES_HERMITIAN\0A or SPOOLES_NONSYMMETRIC\0A\00", align 1
@.str3 = private unnamed_addr constant [97 x i8] c"\0A fatal error in Chv_nbytesNeeded()\0A invalid type = %d\0A must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{!8, !20, !51, !57, !71, !81, !95}
!8 = !DISubprogram(name: "Chv_nbytesNeeded", scope: !1, file: !1, line: 16, type: !9, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32, i32)* @Chv_nbytesNeeded, variables: !11)
!9 = !DISubroutineType(types: !10)
!10 = !{!6, !6, !6, !6, !6, !6}
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19}
!12 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nD", arg: 1, scope: !8, file: !1, line: 17, type: !6)
!13 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nL", arg: 2, scope: !8, file: !1, line: 18, type: !6)
!14 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nU", arg: 3, scope: !8, file: !1, line: 19, type: !6)
!15 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 4, scope: !8, file: !1, line: 20, type: !6)
!16 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 5, scope: !8, file: !1, line: 21, type: !6)
!17 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !8, file: !1, line: 23, type: !6)
!18 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !8, file: !1, line: 23, type: !6)
!19 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !8, file: !1, line: 23, type: !6)
!20 = !DISubprogram(name: "Chv_nbytesInWorkspace", scope: !1, file: !1, line: 125, type: !21, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*)* @Chv_nbytesInWorkspace, variables: !49)
!21 = !DISubroutineType(types: !22)
!22 = !{!6, !23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !25, line: 30, baseType: !26)
!25 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !25, line: 31, size: 640, align: 64, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !39, !48}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !26, file: !25, line: 32, baseType: !6, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !26, file: !25, line: 33, baseType: !6, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !26, file: !25, line: 34, baseType: !6, size: 32, align: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !26, file: !25, line: 35, baseType: !6, size: 32, align: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !25, line: 36, baseType: !6, size: 32, align: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !26, file: !25, line: 37, baseType: !6, size: 32, align: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !26, file: !25, line: 38, baseType: !5, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !26, file: !25, line: 39, baseType: !5, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !26, file: !25, line: 40, baseType: !37, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !26, file: !25, line: 41, baseType: !40, size: 192, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !41, line: 20, baseType: !42)
!41 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !41, line: 21, size: 192, align: 64, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !41, line: 22, baseType: !6, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !42, file: !41, line: 23, baseType: !6, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !42, file: !41, line: 24, baseType: !6, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !42, file: !41, line: 25, baseType: !37, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !25, line: 42, baseType: !23, size: 64, align: 64, offset: 576)
!49 = !{!50}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !20, file: !1, line: 126, type: !23)
!51 = !DISubprogram(name: "Chv_setNbytesInWorkspace", scope: !1, file: !1, line: 144, type: !52, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32)* @Chv_setNbytesInWorkspace, variables: !54)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !23, !6}
!54 = !{!55, !56}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !51, file: !1, line: 145, type: !23)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbytes", arg: 2, scope: !51, file: !1, line: 146, type: !6)
!57 = !DISubprogram(name: "Chv_setFields", scope: !1, file: !1, line: 166, type: !58, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32, i32, i32, i32, i32, i32)* @Chv_setFields, variables: !60)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !23, !6, !6, !6, !6, !6, !6}
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !57, file: !1, line: 167, type: !23)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "id", arg: 2, scope: !57, file: !1, line: 168, type: !6)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nD", arg: 3, scope: !57, file: !1, line: 169, type: !6)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nL", arg: 4, scope: !57, file: !1, line: 170, type: !6)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nU", arg: 5, scope: !57, file: !1, line: 171, type: !6)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 6, scope: !57, file: !1, line: 172, type: !6)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 7, scope: !57, file: !1, line: 173, type: !6)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dbuffer", scope: !57, file: !1, line: 175, type: !37)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !57, file: !1, line: 176, type: !6)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuffer", scope: !57, file: !1, line: 177, type: !5)
!71 = !DISubprogram(name: "Chv_init", scope: !1, file: !1, line: 270, type: !58, isLocal: false, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32, i32, i32, i32, i32, i32)* @Chv_init, variables: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !71, file: !1, line: 271, type: !23)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "id", arg: 2, scope: !71, file: !1, line: 272, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nD", arg: 3, scope: !71, file: !1, line: 273, type: !6)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nL", arg: 4, scope: !71, file: !1, line: 274, type: !6)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nU", arg: 5, scope: !71, file: !1, line: 275, type: !6)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 6, scope: !71, file: !1, line: 276, type: !6)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 7, scope: !71, file: !1, line: 277, type: !6)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !71, file: !1, line: 279, type: !6)
!81 = !DISubprogram(name: "Chv_initWithPointers", scope: !1, file: !1, line: 356, type: !82, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32, i32, i32, i32, i32, i32, i32*, i32*, double*)* @Chv_initWithPointers, variables: !84)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !23, !6, !6, !6, !6, !6, !6, !5, !5, !37}
