; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [46 x i8] c"\0A fatal error in Chv_shift(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [122 x i8] c"\0A fatal error in Chv_shift(%p,%d)\0A type is SPOOLES_REAL, symflag = %d\0A must be SPOOLES_SYMMETRIC or SPOOLES_NONSYMMETRIC\0A\00", align 1
@.str2 = private unnamed_addr constant [145 x i8] c"\0A fatal error in Chv_shift(%p,%d)\0A type is SPOOLES_COMPLEX, symflag = %d\0A must be SPOOLES_SYMMETRIC, SPOOLES_HERMITIAN\0A or SPOOLES_NONSYMMETRIC\0A\00", align 1
@.str3 = private unnamed_addr constant [44 x i8] c"\0A fatal error in Chv_maxabs(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !42, !51, !68, !84, !89, !143, !183}
!6 = !DISubprogram(name: "Chv_shift", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32)* @Chv_shift, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !11, line: 31, size: 640, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !12, file: !11, line: 37, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 42, baseType: !9, size: 64, align: 64, offset: 576)
!37 = !{!38, !39, !40, !41}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 18, type: !9)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shift", arg: 2, scope: !6, file: !1, line: 19, type: !15)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 21, type: !15)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !6, file: !1, line: 21, type: !15)
!42 = !DISubprogram(name: "Chv_maxabs", scope: !1, file: !1, line: 150, type: !43, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._Chv*)* @Chv_maxabs, variables: !45)
!43 = !DISubroutineType(types: !44)
!44 = !{!26, !9}
!45 = !{!46, !47, !48}
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !42, file: !1, line: 151, type: !9)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxabs", scope: !42, file: !1, line: 153, type: !26)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !49, file: !1, line: 166, type: !15)
!49 = distinct !DILexicalBlock(scope: !50, file: !1, line: 165, column: 25)
!50 = distinct !DILexicalBlock(scope: !42, file: !1, line: 165, column: 6)
!51 = !DISubprogram(name: "Chv_frobNorm", scope: !1, file: !1, line: 187, type: !43, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._Chv*)* @Chv_frobNorm, variables: !52)
!52 = !{!53, !54, !55, !58, !59, !60, !61, !64, !65, !66, !67}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !51, file: !1, line: 188, type: !9)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !51, file: !1, line: 190, type: !26)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !56, file: !1, line: 202, type: !26)
!56 = distinct !DILexicalBlock(scope: !57, file: !1, line: 201, column: 25)
!57 = distinct !DILexicalBlock(scope: !51, file: !1, line: 201, column: 6)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !56, file: !1, line: 202, type: !25)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !56, file: !1, line: 203, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !56, file: !1, line: 203, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imag", scope: !62, file: !1, line: 212, type: !26)
!62 = distinct !DILexicalBlock(scope: !63, file: !1, line: 211, column: 35)
!63 = distinct !DILexicalBlock(scope: !57, file: !1, line: 211, column: 13)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "real", scope: !62, file: !1, line: 212, type: !26)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !62, file: !1, line: 212, type: !25)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !62, file: !1, line: 213, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !62, file: !1, line: 213, type: !15)
!68 = !DISubprogram(name: "Chv_sub", scope: !1, file: !1, line: 239, type: !69, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, %struct._Chv*)* @Chv_sub, variables: !71)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !9, !9}
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvJ", arg: 1, scope: !68, file: !1, line: 240, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvI", arg: 2, scope: !68, file: !1, line: 241, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entriesI", scope: !68, file: !1, line: 243, type: !25)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entriesJ", scope: !68, file: !1, line: 243, type: !25)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !68, file: !1, line: 244, type: !15)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nDI", scope: !68, file: !1, line: 244, type: !15)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nDJ", scope: !68, file: !1, line: 244, type: !15)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !68, file: !1, line: 244, type: !15)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nLI", scope: !68, file: !1, line: 244, type: !15)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nLJ", scope: !68, file: !1, line: 244, type: !15)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nUI", scope: !68, file: !1, line: 244, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nUJ", scope: !68, file: !1, line: 244, type: !15)
!84 = !DISubprogram(name: "Chv_zero", scope: !1, file: !1, line: 299, type: !85, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*)* @Chv_zero, variables: !87)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !9}
!87 = !{!88}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !84, file: !1, line: 300, type: !9)
!89 = !DISubprogram(name: "Chv_fill11block", scope: !1, file: !1, line: 333, type: !90, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, %struct._A2*)* @Chv_fill11block, variables: !104)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !9, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !94, line: 49, baseType: !95)
!94 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../A2/A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !94, line: 41, size: 256, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !94, line: 42, baseType: !15, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !95, file: !94, line: 43, baseType: !15, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !95, file: !94, line: 44, baseType: !15, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !95, file: !94, line: 45, baseType: !15, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !95, file: !94, line: 46, baseType: !15, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !95, file: !94, line: 47, baseType: !15, size: 32, align: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !95, file: !94, line: 48, baseType: !25, size: 64, align: 64, offset: 192)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !116, !117, !118, !119, !120, !123, !124, !125, !126, !127, !132, !133, !134, !135, !136, !139, !140, !141, !142}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !89, file: !1, line: 334, type: !9)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 2, scope: !89, file: !1, line: 335, type: !92)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !89, file: !1, line: 337, type: !25)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !89, file: !1, line: 338, type: !15)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !89, file: !1, line: 338, type: !15)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !89, file: !1, line: 338, type: !15)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !112, file: !1, line: 361, type: !15)
!112 = distinct !DILexicalBlock(scope: !113, file: !1, line: 360, column: 33)
!113 = distinct !DILexicalBlock(scope: !114, file: !1, line: 360, column: 9)
!114 = distinct !DILexicalBlock(scope: !115, file: !1, line: 357, column: 25)
!115 = distinct !DILexicalBlock(scope: !89, file: !1, line: 357, column: 6)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iioff", scope: !112, file: !1, line: 361, type: !15)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !112, file: !1, line: 361, type: !15)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istride", scope: !112, file: !1, line: 361, type: !15)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !112, file: !1, line: 361, type: !15)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !121, file: !1, line: 381, type: !15)
!121 = distinct !DILexicalBlock(scope: !122, file: !1, line: 380, column: 43)
!122 = distinct !DILexicalBlock(scope: !113, file: !1, line: 380, column: 16)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iioff", scope: !121, file: !1, line: 381, type: !15)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !121, file: !1, line: 381, type: !15)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istride", scope: !121, file: !1, line: 381, type: !15)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !121, file: !1, line: 381, type: !15)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !128, file: !1, line: 409, type: !15)
!128 = distinct !DILexicalBlock(scope: !129, file: !1, line: 408, column: 58)
!129 = distinct !DILexicalBlock(scope: !130, file: !1, line: 408, column: 9)
!130 = distinct !DILexicalBlock(scope: !131, file: !1, line: 405, column: 35)
!131 = distinct !DILexicalBlock(scope: !115, file: !1, line: 405, column: 13)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iioff", scope: !128, file: !1, line: 409, type: !15)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !128, file: !1, line: 409, type: !15)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istride", scope: !128, file: !1, line: 409, type: !15)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !128, file: !1, line: 409, type: !15)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !137, file: !1, line: 431, type: !15)
!137 = distinct !DILexicalBlock(scope: !138, file: !1, line: 430, column: 43)
!138 = distinct !DILexicalBlock(scope: !129, file: !1, line: 430, column: 16)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iioff", scope: !137, file: !1, line: 431, type: !15)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !137, file: !1, line: 431, type: !15)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istride", scope: !137, file: !1, line: 431, type: !15)
