; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_update.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [54 x i8] c"\0A fatal error in Chv_updateH(%p,%p,%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [75 x i8] c"\0A fatal error in Chv_updateH(%p,%p,%p,%p)\0A bad input, chvT is not complex\0A\00", align 1
@.str2 = private unnamed_addr constant [75 x i8] c"\0A fatal error in Chv_updateH(%p,%p,%p,%p)\0A bad input, mtxD is not complex\0A\00", align 1
@.str3 = private unnamed_addr constant [75 x i8] c"\0A fatal error in Chv_updateH(%p,%p,%p,%p)\0A bad input, mtxU is not complex\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_update.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !125, !250}
!6 = !DISubprogram(name: "Chv_updateH", scope: !1, file: !1, line: 21, type: !7, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, %struct._SubMtx*, %struct._SubMtx*, %struct._DV*)* @Chv_updateH, variables: !53)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !37, !37, !52}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !11, line: 31, size: 640, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !12, file: !11, line: 37, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 42, baseType: !9, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !39, line: 43, baseType: !40)
!39 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !39, line: 44, size: 576, align: 64, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 45, baseType: !15, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !40, file: !39, line: 46, baseType: !15, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !40, file: !39, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !40, file: !39, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !40, file: !39, line: 49, baseType: !15, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !40, file: !39, line: 50, baseType: !15, size: 32, align: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !40, file: !39, line: 51, baseType: !15, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !40, file: !39, line: 52, baseType: !25, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !40, file: !39, line: 53, baseType: !28, size: 192, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 54, baseType: !37, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !71, !72, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvT", arg: 1, scope: !6, file: !1, line: 22, type: !9)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxD", arg: 2, scope: !6, file: !1, line: 23, type: !37)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxU", arg: 3, scope: !6, file: !1, line: 24, type: !37)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tempDV", arg: 4, scope: !6, file: !1, line: 25, type: !52)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstInT", scope: !6, file: !1, line: 27, type: !15)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstInU", scope: !6, file: !1, line: 27, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcolT", scope: !6, file: !1, line: 27, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcolU", scope: !6, file: !1, line: 27, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastInT", scope: !6, file: !1, line: 27, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastInU", scope: !6, file: !1, line: 27, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncolT", scope: !6, file: !1, line: 27, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncolU", scope: !6, file: !1, line: 27, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colindT", scope: !6, file: !1, line: 28, type: !22)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colindU", scope: !6, file: !1, line: 28, type: !22)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isum", scope: !69, file: !1, line: 104, type: !26)
!69 = distinct !DILexicalBlock(scope: !70, file: !1, line: 103, column: 38)
!70 = distinct !DILexicalBlock(scope: !6, file: !1, line: 103, column: 6)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rsum", scope: !69, file: !1, line: 104, type: !26)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sums", scope: !69, file: !1, line: 105, type: !73)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1152, align: 64, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 18)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base0", scope: !69, file: !1, line: 106, type: !25)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base1", scope: !69, file: !1, line: 106, type: !25)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base2", scope: !69, file: !1, line: 106, type: !25)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colU0", scope: !69, file: !1, line: 106, type: !25)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colU1", scope: !69, file: !1, line: 106, type: !25)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colU2", scope: !69, file: !1, line: 106, type: !25)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entU", scope: !69, file: !1, line: 106, type: !25)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowUT0", scope: !69, file: !1, line: 107, type: !25)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowUT1", scope: !69, file: !1, line: 107, type: !25)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowUT2", scope: !69, file: !1, line: 107, type: !25)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp0", scope: !69, file: !1, line: 107, type: !25)
