; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_copy.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [70 x i8] c"\0A fatal error in Chv_copyEntriesToVector(%p,%d,%p,,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [494 x i8] c"\0A fatal error in Chv_copyEntriesToVector(%p,%d,%p,%d,%d)\0A bad input\0A\0A copyflag = %d, must be\0A\0A CHV_STRICT_LOWER    --> copy strict lower entries\0A CHV_DIAGONAL        --> copy diagonal entries\0A CHV_STRICT_UPPER    --> copy strict upper entries\0A CHV_STRICT_LOWER_11 --> copy strict lower entries in (1,1) block\0A CHV_LOWER_21        --> copy lower entries in (2,1) block\0A CHV_STRICT_UPPER_11 --> copy strict upper entries in (1,1) block\0A CHV_UPPER_12        --> copy upper entries in (1,2) block\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_copy.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !227, !415, !427, !499}
!6 = !DISubprogram(name: "Chv_copyEntriesToVector", scope: !1, file: !1, line: 36, type: !7, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*, i32, i32*, i32, double*, i32, i32)* @Chv_copyEntriesToVector, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !9, !22, !9, !25, !9, !9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !12, line: 30, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !12, line: 31, size: 640, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !13, file: !12, line: 32, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !13, file: !12, line: 33, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !13, file: !12, line: 34, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !13, file: !12, line: 35, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 36, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !13, file: !12, line: 37, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !13, file: !12, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !13, file: !12, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !13, file: !12, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !9, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !12, line: 42, baseType: !10, size: 64, align: 64, offset: 576)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !58, !61, !62, !65, !66, !70, !71, !72, !73, !74, !75, !76, !78, !79, !80, !81, !82, !85, !86, !87, !88, !89, !90, !91, !92, !94, !95, !96, !100, !101, !102, !103, !104, !105, !106, !107, !109, !110, !111, !112, !113, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !127, !128, !129, !130, !131, !132, !133, !136, !137, !138, !139, !140, !141, !142, !144, !145, !146, !147, !148, !151, !152, !153, !154, !155, !156, !158, !159, !160, !161, !162, !166, !167, !168, !169, !170, !171, !172, !173, !175, !176, !177, !178, !179, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !193, !194, !195, !196, !197, !198, !202, !203, !204, !205, !206, !208, !209, !210, !211, !212, !215, !216, !217, !218, !219, !220, !222, !223, !224, !225, !226}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 37, type: !10)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npivot", arg: 2, scope: !6, file: !1, line: 38, type: !9)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivotsizes", arg: 3, scope: !6, file: !1, line: 39, type: !22)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 4, scope: !6, file: !1, line: 40, type: !9)
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvec", arg: 5, scope: !6, file: !1, line: 41, type: !25)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "copyflag", arg: 6, scope: !6, file: !1, line: 42, type: !9)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "storeflag", arg: 7, scope: !6, file: !1, line: 43, type: !9)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !6, file: !1, line: 45, type: !25)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mm", scope: !6, file: !1, line: 46, type: !9)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !6, file: !1, line: 46, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !6, file: !1, line: 46, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !6, file: !1, line: 46, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !6, file: !1, line: 46, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !6, file: !1, line: 46, type: !9)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !6, file: !1, line: 46, type: !9)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symflag", scope: !6, file: !1, line: 46, type: !9)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipivot", scope: !55, file: !1, line: 127, type: !9)
!55 = distinct !DILexicalBlock(scope: !56, file: !1, line: 126, column: 11)
!56 = distinct !DILexicalBlock(scope: !57, file: !1, line: 124, column: 9)
!57 = distinct !DILexicalBlock(scope: !6, file: !1, line: 112, column: 21)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !59, file: !1, line: 137, type: !9)
!59 = distinct !DILexicalBlock(scope: !60, file: !1, line: 136, column: 11)
!60 = distinct !DILexicalBlock(scope: !57, file: !1, line: 134, column: 9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipivot", scope: !59, file: !1, line: 137, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !63, file: !1, line: 168, type: !9)
!63 = distinct !DILexicalBlock(scope: !64, file: !1, line: 167, column: 11)
!64 = distinct !DILexicalBlock(scope: !57, file: !1, line: 165, column: 9)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipivot", scope: !63, file: !1, line: 168, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !67, file: !1, line: 209, type: !9)
!67 = distinct !DILexicalBlock(scope: !68, file: !1, line: 203, column: 23)
