; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_findPivot.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [65 x i8] c"\0A fatal error in Chv_findPivot(%p,%p,%f,%d,%p,%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [108 x i8] c"\0A fatal error in Chv_findPivot(%p,%p,%f,%d,%p,%p,%p)\0A bad type %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1
@.str2 = private unnamed_addr constant [136 x i8] c"\0A fatal error in Chv_findPivot(%p,%p,%f,%d,%p,%p,%p)\0A bad symflag %d\0A must be SPOOLES_SYMMETRIC, SPOOLES_HERMITIAN or CHV_NONSYMMETRIC\0A\00", align 1
@.str3 = private unnamed_addr constant [70 x i8] c"\0A fatal error in Chv_findPivot(%p,%p,%f,%d,%p,%p,%p)\0A bad symflag %d\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_findPivot.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{!8, !47, !71, !88, !119, !147}
!8 = !DISubprogram(name: "Chv_findPivot", scope: !1, file: !1, line: 40, type: !9, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*, %struct._DV*, double, i32, i32*, i32*, i32*)* @Chv_findPivot, variables: !38)
!9 = !DISubroutineType(types: !10)
!10 = !{!6, !11, !37, !26, !6, !5, !5, !5}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !13, line: 30, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !13, line: 31, size: 640, align: 64, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !27, !36}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !14, file: !13, line: 32, baseType: !6, size: 32, align: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !14, file: !13, line: 33, baseType: !6, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !14, file: !13, line: 34, baseType: !6, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !14, file: !13, line: 35, baseType: !6, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !14, file: !13, line: 36, baseType: !6, size: 32, align: 32, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !14, file: !13, line: 37, baseType: !6, size: 32, align: 32, offset: 160)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !14, file: !13, line: 38, baseType: !5, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !14, file: !13, line: 39, baseType: !5, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !14, file: !13, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !14, file: !13, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !6, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !6, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !6, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 42, baseType: !11, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !8, file: !1, line: 41, type: !11)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "workDV", arg: 2, scope: !8, file: !1, line: 42, type: !37)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tau", arg: 3, scope: !8, file: !1, line: 43, type: !26)
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndelay", arg: 4, scope: !8, file: !1, line: 44, type: !6)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pirow", arg: 5, scope: !8, file: !1, line: 45, type: !5)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pjcol", arg: 6, scope: !8, file: !1, line: 46, type: !5)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pntest", arg: 7, scope: !8, file: !1, line: 47, type: !5)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !8, file: !1, line: 49, type: !6)
!47 = !DISubprogram(name: "findPivotSH", scope: !1, file: !1, line: 114, type: !9, isLocal: true, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, variables: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !47, file: !1, line: 115, type: !11)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "workDV", arg: 2, scope: !47, file: !1, line: 116, type: !37)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tau", arg: 3, scope: !47, file: !1, line: 117, type: !26)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndelay", arg: 4, scope: !47, file: !1, line: 118, type: !6)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pirow", arg: 5, scope: !47, file: !1, line: 119, type: !5)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pjcol", arg: 6, scope: !47, file: !1, line: 120, type: !5)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pntest", arg: 7, scope: !47, file: !1, line: 121, type: !5)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !47, file: !1, line: 123, type: !26)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowmaxes", scope: !47, file: !1, line: 124, type: !25)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !47, file: !1, line: 125, type: !6)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !47, file: !1, line: 125, type: !6)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrow", scope: !47, file: !1, line: 125, type: !6)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "krow", scope: !47, file: !1, line: 125, type: !6)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncand", scope: !47, file: !1, line: 125, type: !6)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !47, file: !1, line: 125, type: !6)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndouble", scope: !47, file: !1, line: 126, type: !6)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntest", scope: !47, file: !1, line: 126, type: !6)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivotsize", scope: !47, file: !1, line: 126, type: !6)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tag", scope: !47, file: !1, line: 126, type: !6)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "untag", scope: !47, file: !1, line: 126, type: !6)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowids", scope: !47, file: !1, line: 127, type: !5)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowmark", scope: !47, file: !1, line: 127, type: !5)
