; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_swap.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [52 x i8] c"\0A fatal error in Chv_swapRows(%p,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [72 x i8] c"\0A fatal error in Chv_swapRows(%p,%d,%d)\0A rows must be less than nD = %d\00", align 1
@.str2 = private unnamed_addr constant [75 x i8] c"\0A fatal error in Chv_swapRows(%p,%d,%d)\0A bad input, entries = %p, nD = %d\0A\00", align 1
@.str3 = private unnamed_addr constant [93 x i8] c"\0A fatal error in Chv_swapRows(%p,%d,%d)\0A type = %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1
@.str4 = private unnamed_addr constant [62 x i8] c"\0A fatal error in Chv_swapRows(%p,%d,%d)\0A bad symmetryflag %d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_swap.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !53, !70}
!6 = !DISubprogram(name: "Chv_swapRows", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32, i32)* @Chv_swapRows, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !11, line: 31, size: 640, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !12, file: !11, line: 37, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 42, baseType: !9, size: 64, align: 64, offset: 576)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 17, type: !9)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 2, scope: !6, file: !1, line: 18, type: !15)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jrow", arg: 3, scope: !6, file: !1, line: 19, type: !15)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dtmp", scope: !6, file: !1, line: 21, type: !26)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !6, file: !1, line: 22, type: !25)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 23, type: !15)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !6, file: !1, line: 23, type: !15)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itmp", scope: !6, file: !1, line: 23, type: !15)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "joff", scope: !6, file: !1, line: 23, type: !15)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !6, file: !1, line: 23, type: !15)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !6, file: !1, line: 23, type: !15)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !6, file: !1, line: 23, type: !15)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !6, file: !1, line: 23, type: !15)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !6, file: !1, line: 23, type: !15)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !6, file: !1, line: 24, type: !22)
!53 = !DISubprogram(name: "Chv_swapColumns", scope: !1, file: !1, line: 184, type: !7, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32, i32)* @Chv_swapColumns, variables: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !53, file: !1, line: 185, type: !9)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "icol", arg: 2, scope: !53, file: !1, line: 186, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jcol", arg: 3, scope: !53, file: !1, line: 187, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dtmp", scope: !53, file: !1, line: 189, type: !26)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !53, file: !1, line: 190, type: !25)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !53, file: !1, line: 191, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !53, file: !1, line: 191, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itmp", scope: !53, file: !1, line: 191, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "joff", scope: !53, file: !1, line: 191, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !53, file: !1, line: 191, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !53, file: !1, line: 191, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !53, file: !1, line: 191, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !53, file: !1, line: 191, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !53, file: !1, line: 191, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !53, file: !1, line: 192, type: !22)
