; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_instance.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [40 x i8] c"\0A fatal error in Chv_id(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [42 x i8] c"\0A fatal error in Chv_type(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [50 x i8] c"\0A fatal error in Chv_symmetryFlag(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [57 x i8] c"\0A fatal error in Chv_dimensions(%p,%p,%p,%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [54 x i8] c"\0A fatal error in Chv_rowIndices(%p,%p,%p)\0A bad input\0A\00", align 1
@.str5 = private unnamed_addr constant [61 x i8] c"\0A fatal error in Chv_rowIndices(%p,%p,%p)\0A bad symflag = %d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_instance.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !39, !42, !45, !53, !61, !66, !73, !78, !85, !90, !106, !123, !140, !157, !173}
!6 = !DISubprogram(name: "Chv_id", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*)* @Chv_id, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !12, line: 30, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !12, line: 31, size: 640, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !13, file: !12, line: 32, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !13, file: !12, line: 33, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !13, file: !12, line: 34, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !13, file: !12, line: 35, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 36, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !13, file: !12, line: 37, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !13, file: !12, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !13, file: !12, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !13, file: !12, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !9, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !12, line: 42, baseType: !10, size: 64, align: 64, offset: 576)
!37 = !{!38}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 15, type: !10)
!39 = !DISubprogram(name: "Chv_type", scope: !1, file: !1, line: 40, type: !7, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*)* @Chv_type, variables: !40)
!40 = !{!41}
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !39, file: !1, line: 41, type: !10)
!42 = !DISubprogram(name: "Chv_symmetryFlag", scope: !1, file: !1, line: 67, type: !7, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*)* @Chv_symmetryFlag, variables: !43)
!43 = !{!44}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !42, file: !1, line: 68, type: !10)
!45 = !DISubprogram(name: "Chv_dimensions", scope: !1, file: !1, line: 91, type: !46, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32*, i32*, i32*)* @Chv_dimensions, variables: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !10, !22, !22, !22}
!48 = !{!49, !50, !51, !52}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !45, file: !1, line: 92, type: !10)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnD", arg: 2, scope: !45, file: !1, line: 93, type: !22)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnL", arg: 3, scope: !45, file: !1, line: 94, type: !22)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnU", arg: 4, scope: !45, file: !1, line: 95, type: !22)
!53 = !DISubprogram(name: "Chv_rowIndices", scope: !1, file: !1, line: 122, type: !54, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32*, i32**)* @Chv_rowIndices, variables: !57)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !10, !22, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!57 = !{!58, !59, !60}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !53, file: !1, line: 123, type: !10)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnrow", arg: 2, scope: !53, file: !1, line: 124, type: !22)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prowind", arg: 3, scope: !53, file: !1, line: 125, type: !56)
!61 = !DISubprogram(name: "Chv_columnIndices", scope: !1, file: !1, line: 159, type: !54, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, i32*, i32**)* @Chv_columnIndices, variables: !62)
!62 = !{!63, !64, !65}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !61, file: !1, line: 160, type: !10)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pncol", arg: 2, scope: !61, file: !1, line: 161, type: !22)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pcolind", arg: 3, scope: !61, file: !1, line: 162, type: !56)
!66 = !DISubprogram(name: "Chv_nent", scope: !1, file: !1, line: 188, type: !7, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*)* @Chv_nent, variables: !67)
!67 = !{!68, !69, !70, !71, !72}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !66, file: !1, line: 189, type: !10)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !66, file: !1, line: 191, type: !9)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !66, file: !1, line: 191, type: !9)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !66, file: !1, line: 191, type: !9)
