; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_factor.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }
%struct._PatchAndGoInfo = type { i32, double, double, %struct._IV*, %struct._DV* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [56 x i8] c"\0A fatal error in Chv_factorWithNoPivoting()\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [86 x i8] c"\0A fatal error in Chv_factorWithNoPivoting()\0A patch-and-go info != NULL, strategy = %d\00", align 1
@.str2 = private unnamed_addr constant [54 x i8] c"\0A fatal error in Chv_factorWithPivoting()\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [60 x i8] c"\0A fatal error in Chv_factorWithPivoting()\0A workDV is NULL \0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/Chv_factor.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !82, !109, !115, !119, !134, !145, !166, !190}
!6 = !DISubprogram(name: "Chv_factorWithNoPivoting", scope: !1, file: !1, line: 19, type: !7, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*, %struct._PatchAndGoInfo*)* @Chv_factorWithNoPivoting, variables: !57)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !37}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !12, line: 30, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !12, line: 31, size: 640, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !13, file: !12, line: 32, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !13, file: !12, line: 33, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !13, file: !12, line: 34, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !13, file: !12, line: 35, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 36, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !13, file: !12, line: 37, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !13, file: !12, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !13, file: !12, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !13, file: !12, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !9, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !12, line: 42, baseType: !10, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !39, line: 31, baseType: !40)
!39 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !39, line: 32, size: 320, align: 64, elements: !41)
!41 = !{!42, !43, !44, !45, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !40, file: !39, line: 33, baseType: !9, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !40, file: !39, line: 34, baseType: !26, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !40, file: !39, line: 35, baseType: !26, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !40, file: !39, line: 36, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !48, line: 20, baseType: !49)
!48 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Chv/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !48, line: 21, size: 192, align: 64, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !49, file: !48, line: 22, baseType: !9, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !49, file: !48, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !49, file: !48, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !49, file: !48, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !40, file: !39, line: 37, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !71, !72, !73, !74, !77, !78, !79, !80, !81}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 20, type: !10)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 2, scope: !6, file: !1, line: 21, type: !37)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wrkChv", scope: !6, file: !1, line: 23, type: !11)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !6, file: !1, line: 24, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !6, file: !1, line: 24, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nelim", scope: !6, file: !1, line: 24, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !6, file: !1, line: 24, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !6, file: !1, line: 25, type: !22)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !6, file: !1, line: 25, type: !22)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colmaxabs", scope: !68, file: !1, line: 67, type: !26)
!68 = distinct !DILexicalBlock(scope: !69, file: !1, line: 66, column: 35)
!69 = distinct !DILexicalBlock(scope: !70, file: !1, line: 66, column: 13)
!70 = distinct !DILexicalBlock(scope: !6, file: !1, line: 52, column: 6)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diagabs", scope: !68, file: !1, line: 67, type: !26)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offmaxabs", scope: !68, file: !1, line: 67, type: !26)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowmaxabs", scope: !68, file: !1, line: 67, type: !26)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colmaxabs", scope: !75, file: !1, line: 96, type: !26)
!75 = distinct !DILexicalBlock(scope: !76, file: !1, line: 95, column: 35)
!76 = distinct !DILexicalBlock(scope: !69, file: !1, line: 95, column: 13)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diagabs", scope: !75, file: !1, line: 96, type: !26)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "olddiag", scope: !75, file: !1, line: 96, type: !26)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newdiag", scope: !75, file: !1, line: 96, type: !26)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offmaxabs", scope: !75, file: !1, line: 96, type: !26)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowmaxabs", scope: !75, file: !1, line: 96, type: !26)
!82 = !DISubprogram(name: "Chv_factorWithPivoting", scope: !1, file: !1, line: 160, type: !83, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Chv*, i32, i32, %struct._IV*, %struct._DV*, double, i32*)* @Chv_factorWithPivoting, variables: !85)
!83 = !DISubroutineType(types: !84)
!84 = !{!9, !10, !9, !9, !46, !56, !26, !22}
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !82, file: !1, line: 161, type: !10)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndelay", arg: 2, scope: !82, file: !1, line: 162, type: !9)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivotflag", arg: 3, scope: !82, file: !1, line: 163, type: !9)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivotsizesIV", arg: 4, scope: !82, file: !1, line: 164, type: !46)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "workDV", arg: 5, scope: !82, file: !1, line: 165, type: !56)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tau", arg: 6, scope: !82, file: !1, line: 166, type: !26)
