; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvList/src/ChvList_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._ChvList = type { i32, %struct._Chv**, i32*, %struct._Lock*, i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }
%struct._Lock = type { i8*, i32, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [59 x i8] c"\0A fatal error in ChvList_isListNonempty(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [56 x i8] c"\0A fatal error in ChvList_isCountZero(%p,%d)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [63 x i8] c"\0A fatal error in ChvList_addObjectToList(%p,%p,%d)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [52 x i8] c"\0A fatal error in ChvList_getList(%p,%d)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define i32 @ChvList_isListNonempty(%struct._ChvList* %chvlist, i32 %ilist) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvList/src/ChvList_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !62, !66, !73}
!6 = !DISubprogram(name: "ChvList_isListNonempty", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ChvList*, i32)* @ChvList_isListNonempty, variables: !59)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChvList", file: !12, line: 24, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvList/src/../ChvList.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ChvList", file: !12, line: 25, size: 384, align: 64, elements: !14)
!14 = !{!15, !16, !45, !46, !55, !58}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !13, file: !12, line: 26, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !13, file: !12, line: 27, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !20, line: 30, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvList/src/../../Chv/Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !20, line: 31, size: 640, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !31, !32, !35, !44}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !21, file: !20, line: 32, baseType: !9, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !21, file: !20, line: 33, baseType: !9, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !21, file: !20, line: 34, baseType: !9, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !21, file: !20, line: 35, baseType: !9, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !20, line: 36, baseType: !9, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !21, file: !20, line: 37, baseType: !9, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !21, file: !20, line: 38, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !21, file: !20, line: 39, baseType: !30, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !21, file: !20, line: 40, baseType: !33, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !21, file: !20, line: 41, baseType: !36, size: 192, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !37, line: 20, baseType: !38)
!37 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvList/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !37, line: 21, size: 192, align: 64, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !38, file: !37, line: 22, baseType: !9, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !38, file: !37, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !38, file: !37, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !38, file: !37, line: 25, baseType: !33, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !20, line: 42, baseType: !18, size: 64, align: 64, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !13, file: !12, line: 28, baseType: !30, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !13, file: !12, line: 29, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !49, line: 36, baseType: !50)
!49 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvList/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !49, line: 37, size: 128, align: 64, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !50, file: !49, line: 45, baseType: !4, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !50, file: !49, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !50, file: !49, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !13, file: !12, line: 30, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !13, file: !12, line: 31, baseType: !9, size: 32, align: 32, offset: 320)
!59 = !{!60, !61}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvlist", arg: 1, scope: !6, file: !1, line: 18, type: !10)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !6, file: !1, line: 19, type: !9)
!62 = !DISubprogram(name: "ChvList_isCountZero", scope: !1, file: !1, line: 42, type: !7, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ChvList*, i32)* @ChvList_isCountZero, variables: !63)
!63 = !{!64, !65}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvlist", arg: 1, scope: !62, file: !1, line: 43, type: !10)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !62, file: !1, line: 44, type: !9)
!66 = !DISubprogram(name: "ChvList_addObjectToList", scope: !1, file: !1, line: 74, type: !67, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ChvList*, %struct._Chv*, i32)* @ChvList_addObjectToList, variables: !69)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !10, !18, !9}
!69 = !{!70, !71, !72}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvlist", arg: 1, scope: !66, file: !1, line: 75, type: !10)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 2, scope: !66, file: !1, line: 76, type: !18)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 3, scope: !66, file: !1, line: 77, type: !9)
!73 = !DISubprogram(name: "ChvList_getList", scope: !1, file: !1, line: 146, type: !74, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Chv* (%struct._ChvList*, i32)* @ChvList_getList, variables: !76)
!74 = !DISubroutineType(types: !75)
!75 = !{!18, !10, !9}
!76 = !{!77, !78, !79}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvlist", arg: 1, scope: !73, file: !1, line: 147, type: !10)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !73, file: !1, line: 148, type: !9)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv", scope: !73, file: !1, line: 150, type: !18)
!80 = !{i32 2, !"Dwarf Version", i32 2}
!81 = !{i32 2, !"Debug Info Version", i32 700000003}
!82 = !{i32 1, !"PIC Level", i32 2}
!83 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!84 = !DIExpression()
!85 = !DILocation(line: 18, column: 15, scope: !6)
!86 = !DILocation(line: 19, column: 14, scope: !6)
!87 = !DILocation(line: 26, column: 14, scope: !88)
!88 = distinct !DILexicalBlock(scope: !6, file: !1, line: 26, column: 6)
!89 = !DILocation(line: 26, column: 31, scope: !88)
!90 = !DILocation(line: 26, column: 22, scope: !88)
!91 = !DILocation(line: 26, column: 56, scope: !88)
!92 = !{!93, !94, i64 0}
!93 = !{!"_ChvList", !94, i64 0, !97, i64 8, !97, i64 16, !97, i64 24, !97, i64 32, !94, i64 40}
!94 = !{!"int", !95, i64 0}
!95 = !{!"omnipotent char", !96, i64 0}
!96 = !{!"Simple C/C++ TBAA"}
!97 = !{!"any pointer", !95, i64 0}
!98 = !DILocation(line: 26, column: 44, scope: !88)
!99 = !DILocation(line: 26, column: 6, scope: !6)
!100 = !DILocation(line: 27, column: 12, scope: !101)
!101 = distinct !DILexicalBlock(scope: !88, file: !1, line: 26, column: 64)
!102 = !{!97, !97, i64 0}
!103 = !DILocation(line: 27, column: 4, scope: !101)
!104 = !DILocation(line: 29, column: 1, scope: !101)
!105 = !DILocation(line: 30, column: 8, scope: !6)
!106 = !DILocation(line: 30, column: 17, scope: !6)
!107 = !{!93, !97, i64 8}
!108 = !DILocation(line: 30, column: 30, scope: !6)
!109 = !DILocation(line: 30, column: 1, scope: !6)
!110 = !DILocation(line: 43, column: 15, scope: !62)
!111 = !DILocation(line: 44, column: 14, scope: !62)
!112 = !DILocation(line: 51, column: 14, scope: !113)
!113 = distinct !DILexicalBlock(scope: !62, file: !1, line: 51, column: 6)
