; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvManager/src/ChvManager_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }
%struct._ChvManager = type { %struct._Chv*, %struct._Lock*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._Lock = type { i8*, i32, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [70 x i8] c"\0A fatal error in ChvMananger_newObjectOfSizeNbytes(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [62 x i8] c"\0A fatal error in ChvMananger_releaseObject(%p,%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [68 x i8] c"\0A fatal error in ChvManager_releaseListOfObjects(%p,%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define %struct._Chv* @ChvManager_newObjectOfSizeNbytes(%struct._ChvManager* %manager, i32 %nbytesNeeded) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvManager/src/ChvManager_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !68, !78}
!6 = !DISubprogram(name: "ChvManager_newObjectOfSizeNbytes", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Chv* (%struct._ChvManager*, i32)* @ChvManager_newObjectOfSizeNbytes, variables: !61)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !37, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvManager/src/../../Chv/Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !11, line: 31, size: 640, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !12, file: !11, line: 37, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvManager/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 42, baseType: !9, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChvManager", file: !39, line: 9, baseType: !40)
!39 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvManager/src/../ChvManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ChvManager", file: !39, line: 10, size: 448, align: 64, elements: !41)
!41 = !{!42, !43, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !40, file: !39, line: 11, baseType: !9, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !40, file: !39, line: 12, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !46, line: 36, baseType: !47)
!46 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ChvManager/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !46, line: 37, size: 128, align: 64, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !47, file: !46, line: 45, baseType: !4, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !47, file: !46, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !47, file: !46, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !40, file: !39, line: 13, baseType: !15, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !40, file: !39, line: 14, baseType: !15, size: 32, align: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !40, file: !39, line: 15, baseType: !15, size: 32, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !40, file: !39, line: 16, baseType: !15, size: 32, align: 32, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !40, file: !39, line: 17, baseType: !15, size: 32, align: 32, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !40, file: !39, line: 18, baseType: !15, size: 32, align: 32, offset: 288)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !40, file: !39, line: 19, baseType: !15, size: 32, align: 32, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !40, file: !39, line: 20, baseType: !15, size: 32, align: 32, offset: 352)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !40, file: !39, line: 21, baseType: !15, size: 32, align: 32, offset: 384)
!61 = !{!62, !63, !64, !65, !66, !67}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 1, scope: !6, file: !1, line: 18, type: !37)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbytesNeeded", arg: 2, scope: !6, file: !1, line: 19, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv", scope: !6, file: !1, line: 21, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !6, file: !1, line: 21, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytesAvailable", scope: !6, file: !1, line: 22, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newinstance", scope: !6, file: !1, line: 22, type: !15)
!68 = !DISubprogram(name: "ChvManager_releaseObject", scope: !1, file: !1, line: 146, type: !69, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ChvManager*, %struct._Chv*)* @ChvManager_releaseObject, variables: !71)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !37, !9}
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 1, scope: !68, file: !1, line: 147, type: !37)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv1", arg: 2, scope: !68, file: !1, line: 148, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv2", scope: !68, file: !1, line: 150, type: !9)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !68, file: !1, line: 150, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes1", scope: !68, file: !1, line: 151, type: !15)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes2", scope: !68, file: !1, line: 151, type: !15)
!78 = !DISubprogram(name: "ChvManager_releaseListOfObjects", scope: !1, file: !1, line: 242, type: !69, isLocal: false, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ChvManager*, %struct._Chv*)* @ChvManager_releaseListOfObjects, variables: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 1, scope: !78, file: !1, line: 243, type: !37)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 2, scope: !78, file: !1, line: 244, type: !9)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv1", scope: !78, file: !1, line: 246, type: !9)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv2", scope: !78, file: !1, line: 246, type: !9)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !78, file: !1, line: 246, type: !9)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes1", scope: !78, file: !1, line: 247, type: !15)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes2", scope: !78, file: !1, line: 247, type: !15)
!87 = !{i32 2, !"Dwarf Version", i32 2}
!88 = !{i32 2, !"Debug Info Version", i32 700000003}
!89 = !{i32 1, !"PIC Level", i32 2}
!90 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!91 = !DIExpression()
!92 = !DILocation(line: 18, column: 18, scope: !6)
!93 = !DILocation(line: 19, column: 17, scope: !6)
!94 = !DILocation(line: 28, column: 14, scope: !95)
!95 = distinct !DILexicalBlock(scope: !6, file: !1, line: 28, column: 6)
!96 = !DILocation(line: 28, column: 38, scope: !95)
!97 = !DILocation(line: 28, column: 22, scope: !95)
!98 = !DILocation(line: 29, column: 12, scope: !99)
!99 = distinct !DILexicalBlock(scope: !95, file: !1, line: 28, column: 45)
!100 = !{!101, !101, i64 0}
!101 = !{!"any pointer", !102, i64 0}
!102 = !{!"omnipotent char", !103, i64 0}
!103 = !{!"Simple C/C++ TBAA"}
!104 = !DILocation(line: 29, column: 4, scope: !99)
!105 = !DILocation(line: 32, column: 4, scope: !99)
!106 = !DILocation(line: 38, column: 15, scope: !107)
