; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_permute.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._DenseMtx = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._DenseMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [57 x i8] c"\0A fatal error in DenseMtx_permuteRows(%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [70 x i8] c"\0A fatal error in DenseMtx_permuteRows(%p,%p)\0A irow = %d, maxnrow = %d\00", align 1
@.str2 = private unnamed_addr constant [60 x i8] c"\0A fatal error in DenseMtx_permuteColumns(%p,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [73 x i8] c"\0A fatal error in DenseMtx_permuteColumns(%p,%p)\0A jcol = %d, maxncol = %d\00", align 1

; Function Attrs: nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_permute.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !68}
!6 = !DISubprogram(name: "DenseMtx_permuteRows", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, %struct._IV*)* @DenseMtx_permuteRows, variables: !47)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !38}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "DenseMtx", file: !11, line: 28, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../DenseMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DenseMtx", file: !11, line: 29, size: 704, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !24, !25, !28, !37}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 30, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !12, file: !11, line: 31, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 37, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 38, baseType: !23, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 39, baseType: !26, size: 64, align: 64, offset: 384)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 40, baseType: !29, size: 192, align: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !30, line: 20, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !30, line: 21, size: 192, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !31, file: !30, line: 22, baseType: !15, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !31, file: !30, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !31, file: !30, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !31, file: !30, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 41, baseType: !9, size: 64, align: 64, offset: 640)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !40, line: 20, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !40, line: 21, size: 192, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !41, file: !40, line: 22, baseType: !15, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !41, file: !40, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !41, file: !40, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !41, file: !40, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!47 = !{!48, !49, !50, !62, !63, !64, !65, !66, !67}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !6, file: !1, line: 15, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldToNewIV", arg: 2, scope: !6, file: !1, line: 16, type: !38)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !6, file: !1, line: 18, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !52, line: 49, baseType: !53)
!52 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../A2/A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !52, line: 41, size: 256, align: 64, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !52, line: 42, baseType: !15, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !53, file: !52, line: 43, baseType: !15, size: 32, align: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !53, file: !52, line: 44, baseType: !15, size: 32, align: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !53, file: !52, line: 45, baseType: !15, size: 32, align: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !53, file: !52, line: 46, baseType: !15, size: 32, align: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !53, file: !52, line: 47, baseType: !15, size: 32, align: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !53, file: !52, line: 48, baseType: !26, size: 64, align: 64, offset: 192)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 19, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !6, file: !1, line: 19, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxnrow", scope: !6, file: !1, line: 19, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !6, file: !1, line: 19, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldToNew", scope: !6, file: !1, line: 20, type: !23)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !6, file: !1, line: 20, type: !23)
!68 = !DISubprogram(name: "DenseMtx_permuteColumns", scope: !1, file: !1, line: 71, type: !7, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, %struct._IV*)* @DenseMtx_permuteColumns, variables: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !68, file: !1, line: 72, type: !9)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldToNewIV", arg: 2, scope: !68, file: !1, line: 73, type: !38)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !68, file: !1, line: 75, type: !51)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !68, file: !1, line: 76, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !68, file: !1, line: 76, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxncol", scope: !68, file: !1, line: 76, type: !15)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !68, file: !1, line: 76, type: !15)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldToNew", scope: !68, file: !1, line: 77, type: !23)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !68, file: !1, line: 77, type: !23)
!79 = !{i32 2, !"Dwarf Version", i32 2}
!80 = !{i32 2, !"Debug Info Version", i32 700000003}
!81 = !{i32 1, !"PIC Level", i32 2}
!82 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!83 = !DIExpression()
!84 = !DILocation(line: 15, column: 16, scope: !6)
!85 = !DILocation(line: 16, column: 16, scope: !6)
!86 = !DILocation(line: 26, column: 10, scope: !87)
!87 = distinct !DILexicalBlock(scope: !6, file: !1, line: 26, column: 6)
!88 = !DILocation(line: 26, column: 32, scope: !87)
!89 = !DILocation(line: 26, column: 18, scope: !87)
!90 = !DILocation(line: 27, column: 12, scope: !91)
!91 = distinct !DILexicalBlock(scope: !87, file: !1, line: 26, column: 42)
!92 = !{!93, !93, i64 0}
!93 = !{!"any pointer", !94, i64 0}
!94 = !{!"omnipotent char", !95, i64 0}
!95 = !{!"Simple C/C++ TBAA"}
!96 = !DILocation(line: 27, column: 4, scope: !91)
!97 = !DILocation(line: 29, column: 4, scope: !91)
!98 = !DILocation(line: 19, column: 26, scope: !6)
!99 = !DILocation(line: 20, column: 19, scope: !6)
!100 = !DILocation(line: 31, column: 1, scope: !6)
!101 = !DILocation(line: 32, column: 6, scope: !102)
!102 = distinct !DILexicalBlock(scope: !6, file: !1, line: 32, column: 6)
!103 = !{!104, !104, i64 0}
!104 = !{!"int", !94, i64 0}
!105 = !DILocation(line: 32, column: 11, scope: !102)
!106 = !DILocation(line: 32, column: 6, scope: !6)
!107 = !DILocation(line: 19, column: 17, scope: !6)
!108 = !DILocation(line: 20, column: 8, scope: !6)
!109 = !DILocation(line: 40, column: 1, scope: !6)
!110 = !DILocation(line: 19, column: 7, scope: !6)
!111 = !DILocation(line: 41, column: 21, scope: !112)
!112 = distinct !DILexicalBlock(scope: !113, file: !1, line: 41, column: 1)
!113 = distinct !DILexicalBlock(scope: !6, file: !1, line: 41, column: 1)
!114 = !DILocation(line: 41, column: 19, scope: !112)
!115 = !DILocation(line: 41, column: 1, scope: !113)
!116 = !DILocation(line: 42, column: 11, scope: !117)
