; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._DenseMtx = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._DenseMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }
%struct._Drand = type { double, double, double, double, double, double, double, double, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [47 x i8] c"\0A fatal error in DenseMtx_sort(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [59 x i8] c"\0A fatal error in DenseMtx_copyRow(%p,%d,%p,%d)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [58 x i8] c"\0A fatal error in DenseMtx_addRow(%p,%d,%p,%d)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [47 x i8] c"\0A fatal error in DenseMtx_zero(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !59, !75, !81, !95, !98, !118, !131, !138, !144, !161, !176}
!6 = !DISubprogram(name: "DenseMtx_sort", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*)* @DenseMtx_sort, variables: !38)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "DenseMtx", file: !11, line: 28, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../DenseMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DenseMtx", file: !11, line: 29, size: 704, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !24, !25, !28, !37}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 30, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !12, file: !11, line: 31, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 37, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 38, baseType: !23, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 39, baseType: !26, size: 64, align: 64, offset: 384)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 40, baseType: !29, size: 192, align: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !30, line: 20, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !30, line: 21, size: 192, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !31, file: !30, line: 22, baseType: !15, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !31, file: !30, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !31, file: !30, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !31, file: !30, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 41, baseType: !9, size: 64, align: 64, offset: 640)
!38 = !{!39, !40, !52, !53, !54, !55, !56, !57, !58}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !6, file: !1, line: 18, type: !9)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !6, file: !1, line: 20, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !42, line: 49, baseType: !43)
!42 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../A2/A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !42, line: 41, size: 256, align: 64, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50, !51}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !42, line: 42, baseType: !15, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !43, file: !42, line: 43, baseType: !15, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !43, file: !42, line: 44, baseType: !15, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !43, file: !42, line: 45, baseType: !15, size: 32, align: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !43, file: !42, line: 46, baseType: !15, size: 32, align: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !43, file: !42, line: 47, baseType: !15, size: 32, align: 32, offset: 160)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !43, file: !42, line: 48, baseType: !26, size: 64, align: 64, offset: 192)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 21, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !6, file: !1, line: 21, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !6, file: !1, line: 21, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sortColumns", scope: !6, file: !1, line: 21, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sortRows", scope: !6, file: !1, line: 21, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !6, file: !1, line: 22, type: !23)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !6, file: !1, line: 22, type: !23)
!59 = !DISubprogram(name: "DenseMtx_copyRow", scope: !1, file: !1, line: 73, type: !60, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32, %struct._DenseMtx*, i32)* @DenseMtx_copyRow, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !9, !15, !9, !15}
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxB", arg: 1, scope: !59, file: !1, line: 74, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irowB", arg: 2, scope: !59, file: !1, line: 75, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 3, scope: !59, file: !1, line: 76, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irowA", arg: 4, scope: !59, file: !1, line: 77, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowA", scope: !59, file: !1, line: 79, type: !26)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowB", scope: !59, file: !1, line: 79, type: !26)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !59, file: !1, line: 80, type: !15)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2A", scope: !59, file: !1, line: 80, type: !15)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2B", scope: !59, file: !1, line: 80, type: !15)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iA", scope: !59, file: !1, line: 80, type: !15)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iB", scope: !59, file: !1, line: 80, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !59, file: !1, line: 80, type: !15)
!75 = !DISubprogram(name: "DenseMtx_copyRowAndIndex", scope: !1, file: !1, line: 124, type: !60, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32, %struct._DenseMtx*, i32)* @DenseMtx_copyRowAndIndex, variables: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxB", arg: 1, scope: !75, file: !1, line: 125, type: !9)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irowB", arg: 2, scope: !75, file: !1, line: 126, type: !15)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 3, scope: !75, file: !1, line: 127, type: !9)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irowA", arg: 4, scope: !75, file: !1, line: 128, type: !15)
!81 = !DISubprogram(name: "DenseMtx_addRow", scope: !1, file: !1, line: 156, type: !60, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32, %struct._DenseMtx*, i32)* @DenseMtx_addRow, variables: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxB", arg: 1, scope: !81, file: !1, line: 157, type: !9)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irowB", arg: 2, scope: !81, file: !1, line: 158, type: !15)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 3, scope: !81, file: !1, line: 159, type: !9)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irowA", arg: 4, scope: !81, file: !1, line: 160, type: !15)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowA", scope: !81, file: !1, line: 162, type: !26)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowB", scope: !81, file: !1, line: 162, type: !26)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !81, file: !1, line: 163, type: !15)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2A", scope: !81, file: !1, line: 163, type: !15)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2B", scope: !81, file: !1, line: 163, type: !15)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iA", scope: !81, file: !1, line: 163, type: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iB", scope: !81, file: !1, line: 163, type: !15)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !81, file: !1, line: 163, type: !15)
!95 = !DISubprogram(name: "DenseMtx_zero", scope: !1, file: !1, line: 203, type: !7, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*)* @DenseMtx_zero, variables: !96)
!96 = !{!97}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !95, file: !1, line: 204, type: !9)
!98 = !DISubprogram(name: "DenseMtx_fillRandomEntries", scope: !1, file: !1, line: 232, type: !99, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, %struct._Drand*)* @DenseMtx_fillRandomEntries, variables: !115)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !9, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drand", file: !103, line: 27, baseType: !104)
!103 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../Drand/Drand.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Drand", file: !103, line: 17, size: 576, align: 64, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !104, file: !103, line: 18, baseType: !27, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !104, file: !103, line: 19, baseType: !27, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "base1", scope: !104, file: !103, line: 20, baseType: !27, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !104, file: !103, line: 21, baseType: !27, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !104, file: !103, line: 22, baseType: !27, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !104, file: !103, line: 23, baseType: !27, size: 64, align: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !104, file: !103, line: 24, baseType: !27, size: 64, align: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !104, file: !103, line: 25, baseType: !27, size: 64, align: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !104, file: !103, line: 26, baseType: !15, size: 32, align: 32, offset: 512)
!115 = !{!116, !117}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !98, file: !1, line: 233, type: !9)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "drand", arg: 2, scope: !98, file: !1, line: 234, type: !101)
!118 = !DISubprogram(name: "DenseMtx_checksums", scope: !1, file: !1, line: 265, type: !119, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, double*)* @DenseMtx_checksums, variables: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !9, !26}
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !118, file: !1, line: 266, type: !9)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sums", arg: 2, scope: !118, file: !1, line: 267, type: !26)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !118, file: !1, line: 269, type: !26)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !118, file: !1, line: 270, type: !15)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !118, file: !1, line: 270, type: !15)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !118, file: !1, line: 270, type: !15)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !118, file: !1, line: 270, type: !15)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !118, file: !1, line: 271, type: !23)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !118, file: !1, line: 271, type: !23)
!131 = !DISubprogram(name: "DenseMtx_maxabs", scope: !1, file: !1, line: 313, type: !132, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._DenseMtx*)* @DenseMtx_maxabs, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{!27, !9}
!134 = !{!135, !136, !137}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !131, file: !1, line: 314, type: !9)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxabs", scope: !131, file: !1, line: 316, type: !27)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !131, file: !1, line: 317, type: !15)
!138 = !DISubprogram(name: "DenseMtx_sub", scope: !1, file: !1, line: 348, type: !139, isLocal: false, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, %struct._DenseMtx*)* @DenseMtx_sub, variables: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !9, !9}
!141 = !{!142, !143}
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxB", arg: 1, scope: !138, file: !1, line: 349, type: !9)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 2, scope: !138, file: !1, line: 350, type: !9)
!144 = !DISubprogram(name: "DenseMtx_copyRowIntoVector", scope: !1, file: !1, line: 410, type: !145, isLocal: false, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32, double*)* @DenseMtx_copyRowIntoVector, variables: !147)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !9, !15, !26}
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !144, file: !1, line: 411, type: !9)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 2, scope: !144, file: !1, line: 412, type: !15)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 3, scope: !144, file: !1, line: 413, type: !26)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !144, file: !1, line: 415, type: !26)
