; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._DenseMtx = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._DenseMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [51 x i8] c"\0A error in DenseMtx_readFromFile(%p,%s)\0A bad input\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [59 x i8] c"\0A error in DenseMtx_readFromFile()\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [107 x i8] c"\0A error in DenseMtx_readFromFile()\0A bad DenseMtx file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str5 = private unnamed_addr constant [60 x i8] c"\0A error in DenseMtx_readFromFormattedFile(%p,%p)\0A bad input\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !9, globals: !184, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !{!10, !107, !119, !126, !133, !138, !143, !147, !168}
!10 = !DISubprogram(name: "DenseMtx_readFromFile", scope: !1, file: !1, line: 23, type: !11, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, i8*)* @DenseMtx_readFromFile, variables: !40)
!11 = !DISubroutineType(types: !12)
!12 = !{!8, !13, !5}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "DenseMtx", file: !15, line: 28, baseType: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../DenseMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DenseMtx", file: !15, line: 29, size: 704, align: 64, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !30, !39}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, file: !15, line: 30, baseType: !8, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !16, file: !15, line: 31, baseType: !8, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !16, file: !15, line: 32, baseType: !8, size: 32, align: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !16, file: !15, line: 33, baseType: !8, size: 32, align: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !16, file: !15, line: 34, baseType: !8, size: 32, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !16, file: !15, line: 35, baseType: !8, size: 32, align: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !16, file: !15, line: 36, baseType: !8, size: 32, align: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !16, file: !15, line: 37, baseType: !7, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !16, file: !15, line: 38, baseType: !7, size: 64, align: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !15, line: 39, baseType: !28, size: 64, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !16, file: !15, line: 40, baseType: !31, size: 192, align: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !32, line: 20, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !32, line: 21, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 22, baseType: !8, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !33, file: !32, line: 23, baseType: !8, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !33, file: !32, line: 24, baseType: !8, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !33, file: !32, line: 25, baseType: !28, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !16, file: !15, line: 41, baseType: !13, size: 64, align: 64, offset: 640)
!40 = !{!41, !42, !43, !104, !105, !106}
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !10, file: !1, line: 24, type: !13)
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !10, file: !1, line: 25, type: !5)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !10, file: !1, line: 27, type: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !46, line: 153, baseType: !47)
!46 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !46, line: 122, size: 1216, align: 64, elements: !48)
!48 = !{!49, !52, !53, !54, !56, !57, !62, !63, !64, !68, !72, !82, !88, !89, !92, !93, !97, !101, !102, !103}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !47, file: !46, line: 123, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !47, file: !46, line: 124, baseType: !8, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !47, file: !46, line: 125, baseType: !8, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !46, line: 126, baseType: !55, size: 16, align: 16, offset: 128)
!55 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !47, file: !46, line: 127, baseType: !55, size: 16, align: 16, offset: 144)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !47, file: !46, line: 128, baseType: !58, size: 128, align: 64, offset: 192)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !46, line: 88, size: 128, align: 64, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !58, file: !46, line: 89, baseType: !50, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !58, file: !46, line: 90, baseType: !8, size: 32, align: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !47, file: !46, line: 129, baseType: !8, size: 32, align: 32, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !47, file: !46, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !47, file: !46, line: 133, baseType: !65, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!8, !4}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !47, file: !46, line: 134, baseType: !69, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!8, !4, !5, !8}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !47, file: !46, line: 135, baseType: !73, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !4, !76, !8}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !46, line: 77, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !78, line: 71, baseType: !79)
!78 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !80, line: 46, baseType: !81)
!80 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!81 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !47, file: !46, line: 136, baseType: !83, size: 64, align: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!8, !4, !86, !8}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !47, file: !46, line: 139, baseType: !58, size: 128, align: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !47, file: !46, line: 140, baseType: !90, size: 64, align: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !46, line: 94, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !47, file: !46, line: 141, baseType: !8, size: 32, align: 32, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !47, file: !46, line: 144, baseType: !94, size: 24, align: 8, offset: 928)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 24, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 3)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !47, file: !46, line: 145, baseType: !98, size: 8, align: 8, offset: 952)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !47, file: !46, line: 148, baseType: !58, size: 128, align: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !47, file: !46, line: 151, baseType: !8, size: 32, align: 32, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !46, line: 152, baseType: !76, size: 64, align: 64, offset: 1152)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !10, file: !1, line: 28, type: !8)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !10, file: !1, line: 28, type: !8)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !10, file: !1, line: 28, type: !8)
!107 = !DISubprogram(name: "DenseMtx_readFromFormattedFile", scope: !1, file: !1, line: 91, type: !108, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, %struct.__sFILE*)* @DenseMtx_readFromFormattedFile, variables: !110)
!108 = !DISubroutineType(types: !109)
!109 = !{!8, !13, !44}
!110 = !{!111, !112, !113, !114, !115}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !107, file: !1, line: 92, type: !13)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !107, file: !1, line: 93, type: !44)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !107, file: !1, line: 95, type: !8)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !107, file: !1, line: 95, type: !8)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !107, file: !1, line: 96, type: !116)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 224, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 7)
!119 = !DISubprogram(name: "DenseMtx_readFromBinaryFile", scope: !1, file: !1, line: 188, type: !108, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, %struct.__sFILE*)* @DenseMtx_readFromBinaryFile, variables: !120)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !119, file: !1, line: 189, type: !13)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !119, file: !1, line: 190, type: !44)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !119, file: !1, line: 192, type: !8)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !119, file: !1, line: 192, type: !8)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !119, file: !1, line: 193, type: !116)
!126 = !DISubprogram(name: "DenseMtx_writeToFile", scope: !1, file: !1, line: 299, type: !11, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, i8*)* @DenseMtx_writeToFile, variables: !127)
!127 = !{!128, !129, !130, !131, !132}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !126, file: !1, line: 300, type: !13)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !126, file: !1, line: 301, type: !5)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !126, file: !1, line: 303, type: !44)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !126, file: !1, line: 304, type: !8)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !126, file: !1, line: 304, type: !8)
!133 = !DISubprogram(name: "DenseMtx_writeToFormattedFile", scope: !1, file: !1, line: 382, type: !108, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, %struct.__sFILE*)* @DenseMtx_writeToFormattedFile, variables: !134)
!134 = !{!135, !136, !137}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !133, file: !1, line: 383, type: !13)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !133, file: !1, line: 384, type: !44)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !133, file: !1, line: 386, type: !8)
!138 = !DISubprogram(name: "DenseMtx_writeToBinaryFile", scope: !1, file: !1, line: 430, type: !108, isLocal: false, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, %struct.__sFILE*)* @DenseMtx_writeToBinaryFile, variables: !139)
!139 = !{!140, !141, !142}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !138, file: !1, line: 431, type: !13)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !138, file: !1, line: 432, type: !44)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !138, file: !1, line: 434, type: !8)
!143 = !DISubprogram(name: "DenseMtx_writeStats", scope: !1, file: !1, line: 483, type: !108, isLocal: false, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, %struct.__sFILE*)* @DenseMtx_writeStats, variables: !144)
!144 = !{!145, !146}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !143, file: !1, line: 484, type: !13)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !143, file: !1, line: 485, type: !44)
!147 = !DISubprogram(name: "DenseMtx_writeForHumanEye", scope: !1, file: !1, line: 548, type: !108, isLocal: false, isDefinition: true, scopeLine: 551, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, %struct.__sFILE*)* @DenseMtx_writeForHumanEye, variables: !148)
!148 = !{!149, !150, !151, !163, !164, !165, !166, !167}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !147, file: !1, line: 549, type: !13)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !147, file: !1, line: 550, type: !44)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !147, file: !1, line: 552, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !153, line: 49, baseType: !154)
!153 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../A2/A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !153, line: 41, size: 256, align: 64, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !154, file: !153, line: 42, baseType: !8, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !154, file: !153, line: 43, baseType: !8, size: 32, align: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !154, file: !153, line: 44, baseType: !8, size: 32, align: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !154, file: !153, line: 45, baseType: !8, size: 32, align: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !154, file: !153, line: 46, baseType: !8, size: 32, align: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !154, file: !153, line: 47, baseType: !8, size: 32, align: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !154, file: !153, line: 48, baseType: !28, size: 64, align: 64, offset: 192)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !147, file: !1, line: 553, type: !8)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !147, file: !1, line: 553, type: !8)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !147, file: !1, line: 553, type: !8)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !147, file: !1, line: 554, type: !7)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !147, file: !1, line: 554, type: !7)
!168 = !DISubprogram(name: "DenseMtx_writeForMatlab", scope: !1, file: !1, line: 603, type: !169, isLocal: false, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*, i8*, %struct.__sFILE*)* @DenseMtx_writeForMatlab, variables: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!8, !13, !5, !44}
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !168, file: !1, line: 604, type: !13)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxname", arg: 2, scope: !168, file: !1, line: 605, type: !5)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 3, scope: !168, file: !1, line: 606, type: !44)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !168, file: !1, line: 608, type: !28)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !168, file: !1, line: 609, type: !8)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !168, file: !1, line: 609, type: !8)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !168, file: !1, line: 609, type: !8)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !168, file: !1, line: 609, type: !8)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !168, file: !1, line: 609, type: !8)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !168, file: !1, line: 609, type: !8)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !168, file: !1, line: 610, type: !7)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !168, file: !1, line: 610, type: !7)
!184 = !{!185, !186}
!185 = !DIGlobalVariable(name: "suffixb", scope: !0, file: !1, line: 5, type: !86, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariable(name: "suffixf", scope: !0, file: !1, line: 6, type: !86, isLocal: true, isDefinition: true)
!187 = !{i32 2, !"Dwarf Version", i32 2}
!188 = !{i32 2, !"Debug Info Version", i32 700000003}
!189 = !{i32 1, !"PIC Level", i32 2}
!190 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!191 = !DIExpression()
!192 = !DILocation(line: 24, column: 16, scope: !10)
!193 = !DILocation(line: 25, column: 16, scope: !10)
!194 = !DILocation(line: 28, column: 18, scope: !10)
!195 = !DILocation(line: 34, column: 10, scope: !196)
!196 = distinct !DILexicalBlock(scope: !10, file: !1, line: 34, column: 6)
!197 = !DILocation(line: 34, column: 24, scope: !196)
!198 = !DILocation(line: 34, column: 18, scope: !196)
!199 = !DILocation(line: 35, column: 12, scope: !200)
!200 = distinct !DILexicalBlock(scope: !196, file: !1, line: 34, column: 34)
!201 = !{!202, !202, i64 0}
!202 = !{!"any pointer", !203, i64 0}
!203 = !{!"omnipotent char", !204, i64 0}
!204 = !{!"Simple C/C++ TBAA"}
!205 = !DILocation(line: 35, column: 4, scope: !200)
!206 = !DILocation(line: 37, column: 4, scope: !200)
!207 = !DILocation(line: 44, column: 12, scope: !10)
!208 = !DILocation(line: 28, column: 8, scope: !10)
!209 = !DILocation(line: 28, column: 26, scope: !10)
!210 = !DILocation(line: 46, column: 15, scope: !211)
!211 = distinct !DILexicalBlock(scope: !10, file: !1, line: 46, column: 6)
