; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_instance.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._DenseMtx = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._DenseMtx* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [48 x i8] c"\0A fatal error in DenseMtx_rowid(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [48 x i8] c"\0A fatal error in DenseMtx_colid(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [59 x i8] c"\0A fatal error in DenseMtx_dimensions(%p,%p,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [55 x i8] c"\0A fatal error in DenseMtx_rowIncrement(%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [58 x i8] c"\0A fatal error in DenseMtx_columnIncrement(%p)\0A bad input\0A\00", align 1
@.str5 = private unnamed_addr constant [59 x i8] c"\0A fatal error in DenseMtx_rowIndices(%p,%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_instance.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !40, !43, !50, !53, !56, !64, !69, !74, !79, !87, !97, !105, !115, !123}
!6 = !DISubprogram(name: "DenseMtx_rowid", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*)* @DenseMtx_rowid, variables: !38)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "DenseMtx", file: !12, line: 28, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../DenseMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DenseMtx", file: !12, line: 29, size: 704, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !24, !25, !28, !37}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 30, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !13, file: !12, line: 31, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !13, file: !12, line: 32, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !13, file: !12, line: 33, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !13, file: !12, line: 34, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !13, file: !12, line: 35, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !13, file: !12, line: 36, baseType: !9, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !13, file: !12, line: 37, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !13, file: !12, line: 38, baseType: !23, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 39, baseType: !26, size: 64, align: 64, offset: 384)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !13, file: !12, line: 40, baseType: !29, size: 192, align: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !30, line: 20, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !30, line: 21, size: 192, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !31, file: !30, line: 22, baseType: !9, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !31, file: !30, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !31, file: !30, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !31, file: !30, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !12, line: 41, baseType: !10, size: 64, align: 64, offset: 640)
!38 = !{!39}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !6, file: !1, line: 15, type: !10)
!40 = !DISubprogram(name: "DenseMtx_colid", scope: !1, file: !1, line: 38, type: !7, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*)* @DenseMtx_colid, variables: !41)
!41 = !{!42}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !40, file: !1, line: 39, type: !10)
!43 = !DISubprogram(name: "DenseMtx_dimensions", scope: !1, file: !1, line: 62, type: !44, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32*, i32*)* @DenseMtx_dimensions, variables: !46)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !10, !23, !23}
!46 = !{!47, !48, !49}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !43, file: !1, line: 63, type: !10)
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnrow", arg: 2, scope: !43, file: !1, line: 64, type: !23)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pncol", arg: 3, scope: !43, file: !1, line: 65, type: !23)
!50 = !DISubprogram(name: "DenseMtx_rowIncrement", scope: !1, file: !1, line: 91, type: !7, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*)* @DenseMtx_rowIncrement, variables: !51)
!51 = !{!52}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !50, file: !1, line: 92, type: !10)
!53 = !DISubprogram(name: "DenseMtx_columnIncrement", scope: !1, file: !1, line: 115, type: !7, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*)* @DenseMtx_columnIncrement, variables: !54)
!54 = !{!55}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !53, file: !1, line: 116, type: !10)
!56 = !DISubprogram(name: "DenseMtx_rowIndices", scope: !1, file: !1, line: 139, type: !57, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32*, i32**)* @DenseMtx_rowIndices, variables: !60)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !10, !23, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!60 = !{!61, !62, !63}
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !56, file: !1, line: 140, type: !10)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnrow", arg: 2, scope: !56, file: !1, line: 141, type: !23)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prowind", arg: 3, scope: !56, file: !1, line: 142, type: !59)
!64 = !DISubprogram(name: "DenseMtx_columnIndices", scope: !1, file: !1, line: 168, type: !57, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32*, i32**)* @DenseMtx_columnIndices, variables: !65)
!65 = !{!66, !67, !68}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !64, file: !1, line: 169, type: !10)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pncol", arg: 2, scope: !64, file: !1, line: 170, type: !23)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pcolind", arg: 3, scope: !64, file: !1, line: 171, type: !59)
!69 = !DISubprogram(name: "DenseMtx_entries", scope: !1, file: !1, line: 197, type: !70, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: double* (%struct._DenseMtx*)* @DenseMtx_entries, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{!26, !10}
!72 = !{!73}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !69, file: !1, line: 198, type: !10)
