; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._DenseMtx = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._DenseMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [61 x i8] c"\0A fatal error in DenseMtx_nbytesNeeded(%d,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [63 x i8] c"\0A fatal error in DenseMtx_nbytesNeeded(%d,%d,%d)\0A bad type %d\0A\00", align 1
@.str2 = private unnamed_addr constant [60 x i8] c"\0A fatal error in DenseMtx_nbytesInWorkspace(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [63 x i8] c"\0A fatal error in DenseMtx_setNbytesInWorkspace(%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [70 x i8] c"\0A fatal error in DenseMtx_setFields(%p,%d,%d,%d,%d,%d,%d)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/DenseMtx_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{!8, !18, !50, !56, !70, !81, !87, !102}
!8 = !DISubprogram(name: "DenseMtx_nbytesNeeded", scope: !1, file: !1, line: 16, type: !9, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32)* @DenseMtx_nbytesNeeded, variables: !11)
!9 = !DISubroutineType(types: !10)
!10 = !{!6, !6, !6, !6}
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !8, file: !1, line: 17, type: !6)
!13 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrow", arg: 2, scope: !8, file: !1, line: 18, type: !6)
!14 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncol", arg: 3, scope: !8, file: !1, line: 19, type: !6)
!15 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !8, file: !1, line: 21, type: !6)
!16 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndouble", scope: !8, file: !1, line: 21, type: !6)
!17 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !8, file: !1, line: 21, type: !6)
!18 = !DISubprogram(name: "DenseMtx_nbytesInWorkspace", scope: !1, file: !1, line: 69, type: !19, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DenseMtx*)* @DenseMtx_nbytesInWorkspace, variables: !48)
!19 = !DISubroutineType(types: !20)
!20 = !{!6, !21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "DenseMtx", file: !23, line: 28, baseType: !24)
!23 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../DenseMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DenseMtx", file: !23, line: 29, size: 704, align: 64, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !47}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !24, file: !23, line: 30, baseType: !6, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !24, file: !23, line: 31, baseType: !6, size: 32, align: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !24, file: !23, line: 32, baseType: !6, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !24, file: !23, line: 33, baseType: !6, size: 32, align: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !24, file: !23, line: 34, baseType: !6, size: 32, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !24, file: !23, line: 35, baseType: !6, size: 32, align: 32, offset: 160)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !24, file: !23, line: 36, baseType: !6, size: 32, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !24, file: !23, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !24, file: !23, line: 38, baseType: !5, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !24, file: !23, line: 39, baseType: !36, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !24, file: !23, line: 40, baseType: !39, size: 192, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !40, line: 20, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !40, line: 21, size: 192, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !41, file: !40, line: 22, baseType: !6, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !41, file: !40, line: 23, baseType: !6, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !41, file: !40, line: 24, baseType: !6, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !41, file: !40, line: 25, baseType: !36, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !23, line: 41, baseType: !21, size: 64, align: 64, offset: 640)
!48 = !{!49}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !18, file: !1, line: 70, type: !21)
!50 = !DISubprogram(name: "DenseMtx_setNbytesInWorkspace", scope: !1, file: !1, line: 88, type: !51, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32)* @DenseMtx_setNbytesInWorkspace, variables: !53)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !21, !6}
!53 = !{!54, !55}
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !50, file: !1, line: 89, type: !21)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbytes", arg: 2, scope: !50, file: !1, line: 90, type: !6)
!56 = !DISubprogram(name: "DenseMtx_setFields", scope: !1, file: !1, line: 111, type: !57, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32, i32, i32, i32, i32, i32, i32)* @DenseMtx_setFields, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !21, !6, !6, !6, !6, !6, !6, !6}
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !56, file: !1, line: 112, type: !21)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !56, file: !1, line: 113, type: !6)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowid", arg: 3, scope: !56, file: !1, line: 114, type: !6)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colid", arg: 4, scope: !56, file: !1, line: 115, type: !6)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrow", arg: 5, scope: !56, file: !1, line: 116, type: !6)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncol", arg: 6, scope: !56, file: !1, line: 117, type: !6)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc1", arg: 7, scope: !56, file: !1, line: 118, type: !6)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc2", arg: 8, scope: !56, file: !1, line: 119, type: !6)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dbuffer", scope: !56, file: !1, line: 121, type: !36)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuffer", scope: !56, file: !1, line: 122, type: !5)
!70 = !DISubprogram(name: "DenseMtx_init", scope: !1, file: !1, line: 183, type: !57, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32, i32, i32, i32, i32, i32, i32)* @DenseMtx_init, variables: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !70, file: !1, line: 184, type: !21)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !70, file: !1, line: 185, type: !6)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowid", arg: 3, scope: !70, file: !1, line: 186, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colid", arg: 4, scope: !70, file: !1, line: 187, type: !6)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrow", arg: 5, scope: !70, file: !1, line: 188, type: !6)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncol", arg: 6, scope: !70, file: !1, line: 189, type: !6)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc1", arg: 7, scope: !70, file: !1, line: 190, type: !6)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc2", arg: 8, scope: !70, file: !1, line: 191, type: !6)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !70, file: !1, line: 193, type: !6)
!81 = !DISubprogram(name: "DenseMtx_initFromBuffer", scope: !1, file: !1, line: 250, type: !82, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*)* @DenseMtx_initFromBuffer, variables: !84)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !21}
!84 = !{!85, !86}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !81, file: !1, line: 251, type: !21)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuffer", scope: !81, file: !1, line: 253, type: !5)
!87 = !DISubprogram(name: "DenseMtx_initWithPointers", scope: !1, file: !1, line: 279, type: !88, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, double*)* @DenseMtx_initWithPointers, variables: !90)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !21, !6, !6, !6, !6, !6, !6, !6, !5, !5, !36}
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !87, file: !1, line: 280, type: !21)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !87, file: !1, line: 281, type: !6)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowid", arg: 3, scope: !87, file: !1, line: 282, type: !6)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colid", arg: 4, scope: !87, file: !1, line: 283, type: !6)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrow", arg: 5, scope: !87, file: !1, line: 284, type: !6)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncol", arg: 6, scope: !87, file: !1, line: 285, type: !6)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc1", arg: 7, scope: !87, file: !1, line: 286, type: !6)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc2", arg: 8, scope: !87, file: !1, line: 287, type: !6)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowind", arg: 9, scope: !87, file: !1, line: 288, type: !5)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colind", arg: 10, scope: !87, file: !1, line: 289, type: !5)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entries", arg: 11, scope: !87, file: !1, line: 290, type: !36)
!102 = !DISubprogram(name: "DenseMtx_setA2", scope: !1, file: !1, line: 353, type: !103, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DenseMtx*, %struct._A2*)* @DenseMtx_setA2, variables: !117)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !21, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !107, line: 49, baseType: !108)
!107 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DenseMtx/src/../../A2/A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !107, line: 41, size: 256, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !107, line: 42, baseType: !6, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !108, file: !107, line: 43, baseType: !6, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !108, file: !107, line: 44, baseType: !6, size: 32, align: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !108, file: !107, line: 45, baseType: !6, size: 32, align: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !108, file: !107, line: 46, baseType: !6, size: 32, align: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !108, file: !107, line: 47, baseType: !6, size: 32, align: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !108, file: !107, line: 48, baseType: !36, size: 64, align: 64, offset: 192)
!117 = !{!118, !119}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !102, file: !1, line: 354, type: !21)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a2", arg: 2, scope: !102, file: !1, line: 355, type: !105)
!120 = !{i32 2, !"Dwarf Version", i32 2}
!121 = !{i32 2, !"Debug Info Version", i32 700000003}
!122 = !{i32 1, !"PIC Level", i32 2}
!123 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!124 = !DIExpression()
!125 = !DILocation(line: 17, column: 10, scope: !8)
!126 = !DILocation(line: 18, column: 10, scope: !8)
!127 = !DILocation(line: 19, column: 10, scope: !8)
!128 = !DILocation(line: 27, column: 16, scope: !129)
!129 = distinct !DILexicalBlock(scope: !8, file: !1, line: 27, column: 7)
!130 = !DILocation(line: 28, column: 12, scope: !131)
!131 = distinct !DILexicalBlock(scope: !129, file: !1, line: 27, column: 30)
!132 = !{!133, !133, i64 0}
!133 = !{!"any pointer", !134, i64 0}
!134 = !{!"omnipotent char", !135, i64 0}
!135 = !{!"Simple C/C++ TBAA"}
!136 = !DILocation(line: 28, column: 4, scope: !131)
!137 = !DILocation(line: 31, column: 4, scope: !131)
!138 = !DILocation(line: 21, column: 24, scope: !8)
!139 = !DILocation(line: 34, column: 6, scope: !8)
!140 = !DILocation(line: 37, column: 15, scope: !141)
!141 = distinct !DILexicalBlock(scope: !142, file: !1, line: 36, column: 39)
!142 = distinct !DILexicalBlock(scope: !143, file: !1, line: 36, column: 13)
!143 = distinct !DILexicalBlock(scope: !8, file: !1, line: 34, column: 6)
!144 = !DILocation(line: 39, column: 12, scope: !145)
!145 = distinct !DILexicalBlock(scope: !142, file: !1, line: 38, column: 8)
!146 = !DILocation(line: 39, column: 4, scope: !145)
!147 = !DILocation(line: 42, column: 4, scope: !145)
!148 = !DILocation(line: 35, column: 18, scope: !149)
!149 = distinct !DILexicalBlock(scope: !143, file: !1, line: 34, column: 29)
!150 = !DILocation(line: 33, column: 17, scope: !8)
!151 = !DILocation(line: 47, column: 20, scope: !152)
!152 = distinct !DILexicalBlock(scope: !153, file: !1, line: 46, column: 47)
!153 = distinct !DILexicalBlock(scope: !154, file: !1, line: 46, column: 13)
!154 = distinct !DILexicalBlock(scope: !8, file: !1, line: 44, column: 6)
!155 = !DILocation(line: 47, column: 24, scope: !152)
!156 = !DILocation(line: 47, column: 27, scope: !152)
!157 = !DILocation(line: 47, column: 37, scope: !152)
!158 = !DILocation(line: 21, column: 7, scope: !8)
!159 = !DILocation(line: 58, column: 1, scope: !8)
!160 = !DILocation(line: 70, column: 16, scope: !18)
!161 = !DILocation(line: 72, column: 10, scope: !162)
!162 = distinct !DILexicalBlock(scope: !18, file: !1, line: 72, column: 6)
!163 = !DILocation(line: 72, column: 6, scope: !18)
!164 = !DILocation(line: 73, column: 12, scope: !165)
!165 = distinct !DILexicalBlock(scope: !162, file: !1, line: 72, column: 20)
!166 = !DILocation(line: 73, column: 4, scope: !165)
!167 = !DILocation(line: 75, column: 4, scope: !165)
!168 = !DILocation(line: 77, column: 40, scope: !18)
!169 = !DILocation(line: 77, column: 23, scope: !18)
!170 = !DILocation(line: 77, column: 22, scope: !18)
!171 = !DILocation(line: 77, column: 1, scope: !18)
!172 = !DILocation(line: 89, column: 16, scope: !50)
!173 = !DILocation(line: 90, column: 15, scope: !50)
!174 = !DILocation(line: 92, column: 10, scope: !175)
!175 = distinct !DILexicalBlock(scope: !50, file: !1, line: 92, column: 6)
!176 = !DILocation(line: 92, column: 6, scope: !50)
!177 = !DILocation(line: 93, column: 12, scope: !178)
!178 = distinct !DILexicalBlock(scope: !175, file: !1, line: 92, column: 20)
!179 = !DILocation(line: 93, column: 4, scope: !178)
!180 = !DILocation(line: 96, column: 4, scope: !178)
!181 = !DILocation(line: 98, column: 18, scope: !50)
!182 = !DILocation(line: 98, column: 25, scope: !50)
!183 = !DILocation(line: 98, column: 31, scope: !50)
