; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Drand/src/Drand_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Drand = type { double, double, double, double, double, double, double, double, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [45 x i8] c"\0A fatal error in Drand_value(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [57 x i8] c"\0A fatal error in Drand_fillZvector(%p,%d,%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [57 x i8] c"\0A fatal error in Drand_fillDvector(%p,%d,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [57 x i8] c"\0A fatal error in Drand_fillIvector(%p,%d,%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define double @Drand_value(%struct._Drand* %drand) #0 {
  tail call void @llvm.dbg.value(metadata %struct._Drand* %drand, i64 0, metadata !26, metadata !57), !dbg !58
  %1 = icmp eq %struct._Drand* %drand, null, !dbg !59
  br i1 %1, label %2, label %5, !dbg !61


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Drand/src/Drand_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{!7, !29, !38, !44}
!7 = !DISubprogram(name: "Drand_value", scope: !1, file: !1, line: 14, type: !8, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._Drand*)* @Drand_value, variables: !25)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drand", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Drand/src/../Drand.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Drand", file: !13, line: 17, size: 576, align: 64, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !14, file: !13, line: 18, baseType: !10, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !14, file: !13, line: 19, baseType: !10, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "base1", scope: !14, file: !13, line: 20, baseType: !10, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !14, file: !13, line: 21, baseType: !10, size: 64, align: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !14, file: !13, line: 22, baseType: !10, size: 64, align: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !14, file: !13, line: 23, baseType: !10, size: 64, align: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !14, file: !13, line: 24, baseType: !10, size: 64, align: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !14, file: !13, line: 25, baseType: !10, size: 64, align: 64, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !14, file: !13, line: 26, baseType: !5, size: 32, align: 32, offset: 512)
!25 = !{!26, !27, !28}
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "drand", arg: 1, scope: !7, file: !1, line: 15, type: !11)
!27 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !7, file: !1, line: 17, type: !10)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !7, file: !1, line: 17, type: !10)
!29 = !DISubprogram(name: "Drand_fillZvector", scope: !1, file: !1, line: 90, type: !30, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Drand*, i32, double*)* @Drand_fillZvector, variables: !33)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !11, !5, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!33 = !{!34, !35, !36, !37}
!34 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "drand", arg: 1, scope: !29, file: !1, line: 91, type: !11)
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !29, file: !1, line: 92, type: !5)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvec", arg: 3, scope: !29, file: !1, line: 93, type: !32)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !29, file: !1, line: 95, type: !5)
!38 = !DISubprogram(name: "Drand_fillDvector", scope: !1, file: !1, line: 125, type: !30, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Drand*, i32, double*)* @Drand_fillDvector, variables: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "drand", arg: 1, scope: !38, file: !1, line: 126, type: !11)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !38, file: !1, line: 127, type: !5)
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvec", arg: 3, scope: !38, file: !1, line: 128, type: !32)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !38, file: !1, line: 130, type: !5)
!44 = !DISubprogram(name: "Drand_fillIvector", scope: !1, file: !1, line: 161, type: !45, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Drand*, i32, i32*)* @Drand_fillIvector, variables: !48)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !11, !5, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!48 = !{!49, !50, !51, !52}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "drand", arg: 1, scope: !44, file: !1, line: 162, type: !11)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !44, file: !1, line: 163, type: !5)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivec", arg: 3, scope: !44, file: !1, line: 164, type: !47)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !44, file: !1, line: 166, type: !5)
!53 = !{i32 2, !"Dwarf Version", i32 2}
!54 = !{i32 2, !"Debug Info Version", i32 700000003}
!55 = !{i32 1, !"PIC Level", i32 2}
!56 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!57 = !DIExpression()
!58 = !DILocation(line: 15, column: 13, scope: !7)
!59 = !DILocation(line: 23, column: 12, scope: !60)
!60 = distinct !DILexicalBlock(scope: !7, file: !1, line: 23, column: 6)
!61 = !DILocation(line: 23, column: 6, scope: !7)
!62 = !DILocation(line: 24, column: 12, scope: !63)
!63 = distinct !DILexicalBlock(scope: !60, file: !1, line: 23, column: 22)
!64 = !{!65, !65, i64 0}
!65 = !{!"any pointer", !66, i64 0}
!66 = !{!"omnipotent char", !67, i64 0}
!67 = !{!"Simple C/C++ TBAA"}
!68 = !DILocation(line: 24, column: 4, scope: !63)
!69 = !DILocation(line: 26, column: 4, scope: !63)
!70 = !DILocation(line: 33, column: 13, scope: !71)
!71 = distinct !DILexicalBlock(scope: !7, file: !1, line: 33, column: 6)
!72 = !{!73, !75, i64 64}
