; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/DSTree_stages.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IV = type { i32, i32, i32, i32* }
%struct._DSTree = type { %struct._Tree*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A fatal error in DSTree_NDstages(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [56 x i8] c"\0A fatal error in DSTree_NDstages(%p)\0A bad mapIV object\0A\00", align 1
@.str2 = private unnamed_addr constant [50 x i8] c"\0A fatal error in DSTree_ND2stages(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [57 x i8] c"\0A fatal error in DSTree_ND2stages(%p)\0A bad mapIV object\0A\00", align 1
@.str4 = private unnamed_addr constant [50 x i8] c"\0A fatal error in DSTree_MS2stages(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/DSTree_stages.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !50, !64, !78, !93}
!6 = !DISubprogram(name: "DSTree_NDstages", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._DSTree*)* @DSTree_NDstages, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !20}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !11, line: 20, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !11, line: 21, size: 192, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !11, line: 22, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !12, file: !11, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !12, file: !11, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !12, file: !11, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSTree", file: !22, line: 22, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/../DSTree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DSTree", file: !22, line: 23, size: 128, align: 64, elements: !24)
!24 = !{!25, !36}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !23, file: !22, line: 24, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !28, line: 15, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !28, line: 16, size: 256, align: 64, elements: !30)
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !29, file: !28, line: 17, baseType: !15, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !29, file: !28, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !29, file: !28, line: 19, baseType: !19, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !29, file: !28, line: 20, baseType: !19, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !29, file: !28, line: 21, baseType: !19, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "mapIV", scope: !23, file: !22, line: 25, baseType: !9, size: 64, align: 64, offset: 64)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !6, file: !1, line: 17, type: !20)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndomsep", scope: !6, file: !1, line: 19, type: !15)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !6, file: !1, line: 19, type: !15)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !6, file: !1, line: 19, type: !15)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetric", scope: !6, file: !1, line: 20, type: !19)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !6, file: !1, line: 20, type: !19)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stages", scope: !6, file: !1, line: 20, type: !19)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetricIV", scope: !6, file: !1, line: 21, type: !9)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !6, file: !1, line: 21, type: !9)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagesIV", scope: !6, file: !1, line: 21, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetricIV", scope: !6, file: !1, line: 21, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !6, file: !1, line: 22, type: !26)
!50 = !DISubprogram(name: "DSTree_ND2stages", scope: !1, file: !1, line: 82, type: !7, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._DSTree*)* @DSTree_ND2stages, variables: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !50, file: !1, line: 83, type: !20)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndomsep", scope: !50, file: !1, line: 85, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !50, file: !1, line: 85, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !50, file: !1, line: 85, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetric", scope: !50, file: !1, line: 86, type: !19)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !50, file: !1, line: 86, type: !19)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stages", scope: !50, file: !1, line: 86, type: !19)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetricIV", scope: !50, file: !1, line: 87, type: !9)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !50, file: !1, line: 87, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagesIV", scope: !50, file: !1, line: 87, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetricIV", scope: !50, file: !1, line: 87, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !50, file: !1, line: 88, type: !26)
!64 = !DISubprogram(name: "DSTree_MS2stages", scope: !1, file: !1, line: 151, type: !7, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._DSTree*)* @DSTree_MS2stages, variables: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !64, file: !1, line: 152, type: !20)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndomsep", scope: !64, file: !1, line: 154, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !64, file: !1, line: 154, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !64, file: !1, line: 154, type: !15)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetric", scope: !64, file: !1, line: 155, type: !19)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !64, file: !1, line: 155, type: !19)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stages", scope: !64, file: !1, line: 155, type: !19)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetricIV", scope: !64, file: !1, line: 156, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !64, file: !1, line: 156, type: !9)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagesIV", scope: !64, file: !1, line: 156, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetricIV", scope: !64, file: !1, line: 156, type: !9)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !64, file: !1, line: 157, type: !26)
!78 = !DISubprogram(name: "DSTree_MS3stages", scope: !1, file: !1, line: 220, type: !7, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._DSTree*)* @DSTree_MS3stages, variables: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !78, file: !1, line: 221, type: !20)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndomsep", scope: !78, file: !1, line: 223, type: !15)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nstage", scope: !78, file: !1, line: 223, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !78, file: !1, line: 223, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !78, file: !1, line: 223, type: !15)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetric", scope: !78, file: !1, line: 224, type: !19)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !78, file: !1, line: 224, type: !19)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stages", scope: !78, file: !1, line: 224, type: !19)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmetricIV", scope: !78, file: !1, line: 225, type: !9)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !78, file: !1, line: 225, type: !9)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagesIV", scope: !78, file: !1, line: 225, type: !9)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetricIV", scope: !78, file: !1, line: 225, type: !9)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !78, file: !1, line: 226, type: !26)
!93 = !DISubprogram(name: "DSTree_stagesViaDomainWeight", scope: !1, file: !1, line: 294, type: !94, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._DSTree*, i32*, %struct._DV*)* @DSTree_stagesViaDomainWeight, variables: !107)
!94 = !DISubroutineType(types: !95)
!95 = !{!9, !20, !19, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !98, line: 20, baseType: !99)
!98 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !98, line: 21, size: 192, align: 64, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !99, file: !98, line: 22, baseType: !15, size: 32, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !99, file: !98, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !99, file: !98, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !99, file: !98, line: 25, baseType: !105, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !93, file: !1, line: 295, type: !20)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vwghts", arg: 2, scope: !93, file: !1, line: 296, type: !19)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cutoffDV", arg: 3, scope: !93, file: !1, line: 297, type: !96)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totvwght", scope: !93, file: !1, line: 299, type: !106)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cutoffs", scope: !93, file: !1, line: 300, type: !105)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodewghts", scope: !93, file: !1, line: 300, type: !105)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subtreewghts", scope: !93, file: !1, line: 300, type: !105)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodewghtDV", scope: !93, file: !1, line: 301, type: !96)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subtreeDV", scope: !93, file: !1, line: 301, type: !96)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ireg", scope: !93, file: !1, line: 302, type: !15)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istage", scope: !93, file: !1, line: 302, type: !15)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jstage", scope: !93, file: !1, line: 302, type: !15)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndomsep", scope: !93, file: !1, line: 302, type: !15)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nstage", scope: !93, file: !1, line: 302, type: !15)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !93, file: !1, line: 302, type: !15)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !93, file: !1, line: 302, type: !15)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !93, file: !1, line: 303, type: !19)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !93, file: !1, line: 303, type: !19)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "regmap", scope: !93, file: !1, line: 303, type: !19)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stages", scope: !93, file: !1, line: 303, type: !19)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !93, file: !1, line: 304, type: !9)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagesIV", scope: !93, file: !1, line: 304, type: !9)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !93, file: !1, line: 305, type: !26)
!131 = !{i32 2, !"Dwarf Version", i32 2}
!132 = !{i32 2, !"Debug Info Version", i32 700000003}
!133 = !{i32 1, !"PIC Level", i32 2}
!134 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!135 = !DIExpression()
!136 = !DILocation(line: 17, column: 14, scope: !6)
!137 = !DILocation(line: 28, column: 14, scope: !138)
!138 = distinct !DILexicalBlock(scope: !6, file: !1, line: 28, column: 7)
!139 = !DILocation(line: 29, column: 4, scope: !138)
!140 = !DILocation(line: 29, column: 23, scope: !138)
!141 = !{!142, !143, i64 0}
!142 = !{!"_DSTree", !143, i64 0, !143, i64 8}
!143 = !{!"any pointer", !144, i64 0}
!144 = !{!"omnipotent char", !145, i64 0}
!145 = !{!"Simple C/C++ TBAA"}
!146 = !DILocation(line: 22, column: 9, scope: !6)
!147 = !DILocation(line: 29, column: 29, scope: !138)
!148 = !DILocation(line: 30, column: 4, scope: !138)
!149 = !DILocation(line: 30, column: 24, scope: !138)
!150 = !{!151, !152, i64 0}
