; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/DSTree_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._DSTree = type { %struct._Tree*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [47 x i8] c"\0A fatal error in DSTree_sizeOf(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [58 x i8] c"\0A fatal error in DSTree_renumberViaPostOT(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [53 x i8] c"\0A fatal error in DSTree_domainWeight(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [56 x i8] c"\0A fatal error in DSTree_separatorWeight(%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define i32 @DSTree_sizeOf(%struct._DSTree* %dstree) #0 {
  tail call void @llvm.dbg.value(metadata %struct._DSTree* %dstree, i64 0, metadata !38, metadata !86), !dbg !87
  %1 = icmp eq %struct._DSTree* %dstree, null, !dbg !88

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/DSTree_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !40, !56, !70}
!6 = !DISubprogram(name: "DSTree_sizeOf", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DSTree*)* @DSTree_sizeOf, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSTree", file: !12, line: 22, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/../DSTree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DSTree", file: !12, line: 23, size: 128, align: 64, elements: !14)
!14 = !{!15, !27}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !13, file: !12, line: 24, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !18, line: 15, baseType: !19)
!18 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !18, line: 16, size: 256, align: 64, elements: !20)
!20 = !{!21, !22, !23, !25, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !19, file: !18, line: 17, baseType: !9, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !19, file: !18, line: 18, baseType: !9, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !19, file: !18, line: 19, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !19, file: !18, line: 20, baseType: !24, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !19, file: !18, line: 21, baseType: !24, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "mapIV", scope: !13, file: !12, line: 25, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !30, line: 20, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/DSTree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !30, line: 21, size: 192, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !31, file: !30, line: 22, baseType: !9, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !31, file: !30, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !31, file: !30, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !31, file: !30, line: 25, baseType: !24, size: 64, align: 64, offset: 128)
!37 = !{!38, !39}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !6, file: !1, line: 15, type: !10)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !6, file: !1, line: 17, type: !9)
!40 = !DISubprogram(name: "DSTree_renumberViaPostOT", scope: !1, file: !1, line: 46, type: !41, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DSTree*)* @DSTree_renumberViaPostOT, variables: !43)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !10}
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !40, file: !1, line: 47, type: !10)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !40, file: !1, line: 49, type: !9)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !40, file: !1, line: 49, type: !9)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !40, file: !1, line: 49, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !40, file: !1, line: 49, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !40, file: !1, line: 49, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !40, file: !1, line: 49, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !40, file: !1, line: 50, type: !24)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldmap", scope: !40, file: !1, line: 50, type: !24)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !40, file: !1, line: 50, type: !24)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !40, file: !1, line: 51, type: !28)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !40, file: !1, line: 52, type: !16)
!56 = !DISubprogram(name: "DSTree_domainWeight", scope: !1, file: !1, line: 134, type: !57, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DSTree*, i32*)* @DSTree_domainWeight, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{!9, !10, !24}
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !56, file: !1, line: 135, type: !10)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vwghts", arg: 2, scope: !56, file: !1, line: 136, type: !24)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domwght", scope: !56, file: !1, line: 138, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ireg", scope: !56, file: !1, line: 138, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !56, file: !1, line: 138, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !56, file: !1, line: 138, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch", scope: !56, file: !1, line: 139, type: !24)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !56, file: !1, line: 139, type: !24)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !56, file: !1, line: 140, type: !28)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !56, file: !1, line: 141, type: !16)
!70 = !DISubprogram(name: "DSTree_separatorWeight", scope: !1, file: !1, line: 182, type: !57, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._DSTree*, i32*)* @DSTree_separatorWeight, variables: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstree", arg: 1, scope: !70, file: !1, line: 183, type: !10)
