; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_permute.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IV = type { i32, i32, i32, i32* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [57 x i8] c"\0A fatal error in ETree_newToOldFrontPerm(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [57 x i8] c"\0A fatal error in ETree_oldToNewFrontPerm(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [55 x i8] c"\0A fatal error in ETree_newToOldVtxPerm(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [55 x i8] c"\0A fatal error in ETree_oldToNewVtxPerm(%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [58 x i8] c"\0A fatal error in ETree_permuteVertices(%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_permute.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !46, !52, !65, !78}
!6 = !DISubprogram(name: "ETree_newToOldFrontPerm", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._ETree*)* @ETree_newToOldFrontPerm, variables: !41)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !20}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !11, line: 20, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !11, line: 21, size: 192, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !11, line: 22, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !12, file: !11, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !12, file: !11, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !12, file: !11, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !22, line: 31, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !22, line: 32, size: 320, align: 64, elements: !24)
!24 = !{!25, !26, !27, !38, !39, !40}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !23, file: !22, line: 33, baseType: !15, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !23, file: !22, line: 34, baseType: !15, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !23, file: !22, line: 35, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !30, line: 15, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !30, line: 16, size: 256, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !31, file: !30, line: 17, baseType: !15, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !31, file: !30, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !31, file: !30, line: 19, baseType: !19, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !31, file: !30, line: 20, baseType: !19, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !31, file: !30, line: 21, baseType: !19, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !23, file: !22, line: 36, baseType: !9, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !23, file: !22, line: 37, baseType: !9, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !23, file: !22, line: 38, baseType: !9, size: 64, align: 64, offset: 256)
!41 = !{!42, !43, !44, !45}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !6, file: !1, line: 15, type: !20)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !6, file: !1, line: 17, type: !15)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !6, file: !1, line: 17, type: !15)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newToOldIV", scope: !6, file: !1, line: 18, type: !9)
!46 = !DISubprogram(name: "ETree_oldToNewFrontPerm", scope: !1, file: !1, line: 51, type: !7, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._ETree*)* @ETree_oldToNewFrontPerm, variables: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !46, file: !1, line: 52, type: !20)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !46, file: !1, line: 54, type: !15)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !46, file: !1, line: 54, type: !15)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldToNewIV", scope: !46, file: !1, line: 55, type: !9)
!52 = !DISubprogram(name: "ETree_newToOldVtxPerm", scope: !1, file: !1, line: 88, type: !7, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._ETree*)* @ETree_newToOldVtxPerm, variables: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !52, file: !1, line: 89, type: !20)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !52, file: !1, line: 91, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "front", scope: !52, file: !1, line: 91, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !52, file: !1, line: 91, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !52, file: !1, line: 91, type: !15)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !52, file: !1, line: 91, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !52, file: !1, line: 92, type: !19)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !52, file: !1, line: 92, type: !19)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newToOld", scope: !52, file: !1, line: 92, type: !19)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !52, file: !1, line: 92, type: !19)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newToOldVtxIV", scope: !52, file: !1, line: 93, type: !9)
!65 = !DISubprogram(name: "ETree_oldToNewVtxPerm", scope: !1, file: !1, line: 154, type: !7, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._ETree*)* @ETree_oldToNewVtxPerm, variables: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !65, file: !1, line: 155, type: !20)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !65, file: !1, line: 157, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "front", scope: !65, file: !1, line: 157, type: !15)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !65, file: !1, line: 157, type: !15)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !65, file: !1, line: 157, type: !15)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !65, file: !1, line: 157, type: !15)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !65, file: !1, line: 158, type: !19)
