; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A error in ETree_readFromFile(%p,%s)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [61 x i8] c"\0A error in ETree_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [106 x i8] c"\0A error in ETree_readFromFile(%p,%s)\0A bad ETree file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str5 = private unnamed_addr constant [58 x i8] c"\0A error in ETree_readFromFormattedFile(%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !163, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !110, !121, !127, !135, !140, !146, !158}
!6 = !DISubprogram(name: "ETree_readFromFile", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*, i8*)* @ETree_readFromFile, variables: !43)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !41}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !12, line: 31, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !12, line: 32, size: 320, align: 64, elements: !14)
!14 = !{!15, !16, !17, !29, !39, !40}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !13, file: !12, line: 33, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !13, file: !12, line: 34, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !13, file: !12, line: 35, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !20, line: 15, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !20, line: 16, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !27, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !21, file: !20, line: 17, baseType: !9, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !21, file: !20, line: 18, baseType: !9, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !21, file: !20, line: 19, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !21, file: !20, line: 20, baseType: !26, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !21, file: !20, line: 21, baseType: !26, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !13, file: !12, line: 36, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !32, line: 20, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !32, line: 21, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 22, baseType: !9, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !33, file: !32, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !33, file: !32, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !33, file: !32, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !13, file: !12, line: 37, baseType: !30, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !13, file: !12, line: 38, baseType: !30, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !{!44, !45, !46, !107, !108, !109}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !6, file: !1, line: 24, type: !10)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !6, file: !1, line: 25, type: !41)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !6, file: !1, line: 27, type: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !49, line: 153, baseType: !50)
!49 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !49, line: 122, size: 1216, align: 64, elements: !51)
!51 = !{!52, !55, !56, !57, !59, !60, !65, !66, !67, !71, !75, !85, !91, !92, !95, !96, !100, !104, !105, !106}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !50, file: !49, line: 123, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !50, file: !49, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !50, file: !49, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !50, file: !49, line: 126, baseType: !58, size: 16, align: 16, offset: 128)
!58 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !50, file: !49, line: 127, baseType: !58, size: 16, align: 16, offset: 144)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !50, file: !49, line: 128, baseType: !61, size: 128, align: 64, offset: 192)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !49, line: 88, size: 128, align: 64, elements: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !61, file: !49, line: 89, baseType: !53, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !61, file: !49, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !50, file: !49, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !50, file: !49, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !50, file: !49, line: 133, baseType: !68, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!9, !4}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !50, file: !49, line: 134, baseType: !72, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!9, !4, !41, !9}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !50, file: !49, line: 135, baseType: !76, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !4, !79, !9}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !49, line: 77, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !81, line: 71, baseType: !82)
!81 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !50, file: !49, line: 136, baseType: !86, size: 64, align: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!9, !4, !89, !9}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !50, file: !49, line: 139, baseType: !61, size: 128, align: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !50, file: !49, line: 140, baseType: !93, size: 64, align: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !49, line: 94, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !50, file: !49, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !50, file: !49, line: 144, baseType: !97, size: 24, align: 8, offset: 928)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 24, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 3)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !50, file: !49, line: 145, baseType: !101, size: 8, align: 8, offset: 952)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 1)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !50, file: !49, line: 148, baseType: !61, size: 128, align: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !50, file: !49, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !50, file: !49, line: 152, baseType: !79, size: 64, align: 64, offset: 1152)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !6, file: !1, line: 28, type: !9)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !6, file: !1, line: 28, type: !9)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !6, file: !1, line: 28, type: !9)
!110 = !DISubprogram(name: "ETree_readFromFormattedFile", scope: !1, file: !1, line: 92, type: !111, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*, %struct.__sFILE*)* @ETree_readFromFormattedFile, variables: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{!9, !10, !47}
!113 = !{!114, !115, !116, !117}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !110, file: !1, line: 93, type: !10)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !110, file: !1, line: 94, type: !47)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !110, file: !1, line: 96, type: !9)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !110, file: !1, line: 97, type: !118)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 64, align: 32, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 2)
!121 = !DISubprogram(name: "ETree_readFromBinaryFile", scope: !1, file: !1, line: 170, type: !111, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*, %struct.__sFILE*)* @ETree_readFromBinaryFile, variables: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !121, file: !1, line: 171, type: !10)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !121, file: !1, line: 172, type: !47)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !121, file: !1, line: 174, type: !9)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !121, file: !1, line: 175, type: !118)
!127 = !DISubprogram(name: "ETree_writeToFile", scope: !1, file: !1, line: 255, type: !7, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*, i8*)* @ETree_writeToFile, variables: !128)
!128 = !{!129, !130, !131, !132, !133, !134}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !127, file: !1, line: 256, type: !10)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !127, file: !1, line: 257, type: !41)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !127, file: !1, line: 259, type: !47)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !127, file: !1, line: 260, type: !9)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !127, file: !1, line: 260, type: !9)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !127, file: !1, line: 260, type: !9)
!135 = !DISubprogram(name: "ETree_writeToFormattedFile", scope: !1, file: !1, line: 329, type: !111, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*, %struct.__sFILE*)* @ETree_writeToFormattedFile, variables: !136)
!136 = !{!137, !138, !139}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !135, file: !1, line: 330, type: !10)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !135, file: !1, line: 331, type: !47)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !135, file: !1, line: 333, type: !9)
