; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._DV = type { i32, i32, i32, double* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [46 x i8] c"\0A fatal error in ETree_sizeOf(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [54 x i8] c"\0A fatal error in ETree_nFactorIndices(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [57 x i8] c"\0A fatal error in ETree_nFactorEntries(%p,%d)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !44, !55, !65, !77, !85, !96, !105, !167, !177, !188, !201}
!6 = !DISubprogram(name: "ETree_sizeOf", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*)* @ETree_sizeOf, variables: !41)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !12, line: 31, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !12, line: 32, size: 320, align: 64, elements: !14)
!14 = !{!15, !16, !17, !29, !39, !40}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !13, file: !12, line: 33, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !13, file: !12, line: 34, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !13, file: !12, line: 35, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !20, line: 15, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !20, line: 16, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !27, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !21, file: !20, line: 17, baseType: !9, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !21, file: !20, line: 18, baseType: !9, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !21, file: !20, line: 19, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !21, file: !20, line: 20, baseType: !26, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !21, file: !20, line: 21, baseType: !26, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !13, file: !12, line: 36, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !32, line: 20, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !32, line: 21, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 22, baseType: !9, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !33, file: !32, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !33, file: !32, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !33, file: !32, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !13, file: !12, line: 37, baseType: !30, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !13, file: !12, line: 38, baseType: !30, size: 64, align: 64, offset: 256)
!41 = !{!42, !43}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !6, file: !1, line: 17, type: !10)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !6, file: !1, line: 19, type: !9)
!44 = !DISubprogram(name: "ETree_nFactorIndices", scope: !1, file: !1, line: 55, type: !7, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*)* @ETree_nFactorIndices, variables: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54}
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !44, file: !1, line: 56, type: !10)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !44, file: !1, line: 58, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !44, file: !1, line: 58, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nv", scope: !44, file: !1, line: 58, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nind", scope: !44, file: !1, line: 58, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !44, file: !1, line: 58, type: !9)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !44, file: !1, line: 58, type: !9)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !44, file: !1, line: 59, type: !26)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !44, file: !1, line: 59, type: !26)
!55 = !DISubprogram(name: "ETree_nFactorEntries", scope: !1, file: !1, line: 96, type: !56, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ETree*, i32)* @ETree_nFactorEntries, variables: !58)
!56 = !DISubroutineType(types: !57)
!57 = !{!9, !10, !9}
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !55, file: !1, line: 97, type: !10)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 2, scope: !55, file: !1, line: 98, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !55, file: !1, line: 100, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !55, file: !1, line: 100, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !55, file: !1, line: 100, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nzf", scope: !55, file: !1, line: 100, type: !9)
!65 = !DISubprogram(name: "ETree_nFactorOps", scope: !1, file: !1, line: 136, type: !66, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._ETree*, i32, i32)* @ETree_nFactorOps, variables: !69)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !10, !9, !9}
!68 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!69 = !{!70, !71, !72, !73, !74, !75, !76}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !65, file: !1, line: 137, type: !10)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !65, file: !1, line: 138, type: !9)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 3, scope: !65, file: !1, line: 139, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ops", scope: !65, file: !1, line: 141, type: !68)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !65, file: !1, line: 142, type: !9)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !65, file: !1, line: 142, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !65, file: !1, line: 142, type: !9)
!77 = !DISubprogram(name: "ETree_nFactorEntriesInFront", scope: !1, file: !1, line: 171, type: !66, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._ETree*, i32, i32)* @ETree_nFactorEntriesInFront, variables: !78)
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !77, file: !1, line: 172, type: !10)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 2, scope: !77, file: !1, line: 173, type: !9)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 3, scope: !77, file: !1, line: 174, type: !9)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !77, file: !1, line: 176, type: !9)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !77, file: !1, line: 176, type: !9)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !77, file: !1, line: 176, type: !9)
!85 = !DISubprogram(name: "ETree_nInternalOpsInFront", scope: !1, file: !1, line: 218, type: !86, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._ETree*, i32, i32, i32)* @ETree_nInternalOpsInFront, variables: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{!68, !10, !9, !9, !9}
!88 = !{!89, !90, !91, !92, !93, !94, !95}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !85, file: !1, line: 219, type: !10)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !85, file: !1, line: 220, type: !9)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 3, scope: !85, file: !1, line: 221, type: !9)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 4, scope: !85, file: !1, line: 222, type: !9)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !85, file: !1, line: 224, type: !68)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !85, file: !1, line: 224, type: !68)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ops", scope: !85, file: !1, line: 224, type: !68)
!96 = !DISubprogram(name: "ETree_nExternalOpsInFront", scope: !1, file: !1, line: 277, type: !86, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._ETree*, i32, i32, i32)* @ETree_nExternalOpsInFront, variables: !97)
!97 = !{!98, !99, !100, !101, !102, !103, !104}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !96, file: !1, line: 278, type: !10)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !96, file: !1, line: 279, type: !9)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 3, scope: !96, file: !1, line: 280, type: !9)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 4, scope: !96, file: !1, line: 281, type: !9)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !96, file: !1, line: 283, type: !68)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !96, file: !1, line: 283, type: !68)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ops", scope: !96, file: !1, line: 283, type: !68)
!105 = !DISubprogram(name: "ETree_backwardOps", scope: !1, file: !1, line: 334, type: !106, isLocal: false, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: true, function: %struct._DV* (%struct._ETree*, i32, i32, i32*, %struct._IVL*)* @ETree_backwardOps, variables: !140)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !10, !9, !9, !26, !118}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !110, line: 20, baseType: !111)
!110 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !110, line: 21, size: 192, align: 64, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !110, line: 22, baseType: !9, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !111, file: !110, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !111, file: !110, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !111, file: !110, line: 25, baseType: !117, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !120, line: 55, baseType: !121)
!120 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !120, line: 79, size: 384, align: 64, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !130, !131}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !120, line: 80, baseType: !9, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !121, file: !120, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !121, file: !120, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !121, file: !120, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !121, file: !120, line: 84, baseType: !26, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !121, file: !120, line: 85, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !121, file: !120, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !121, file: !120, line: 87, baseType: !132, size: 64, align: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !120, line: 56, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !120, line: 102, size: 192, align: 64, elements: !135)
!135 = !{!136, !137, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !120, line: 103, baseType: !9, size: 32, align: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !134, file: !120, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !134, file: !120, line: 105, baseType: !26, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !120, line: 106, baseType: !132, size: 64, align: 64, offset: 128)
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !105, file: !1, line: 335, type: !10)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !105, file: !1, line: 336, type: !9)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 3, scope: !105, file: !1, line: 337, type: !9)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vwghts", arg: 4, scope: !105, file: !1, line: 338, type: !26)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbfacIVL", arg: 5, scope: !105, file: !1, line: 339, type: !118)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extops", scope: !105, file: !1, line: 341, type: !68)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opsKbndK", scope: !105, file: !1, line: 341, type: !68)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opsKK", scope: !105, file: !1, line: 341, type: !68)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ops", scope: !105, file: !1, line: 342, type: !117)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opsDV", scope: !105, file: !1, line: 343, type: !108)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghtJ", scope: !105, file: !1, line: 344, type: !9)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !105, file: !1, line: 344, type: !9)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !105, file: !1, line: 344, type: !9)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !105, file: !1, line: 344, type: !9)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !105, file: !1, line: 344, type: !9)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwght", scope: !105, file: !1, line: 344, type: !9)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nadj", scope: !105, file: !1, line: 345, type: !9)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !105, file: !1, line: 345, type: !9)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !105, file: !1, line: 345, type: !9)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wghtJ", scope: !105, file: !1, line: 345, type: !9)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wghtK", scope: !105, file: !1, line: 345, type: !9)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "counts", scope: !105, file: !1, line: 346, type: !26)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !105, file: !1, line: 346, type: !26)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !105, file: !1, line: 346, type: !26)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !105, file: !1, line: 346, type: !26)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !105, file: !1, line: 346, type: !26)
!167 = !DISubprogram(name: "ETree_factorEntriesIV", scope: !1, file: !1, line: 445, type: !168, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._ETree*, i32)* @ETree_factorEntriesIV, variables: !170)
!168 = !DISubroutineType(types: !169)
!169 = !{!30, !10, !9}
!170 = !{!171, !172, !173, !174, !175, !176}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !167, file: !1, line: 446, type: !10)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 2, scope: !167, file: !1, line: 447, type: !9)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !167, file: !1, line: 449, type: !9)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !167, file: !1, line: 449, type: !9)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nzf", scope: !167, file: !1, line: 450, type: !26)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nzfIV", scope: !167, file: !1, line: 451, type: !30)
!177 = !DISubprogram(name: "ETree_forwardOps", scope: !1, file: !1, line: 492, type: !178, isLocal: false, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: true, function: %struct._DV* (%struct._ETree*, i32, i32)* @ETree_forwardOps, variables: !180)
!178 = !DISubroutineType(types: !179)
!179 = !{!108, !10, !9, !9}
!180 = !{!181, !182, !183, !184, !185, !186, !187}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !177, file: !1, line: 493, type: !10)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !177, file: !1, line: 494, type: !9)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 3, scope: !177, file: !1, line: 495, type: !9)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ops", scope: !177, file: !1, line: 497, type: !117)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opsDV", scope: !177, file: !1, line: 498, type: !108)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !177, file: !1, line: 499, type: !9)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !177, file: !1, line: 499, type: !9)
!188 = !DISubprogram(name: "ETree_expand", scope: !1, file: !1, line: 532, type: !189, isLocal: false, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ETree* (%struct._ETree*, %struct._IV*)* @ETree_expand, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!10, !10, !30}
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !188, file: !1, line: 533, type: !10)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eqmapIV", arg: 2, scope: !188, file: !1, line: 534, type: !30)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etree2", scope: !188, file: !1, line: 536, type: !10)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !188, file: !1, line: 537, type: !9)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndof", scope: !188, file: !1, line: 537, type: !9)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !188, file: !1, line: 537, type: !9)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !188, file: !1, line: 538, type: !26)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !188, file: !1, line: 538, type: !26)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront2", scope: !188, file: !1, line: 538, type: !26)
!201 = !DISubprogram(name: "ETree_spliceTwoETrees", scope: !1, file: !1, line: 591, type: !202, isLocal: false, isDefinition: true, scopeLine: 596, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ETree* (%struct._ETree*, %struct._Graph*, %struct._IV*, %struct._ETree*)* @ETree_spliceTwoETrees, variables: !218)
!202 = !DISubroutineType(types: !203)
!203 = !{!10, !10, !204, !30, !10}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !206, line: 49, baseType: !207)
!206 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !206, line: 50, size: 384, align: 64, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !206, line: 51, baseType: !9, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !207, file: !206, line: 52, baseType: !9, size: 32, align: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !207, file: !206, line: 53, baseType: !9, size: 32, align: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !207, file: !206, line: 54, baseType: !9, size: 32, align: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !207, file: !206, line: 55, baseType: !9, size: 32, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !207, file: !206, line: 56, baseType: !9, size: 32, align: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !207, file: !206, line: 57, baseType: !118, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !207, file: !206, line: 58, baseType: !26, size: 64, align: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !207, file: !206, line: 59, baseType: !118, size: 64, align: 64, offset: 320)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree0", arg: 1, scope: !201, file: !1, line: 592, type: !10)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "graph0", arg: 2, scope: !201, file: !1, line: 593, type: !204)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapIV", arg: 3, scope: !201, file: !1, line: 594, type: !30)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree1", arg: 4, scope: !201, file: !1, line: 595, type: !10)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etree2", scope: !201, file: !1, line: 597, type: !10)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts0", scope: !201, file: !1, line: 598, type: !26)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts1", scope: !201, file: !1, line: 598, type: !26)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts2", scope: !201, file: !1, line: 598, type: !26)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch0", scope: !201, file: !1, line: 598, type: !26)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head0", scope: !201, file: !1, line: 598, type: !26)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link0", scope: !201, file: !1, line: 598, type: !26)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !201, file: !1, line: 599, type: !26)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !201, file: !1, line: 599, type: !26)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts0", scope: !201, file: !1, line: 599, type: !26)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts1", scope: !201, file: !1, line: 599, type: !26)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts2", scope: !201, file: !1, line: 599, type: !26)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par0", scope: !201, file: !1, line: 599, type: !26)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par1", scope: !201, file: !1, line: 600, type: !26)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par2", scope: !201, file: !1, line: 600, type: !26)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib0", scope: !201, file: !1, line: 600, type: !26)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !201, file: !1, line: 600, type: !26)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront0", scope: !201, file: !1, line: 600, type: !26)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront1", scope: !201, file: !1, line: 600, type: !26)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront2", scope: !201, file: !1, line: 601, type: !26)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !201, file: !1, line: 602, type: !9)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !201, file: !1, line: 602, type: !9)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !201, file: !1, line: 602, type: !9)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront0", scope: !201, file: !1, line: 602, type: !9)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront1", scope: !201, file: !1, line: 602, type: !9)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront2", scope: !201, file: !1, line: 602, type: !9)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !201, file: !1, line: 602, type: !9)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi", scope: !201, file: !1, line: 602, type: !9)
