; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.timeval = type { i64, i32 }
%struct.timezone = type { i32, i32 }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [51 x i8] c"\0A fatal error in ETree_init1(%p,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [56 x i8] c"\0A fatal error in ETree_initFromGraph(%p,%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [62 x i8] c"\0A fatal error in ETree_initFromGraph(%p,%p,%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !228, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !45, !98, !119, !153}
!6 = !DISubprogram(name: "ETree_init1", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ETree*, i32, i32)* @ETree_init1, variables: !41)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !11, line: 31, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !11, line: 32, size: 320, align: 64, elements: !13)
!13 = !{!14, !16, !17, !29, !39, !40}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !12, file: !11, line: 35, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !20, line: 15, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !20, line: 16, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !27, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !21, file: !20, line: 17, baseType: !15, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !21, file: !20, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !21, file: !20, line: 19, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !21, file: !20, line: 20, baseType: !26, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !21, file: !20, line: 21, baseType: !26, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !12, file: !11, line: 36, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !32, line: 20, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !32, line: 21, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 22, baseType: !15, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !33, file: !32, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !33, file: !32, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !33, file: !32, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !12, file: !11, line: 37, baseType: !30, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !12, file: !11, line: 38, baseType: !30, size: 64, align: 64, offset: 256)
!41 = !{!42, !43, !44}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !6, file: !1, line: 17, type: !9)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfront", arg: 2, scope: !6, file: !1, line: 18, type: !15)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nvtx", arg: 3, scope: !6, file: !1, line: 19, type: !15)
!45 = !DISubprogram(name: "ETree_initFromGraph", scope: !1, file: !1, line: 56, type: !46, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ETree*, %struct._Graph*)* @ETree_initFromGraph, variables: !84)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !9, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !50, line: 49, baseType: !51)
!50 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !50, line: 50, size: 384, align: 64, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !82, !83}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !50, line: 51, baseType: !15, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !51, file: !50, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !51, file: !50, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !51, file: !50, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !51, file: !50, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !51, file: !50, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !51, file: !50, line: 57, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !62, line: 55, baseType: !63)
!62 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !62, line: 79, size: 384, align: 64, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !72, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !62, line: 80, baseType: !15, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !63, file: !62, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !63, file: !62, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !63, file: !62, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !63, file: !62, line: 84, baseType: !26, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !63, file: !62, line: 85, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !63, file: !62, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !63, file: !62, line: 87, baseType: !74, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !62, line: 56, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !62, line: 102, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !62, line: 103, baseType: !15, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !76, file: !62, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !76, file: !62, line: 105, baseType: !26, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !62, line: 106, baseType: !74, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !51, file: !50, line: 58, baseType: !26, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !51, file: !50, line: 59, baseType: !60, size: 64, align: 64, offset: 320)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !45, file: !1, line: 57, type: !9)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !45, file: !1, line: 58, type: !48)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !45, file: !1, line: 60, type: !15)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !45, file: !1, line: 60, type: !15)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !45, file: !1, line: 60, type: !15)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !45, file: !1, line: 60, type: !15)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !45, file: !1, line: 60, type: !15)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !45, file: !1, line: 60, type: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !45, file: !1, line: 61, type: !26)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !45, file: !1, line: 61, type: !26)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !45, file: !1, line: 61, type: !26)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !45, file: !1, line: 61, type: !26)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !45, file: !1, line: 61, type: !26)
!98 = !DISubprogram(name: "ETree_initFromGraphWithPerms", scope: !1, file: !1, line: 128, type: !99, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ETree*, %struct._Graph*, i32*, i32*)* @ETree_initFromGraphWithPerms, variables: !101)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !9, !48, !26, !26}
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !98, file: !1, line: 129, type: !9)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !98, file: !1, line: 130, type: !48)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newToOld", arg: 3, scope: !98, file: !1, line: 131, type: !26)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldToNew", arg: 4, scope: !98, file: !1, line: 132, type: !26)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !98, file: !1, line: 134, type: !15)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !98, file: !1, line: 134, type: !15)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !98, file: !1, line: 134, type: !15)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unew", scope: !98, file: !1, line: 134, type: !15)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uold", scope: !98, file: !1, line: 134, type: !15)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vold", scope: !98, file: !1, line: 134, type: !15)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vnew", scope: !98, file: !1, line: 134, type: !15)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !98, file: !1, line: 134, type: !15)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !98, file: !1, line: 135, type: !26)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !98, file: !1, line: 135, type: !26)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !98, file: !1, line: 135, type: !26)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !98, file: !1, line: 135, type: !26)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !98, file: !1, line: 135, type: !26)
!119 = !DISubprogram(name: "ETree_initFromDenseMatrix", scope: !1, file: !1, line: 238, type: !120, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ETree*, i32, i32, i32)* @ETree_initFromDenseMatrix, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !9, !15, !15, !15}
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !142, !143, !144, !145, !146, !147, !148, !149, !151, !152}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !119, file: !1, line: 239, type: !9)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !119, file: !1, line: 240, type: !15)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "option", arg: 3, scope: !119, file: !1, line: 241, type: !15)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param", arg: 4, scope: !119, file: !1, line: 242, type: !15)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !119, file: !1, line: 244, type: !15)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bnd", scope: !119, file: !1, line: 244, type: !15)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !119, file: !1, line: 244, type: !15)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "front", scope: !119, file: !1, line: 244, type: !15)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !119, file: !1, line: 244, type: !15)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !119, file: !1, line: 244, type: !15)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !119, file: !1, line: 244, type: !15)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !119, file: !1, line: 244, type: !15)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !119, file: !1, line: 244, type: !15)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !119, file: !1, line: 245, type: !26)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !119, file: !1, line: 245, type: !26)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !119, file: !1, line: 245, type: !26)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !119, file: !1, line: 245, type: !26)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndJ", scope: !141, file: !1, line: 330, type: !15)
!141 = distinct !DILexicalBlock(scope: !119, file: !1, line: 329, column: 1)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !141, file: !1, line: 330, type: !15)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !141, file: !1, line: 330, type: !15)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !141, file: !1, line: 330, type: !15)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !141, file: !1, line: 330, type: !15)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizeI", scope: !141, file: !1, line: 330, type: !15)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizeJ", scope: !141, file: !1, line: 330, type: !15)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !141, file: !1, line: 331, type: !26)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "facops", scope: !141, file: !1, line: 332, type: !150)
!150 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "solops", scope: !141, file: !1, line: 332, type: !150)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "updops", scope: !141, file: !1, line: 332, type: !150)
!153 = !DISubprogram(name: "ETree_initFromFile", scope: !1, file: !1, line: 378, type: !154, isLocal: false, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._ETree*, i8*, i32, %struct.__sFILE*)* @ETree_initFromFile, variables: !218)
!154 = !DISubroutineType(types: !155)
!155 = !{!30, !9, !156, !15, !158}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !160, line: 153, baseType: !161)
!160 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !160, line: 122, size: 1216, align: 64, elements: !162)
!162 = !{!163, !166, !167, !168, !170, !171, !176, !177, !178, !182, !186, !196, !202, !203, !206, !207, !211, !215, !216, !217}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !161, file: !160, line: 123, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !161, file: !160, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !161, file: !160, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !161, file: !160, line: 126, baseType: !169, size: 16, align: 16, offset: 128)
!169 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !161, file: !160, line: 127, baseType: !169, size: 16, align: 16, offset: 144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !161, file: !160, line: 128, baseType: !172, size: 128, align: 64, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !160, line: 88, size: 128, align: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !172, file: !160, line: 89, baseType: !164, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !172, file: !160, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !161, file: !160, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !161, file: !160, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !161, file: !160, line: 133, baseType: !179, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!15, !4}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !161, file: !160, line: 134, baseType: !183, size: 64, align: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!15, !4, !156, !15}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !161, file: !160, line: 135, baseType: !187, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !4, !190, !15}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !160, line: 77, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !192, line: 71, baseType: !193)
!192 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !194, line: 46, baseType: !195)
!194 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!195 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !161, file: !160, line: 136, baseType: !197, size: 64, align: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!15, !4, !200, !15}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !161, file: !160, line: 139, baseType: !172, size: 128, align: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !161, file: !160, line: 140, baseType: !204, size: 64, align: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !160, line: 94, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !161, file: !160, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !161, file: !160, line: 144, baseType: !208, size: 24, align: 8, offset: 928)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 24, align: 8, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 3)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !161, file: !160, line: 145, baseType: !212, size: 8, align: 8, offset: 952)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 8, align: 8, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 1)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !161, file: !160, line: 148, baseType: !172, size: 128, align: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !161, file: !160, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !161, file: !160, line: 152, baseType: !190, size: 64, align: 64, offset: 1152)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontETree", arg: 1, scope: !153, file: !1, line: 379, type: !9)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inETreeFileName", arg: 2, scope: !153, file: !1, line: 380, type: !156)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 3, scope: !153, file: !1, line: 381, type: !15)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 4, scope: !153, file: !1, line: 382, type: !158)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !153, file: !1, line: 384, type: !150)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !153, file: !1, line: 384, type: !150)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neqns", scope: !153, file: !1, line: 385, type: !15)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !153, file: !1, line: 385, type: !15)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldToNewIV", scope: !153, file: !1, line: 386, type: !30)
!228 = !{!229, !240}
!229 = !DIGlobalVariable(name: "TV", scope: !0, file: !230, line: 9, type: !231, isLocal: true, isDefinition: true, variable: %struct.timeval* @TV)
!230 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../timings.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !232, line: 30, size: 128, align: 64, elements: !233)
!232 = !DIFile(filename: "/usr/include/sys/_types/_timeval.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!233 = !{!234, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !231, file: !232, line: 32, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !194, line: 120, baseType: !236)
!236 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !231, file: !232, line: 33, baseType: !238, size: 32, align: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !192, line: 74, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !194, line: 44, baseType: !15)
!240 = !DIGlobalVariable(name: "TZ", scope: !0, file: !230, line: 10, type: !241, isLocal: true, isDefinition: true, variable: %struct.timezone* @TZ)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !242, line: 124, size: 64, align: 32, elements: !243)
!242 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !241, file: !242, line: 125, baseType: !15, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !241, file: !242, line: 126, baseType: !15, size: 32, align: 32, offset: 32)
!246 = !{i32 2, !"Dwarf Version", i32 2}
!247 = !{i32 2, !"Debug Info Version", i32 700000003}
!248 = !{i32 1, !"PIC Level", i32 2}
!249 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!250 = !DIExpression()
!251 = !DILocation(line: 17, column: 13, scope: !6)
!252 = !DILocation(line: 18, column: 12, scope: !6)
!253 = !DILocation(line: 19, column: 12, scope: !6)
!254 = !DILocation(line: 26, column: 12, scope: !255)
!255 = distinct !DILexicalBlock(scope: !6, file: !1, line: 26, column: 6)
!256 = !DILocation(line: 26, column: 30, scope: !255)
!257 = !DILocation(line: 26, column: 20, scope: !255)
!258 = !DILocation(line: 26, column: 42, scope: !255)
!259 = !DILocation(line: 27, column: 12, scope: !260)
!260 = distinct !DILexicalBlock(scope: !255, file: !1, line: 26, column: 53)
!261 = !{!262, !262, i64 0}
!262 = !{!"any pointer", !263, i64 0}
!263 = !{!"omnipotent char", !264, i64 0}
!264 = !{!"Simple C/C++ TBAA"}
!265 = !DILocation(line: 27, column: 4, scope: !260)
!266 = !DILocation(line: 29, column: 4, scope: !260)
!267 = !DILocation(line: 31, column: 1, scope: !6)
!268 = !DILocation(line: 32, column: 8, scope: !6)
!269 = !DILocation(line: 32, column: 15, scope: !6)
!270 = !{!271, !272, i64 0}
!271 = !{!"_ETree", !272, i64 0, !272, i64 4, !262, i64 8, !262, i64 16, !262, i64 24, !262, i64 32}
!272 = !{!"int", !263, i64 0}
!273 = !DILocation(line: 33, column: 8, scope: !6)
!274 = !DILocation(line: 33, column: 15, scope: !6)
!275 = !{!271, !272, i64 4}
!276 = !DILocation(line: 34, column: 17, scope: !6)
!277 = !DILocation(line: 34, column: 8, scope: !6)
!278 = !DILocation(line: 34, column: 15, scope: !6)
!279 = !{!271, !262, i64 8}
!280 = !DILocation(line: 35, column: 1, scope: !6)
!281 = !DILocation(line: 36, column: 21, scope: !6)
!282 = !DILocation(line: 36, column: 8, scope: !6)
!283 = !DILocation(line: 36, column: 19, scope: !6)
!284 = !{!271, !262, i64 16}
!285 = !DILocation(line: 37, column: 1, scope: !6)
!286 = !DILocation(line: 38, column: 16, scope: !6)
!287 = !DILocation(line: 38, column: 1, scope: !6)
!288 = !DILocation(line: 39, column: 21, scope: !6)
!289 = !DILocation(line: 39, column: 8, scope: !6)
!290 = !DILocation(line: 39, column: 19, scope: !6)
!291 = !{!271, !262, i64 24}
!292 = !DILocation(line: 40, column: 1, scope: !6)
!293 = !DILocation(line: 41, column: 16, scope: !6)
!294 = !DILocation(line: 41, column: 1, scope: !6)
!295 = !DILocation(line: 42, column: 23, scope: !6)
!296 = !DILocation(line: 42, column: 8, scope: !6)
!297 = !DILocation(line: 42, column: 21, scope: !6)
!298 = !{!271, !262, i64 32}
!299 = !DILocation(line: 43, column: 1, scope: !6)
!300 = !DILocation(line: 45, column: 1, scope: !6)
!301 = !DILocation(line: 57, column: 13, scope: !45)
!302 = !DILocation(line: 58, column: 13, scope: !45)
!303 = !DILocation(line: 67, column: 12, scope: !304)
!304 = distinct !DILexicalBlock(scope: !45, file: !1, line: 67, column: 6)
!305 = !DILocation(line: 67, column: 25, scope: !304)
!306 = !DILocation(line: 67, column: 20, scope: !304)
!307 = !DILocation(line: 67, column: 47, scope: !304)
!308 = !{!309, !272, i64 4}
!309 = !{!"_Graph", !272, i64 0, !272, i64 4, !272, i64 8, !272, i64 12, !272, i64 16, !272, i64 20, !262, i64 24, !262, i64 32, !262, i64 40}
!310 = !DILocation(line: 60, column: 19, scope: !45)
!311 = !DILocation(line: 67, column: 53, scope: !304)
!312 = !DILocation(line: 67, column: 6, scope: !45)
!313 = !DILocation(line: 68, column: 12, scope: !314)
!314 = distinct !DILexicalBlock(scope: !304, file: !1, line: 67, column: 60)
!315 = !DILocation(line: 68, column: 4, scope: !314)
!316 = !DILocation(line: 70, column: 4, scope: !314)
!317 = !DILocation(line: 60, column: 11, scope: !45)
!318 = !DILocation(line: 78, column: 1, scope: !45)
!319 = !DILocation(line: 79, column: 30, scope: !45)
!320 = !DILocation(line: 79, column: 12, scope: !45)
