; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_transform.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [61 x i8] c"\0A fatal error in ETree_transform(%p,%p,%d,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [62 x i8] c"\0A fatal error in ETree_transform2(%p,%p,%d,%d,%d)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [60 x i8] c"\0A fatal error in ETree_mergeFrontsOne(%p,%d,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [83 x i8] c"\0A fatal error in ETree_mergeFrontsOne(%p,%d,%p)\0A size(nzerosIV) = %d, nfront = %d\0A\00", align 1
@.str4 = private unnamed_addr constant [60 x i8] c"\0A fatal error in ETree_mergeFrontsAll(%p,%d,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/ETree_transform.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !51, !62, !86, !110, !134, !176}
!6 = !DISubprogram(name: "ETree_transform", scope: !1, file: !1, line: 24, type: !7, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ETree* (%struct._ETree*, i32*, i32, i32, i32)* @ETree_transform, variables: !41)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !26, !15, !15, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !11, line: 31, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !11, line: 32, size: 320, align: 64, elements: !13)
!13 = !{!14, !16, !17, !29, !39, !40}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !12, file: !11, line: 35, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !20, line: 15, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !20, line: 16, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !27, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !21, file: !20, line: 17, baseType: !15, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !21, file: !20, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !21, file: !20, line: 19, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !21, file: !20, line: 20, baseType: !26, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !21, file: !20, line: 21, baseType: !26, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !12, file: !11, line: 36, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !32, line: 20, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/ETree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !32, line: 21, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 22, baseType: !15, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !33, file: !32, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !33, file: !32, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !33, file: !32, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !12, file: !11, line: 37, baseType: !30, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !12, file: !11, line: 38, baseType: !30, size: 64, align: 64, offset: 256)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !6, file: !1, line: 25, type: !9)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vwghts", arg: 2, scope: !6, file: !1, line: 26, type: !26)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxzeros", arg: 3, scope: !6, file: !1, line: 27, type: !15)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxfrontsize", arg: 4, scope: !6, file: !1, line: 28, type: !15)
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 5, scope: !6, file: !1, line: 29, type: !15)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etree2", scope: !6, file: !1, line: 31, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !6, file: !1, line: 32, type: !15)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !6, file: !1, line: 32, type: !15)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nzerosIV", scope: !6, file: !1, line: 33, type: !30)
!51 = !DISubprogram(name: "ETree_transform2", scope: !1, file: !1, line: 107, type: !7, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ETree* (%struct._ETree*, i32*, i32, i32, i32)* @ETree_transform2, variables: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !51, file: !1, line: 108, type: !9)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vwghts", arg: 2, scope: !51, file: !1, line: 109, type: !26)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxzeros", arg: 3, scope: !51, file: !1, line: 110, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxfrontsize", arg: 4, scope: !51, file: !1, line: 111, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 5, scope: !51, file: !1, line: 112, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etree2", scope: !51, file: !1, line: 114, type: !9)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !51, file: !1, line: 115, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !51, file: !1, line: 115, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nzerosIV", scope: !51, file: !1, line: 116, type: !30)
!62 = !DISubprogram(name: "ETree_mergeFrontsOne", scope: !1, file: !1, line: 180, type: !63, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ETree* (%struct._ETree*, i32, %struct._IV*)* @ETree_mergeFrontsOne, variables: !65)
!63 = !DISubroutineType(types: !64)
!64 = !{!9, !9, !15, !30}
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !62, file: !1, line: 181, type: !9)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxzeros", arg: 2, scope: !62, file: !1, line: 182, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nzerosIV", arg: 3, scope: !62, file: !1, line: 183, type: !30)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etree2", scope: !62, file: !1, line: 185, type: !9)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "costJ", scope: !62, file: !1, line: 186, type: !15)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !62, file: !1, line: 186, type: !15)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !62, file: !1, line: 186, type: !15)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !62, file: !1, line: 186, type: !15)
