; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_basics.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._FrontMtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._Tree*, %struct._ETree*, %struct._IV*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._I2Ohash*, %struct._I2Ohash*, %struct._SubMtxManager*, %struct._Lock*, %struct._PatchAndGoInfo*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._I2Ohash = type { i32, i32, i32, %struct._I2OP*, %struct._I2OP*, %struct._I2OP** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !177, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_basics.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !174, !129, !175}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FrontMtx", file: !6, line: 97, size: 1536, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../FrontMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !31, !52, !53, !76, !77, !78, !79, !80, !107, !108, !109, !110, !111, !134, !135, !160, !161, !173}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !5, file: !6, line: 98, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "neqns", scope: !5, file: !6, line: 99, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !5, file: !6, line: 100, baseType: !9, size: 32, align: 32, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "symmetryflag", scope: !5, file: !6, line: 101, baseType: !9, size: 32, align: 32, offset: 96)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "sparsityflag", scope: !5, file: !6, line: 102, baseType: !9, size: 32, align: 32, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pivotingflag", scope: !5, file: !6, line: 103, baseType: !9, size: 32, align: 32, offset: 160)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "dataMode", scope: !5, file: !6, line: 104, baseType: !9, size: 32, align: 32, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nentD", scope: !5, file: !6, line: 105, baseType: !9, size: 32, align: 32, offset: 224)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nentL", scope: !5, file: !6, line: 106, baseType: !9, size: 32, align: 32, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nentU", scope: !5, file: !6, line: 107, baseType: !9, size: 32, align: 32, offset: 288)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !5, file: !6, line: 108, baseType: !20, size: 64, align: 64, offset: 320)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !22, line: 15, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !22, line: 16, size: 256, align: 64, elements: !24)
!24 = !{!25, !26, !27, !29, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !23, file: !22, line: 17, baseType: !9, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !23, file: !22, line: 18, baseType: !9, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !23, file: !22, line: 19, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !23, file: !22, line: 20, baseType: !28, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !23, file: !22, line: 21, baseType: !28, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "frontETree", scope: !5, file: !6, line: 109, baseType: !32, size: 64, align: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !34, line: 31, baseType: !35)
!34 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !34, line: 32, size: 320, align: 64, elements: !36)
!36 = !{!37, !38, !39, !40, !50, !51}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !35, file: !34, line: 33, baseType: !9, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !35, file: !34, line: 34, baseType: !9, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !35, file: !34, line: 35, baseType: !20, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !35, file: !34, line: 36, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !43, line: 20, baseType: !44)
!43 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !43, line: 21, size: 192, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !44, file: !43, line: 22, baseType: !9, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !44, file: !43, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !44, file: !43, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !44, file: !43, line: 25, baseType: !28, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !35, file: !34, line: 37, baseType: !41, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !35, file: !34, line: 38, baseType: !41, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "frontsizesIV", scope: !5, file: !6, line: 110, baseType: !41, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "symbfacIVL", scope: !5, file: !6, line: 111, baseType: !54, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !56, line: 55, baseType: !57)
!56 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !56, line: 79, size: 384, align: 64, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !66, !67}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !56, line: 80, baseType: !9, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !57, file: !56, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !57, file: !56, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !57, file: !56, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !57, file: !56, line: 84, baseType: !28, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !57, file: !56, line: 85, baseType: !65, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !57, file: !56, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !57, file: !56, line: 87, baseType: !68, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !56, line: 56, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !56, line: 102, size: 192, align: 64, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !56, line: 103, baseType: !9, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !70, file: !56, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !70, file: !56, line: 105, baseType: !28, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !56, line: 106, baseType: !68, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rowadjIVL", scope: !5, file: !6, line: 112, baseType: !54, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "coladjIVL", scope: !5, file: !6, line: 113, baseType: !54, size: 64, align: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "lowerblockIVL", scope: !5, file: !6, line: 114, baseType: !54, size: 64, align: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "upperblockIVL", scope: !5, file: !6, line: 115, baseType: !54, size: 64, align: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxDJJ", scope: !5, file: !6, line: 116, baseType: !81, size: 64, align: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !84, line: 43, baseType: !85)
!84 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !84, line: 44, size: 576, align: 64, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !97, !106}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !84, line: 45, baseType: !9, size: 32, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !85, file: !84, line: 46, baseType: !9, size: 32, align: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !85, file: !84, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !85, file: !84, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !85, file: !84, line: 49, baseType: !9, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !85, file: !84, line: 50, baseType: !9, size: 32, align: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !85, file: !84, line: 51, baseType: !9, size: 32, align: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !85, file: !84, line: 52, baseType: !95, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !85, file: !84, line: 53, baseType: !98, size: 192, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !99, line: 20, baseType: !100)
!99 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !99, line: 21, size: 192, align: 64, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !99, line: 22, baseType: !9, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !100, file: !99, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !100, file: !99, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !100, file: !99, line: 25, baseType: !95, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !84, line: 54, baseType: !82, size: 64, align: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJJ", scope: !5, file: !6, line: 117, baseType: !81, size: 64, align: 64, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJN", scope: !5, file: !6, line: 118, baseType: !81, size: 64, align: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLJJ", scope: !5, file: !6, line: 119, baseType: !81, size: 64, align: 64, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLNJ", scope: !5, file: !6, line: 120, baseType: !81, size: 64, align: 64, offset: 1088)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "lowerhash", scope: !5, file: !6, line: 121, baseType: !112, size: 64, align: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !114, line: 6, baseType: !115)
!114 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../I2Ohash/I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !114, line: 7, size: 320, align: 64, elements: !116)
!116 = !{!117, !118, !119, !120, !131, !132}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !115, file: !114, line: 8, baseType: !9, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !115, file: !114, line: 9, baseType: !9, size: 32, align: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !115, file: !114, line: 10, baseType: !9, size: 32, align: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !115, file: !114, line: 11, baseType: !121, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !123, line: 5, baseType: !124)
!123 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !123, line: 6, size: 192, align: 64, elements: !125)
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !124, file: !123, line: 7, baseType: !9, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !124, file: !123, line: 8, baseType: !9, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !124, file: !123, line: 9, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !123, line: 10, baseType: !121, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !115, file: !114, line: 12, baseType: !121, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !115, file: !114, line: 13, baseType: !133, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "upperhash", scope: !5, file: !6, line: 122, baseType: !112, size: 64, align: 64, offset: 1216)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !5, file: !6, line: 123, baseType: !136, size: 64, align: 64, offset: 1280)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !138, line: 9, baseType: !139)
!138 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxManager/SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !138, line: 10, size: 448, align: 64, elements: !140)
!140 = !{!141, !142, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !139, file: !138, line: 11, baseType: !82, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !139, file: !138, line: 12, baseType: !143, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !145, line: 36, baseType: !146)
!145 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !145, line: 37, size: 128, align: 64, elements: !147)
!147 = !{!148, !149, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !146, file: !145, line: 45, baseType: !129, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !146, file: !145, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !146, file: !145, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !139, file: !138, line: 13, baseType: !9, size: 32, align: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !139, file: !138, line: 14, baseType: !9, size: 32, align: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !139, file: !138, line: 15, baseType: !9, size: 32, align: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !139, file: !138, line: 16, baseType: !9, size: 32, align: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !139, file: !138, line: 17, baseType: !9, size: 32, align: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !139, file: !138, line: 18, baseType: !9, size: 32, align: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !139, file: !138, line: 19, baseType: !9, size: 32, align: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !139, file: !138, line: 20, baseType: !9, size: 32, align: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !139, file: !138, line: 21, baseType: !9, size: 32, align: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !5, file: !6, line: 124, baseType: !143, size: 64, align: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "patchinfo", scope: !5, file: !6, line: 125, baseType: !162, size: 64, align: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !164, line: 31, baseType: !165)
!164 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !164, line: 32, size: 320, align: 64, elements: !166)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !165, file: !164, line: 33, baseType: !9, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !165, file: !164, line: 34, baseType: !96, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !165, file: !164, line: 35, baseType: !96, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !165, file: !164, line: 36, baseType: !41, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !165, file: !164, line: 37, baseType: !172, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !5, file: !6, line: 126, baseType: !9, size: 32, align: 32, offset: 1472)
!174 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!177 = !{!178, !185, !190, !200}
!178 = !DISubprogram(name: "FrontMtx_new", scope: !1, file: !1, line: 16, type: !179, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: %struct._FrontMtx* ()* @FrontMtx_new, variables: !183)
!179 = !DISubroutineType(types: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrontMtx", file: !6, line: 96, baseType: !5)
!183 = !{!184}
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontmtx", scope: !178, file: !1, line: 19, type: !181)
!185 = !DISubprogram(name: "FrontMtx_setDefaultFields", scope: !1, file: !1, line: 35, type: !186, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*)* @FrontMtx_setDefaultFields, variables: !188)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !181}
!188 = !{!189}
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !185, file: !1, line: 36, type: !181)
!190 = !DISubprogram(name: "FrontMtx_clearData", scope: !1, file: !1, line: 82, type: !186, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*)* @FrontMtx_clearData, variables: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !190, file: !1, line: 83, type: !181)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtx", scope: !190, file: !1, line: 85, type: !82)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !190, file: !1, line: 86, type: !9)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !190, file: !1, line: 86, type: !9)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !190, file: !1, line: 86, type: !9)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nadj", scope: !190, file: !1, line: 86, type: !9)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !190, file: !1, line: 86, type: !9)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !190, file: !1, line: 87, type: !28)
!200 = !DISubprogram(name: "FrontMtx_free", scope: !1, file: !1, line: 221, type: !186, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*)* @FrontMtx_free, variables: !201)
!201 = !{!202}
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !200, file: !1, line: 222, type: !181)
!203 = !{i32 2, !"Dwarf Version", i32 2}
!204 = !{i32 2, !"Debug Info Version", i32 700000003}
!205 = !{i32 1, !"PIC Level", i32 2}
!206 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!207 = !DILocation(line: 21, column: 1, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !1, line: 21, column: 1)
!209 = distinct !DILexicalBlock(scope: !210, file: !1, line: 21, column: 1)
!210 = distinct !DILexicalBlock(scope: !178, file: !1, line: 21, column: 1)
!211 = !DIExpression()
!212 = !DILocation(line: 19, column: 13, scope: !178)
!213 = !DILocation(line: 21, column: 1, scope: !209)
!214 = !DILocation(line: 21, column: 1, scope: !215)
!215 = distinct !DILexicalBlock(scope: !208, file: !1, line: 21, column: 1)
!216 = !{!217, !217, i64 0}
!217 = !{!"any pointer", !218, i64 0}
!218 = !{!"omnipotent char", !219, i64 0}
!219 = !{!"Simple C/C++ TBAA"}
!220 = !DILocation(line: 22, column: 1, scope: !178)
