; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._FrontMtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._Tree*, %struct._ETree*, %struct._IV*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._I2Ohash*, %struct._I2Ohash*, %struct._SubMtxManager*, %struct._Lock*, %struct._PatchAndGoInfo*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._I2Ohash = type { i32, i32, i32, %struct._I2OP*, %struct._I2OP*, %struct._I2OP** }
%struct._I2OP = type { i32, i32, i8*, %struct._I2OP* }
%struct._Lock = type { i8*, i32, i32 }
%struct._PatchAndGoInfo = type { i32, double, double, %struct._IV*, %struct._DV* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !34, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !33}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !8, line: 44, size: 576, align: 64, elements: !9)
!8 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !{!10, !12, !13, !14, !15, !16, !17, !18, !21, !30}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !7, file: !8, line: 45, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !7, file: !8, line: 46, baseType: !11, size: 32, align: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !7, file: !8, line: 47, baseType: !11, size: 32, align: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !7, file: !8, line: 48, baseType: !11, size: 32, align: 32, offset: 96)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !7, file: !8, line: 49, baseType: !11, size: 32, align: 32, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !7, file: !8, line: 50, baseType: !11, size: 32, align: 32, offset: 160)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !7, file: !8, line: 51, baseType: !11, size: 32, align: 32, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !7, file: !8, line: 52, baseType: !19, size: 64, align: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !7, file: !8, line: 53, baseType: !22, size: 192, align: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !23, line: 20, baseType: !24)
!23 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !23, line: 21, size: 192, align: 64, elements: !25)
!25 = !{!26, !27, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !24, file: !23, line: 22, baseType: !11, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !24, file: !23, line: 23, baseType: !11, size: 32, align: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !24, file: !23, line: 24, baseType: !11, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !24, file: !23, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 54, baseType: !31, size: 64, align: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !8, line: 43, baseType: !7)
!33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DISubprogram(name: "FrontMtx_init", scope: !1, file: !1, line: 61, type: !36, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, %struct._ETree*, %struct._IVL*, i32, i32, i32, i32, i32, i32, %struct._IV*, %struct._SubMtxManager*, i32, %struct.__sFILE*)* @FrontMtx_init, variables: !244)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !66, !88, !11, !11, !11, !11, !11, !11, !75, !144, !11, !182}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrontMtx", file: !40, line: 96, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../FrontMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FrontMtx", file: !40, line: 97, size: 1536, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !65, !86, !87, !110, !111, !112, !113, !114, !116, !117, !118, !119, !120, !142, !143, !168, !169, !181}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !41, file: !40, line: 98, baseType: !11, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "neqns", scope: !41, file: !40, line: 99, baseType: !11, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !40, line: 100, baseType: !11, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "symmetryflag", scope: !41, file: !40, line: 101, baseType: !11, size: 32, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sparsityflag", scope: !41, file: !40, line: 102, baseType: !11, size: 32, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pivotingflag", scope: !41, file: !40, line: 103, baseType: !11, size: 32, align: 32, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dataMode", scope: !41, file: !40, line: 104, baseType: !11, size: 32, align: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nentD", scope: !41, file: !40, line: 105, baseType: !11, size: 32, align: 32, offset: 224)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nentL", scope: !41, file: !40, line: 106, baseType: !11, size: 32, align: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nentU", scope: !41, file: !40, line: 107, baseType: !11, size: 32, align: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !41, file: !40, line: 108, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !56, line: 15, baseType: !57)
!56 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !56, line: 16, size: 256, align: 64, elements: !58)
!58 = !{!59, !60, !61, !63, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !57, file: !56, line: 17, baseType: !11, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !57, file: !56, line: 18, baseType: !11, size: 32, align: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !57, file: !56, line: 19, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !57, file: !56, line: 20, baseType: !62, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !57, file: !56, line: 21, baseType: !62, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "frontETree", scope: !41, file: !40, line: 109, baseType: !66, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !68, line: 31, baseType: !69)
!68 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !68, line: 32, size: 320, align: 64, elements: !70)
!70 = !{!71, !72, !73, !74, !84, !85}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !69, file: !68, line: 33, baseType: !11, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !69, file: !68, line: 34, baseType: !11, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !69, file: !68, line: 35, baseType: !54, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !69, file: !68, line: 36, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !77, line: 20, baseType: !78)
!77 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !77, line: 21, size: 192, align: 64, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !78, file: !77, line: 22, baseType: !11, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !78, file: !77, line: 23, baseType: !11, size: 32, align: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !78, file: !77, line: 24, baseType: !11, size: 32, align: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !78, file: !77, line: 25, baseType: !62, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !69, file: !68, line: 37, baseType: !75, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !69, file: !68, line: 38, baseType: !75, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "frontsizesIV", scope: !41, file: !40, line: 110, baseType: !75, size: 64, align: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "symbfacIVL", scope: !41, file: !40, line: 111, baseType: !88, size: 64, align: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !90, line: 55, baseType: !91)
!90 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !90, line: 79, size: 384, align: 64, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !100, !101}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !90, line: 80, baseType: !11, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !91, file: !90, line: 81, baseType: !11, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !91, file: !90, line: 82, baseType: !11, size: 32, align: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !91, file: !90, line: 83, baseType: !11, size: 32, align: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !91, file: !90, line: 84, baseType: !62, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !91, file: !90, line: 85, baseType: !99, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !91, file: !90, line: 86, baseType: !11, size: 32, align: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !91, file: !90, line: 87, baseType: !102, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !90, line: 56, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !90, line: 102, size: 192, align: 64, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !90, line: 103, baseType: !11, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !104, file: !90, line: 104, baseType: !11, size: 32, align: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !104, file: !90, line: 105, baseType: !62, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !90, line: 106, baseType: !102, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rowadjIVL", scope: !41, file: !40, line: 112, baseType: !88, size: 64, align: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "coladjIVL", scope: !41, file: !40, line: 113, baseType: !88, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "lowerblockIVL", scope: !41, file: !40, line: 114, baseType: !88, size: 64, align: 64, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "upperblockIVL", scope: !41, file: !40, line: 115, baseType: !88, size: 64, align: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxDJJ", scope: !41, file: !40, line: 116, baseType: !115, size: 64, align: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJJ", scope: !41, file: !40, line: 117, baseType: !115, size: 64, align: 64, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJN", scope: !41, file: !40, line: 118, baseType: !115, size: 64, align: 64, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLJJ", scope: !41, file: !40, line: 119, baseType: !115, size: 64, align: 64, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLNJ", scope: !41, file: !40, line: 120, baseType: !115, size: 64, align: 64, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lowerhash", scope: !41, file: !40, line: 121, baseType: !121, size: 64, align: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !123, line: 6, baseType: !124)
!123 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../I2Ohash/I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !123, line: 7, size: 320, align: 64, elements: !125)
!125 = !{!126, !127, !128, !129, !139, !140}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !124, file: !123, line: 8, baseType: !11, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !124, file: !123, line: 9, baseType: !11, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !124, file: !123, line: 10, baseType: !11, size: 32, align: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !124, file: !123, line: 11, baseType: !130, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !132, line: 5, baseType: !133)
!132 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !132, line: 6, size: 192, align: 64, elements: !134)
!134 = !{!135, !136, !137, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !133, file: !132, line: 7, baseType: !11, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !133, file: !132, line: 8, baseType: !11, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !133, file: !132, line: 9, baseType: !4, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !132, line: 10, baseType: !130, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !124, file: !123, line: 12, baseType: !130, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !124, file: !123, line: 13, baseType: !141, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "upperhash", scope: !41, file: !40, line: 122, baseType: !121, size: 64, align: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !41, file: !40, line: 123, baseType: !144, size: 64, align: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !146, line: 9, baseType: !147)
!146 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxManager/SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !146, line: 10, size: 448, align: 64, elements: !148)
!148 = !{!149, !150, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !147, file: !146, line: 11, baseType: !31, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !147, file: !146, line: 12, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !153, line: 36, baseType: !154)
!153 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !153, line: 37, size: 128, align: 64, elements: !155)
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !154, file: !153, line: 45, baseType: !4, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !154, file: !153, line: 47, baseType: !11, size: 32, align: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !154, file: !153, line: 48, baseType: !11, size: 32, align: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !147, file: !146, line: 13, baseType: !11, size: 32, align: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !147, file: !146, line: 14, baseType: !11, size: 32, align: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !147, file: !146, line: 15, baseType: !11, size: 32, align: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !147, file: !146, line: 16, baseType: !11, size: 32, align: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !147, file: !146, line: 17, baseType: !11, size: 32, align: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !147, file: !146, line: 18, baseType: !11, size: 32, align: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !147, file: !146, line: 19, baseType: !11, size: 32, align: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !147, file: !146, line: 20, baseType: !11, size: 32, align: 32, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !147, file: !146, line: 21, baseType: !11, size: 32, align: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !41, file: !40, line: 124, baseType: !151, size: 64, align: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "patchinfo", scope: !41, file: !40, line: 125, baseType: !170, size: 64, align: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !172, line: 31, baseType: !173)
!172 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !172, line: 32, size: 320, align: 64, elements: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !173, file: !172, line: 33, baseType: !11, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !173, file: !172, line: 34, baseType: !20, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !173, file: !172, line: 35, baseType: !20, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !173, file: !172, line: 36, baseType: !75, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !173, file: !172, line: 37, baseType: !180, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !41, file: !40, line: 126, baseType: !11, size: 32, align: 32, offset: 1472)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !184, line: 153, baseType: !185)
!184 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !184, line: 122, size: 1216, align: 64, elements: !186)
!186 = !{!187, !190, !191, !192, !194, !195, !200, !201, !202, !206, !212, !222, !228, !229, !232, !233, !237, !241, !242, !243}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !185, file: !184, line: 123, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !185, file: !184, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !185, file: !184, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !185, file: !184, line: 126, baseType: !193, size: 16, align: 16, offset: 128)
!193 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !185, file: !184, line: 127, baseType: !193, size: 16, align: 16, offset: 144)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !185, file: !184, line: 128, baseType: !196, size: 128, align: 64, offset: 192)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !184, line: 88, size: 128, align: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !196, file: !184, line: 89, baseType: !188, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !196, file: !184, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !185, file: !184, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !185, file: !184, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !185, file: !184, line: 133, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!11, !4}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !185, file: !184, line: 134, baseType: !207, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!11, !4, !210, !11}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !185, file: !184, line: 135, baseType: !213, size: 64, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !4, !216, !11}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !184, line: 77, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !218, line: 71, baseType: !219)
!218 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !220, line: 46, baseType: !221)
!220 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!221 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !185, file: !184, line: 136, baseType: !223, size: 64, align: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!11, !4, !226, !11}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !185, file: !184, line: 139, baseType: !196, size: 128, align: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !185, file: !184, line: 140, baseType: !230, size: 64, align: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !184, line: 94, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !185, file: !184, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !185, file: !184, line: 144, baseType: !234, size: 24, align: 8, offset: 928)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 24, align: 8, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 3)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !185, file: !184, line: 145, baseType: !238, size: 8, align: 8, offset: 952)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, align: 8, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 1)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !185, file: !184, line: 148, baseType: !196, size: 128, align: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !185, file: !184, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !185, file: !184, line: 152, baseType: !216, size: 64, align: 64, offset: 1152)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !276, !277, !278, !279, !280, !281}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !35, file: !1, line: 62, type: !38)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontETree", arg: 2, scope: !35, file: !1, line: 63, type: !66)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbfacIVL", arg: 3, scope: !35, file: !1, line: 64, type: !88)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 4, scope: !35, file: !1, line: 65, type: !11)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symmetryflag", arg: 5, scope: !35, file: !1, line: 66, type: !11)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sparsityflag", arg: 6, scope: !35, file: !1, line: 67, type: !11)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivotingflag", arg: 7, scope: !35, file: !1, line: 68, type: !11)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lockflag", arg: 8, scope: !35, file: !1, line: 69, type: !11)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 9, scope: !35, file: !1, line: 70, type: !11)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ownersIV", arg: 10, scope: !35, file: !1, line: 71, type: !75)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 11, scope: !35, file: !1, line: 72, type: !144)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 12, scope: !35, file: !1, line: 73, type: !11)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 13, scope: !35, file: !1, line: 74, type: !182)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtx", scope: !35, file: !1, line: 76, type: !31)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !35, file: !1, line: 77, type: !11)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !35, file: !1, line: 77, type: !11)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nentD", scope: !35, file: !1, line: 77, type: !11)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nentL", scope: !35, file: !1, line: 77, type: !11)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nentU", scope: !35, file: !1, line: 77, type: !11)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neqns", scope: !35, file: !1, line: 77, type: !11)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !35, file: !1, line: 77, type: !11)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !35, file: !1, line: 77, type: !11)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !35, file: !1, line: 77, type: !11)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !35, file: !1, line: 77, type: !11)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !35, file: !1, line: 78, type: !62)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !35, file: !1, line: 78, type: !62)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "owners", scope: !35, file: !1, line: 78, type: !62)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !35, file: !1, line: 78, type: !62)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !274, file: !1, line: 230, type: !19)
!274 = distinct !DILexicalBlock(scope: !275, file: !1, line: 229, column: 44)
!275 = distinct !DILexicalBlock(scope: !35, file: !1, line: 228, column: 7)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !274, file: !1, line: 231, type: !11)
