; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_instance.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._FrontMtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._Tree*, %struct._ETree*, %struct._IV*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._I2Ohash*, %struct._I2Ohash*, %struct._SubMtxManager*, %struct._Lock*, %struct._PatchAndGoInfo*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._I2Ohash = type { i32, i32, i32, %struct._I2OP*, %struct._I2OP*, %struct._I2OP** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_instance.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !181, !184, !189, !203, !209, !216, !224, !230, !236, !245, !252, !258, !264, !268, !271, !276}
!6 = !DISubprogram(name: "FrontMtx_nfront", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._FrontMtx*)* @FrontMtx_nfront, variables: !179)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrontMtx", file: !12, line: 96, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../FrontMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FrontMtx", file: !12, line: 97, size: 1536, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !37, !58, !59, !82, !83, !84, !85, !86, !113, !114, !115, !116, !117, !139, !140, !165, !166, !178}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !13, file: !12, line: 98, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "neqns", scope: !13, file: !12, line: 99, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 100, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "symmetryflag", scope: !13, file: !12, line: 101, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sparsityflag", scope: !13, file: !12, line: 102, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "pivotingflag", scope: !13, file: !12, line: 103, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "dataMode", scope: !13, file: !12, line: 104, baseType: !9, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "nentD", scope: !13, file: !12, line: 105, baseType: !9, size: 32, align: 32, offset: 224)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "nentL", scope: !13, file: !12, line: 106, baseType: !9, size: 32, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nentU", scope: !13, file: !12, line: 107, baseType: !9, size: 32, align: 32, offset: 288)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !13, file: !12, line: 108, baseType: !26, size: 64, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !28, line: 15, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !28, line: 16, size: 256, align: 64, elements: !30)
!30 = !{!31, !32, !33, !35, !36}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !29, file: !28, line: 17, baseType: !9, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !29, file: !28, line: 18, baseType: !9, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !29, file: !28, line: 19, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !29, file: !28, line: 20, baseType: !34, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !29, file: !28, line: 21, baseType: !34, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "frontETree", scope: !13, file: !12, line: 109, baseType: !38, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !40, line: 31, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !40, line: 32, size: 320, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46, !56, !57}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !41, file: !40, line: 33, baseType: !9, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !41, file: !40, line: 34, baseType: !9, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !41, file: !40, line: 35, baseType: !26, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !41, file: !40, line: 36, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !49, line: 20, baseType: !50)
!49 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !49, line: 21, size: 192, align: 64, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !49, line: 22, baseType: !9, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !50, file: !49, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !50, file: !49, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !50, file: !49, line: 25, baseType: !34, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !41, file: !40, line: 37, baseType: !47, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !41, file: !40, line: 38, baseType: !47, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "frontsizesIV", scope: !13, file: !12, line: 110, baseType: !47, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "symbfacIVL", scope: !13, file: !12, line: 111, baseType: !60, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !62, line: 55, baseType: !63)
!62 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !62, line: 79, size: 384, align: 64, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !72, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !62, line: 80, baseType: !9, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !63, file: !62, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !63, file: !62, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !63, file: !62, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !63, file: !62, line: 84, baseType: !34, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !63, file: !62, line: 85, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !63, file: !62, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !63, file: !62, line: 87, baseType: !74, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !62, line: 56, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !62, line: 102, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !62, line: 103, baseType: !9, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !76, file: !62, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !76, file: !62, line: 105, baseType: !34, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !62, line: 106, baseType: !74, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rowadjIVL", scope: !13, file: !12, line: 112, baseType: !60, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "coladjIVL", scope: !13, file: !12, line: 113, baseType: !60, size: 64, align: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lowerblockIVL", scope: !13, file: !12, line: 114, baseType: !60, size: 64, align: 64, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "upperblockIVL", scope: !13, file: !12, line: 115, baseType: !60, size: 64, align: 64, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxDJJ", scope: !13, file: !12, line: 116, baseType: !87, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !90, line: 43, baseType: !91)
!90 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !90, line: 44, size: 576, align: 64, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !103, !112}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !90, line: 45, baseType: !9, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !91, file: !90, line: 46, baseType: !9, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !91, file: !90, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !91, file: !90, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !91, file: !90, line: 49, baseType: !9, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !91, file: !90, line: 50, baseType: !9, size: 32, align: 32, offset: 160)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !91, file: !90, line: 51, baseType: !9, size: 32, align: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !91, file: !90, line: 52, baseType: !101, size: 64, align: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !91, file: !90, line: 53, baseType: !104, size: 192, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !105, line: 20, baseType: !106)
!105 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !105, line: 21, size: 192, align: 64, elements: !107)
!107 = !{!108, !109, !110, !111}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !105, line: 22, baseType: !9, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !106, file: !105, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !106, file: !105, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !106, file: !105, line: 25, baseType: !101, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !90, line: 54, baseType: !88, size: 64, align: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJJ", scope: !13, file: !12, line: 117, baseType: !87, size: 64, align: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJN", scope: !13, file: !12, line: 118, baseType: !87, size: 64, align: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLJJ", scope: !13, file: !12, line: 119, baseType: !87, size: 64, align: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLNJ", scope: !13, file: !12, line: 120, baseType: !87, size: 64, align: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lowerhash", scope: !13, file: !12, line: 121, baseType: !118, size: 64, align: 64, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !120, line: 6, baseType: !121)
!120 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../I2Ohash/I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !120, line: 7, size: 320, align: 64, elements: !122)
!122 = !{!123, !124, !125, !126, !136, !137}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !121, file: !120, line: 8, baseType: !9, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !121, file: !120, line: 9, baseType: !9, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !121, file: !120, line: 10, baseType: !9, size: 32, align: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !121, file: !120, line: 11, baseType: !127, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !129, line: 5, baseType: !130)
!129 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !129, line: 6, size: 192, align: 64, elements: !131)
!131 = !{!132, !133, !134, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !130, file: !129, line: 7, baseType: !9, size: 32, align: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !130, file: !129, line: 8, baseType: !9, size: 32, align: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !130, file: !129, line: 9, baseType: !4, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !129, line: 10, baseType: !127, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !121, file: !120, line: 12, baseType: !127, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !121, file: !120, line: 13, baseType: !138, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "upperhash", scope: !13, file: !12, line: 122, baseType: !118, size: 64, align: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !13, file: !12, line: 123, baseType: !141, size: 64, align: 64, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !143, line: 9, baseType: !144)
!143 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxManager/SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !143, line: 10, size: 448, align: 64, elements: !145)
!145 = !{!146, !147, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !144, file: !143, line: 11, baseType: !88, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !144, file: !143, line: 12, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !150, line: 36, baseType: !151)
!150 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !150, line: 37, size: 128, align: 64, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !151, file: !150, line: 45, baseType: !4, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !151, file: !150, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !151, file: !150, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !144, file: !143, line: 13, baseType: !9, size: 32, align: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !144, file: !143, line: 14, baseType: !9, size: 32, align: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !144, file: !143, line: 15, baseType: !9, size: 32, align: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !144, file: !143, line: 16, baseType: !9, size: 32, align: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !144, file: !143, line: 17, baseType: !9, size: 32, align: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !144, file: !143, line: 18, baseType: !9, size: 32, align: 32, offset: 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !144, file: !143, line: 19, baseType: !9, size: 32, align: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !144, file: !143, line: 20, baseType: !9, size: 32, align: 32, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !144, file: !143, line: 21, baseType: !9, size: 32, align: 32, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !13, file: !12, line: 124, baseType: !148, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "patchinfo", scope: !13, file: !12, line: 125, baseType: !167, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !169, line: 31, baseType: !170)
!169 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !169, line: 32, size: 320, align: 64, elements: !171)
!171 = !{!172, !173, !174, !175, !176}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !170, file: !169, line: 33, baseType: !9, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !170, file: !169, line: 34, baseType: !102, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !170, file: !169, line: 35, baseType: !102, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !170, file: !169, line: 36, baseType: !47, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !170, file: !169, line: 37, baseType: !177, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !13, file: !12, line: 126, baseType: !9, size: 32, align: 32, offset: 1472)
!179 = !{!180}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !6, file: !1, line: 15, type: !10)
!181 = !DISubprogram(name: "FrontMtx_neqns", scope: !1, file: !1, line: 38, type: !7, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._FrontMtx*)* @FrontMtx_neqns, variables: !182)
!182 = !{!183}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !181, file: !1, line: 39, type: !10)
!184 = !DISubprogram(name: "FrontMtx_frontTree", scope: !1, file: !1, line: 62, type: !185, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Tree* (%struct._FrontMtx*)* @FrontMtx_frontTree, variables: !187)
!185 = !DISubroutineType(types: !186)
!186 = !{!26, !10}
!187 = !{!188}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !184, file: !1, line: 63, type: !10)
!189 = !DISubprogram(name: "FrontMtx_initialFrontDimensions", scope: !1, file: !1, line: 87, type: !190, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i32, i32*, i32*, i32*, i32*)* @FrontMtx_initialFrontDimensions, variables: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !10, !9, !34, !34, !34, !34}
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !189, file: !1, line: 88, type: !10)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 2, scope: !189, file: !1, line: 89, type: !9)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnD", arg: 3, scope: !189, file: !1, line: 90, type: !34)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnL", arg: 4, scope: !189, file: !1, line: 91, type: !34)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnU", arg: 5, scope: !189, file: !1, line: 92, type: !34)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnbytes", arg: 6, scope: !189, file: !1, line: 93, type: !34)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !189, file: !1, line: 95, type: !9)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !189, file: !1, line: 95, type: !9)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !189, file: !1, line: 95, type: !9)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !189, file: !1, line: 95, type: !9)
!203 = !DISubprogram(name: "FrontMtx_frontSize", scope: !1, file: !1, line: 165, type: !204, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._FrontMtx*, i32)* @FrontMtx_frontSize, variables: !206)
!204 = !DISubroutineType(types: !205)
!205 = !{!9, !10, !9}
!206 = !{!207, !208}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !203, file: !1, line: 166, type: !10)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 2, scope: !203, file: !1, line: 167, type: !9)
!209 = !DISubprogram(name: "FrontMtx_setFrontSize", scope: !1, file: !1, line: 191, type: !210, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i32, i32)* @FrontMtx_setFrontSize, variables: !212)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !10, !9, !9}
!212 = !{!213, !214, !215}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !209, file: !1, line: 192, type: !10)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 2, scope: !209, file: !1, line: 193, type: !9)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !209, file: !1, line: 194, type: !9)
