; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_postponed.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._FrontMtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._Tree*, %struct._ETree*, %struct._IV*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._I2Ohash*, %struct._I2Ohash*, %struct._SubMtxManager*, %struct._Lock*, %struct._PatchAndGoInfo*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._I2Ohash = type { i32, i32, i32, %struct._I2OP*, %struct._I2OP*, %struct._I2OP** }
%struct._I2OP = type { i32, i32, i8*, %struct._I2OP* }
%struct._SubMtxManager = type { %struct._SubMtx*, %struct._Lock*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._Lock = type { i8*, i32, i32 }
%struct._PatchAndGoInfo = type { i32, double, double, %struct._IV*, %struct._DV* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_postponed.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !239}
!6 = !DISubprogram(name: "FrontMtx_assemblePostponedData", scope: !1, file: !1, line: 26, type: !7, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Chv* (%struct._FrontMtx*, %struct._Chv*, %struct._ChvList*, %struct._ChvManager*, i32*)* @FrontMtx_assemblePostponedData, variables: !225)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !37, !9, !195, !209, !22}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Chv/Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !11, line: 31, size: 640, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !12, file: !11, line: 37, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 42, baseType: !9, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrontMtx", file: !39, line: 96, baseType: !40)
!39 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../FrontMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FrontMtx", file: !39, line: 97, size: 1536, align: 64, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !63, !84, !85, !108, !109, !110, !111, !112, !129, !130, !131, !132, !133, !155, !156, !181, !182, !194}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !40, file: !39, line: 98, baseType: !15, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "neqns", scope: !40, file: !39, line: 99, baseType: !15, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 100, baseType: !15, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "symmetryflag", scope: !40, file: !39, line: 101, baseType: !15, size: 32, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sparsityflag", scope: !40, file: !39, line: 102, baseType: !15, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pivotingflag", scope: !40, file: !39, line: 103, baseType: !15, size: 32, align: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "dataMode", scope: !40, file: !39, line: 104, baseType: !15, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nentD", scope: !40, file: !39, line: 105, baseType: !15, size: 32, align: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nentL", scope: !40, file: !39, line: 106, baseType: !15, size: 32, align: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nentU", scope: !40, file: !39, line: 107, baseType: !15, size: 32, align: 32, offset: 288)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !40, file: !39, line: 108, baseType: !53, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !55, line: 15, baseType: !56)
!55 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !55, line: 16, size: 256, align: 64, elements: !57)
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !56, file: !55, line: 17, baseType: !15, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !56, file: !55, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !56, file: !55, line: 19, baseType: !22, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !56, file: !55, line: 20, baseType: !22, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !56, file: !55, line: 21, baseType: !22, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "frontETree", scope: !40, file: !39, line: 109, baseType: !64, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !66, line: 31, baseType: !67)
!66 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !66, line: 32, size: 320, align: 64, elements: !68)
!68 = !{!69, !70, !71, !72, !82, !83}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !67, file: !66, line: 33, baseType: !15, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !67, file: !66, line: 34, baseType: !15, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !67, file: !66, line: 35, baseType: !53, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !67, file: !66, line: 36, baseType: !73, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !75, line: 20, baseType: !76)
!75 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !75, line: 21, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !75, line: 22, baseType: !15, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !76, file: !75, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !76, file: !75, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !76, file: !75, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !67, file: !66, line: 37, baseType: !73, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !67, file: !66, line: 38, baseType: !73, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "frontsizesIV", scope: !40, file: !39, line: 110, baseType: !73, size: 64, align: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "symbfacIVL", scope: !40, file: !39, line: 111, baseType: !86, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !88, line: 55, baseType: !89)
!88 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !88, line: 79, size: 384, align: 64, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !98, !99}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !88, line: 80, baseType: !15, size: 32, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !89, file: !88, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !89, file: !88, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !89, file: !88, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !89, file: !88, line: 84, baseType: !22, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !89, file: !88, line: 85, baseType: !97, size: 64, align: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !89, file: !88, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !89, file: !88, line: 87, baseType: !100, size: 64, align: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !88, line: 56, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !88, line: 102, size: 192, align: 64, elements: !103)
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !88, line: 103, baseType: !15, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !102, file: !88, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !102, file: !88, line: 105, baseType: !22, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !88, line: 106, baseType: !100, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rowadjIVL", scope: !40, file: !39, line: 112, baseType: !86, size: 64, align: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "coladjIVL", scope: !40, file: !39, line: 113, baseType: !86, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lowerblockIVL", scope: !40, file: !39, line: 114, baseType: !86, size: 64, align: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "upperblockIVL", scope: !40, file: !39, line: 115, baseType: !86, size: 64, align: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxDJJ", scope: !40, file: !39, line: 116, baseType: !113, size: 64, align: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !116, line: 43, baseType: !117)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !116, line: 44, size: 576, align: 64, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !116, line: 45, baseType: !15, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !117, file: !116, line: 46, baseType: !15, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !117, file: !116, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !117, file: !116, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !117, file: !116, line: 49, baseType: !15, size: 32, align: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !117, file: !116, line: 50, baseType: !15, size: 32, align: 32, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !117, file: !116, line: 51, baseType: !15, size: 32, align: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !117, file: !116, line: 52, baseType: !25, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !117, file: !116, line: 53, baseType: !28, size: 192, align: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !116, line: 54, baseType: !114, size: 64, align: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJJ", scope: !40, file: !39, line: 117, baseType: !113, size: 64, align: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJN", scope: !40, file: !39, line: 118, baseType: !113, size: 64, align: 64, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLJJ", scope: !40, file: !39, line: 119, baseType: !113, size: 64, align: 64, offset: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLNJ", scope: !40, file: !39, line: 120, baseType: !113, size: 64, align: 64, offset: 1088)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "lowerhash", scope: !40, file: !39, line: 121, baseType: !134, size: 64, align: 64, offset: 1152)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !136, line: 6, baseType: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../I2Ohash/I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !136, line: 7, size: 320, align: 64, elements: !138)
!138 = !{!139, !140, !141, !142, !152, !153}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !137, file: !136, line: 8, baseType: !15, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !137, file: !136, line: 9, baseType: !15, size: 32, align: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !137, file: !136, line: 10, baseType: !15, size: 32, align: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !137, file: !136, line: 11, baseType: !143, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !145, line: 5, baseType: !146)
!145 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !145, line: 6, size: 192, align: 64, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !146, file: !145, line: 7, baseType: !15, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !146, file: !145, line: 8, baseType: !15, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !146, file: !145, line: 9, baseType: !4, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !145, line: 10, baseType: !143, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !137, file: !136, line: 12, baseType: !143, size: 64, align: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !137, file: !136, line: 13, baseType: !154, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "upperhash", scope: !40, file: !39, line: 122, baseType: !134, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !40, file: !39, line: 123, baseType: !157, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !159, line: 9, baseType: !160)
!159 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxManager/SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !159, line: 10, size: 448, align: 64, elements: !161)
!161 = !{!162, !163, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !160, file: !159, line: 11, baseType: !114, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !160, file: !159, line: 12, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !166, line: 36, baseType: !167)
!166 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !166, line: 37, size: 128, align: 64, elements: !168)
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !167, file: !166, line: 45, baseType: !4, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !167, file: !166, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !167, file: !166, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !160, file: !159, line: 13, baseType: !15, size: 32, align: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !160, file: !159, line: 14, baseType: !15, size: 32, align: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !160, file: !159, line: 15, baseType: !15, size: 32, align: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !160, file: !159, line: 16, baseType: !15, size: 32, align: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !160, file: !159, line: 17, baseType: !15, size: 32, align: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !160, file: !159, line: 18, baseType: !15, size: 32, align: 32, offset: 288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !160, file: !159, line: 19, baseType: !15, size: 32, align: 32, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !160, file: !159, line: 20, baseType: !15, size: 32, align: 32, offset: 352)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !160, file: !159, line: 21, baseType: !15, size: 32, align: 32, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !40, file: !39, line: 124, baseType: !164, size: 64, align: 64, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "patchinfo", scope: !40, file: !39, line: 125, baseType: !183, size: 64, align: 64, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !185, line: 31, baseType: !186)
!185 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !185, line: 32, size: 320, align: 64, elements: !187)
!187 = !{!188, !189, !190, !191, !192}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !186, file: !185, line: 33, baseType: !15, size: 32, align: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !186, file: !185, line: 34, baseType: !26, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !186, file: !185, line: 35, baseType: !26, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !186, file: !185, line: 36, baseType: !73, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !186, file: !185, line: 37, baseType: !193, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !40, file: !39, line: 126, baseType: !15, size: 32, align: 32, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChvList", file: !197, line: 24, baseType: !198)
!197 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ChvList/ChvList.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ChvList", file: !197, line: 25, size: 384, align: 64, elements: !199)
!199 = !{!200, !201, !203, !204, !205, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !198, file: !197, line: 26, baseType: !15, size: 32, align: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !198, file: !197, line: 27, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !198, file: !197, line: 28, baseType: !22, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !198, file: !197, line: 29, baseType: !164, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !197, line: 30, baseType: !206, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !198, file: !197, line: 31, baseType: !15, size: 32, align: 32, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChvManager", file: !211, line: 9, baseType: !212)
!211 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ChvManager/ChvManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ChvManager", file: !211, line: 10, size: 448, align: 64, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !212, file: !211, line: 11, baseType: !9, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !212, file: !211, line: 12, baseType: !164, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !212, file: !211, line: 13, baseType: !15, size: 32, align: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !212, file: !211, line: 14, baseType: !15, size: 32, align: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !212, file: !211, line: 15, baseType: !15, size: 32, align: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !212, file: !211, line: 16, baseType: !15, size: 32, align: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !212, file: !211, line: 17, baseType: !15, size: 32, align: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !212, file: !211, line: 18, baseType: !15, size: 32, align: 32, offset: 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !212, file: !211, line: 19, baseType: !15, size: 32, align: 32, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !212, file: !211, line: 20, baseType: !15, size: 32, align: 32, offset: 352)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !212, file: !211, line: 21, baseType: !15, size: 32, align: 32, offset: 384)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !6, file: !1, line: 27, type: !37)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontJ", arg: 2, scope: !6, file: !1, line: 28, type: !9)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvlist", arg: 3, scope: !6, file: !1, line: 29, type: !195)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvmanager", arg: 4, scope: !6, file: !1, line: 30, type: !209)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pndelay", arg: 5, scope: !6, file: !1, line: 31, type: !22)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "child", scope: !6, file: !1, line: 33, type: !9)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "child2", scope: !6, file: !1, line: 33, type: !9)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstchild", scope: !6, file: !1, line: 33, type: !9)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newfrontJ", scope: !6, file: !1, line: 33, type: !9)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nextchild", scope: !6, file: !1, line: 33, type: !9)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !6, file: !1, line: 33, type: !9)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !6, file: !1, line: 34, type: !15)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nDnew", scope: !6, file: !1, line: 34, type: !15)
!239 = !DISubprogram(name: "FrontMtx_storePostponedData", scope: !1, file: !1, line: 145, type: !240, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, %struct._Chv*, i32, i32, %struct._ChvList*, %struct._ChvManager*)* @FrontMtx_storePostponedData, variables: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !37, !9, !15, !15, !195, !209}
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !239, file: !1, line: 146, type: !37)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontJ", arg: 2, scope: !239, file: !1, line: 147, type: !9)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npost", arg: 3, scope: !239, file: !1, line: 148, type: !15)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "K", arg: 4, scope: !239, file: !1, line: 149, type: !15)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvlist", arg: 5, scope: !239, file: !1, line: 150, type: !195)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvmanager", arg: 6, scope: !239, file: !1, line: 151, type: !209)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv", scope: !239, file: !1, line: 153, type: !9)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !239, file: !1, line: 154, type: !15)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !239, file: !1, line: 154, type: !15)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !239, file: !1, line: 154, type: !15)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nind", scope: !239, file: !1, line: 154, type: !15)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !239, file: !1, line: 154, type: !15)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !239, file: !1, line: 154, type: !15)
!256 = !{i32 2, !"Dwarf Version", i32 2}
!257 = !{i32 2, !"Debug Info Version", i32 700000003}
!258 = !{i32 1, !"PIC Level", i32 2}
!259 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!260 = !DIExpression()
!261 = !DILocation(line: 27, column: 18, scope: !6)
!262 = !DILocation(line: 28, column: 18, scope: !6)
