; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_postProcess.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._FrontMtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._Tree*, %struct._ETree*, %struct._IV*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._I2Ohash*, %struct._I2Ohash*, %struct._SubMtxManager*, %struct._Lock*, %struct._PatchAndGoInfo*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._I2Ohash = type { i32, i32, i32, %struct._I2OP*, %struct._I2OP*, %struct._I2OP** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_postProcess.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !{!8}
!8 = !DISubprogram(name: "FrontMtx_postProcess", scope: !1, file: !1, line: 19, type: !9, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i32, %struct.__sFILE*)* @FrontMtx_postProcess, variables: !241)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !17, !181}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrontMtx", file: !13, line: 96, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../FrontMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FrontMtx", file: !13, line: 97, size: 1536, align: 64, elements: !15)
!15 = !{!16, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !39, !60, !61, !84, !85, !86, !87, !88, !115, !116, !117, !118, !119, !141, !142, !167, !168, !180}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !14, file: !13, line: 98, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "neqns", scope: !14, file: !13, line: 99, baseType: !17, size: 32, align: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !14, file: !13, line: 100, baseType: !17, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symmetryflag", scope: !14, file: !13, line: 101, baseType: !17, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sparsityflag", scope: !14, file: !13, line: 102, baseType: !17, size: 32, align: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pivotingflag", scope: !14, file: !13, line: 103, baseType: !17, size: 32, align: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dataMode", scope: !14, file: !13, line: 104, baseType: !17, size: 32, align: 32, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nentD", scope: !14, file: !13, line: 105, baseType: !17, size: 32, align: 32, offset: 224)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nentL", scope: !14, file: !13, line: 106, baseType: !17, size: 32, align: 32, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nentU", scope: !14, file: !13, line: 107, baseType: !17, size: 32, align: 32, offset: 288)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !14, file: !13, line: 108, baseType: !28, size: 64, align: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !30, line: 15, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !30, line: 16, size: 256, align: 64, elements: !32)
!32 = !{!33, !34, !35, !37, !38}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !31, file: !30, line: 17, baseType: !17, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !31, file: !30, line: 18, baseType: !17, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !31, file: !30, line: 19, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !31, file: !30, line: 20, baseType: !36, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !31, file: !30, line: 21, baseType: !36, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "frontETree", scope: !14, file: !13, line: 109, baseType: !40, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !42, line: 31, baseType: !43)
!42 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !42, line: 32, size: 320, align: 64, elements: !44)
!44 = !{!45, !46, !47, !48, !58, !59}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !43, file: !42, line: 33, baseType: !17, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !43, file: !42, line: 34, baseType: !17, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !43, file: !42, line: 35, baseType: !28, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !43, file: !42, line: 36, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !51, line: 20, baseType: !52)
!51 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !51, line: 21, size: 192, align: 64, elements: !53)
!53 = !{!54, !55, !56, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !52, file: !51, line: 22, baseType: !17, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !52, file: !51, line: 23, baseType: !17, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !52, file: !51, line: 24, baseType: !17, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !52, file: !51, line: 25, baseType: !36, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !43, file: !42, line: 37, baseType: !49, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !43, file: !42, line: 38, baseType: !49, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "frontsizesIV", scope: !14, file: !13, line: 110, baseType: !49, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "symbfacIVL", scope: !14, file: !13, line: 111, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !64, line: 55, baseType: !65)
!64 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !64, line: 79, size: 384, align: 64, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !74, !75}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !64, line: 80, baseType: !17, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !65, file: !64, line: 81, baseType: !17, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !65, file: !64, line: 82, baseType: !17, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !65, file: !64, line: 83, baseType: !17, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !65, file: !64, line: 84, baseType: !36, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !65, file: !64, line: 85, baseType: !73, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !65, file: !64, line: 86, baseType: !17, size: 32, align: 32, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !65, file: !64, line: 87, baseType: !76, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !64, line: 56, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !64, line: 102, size: 192, align: 64, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !78, file: !64, line: 103, baseType: !17, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !78, file: !64, line: 104, baseType: !17, size: 32, align: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !78, file: !64, line: 105, baseType: !36, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !64, line: 106, baseType: !76, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rowadjIVL", scope: !14, file: !13, line: 112, baseType: !62, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "coladjIVL", scope: !14, file: !13, line: 113, baseType: !62, size: 64, align: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "lowerblockIVL", scope: !14, file: !13, line: 114, baseType: !62, size: 64, align: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "upperblockIVL", scope: !14, file: !13, line: 115, baseType: !62, size: 64, align: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxDJJ", scope: !14, file: !13, line: 116, baseType: !89, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !92, line: 43, baseType: !93)
!92 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !92, line: 44, size: 576, align: 64, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !105, !114}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !92, line: 45, baseType: !17, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !93, file: !92, line: 46, baseType: !17, size: 32, align: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !93, file: !92, line: 47, baseType: !17, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !93, file: !92, line: 48, baseType: !17, size: 32, align: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !93, file: !92, line: 49, baseType: !17, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !93, file: !92, line: 50, baseType: !17, size: 32, align: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !93, file: !92, line: 51, baseType: !17, size: 32, align: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !93, file: !92, line: 52, baseType: !103, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !93, file: !92, line: 53, baseType: !106, size: 192, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !107, line: 20, baseType: !108)
!107 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !107, line: 21, size: 192, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !108, file: !107, line: 22, baseType: !17, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !108, file: !107, line: 23, baseType: !17, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !108, file: !107, line: 24, baseType: !17, size: 32, align: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !108, file: !107, line: 25, baseType: !103, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !92, line: 54, baseType: !90, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJJ", scope: !14, file: !13, line: 117, baseType: !89, size: 64, align: 64, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJN", scope: !14, file: !13, line: 118, baseType: !89, size: 64, align: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLJJ", scope: !14, file: !13, line: 119, baseType: !89, size: 64, align: 64, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLNJ", scope: !14, file: !13, line: 120, baseType: !89, size: 64, align: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lowerhash", scope: !14, file: !13, line: 121, baseType: !120, size: 64, align: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !122, line: 6, baseType: !123)
!122 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../I2Ohash/I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !122, line: 7, size: 320, align: 64, elements: !124)
!124 = !{!125, !126, !127, !128, !138, !139}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !123, file: !122, line: 8, baseType: !17, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !123, file: !122, line: 9, baseType: !17, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !123, file: !122, line: 10, baseType: !17, size: 32, align: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !123, file: !122, line: 11, baseType: !129, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !131, line: 5, baseType: !132)
!131 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !131, line: 6, size: 192, align: 64, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !132, file: !131, line: 7, baseType: !17, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !132, file: !131, line: 8, baseType: !17, size: 32, align: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !132, file: !131, line: 9, baseType: !4, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !131, line: 10, baseType: !129, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !123, file: !122, line: 12, baseType: !129, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !123, file: !122, line: 13, baseType: !140, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "upperhash", scope: !14, file: !13, line: 122, baseType: !120, size: 64, align: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !14, file: !13, line: 123, baseType: !143, size: 64, align: 64, offset: 1280)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !145, line: 9, baseType: !146)
!145 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxManager/SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !145, line: 10, size: 448, align: 64, elements: !147)
!147 = !{!148, !149, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !146, file: !145, line: 11, baseType: !90, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !146, file: !145, line: 12, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !152, line: 36, baseType: !153)
!152 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !152, line: 37, size: 128, align: 64, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !153, file: !152, line: 45, baseType: !4, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !153, file: !152, line: 47, baseType: !17, size: 32, align: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !153, file: !152, line: 48, baseType: !17, size: 32, align: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !146, file: !145, line: 13, baseType: !17, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !146, file: !145, line: 14, baseType: !17, size: 32, align: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !146, file: !145, line: 15, baseType: !17, size: 32, align: 32, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !146, file: !145, line: 16, baseType: !17, size: 32, align: 32, offset: 224)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !146, file: !145, line: 17, baseType: !17, size: 32, align: 32, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !146, file: !145, line: 18, baseType: !17, size: 32, align: 32, offset: 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !146, file: !145, line: 19, baseType: !17, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !146, file: !145, line: 20, baseType: !17, size: 32, align: 32, offset: 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !146, file: !145, line: 21, baseType: !17, size: 32, align: 32, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !14, file: !13, line: 124, baseType: !150, size: 64, align: 64, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "patchinfo", scope: !14, file: !13, line: 125, baseType: !169, size: 64, align: 64, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !171, line: 31, baseType: !172)
!171 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !171, line: 32, size: 320, align: 64, elements: !173)
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !172, file: !171, line: 33, baseType: !17, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !172, file: !171, line: 34, baseType: !104, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !172, file: !171, line: 35, baseType: !104, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !172, file: !171, line: 36, baseType: !49, size: 64, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !172, file: !171, line: 37, baseType: !179, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !14, file: !13, line: 126, baseType: !17, size: 32, align: 32, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !183, line: 153, baseType: !184)
!183 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !183, line: 122, size: 1216, align: 64, elements: !185)
!185 = !{!186, !189, !190, !191, !193, !194, !199, !200, !201, !205, !209, !219, !225, !226, !229, !230, !234, !238, !239, !240}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !184, file: !183, line: 123, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !184, file: !183, line: 124, baseType: !17, size: 32, align: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !184, file: !183, line: 125, baseType: !17, size: 32, align: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !184, file: !183, line: 126, baseType: !192, size: 16, align: 16, offset: 128)
!192 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !184, file: !183, line: 127, baseType: !192, size: 16, align: 16, offset: 144)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !184, file: !183, line: 128, baseType: !195, size: 128, align: 64, offset: 192)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !183, line: 88, size: 128, align: 64, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !195, file: !183, line: 89, baseType: !187, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !195, file: !183, line: 90, baseType: !17, size: 32, align: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !184, file: !183, line: 129, baseType: !17, size: 32, align: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !184, file: !183, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !184, file: !183, line: 133, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!17, !4}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !184, file: !183, line: 134, baseType: !206, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!17, !4, !5, !17}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !184, file: !183, line: 135, baseType: !210, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !4, !213, !17}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !183, line: 77, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !215, line: 71, baseType: !216)
!215 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !217, line: 46, baseType: !218)
!217 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!218 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !184, file: !183, line: 136, baseType: !220, size: 64, align: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!17, !4, !223, !17}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !184, file: !183, line: 139, baseType: !195, size: 128, align: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !184, file: !183, line: 140, baseType: !227, size: 64, align: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !183, line: 94, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !184, file: !183, line: 141, baseType: !17, size: 32, align: 32, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !184, file: !183, line: 144, baseType: !231, size: 24, align: 8, offset: 928)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 24, align: 8, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !184, file: !183, line: 145, baseType: !235, size: 8, align: 8, offset: 952)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 8, align: 8, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 1)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !184, file: !183, line: 148, baseType: !195, size: 128, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !184, file: !183, line: 151, baseType: !17, size: 32, align: 32, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !184, file: !183, line: 152, baseType: !213, size: 64, align: 64, offset: 1152)
!241 = !{!242, !243, !244, !245, !246, !249, !250}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !8, file: !1, line: 20, type: !11)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 2, scope: !8, file: !1, line: 21, type: !17)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 3, scope: !8, file: !1, line: 22, type: !181)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !8, file: !1, line: 24, type: !17)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colmapIV", scope: !247, file: !1, line: 38, type: !49)
!247 = distinct !DILexicalBlock(scope: !248, file: !1, line: 37, column: 39)
!248 = distinct !DILexicalBlock(scope: !8, file: !1, line: 37, column: 6)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowmapIV", scope: !247, file: !1, line: 38, type: !49)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFrontIV", scope: !251, file: !1, line: 108, type: !49)
!251 = distinct !DILexicalBlock(scope: !248, file: !1, line: 102, column: 8)
!252 = !{i32 2, !"Dwarf Version", i32 2}
!253 = !{i32 2, !"Debug Info Version", i32 700000003}
!254 = !{i32 1, !"PIC Level", i32 2}
!255 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!256 = !DIExpression()
!257 = !DILocation(line: 20, column: 16, scope: !8)
!258 = !DILocation(line: 21, column: 15, scope: !8)
!259 = !DILocation(line: 22, column: 16, scope: !8)
!260 = !DILocation(line: 30, column: 15, scope: !261)
!261 = distinct !DILexicalBlock(scope: !8, file: !1, line: 30, column: 6)
!262 = !DILocation(line: 30, column: 23, scope: !261)
!263 = !DILocation(line: 30, column: 34, scope: !261)
!264 = !DILocation(line: 30, column: 49, scope: !261)
!265 = !DILocation(line: 30, column: 38, scope: !261)
!266 = !DILocation(line: 31, column: 12, scope: !267)
!267 = distinct !DILexicalBlock(scope: !261, file: !1, line: 30, column: 60)
!268 = !{!269, !269, i64 0}
!269 = !{!"any pointer", !270, i64 0}
!270 = !{!"omnipotent char", !271, i64 0}
!271 = !{!"Simple C/C++ TBAA"}
!272 = !DILocation(line: 31, column: 4, scope: !267)
!273 = !DILocation(line: 34, column: 4, scope: !267)
!274 = !DILocation(line: 36, column: 20, scope: !8)
!275 = !{!276, !277, i64 0}
!276 = !{!"_FrontMtx", !277, i64 0, !277, i64 4, !277, i64 8, !277, i64 12, !277, i64 16, !277, i64 20, !277, i64 24, !277, i64 28, !277, i64 32, !277, i64 36, !269, i64 40, !269, i64 48, !269, i64 56, !269, i64 64, !269, i64 72, !269, i64 80, !269, i64 88, !269, i64 96, !269, i64 104, !269, i64 112, !269, i64 120, !269, i64 128, !269, i64 136, !269, i64 144, !269, i64 152, !269, i64 160, !269, i64 168, !269, i64 176, !277, i64 184}
!277 = !{!"int", !270, i64 0}
!278 = !DILocation(line: 24, column: 7, scope: !8)
!279 = !DILocation(line: 37, column: 6, scope: !248)
!280 = !{!276, !277, i64 20}
!281 = !DILocation(line: 37, column: 6, scope: !8)
!282 = !DILocation(line: 44, column: 4, scope: !247)
!283 = !DILocation(line: 45, column: 16, scope: !284)
!284 = distinct !DILexicalBlock(scope: !247, file: !1, line: 45, column: 9)
!285 = !DILocation(line: 45, column: 9, scope: !247)
!286 = !DILocation(line: 46, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !284, file: !1, line: 45, column: 22)
!288 = !DILocation(line: 47, column: 38, scope: !287)
!289 = !{!276, !269, i64 80}
!290 = !DILocation(line: 47, column: 7, scope: !287)
!291 = !DILocation(line: 48, column: 7, scope: !287)
!292 = !DILocation(line: 49, column: 4, scope: !287)
!293 = !DILocation(line: 50, column: 9, scope: !294)
!294 = distinct !DILexicalBlock(scope: !247, file: !1, line: 50, column: 9)
!295 = !{!276, !277, i64 12}
!296 = !DILocation(line: 50, column: 9, scope: !247)
!297 = !DILocation(line: 51, column: 7, scope: !298)
!298 = distinct !DILexicalBlock(scope: !294, file: !1, line: 50, column: 46)
