; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_loadEntries.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Chv = type { i32, i32, i32, i32, i32, i32, i32*, i32*, double*, %struct._DV, %struct._Chv* }
%struct._DV = type { i32, i32, i32, double* }
%struct._Pencil = type { i32, i32, %struct._InpMtx*, %struct._InpMtx*, [2 x double] }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._IV = type { i32, i32, i32, i32* }

@FrontMtx_loadEntries.one = private unnamed_addr constant [2 x double] [double 1.000000e+00, double 0.000000e+00], align 16
@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [63 x i8] c"\0A fatal error in FrontMtx_loadEntries(%p,%p,%d,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [62 x i8] c"\0A\0A # inside loadEntries for chv %d, sigma = %12.4e + i*%12.4e\00", align 1
@.str2 = private unnamed_addr constant [36 x i8] c"\0A inpmtxA chevron %d : chvsize = %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_loadEntries.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6}
!6 = !DISubprogram(name: "FrontMtx_loadEntries", scope: !1, file: !1, line: 19, type: !7, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, %struct._Pencil*, i32, %struct.__sFILE*)* @FrontMtx_loadEntries, variables: !139)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !37, !15, !77}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Chv/Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !11, line: 31, size: 640, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !23, !24, !27, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 32, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !12, file: !11, line: 35, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 36, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !12, file: !11, line: 37, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !12, file: !11, line: 38, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !12, file: !11, line: 39, baseType: !22, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 40, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 41, baseType: !28, size: 192, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !29, line: 21, size: 192, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !29, line: 22, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !30, file: !29, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !30, file: !29, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !29, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 42, baseType: !9, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pencil", file: !39, line: 17, baseType: !40)
!39 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Pencil/Pencil.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Pencil", file: !39, line: 18, size: 320, align: 64, elements: !41)
!41 = !{!42, !43, !44, !72, !73}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 19, baseType: !15, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !40, file: !39, line: 20, baseType: !15, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "inpmtxA", scope: !40, file: !39, line: 21, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !47, line: 51, baseType: !48)
!47 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../InpMtx/InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !47, line: 52, size: 1472, align: 64, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !65, !66, !67, !68, !69, !70, !71}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !48, file: !47, line: 53, baseType: !15, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !48, file: !47, line: 54, baseType: !15, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !48, file: !47, line: 55, baseType: !15, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !48, file: !47, line: 56, baseType: !15, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !48, file: !47, line: 57, baseType: !15, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !48, file: !47, line: 58, baseType: !26, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !48, file: !47, line: 59, baseType: !57, size: 192, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !58, line: 20, baseType: !59)
!58 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !58, line: 21, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !58, line: 22, baseType: !15, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !59, file: !58, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !59, file: !58, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !59, file: !58, line: 25, baseType: !22, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !48, file: !47, line: 60, baseType: !57, size: 192, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !48, file: !47, line: 61, baseType: !28, size: 192, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !48, file: !47, line: 62, baseType: !15, size: 32, align: 32, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !48, file: !47, line: 63, baseType: !15, size: 32, align: 32, offset: 864)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !48, file: !47, line: 64, baseType: !57, size: 192, align: 64, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !48, file: !47, line: 65, baseType: !57, size: 192, align: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !48, file: !47, line: 66, baseType: !57, size: 192, align: 64, offset: 1280)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "inpmtxB", scope: !40, file: !39, line: 22, baseType: !45, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !40, file: !39, line: 23, baseType: !74, size: 128, align: 64, offset: 192)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, align: 64, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 2)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 153, baseType: !80)
!79 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !79, line: 122, size: 1216, align: 64, elements: !81)
!81 = !{!82, !85, !86, !87, !89, !90, !95, !96, !97, !101, !107, !117, !123, !124, !127, !128, !132, !136, !137, !138}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !80, file: !79, line: 123, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !80, file: !79, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !80, file: !79, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !79, line: 126, baseType: !88, size: 16, align: 16, offset: 128)
!88 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !80, file: !79, line: 127, baseType: !88, size: 16, align: 16, offset: 144)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !80, file: !79, line: 128, baseType: !91, size: 128, align: 64, offset: 192)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !79, line: 88, size: 128, align: 64, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !91, file: !79, line: 89, baseType: !83, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !91, file: !79, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !80, file: !79, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !80, file: !79, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !80, file: !79, line: 133, baseType: !98, size: 64, align: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!15, !4}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !80, file: !79, line: 134, baseType: !102, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!15, !4, !105, !15}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !80, file: !79, line: 135, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !4, !111, !15}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !79, line: 77, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !113, line: 71, baseType: !114)
!113 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!116 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !80, file: !79, line: 136, baseType: !118, size: 64, align: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!15, !4, !121, !15}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !80, file: !79, line: 139, baseType: !91, size: 128, align: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !80, file: !79, line: 140, baseType: !125, size: 64, align: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !79, line: 94, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !80, file: !79, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !80, file: !79, line: 144, baseType: !129, size: 24, align: 8, offset: 928)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 3)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !80, file: !79, line: 145, baseType: !133, size: 8, align: 8, offset: 952)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8, align: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !80, file: !79, line: 148, baseType: !91, size: 128, align: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !80, file: !79, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !79, line: 152, baseType: !111, size: 64, align: 64, offset: 1152)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !160, !168, !170, !171, !172, !173, !176, !184, !186, !187, !188}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chv", arg: 1, scope: !6, file: !1, line: 20, type: !9)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pencil", arg: 2, scope: !6, file: !1, line: 21, type: !37)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 3, scope: !6, file: !1, line: 22, type: !15)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 4, scope: !6, file: !1, line: 23, type: !77)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inpmtxA", scope: !6, file: !1, line: 25, type: !45)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inpmtxB", scope: !6, file: !1, line: 25, type: !45)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "one", scope: !6, file: !1, line: 26, type: !74)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sigma", scope: !6, file: !1, line: 27, type: !25)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chvent", scope: !6, file: !1, line: 28, type: !25)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chvsize", scope: !6, file: !1, line: 29, type: !15)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ichv", scope: !6, file: !1, line: 29, type: !15)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !6, file: !1, line: 29, type: !15)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !6, file: !1, line: 29, type: !15)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !6, file: !1, line: 29, type: !15)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !6, file: !1, line: 29, type: !15)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chvind", scope: !6, file: !1, line: 30, type: !22)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !6, file: !1, line: 30, type: !22)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !158, file: !1, line: 60, type: !15)
!158 = distinct !DILexicalBlock(scope: !159, file: !1, line: 59, column: 24)
!159 = distinct !DILexicalBlock(scope: !6, file: !1, line: 59, column: 6)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !161, file: !1, line: 76, type: !15)
!161 = distinct !DILexicalBlock(scope: !162, file: !1, line: 75, column: 28)
!162 = distinct !DILexicalBlock(scope: !163, file: !1, line: 75, column: 15)
!163 = distinct !DILexicalBlock(scope: !164, file: !1, line: 74, column: 26)
!164 = distinct !DILexicalBlock(scope: !165, file: !1, line: 74, column: 12)
!165 = distinct !DILexicalBlock(scope: !166, file: !1, line: 66, column: 36)
!166 = distinct !DILexicalBlock(scope: !167, file: !1, line: 66, column: 4)
!167 = distinct !DILexicalBlock(scope: !158, file: !1, line: 66, column: 4)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !169, file: !1, line: 93, type: !25)
!169 = distinct !DILexicalBlock(scope: !159, file: !1, line: 92, column: 8)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !169, file: !1, line: 94, type: !15)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "off", scope: !169, file: !1, line: 94, type: !15)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !169, file: !1, line: 94, type: !15)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !174, file: !1, line: 140, type: !15)
!174 = distinct !DILexicalBlock(scope: !175, file: !1, line: 139, column: 24)
!175 = distinct !DILexicalBlock(scope: !6, file: !1, line: 139, column: 6)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !177, file: !1, line: 156, type: !15)
