; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_factorUtil.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.timeval = type { i64, i32 }
%struct.timezone = type { i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._FrontMtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._Tree*, %struct._ETree*, %struct._IV*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._I2Ohash*, %struct._I2Ohash*, %struct._SubMtxManager*, %struct._Lock*, %struct._PatchAndGoInfo*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !586, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_factorUtil.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IP", file: !8, line: 11, size: 128, align: 64, elements: !9)
!8 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/IP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !7, file: !8, line: 12, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 13, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP", file: !8, line: 10, baseType: !7)
!15 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!16 = !{!17, !214, !371, !391, !413, !425, !454, !468, !489, !515, !529, !546, !564}
!17 = !DISubprogram(name: "FrontMtx_initializeFront", scope: !1, file: !1, line: 15, type: !18, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, %struct._Chv*, i32)* @FrontMtx_initializeFront, variables: !205)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20, !189, !11}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrontMtx", file: !22, line: 96, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../FrontMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FrontMtx", file: !22, line: 97, size: 1536, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !47, !68, !69, !92, !93, !94, !95, !96, !123, !124, !125, !126, !127, !149, !150, !175, !176, !188}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !23, file: !22, line: 98, baseType: !11, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "neqns", scope: !23, file: !22, line: 99, baseType: !11, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, file: !22, line: 100, baseType: !11, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "symmetryflag", scope: !23, file: !22, line: 101, baseType: !11, size: 32, align: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sparsityflag", scope: !23, file: !22, line: 102, baseType: !11, size: 32, align: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pivotingflag", scope: !23, file: !22, line: 103, baseType: !11, size: 32, align: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "dataMode", scope: !23, file: !22, line: 104, baseType: !11, size: 32, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "nentD", scope: !23, file: !22, line: 105, baseType: !11, size: 32, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nentL", scope: !23, file: !22, line: 106, baseType: !11, size: 32, align: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nentU", scope: !23, file: !22, line: 107, baseType: !11, size: 32, align: 32, offset: 288)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !23, file: !22, line: 108, baseType: !36, size: 64, align: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !38, line: 15, baseType: !39)
!38 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !38, line: 16, size: 256, align: 64, elements: !40)
!40 = !{!41, !42, !43, !45, !46}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !39, file: !38, line: 17, baseType: !11, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !39, file: !38, line: 18, baseType: !11, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !39, file: !38, line: 19, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !39, file: !38, line: 20, baseType: !44, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !39, file: !38, line: 21, baseType: !44, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "frontETree", scope: !23, file: !22, line: 109, baseType: !48, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !50, line: 31, baseType: !51)
!50 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !50, line: 32, size: 320, align: 64, elements: !52)
!52 = !{!53, !54, !55, !56, !66, !67}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !51, file: !50, line: 33, baseType: !11, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !51, file: !50, line: 34, baseType: !11, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !51, file: !50, line: 35, baseType: !36, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !51, file: !50, line: 36, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !59, line: 20, baseType: !60)
!59 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !59, line: 21, size: 192, align: 64, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !59, line: 22, baseType: !11, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !60, file: !59, line: 23, baseType: !11, size: 32, align: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !60, file: !59, line: 24, baseType: !11, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !60, file: !59, line: 25, baseType: !44, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !51, file: !50, line: 37, baseType: !57, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !51, file: !50, line: 38, baseType: !57, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "frontsizesIV", scope: !23, file: !22, line: 110, baseType: !57, size: 64, align: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "symbfacIVL", scope: !23, file: !22, line: 111, baseType: !70, size: 64, align: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !72, line: 55, baseType: !73)
!72 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !72, line: 79, size: 384, align: 64, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !82, !83}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !72, line: 80, baseType: !11, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !73, file: !72, line: 81, baseType: !11, size: 32, align: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !73, file: !72, line: 82, baseType: !11, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !73, file: !72, line: 83, baseType: !11, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !73, file: !72, line: 84, baseType: !44, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !73, file: !72, line: 85, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !73, file: !72, line: 86, baseType: !11, size: 32, align: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !73, file: !72, line: 87, baseType: !84, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !72, line: 56, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !72, line: 102, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !86, file: !72, line: 103, baseType: !11, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !86, file: !72, line: 104, baseType: !11, size: 32, align: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !86, file: !72, line: 105, baseType: !44, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !72, line: 106, baseType: !84, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rowadjIVL", scope: !23, file: !22, line: 112, baseType: !70, size: 64, align: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "coladjIVL", scope: !23, file: !22, line: 113, baseType: !70, size: 64, align: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "lowerblockIVL", scope: !23, file: !22, line: 114, baseType: !70, size: 64, align: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "upperblockIVL", scope: !23, file: !22, line: 115, baseType: !70, size: 64, align: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxDJJ", scope: !23, file: !22, line: 116, baseType: !97, size: 64, align: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !100, line: 43, baseType: !101)
!100 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !100, line: 44, size: 576, align: 64, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !113, !122}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !100, line: 45, baseType: !11, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !101, file: !100, line: 46, baseType: !11, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !101, file: !100, line: 47, baseType: !11, size: 32, align: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !101, file: !100, line: 48, baseType: !11, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !101, file: !100, line: 49, baseType: !11, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !101, file: !100, line: 50, baseType: !11, size: 32, align: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !101, file: !100, line: 51, baseType: !11, size: 32, align: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !101, file: !100, line: 52, baseType: !111, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !101, file: !100, line: 53, baseType: !114, size: 192, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !115, line: 20, baseType: !116)
!115 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !115, line: 21, size: 192, align: 64, elements: !117)
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !115, line: 22, baseType: !11, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !116, file: !115, line: 23, baseType: !11, size: 32, align: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !116, file: !115, line: 24, baseType: !11, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !116, file: !115, line: 25, baseType: !111, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !100, line: 54, baseType: !98, size: 64, align: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJJ", scope: !23, file: !22, line: 117, baseType: !97, size: 64, align: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJN", scope: !23, file: !22, line: 118, baseType: !97, size: 64, align: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLJJ", scope: !23, file: !22, line: 119, baseType: !97, size: 64, align: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLNJ", scope: !23, file: !22, line: 120, baseType: !97, size: 64, align: 64, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lowerhash", scope: !23, file: !22, line: 121, baseType: !128, size: 64, align: 64, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !130, line: 6, baseType: !131)
!130 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../I2Ohash/I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !130, line: 7, size: 320, align: 64, elements: !132)
!132 = !{!133, !134, !135, !136, !146, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !131, file: !130, line: 8, baseType: !11, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !131, file: !130, line: 9, baseType: !11, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !131, file: !130, line: 10, baseType: !11, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !131, file: !130, line: 11, baseType: !137, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !139, line: 5, baseType: !140)
!139 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !139, line: 6, size: 192, align: 64, elements: !141)
!141 = !{!142, !143, !144, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !140, file: !139, line: 7, baseType: !11, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !140, file: !139, line: 8, baseType: !11, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !140, file: !139, line: 9, baseType: !4, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !139, line: 10, baseType: !137, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !131, file: !130, line: 12, baseType: !137, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !131, file: !130, line: 13, baseType: !148, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "upperhash", scope: !23, file: !22, line: 122, baseType: !128, size: 64, align: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !23, file: !22, line: 123, baseType: !151, size: 64, align: 64, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !153, line: 9, baseType: !154)
!153 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxManager/SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !153, line: 10, size: 448, align: 64, elements: !155)
!155 = !{!156, !157, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !154, file: !153, line: 11, baseType: !98, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !154, file: !153, line: 12, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !160, line: 36, baseType: !161)
!160 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !160, line: 37, size: 128, align: 64, elements: !162)
!162 = !{!163, !164, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !161, file: !160, line: 45, baseType: !4, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !161, file: !160, line: 47, baseType: !11, size: 32, align: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !161, file: !160, line: 48, baseType: !11, size: 32, align: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !154, file: !153, line: 13, baseType: !11, size: 32, align: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !154, file: !153, line: 14, baseType: !11, size: 32, align: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !154, file: !153, line: 15, baseType: !11, size: 32, align: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !154, file: !153, line: 16, baseType: !11, size: 32, align: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !154, file: !153, line: 17, baseType: !11, size: 32, align: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !154, file: !153, line: 18, baseType: !11, size: 32, align: 32, offset: 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !154, file: !153, line: 19, baseType: !11, size: 32, align: 32, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !154, file: !153, line: 20, baseType: !11, size: 32, align: 32, offset: 352)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !154, file: !153, line: 21, baseType: !11, size: 32, align: 32, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !23, file: !22, line: 124, baseType: !158, size: 64, align: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "patchinfo", scope: !23, file: !22, line: 125, baseType: !177, size: 64, align: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !179, line: 31, baseType: !180)
!179 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !179, line: 32, size: 320, align: 64, elements: !181)
!181 = !{!182, !183, !184, !185, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !180, file: !179, line: 33, baseType: !11, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !180, file: !179, line: 34, baseType: !112, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !180, file: !179, line: 35, baseType: !112, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !180, file: !179, line: 36, baseType: !57, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !180, file: !179, line: 37, baseType: !187, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !23, file: !22, line: 126, baseType: !11, size: 32, align: 32, offset: 1472)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "Chv", file: !191, line: 30, baseType: !192)
!191 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Chv/Chv.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Chv", file: !191, line: 31, size: 640, align: 64, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !192, file: !191, line: 32, baseType: !11, size: 32, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nD", scope: !192, file: !191, line: 33, baseType: !11, size: 32, align: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nL", scope: !192, file: !191, line: 34, baseType: !11, size: 32, align: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nU", scope: !192, file: !191, line: 35, baseType: !11, size: 32, align: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !191, line: 36, baseType: !11, size: 32, align: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !192, file: !191, line: 37, baseType: !11, size: 32, align: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !192, file: !191, line: 38, baseType: !44, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !192, file: !191, line: 39, baseType: !44, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !192, file: !191, line: 40, baseType: !111, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !192, file: !191, line: 41, baseType: !114, size: 192, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !191, line: 42, baseType: !189, size: 64, align: 64, offset: 576)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213}
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !17, file: !1, line: 16, type: !20)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontJ", arg: 2, scope: !17, file: !1, line: 17, type: !189)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 3, scope: !17, file: !1, line: 18, type: !11)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncolJ", scope: !17, file: !1, line: 20, type: !11)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !17, file: !1, line: 20, type: !11)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrowJ", scope: !17, file: !1, line: 20, type: !11)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colindJ", scope: !17, file: !1, line: 21, type: !44)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec", scope: !17, file: !1, line: 21, type: !44)
!214 = !DISubprogram(name: "FrontMtx_factorVisit", scope: !1, file: !1, line: 147, type: !215, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: i8 (%struct._FrontMtx*, %struct._Pencil*, i32, i32, i32*, %struct._Chv**, i32, double, double, i8*, %struct._IP**, %struct._IV*, %struct._DV*, i32*, %struct._ChvList*, %struct._ChvList*, %struct._ChvManager*, i32*, double*, i32, %struct.__sFILE*)* @FrontMtx_factorVisit, variables: !340)
!215 = !DISubroutineType(types: !216)
!216 = !{!217, !20, !218, !11, !11, !44, !250, !11, !112, !112, !251, !252, !57, !187, !44, !253, !253, !264, !44, !111, !11, !280}
!217 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pencil", file: !220, line: 17, baseType: !221)
!220 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Pencil/Pencil.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Pencil", file: !220, line: 18, size: 320, align: 64, elements: !222)
!222 = !{!223, !224, !225, !245, !246}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !220, line: 19, baseType: !11, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !221, file: !220, line: 20, baseType: !11, size: 32, align: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "inpmtxA", scope: !221, file: !220, line: 21, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !228, line: 51, baseType: !229)
!228 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../InpMtx/InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !228, line: 52, size: 1472, align: 64, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !229, file: !228, line: 53, baseType: !11, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !229, file: !228, line: 54, baseType: !11, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !229, file: !228, line: 55, baseType: !11, size: 32, align: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !229, file: !228, line: 56, baseType: !11, size: 32, align: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !229, file: !228, line: 57, baseType: !11, size: 32, align: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !229, file: !228, line: 58, baseType: !112, size: 64, align: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !229, file: !228, line: 59, baseType: !58, size: 192, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !229, file: !228, line: 60, baseType: !58, size: 192, align: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !229, file: !228, line: 61, baseType: !114, size: 192, align: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !229, file: !228, line: 62, baseType: !11, size: 32, align: 32, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !229, file: !228, line: 63, baseType: !11, size: 32, align: 32, offset: 864)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !229, file: !228, line: 64, baseType: !58, size: 192, align: 64, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !229, file: !228, line: 65, baseType: !58, size: 192, align: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !229, file: !228, line: 66, baseType: !58, size: 192, align: 64, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "inpmtxB", scope: !221, file: !220, line: 22, baseType: !226, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !221, file: !220, line: 23, baseType: !247, size: 128, align: 64, offset: 192)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, align: 64, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 2)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChvList", file: !255, line: 24, baseType: !256)
!255 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ChvList/ChvList.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ChvList", file: !255, line: 25, size: 384, align: 64, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !256, file: !255, line: 26, baseType: !11, size: 32, align: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !256, file: !255, line: 27, baseType: !250, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !256, file: !255, line: 28, baseType: !44, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !256, file: !255, line: 29, baseType: !158, size: 64, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !255, line: 30, baseType: !251, size: 64, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !256, file: !255, line: 31, baseType: !11, size: 32, align: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChvManager", file: !266, line: 9, baseType: !267)
!266 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ChvManager/ChvManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ChvManager", file: !266, line: 10, size: 448, align: 64, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !267, file: !266, line: 11, baseType: !189, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !267, file: !266, line: 12, baseType: !158, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !267, file: !266, line: 13, baseType: !11, size: 32, align: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !267, file: !266, line: 14, baseType: !11, size: 32, align: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !267, file: !266, line: 15, baseType: !11, size: 32, align: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !267, file: !266, line: 16, baseType: !11, size: 32, align: 32, offset: 224)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !267, file: !266, line: 17, baseType: !11, size: 32, align: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !267, file: !266, line: 18, baseType: !11, size: 32, align: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !267, file: !266, line: 19, baseType: !11, size: 32, align: 32, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !267, file: !266, line: 20, baseType: !11, size: 32, align: 32, offset: 352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !267, file: !266, line: 21, baseType: !11, size: 32, align: 32, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !282, line: 153, baseType: !283)
!282 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !282, line: 122, size: 1216, align: 64, elements: !284)
!284 = !{!285, !288, !289, !290, !292, !293, !298, !299, !300, !304, !308, !318, !324, !325, !328, !329, !333, !337, !338, !339}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !283, file: !282, line: 123, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !283, file: !282, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !283, file: !282, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !283, file: !282, line: 126, baseType: !291, size: 16, align: 16, offset: 128)
!291 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !283, file: !282, line: 127, baseType: !291, size: 16, align: 16, offset: 144)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !283, file: !282, line: 128, baseType: !294, size: 128, align: 64, offset: 192)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !282, line: 88, size: 128, align: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !294, file: !282, line: 89, baseType: !286, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !294, file: !282, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !283, file: !282, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !283, file: !282, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !283, file: !282, line: 133, baseType: !301, size: 64, align: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!11, !4}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !283, file: !282, line: 134, baseType: !305, size: 64, align: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!11, !4, !251, !11}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !283, file: !282, line: 135, baseType: !309, size: 64, align: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !4, !312, !11}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !282, line: 77, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !314, line: 71, baseType: !315)
!314 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !316, line: 46, baseType: !317)
!316 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!317 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !283, file: !282, line: 136, baseType: !319, size: 64, align: 64, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!11, !4, !322, !11}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !283, file: !282, line: 139, baseType: !294, size: 128, align: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !283, file: !282, line: 140, baseType: !326, size: 64, align: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !282, line: 94, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !283, file: !282, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !283, file: !282, line: 144, baseType: !330, size: 24, align: 8, offset: 928)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 24, align: 8, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 3)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !283, file: !282, line: 145, baseType: !334, size: 8, align: 8, offset: 952)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 8, align: 8, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 1)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !283, file: !282, line: 148, baseType: !294, size: 128, align: 64, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !283, file: !282, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !283, file: !282, line: 152, baseType: !312, size: 64, align: 64, offset: 1152)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !214, file: !1, line: 148, type: !20)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pencil", arg: 2, scope: !214, file: !1, line: 149, type: !218)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 3, scope: !214, file: !1, line: 150, type: !11)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 4, scope: !214, file: !1, line: 151, type: !11)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 5, scope: !214, file: !1, line: 152, type: !44)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fronts", arg: 6, scope: !214, file: !1, line: 153, type: !250)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lookahead", arg: 7, scope: !214, file: !1, line: 154, type: !11)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tau", arg: 8, scope: !214, file: !1, line: 155, type: !112)
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "droptol", arg: 9, scope: !214, file: !1, line: 156, type: !112)
!350 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 10, scope: !214, file: !1, line: 157, type: !251)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heads", arg: 11, scope: !214, file: !1, line: 158, type: !252)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivotsizesIV", arg: 12, scope: !214, file: !1, line: 159, type: !57)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "workDV", arg: 13, scope: !214, file: !1, line: 160, type: !187)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parent", arg: 14, scope: !214, file: !1, line: 161, type: !44)
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aggList", arg: 15, scope: !214, file: !1, line: 162, type: !253)
!356 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "postList", arg: 16, scope: !214, file: !1, line: 163, type: !253)
!357 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvmanager", arg: 17, scope: !214, file: !1, line: 164, type: !264)
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stats", arg: 18, scope: !214, file: !1, line: 165, type: !44)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpus", arg: 19, scope: !214, file: !1, line: 166, type: !111)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 20, scope: !214, file: !1, line: 167, type: !11)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 21, scope: !214, file: !1, line: 168, type: !280)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allAggregatesHere", scope: !214, file: !1, line: 175, type: !217)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allPostponedAssmb", scope: !214, file: !1, line: 175, type: !217)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allUpdatesDone", scope: !214, file: !1, line: 175, type: !217)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontJ", scope: !214, file: !1, line: 176, type: !189)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !214, file: !1, line: 177, type: !112)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !214, file: !1, line: 177, type: !112)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !214, file: !1, line: 178, type: !11)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndelay", scope: !214, file: !1, line: 178, type: !11)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nelim", scope: !214, file: !1, line: 178, type: !11)
!371 = !DISubprogram(name: "FrontMtx_setupFront", scope: !1, file: !1, line: 399, type: !372, isLocal: false, isDefinition: true, scopeLine: 409, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Chv* (%struct._FrontMtx*, %struct._Pencil*, i32, i32, i32*, %struct._ChvManager*, double*, i32, %struct.__sFILE*)* @FrontMtx_setupFront, variables: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{!189, !20, !218, !11, !11, !44, !264, !111, !11, !280}
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !371, file: !1, line: 400, type: !20)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pencil", arg: 2, scope: !371, file: !1, line: 401, type: !218)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 3, scope: !371, file: !1, line: 402, type: !11)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 4, scope: !371, file: !1, line: 403, type: !11)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 5, scope: !371, file: !1, line: 404, type: !44)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvmanager", arg: 6, scope: !371, file: !1, line: 405, type: !264)
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpus", arg: 7, scope: !371, file: !1, line: 406, type: !111)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 8, scope: !371, file: !1, line: 407, type: !11)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 9, scope: !371, file: !1, line: 408, type: !280)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontJ", scope: !371, file: !1, line: 410, type: !189)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !371, file: !1, line: 411, type: !112)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !371, file: !1, line: 411, type: !112)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !371, file: !1, line: 412, type: !11)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nD", scope: !371, file: !1, line: 412, type: !11)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nL", scope: !371, file: !1, line: 412, type: !11)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nU", scope: !371, file: !1, line: 412, type: !11)
!391 = !DISubprogram(name: "FrontMtx_factorSetup", scope: !1, file: !1, line: 732, type: !392, isLocal: false, isDefinition: true, scopeLine: 738, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IP** (%struct._FrontMtx*, %struct._IV*, i32, i32, %struct.__sFILE*)* @FrontMtx_factorSetup, variables: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{!252, !20, !57, !11, !11, !280}
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !391, file: !1, line: 733, type: !20)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontOwnersIV", arg: 2, scope: !391, file: !1, line: 734, type: !57)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 3, scope: !391, file: !1, line: 735, type: !11)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 4, scope: !391, file: !1, line: 736, type: !11)
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 5, scope: !391, file: !1, line: 737, type: !280)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !391, file: !1, line: 739, type: !11)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !391, file: !1, line: 739, type: !11)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !391, file: !1, line: 739, type: !11)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !391, file: !1, line: 739, type: !11)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nadj", scope: !391, file: !1, line: 739, type: !11)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !391, file: !1, line: 739, type: !11)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !391, file: !1, line: 740, type: !44)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !391, file: !1, line: 740, type: !44)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "owners", scope: !391, file: !1, line: 740, type: !44)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !391, file: !1, line: 740, type: !44)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !391, file: !1, line: 741, type: !13)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heads", scope: !391, file: !1, line: 742, type: !252)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbfacIVL", scope: !391, file: !1, line: 743, type: !70)
!413 = !DISubprogram(name: "FrontMtx_nactiveChild", scope: !1, file: !1, line: 816, type: !414, isLocal: false, isDefinition: true, scopeLine: 820, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct._FrontMtx*, i8*, i32)* @FrontMtx_nactiveChild, variables: !416)
!414 = !DISubroutineType(types: !415)
!415 = !{!44, !20, !251, !11}
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424}
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !413, file: !1, line: 817, type: !20)
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 2, scope: !413, file: !1, line: 818, type: !251)
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 3, scope: !413, file: !1, line: 819, type: !11)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !413, file: !1, line: 821, type: !11)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !413, file: !1, line: 821, type: !11)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !413, file: !1, line: 821, type: !11)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nactiveChild", scope: !413, file: !1, line: 822, type: !44)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !413, file: !1, line: 822, type: !44)
!425 = !DISubprogram(name: "FrontMtx_setUpDequeue", scope: !1, file: !1, line: 863, type: !426, isLocal: false, isDefinition: true, scopeLine: 873, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Ideq* (%struct._FrontMtx*, i32*, i32, i8*, %struct._IP**, i8, i8, i32, %struct.__sFILE*)* @FrontMtx_setUpDequeue, variables: !437)
!426 = !DISubroutineType(types: !427)
!427 = !{!428, !20, !44, !11, !251, !252, !217, !217, !11, !280}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ideq", file: !430, line: 19, baseType: !431)
!430 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Ideq/Ideq.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ideq", file: !430, line: 20, size: 320, align: 64, elements: !432)
!432 = !{!433, !434, !435, !436}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !431, file: !430, line: 21, baseType: !11, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !431, file: !430, line: 22, baseType: !11, size: 32, align: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !431, file: !430, line: 23, baseType: !11, size: 32, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !431, file: !430, line: 24, baseType: !58, size: 192, align: 64, offset: 128)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !425, file: !1, line: 864, type: !20)
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 2, scope: !425, file: !1, line: 865, type: !44)
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 3, scope: !425, file: !1, line: 866, type: !11)
!441 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 4, scope: !425, file: !1, line: 867, type: !251)
!442 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heads", arg: 5, scope: !425, file: !1, line: 868, type: !252)
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "activeFlag", arg: 6, scope: !425, file: !1, line: 869, type: !217)
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inactiveFlag", arg: 7, scope: !425, file: !1, line: 870, type: !217)
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 8, scope: !425, file: !1, line: 871, type: !11)
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 9, scope: !425, file: !1, line: 872, type: !280)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dequeue", scope: !425, file: !1, line: 874, type: !428)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !425, file: !1, line: 875, type: !11)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !425, file: !1, line: 875, type: !11)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !425, file: !1, line: 875, type: !11)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npath", scope: !425, file: !1, line: 875, type: !11)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !425, file: !1, line: 876, type: !44)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !425, file: !1, line: 877, type: !36)
!454 = !DISubprogram(name: "FrontMtx_loadActiveLeaves", scope: !1, file: !1, line: 931, type: !455, isLocal: false, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i8*, i8, %struct._Ideq*)* @FrontMtx_loadActiveLeaves, variables: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !20, !251, !217, !428}
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !454, file: !1, line: 932, type: !20)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 2, scope: !454, file: !1, line: 933, type: !251)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "activeFlag", arg: 3, scope: !454, file: !1, line: 934, type: !217)
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dequeue", arg: 4, scope: !454, file: !1, line: 935, type: !428)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !454, file: !1, line: 937, type: !11)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !454, file: !1, line: 937, type: !11)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nactivechild", scope: !454, file: !1, line: 937, type: !11)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !454, file: !1, line: 937, type: !11)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch", scope: !454, file: !1, line: 938, type: !44)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib", scope: !454, file: !1, line: 938, type: !44)
!468 = !DISubprogram(name: "FrontMtx_postList", scope: !1, file: !1, line: 973, type: !469, isLocal: false, isDefinition: true, scopeLine: 977, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ChvList* (%struct._FrontMtx*, %struct._IV*, i32)* @FrontMtx_postList, variables: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{!253, !20, !57, !11}
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !468, file: !1, line: 974, type: !20)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontOwnersIV", arg: 2, scope: !468, file: !1, line: 975, type: !57)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lockflag", arg: 3, scope: !468, file: !1, line: 976, type: !11)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !468, file: !1, line: 978, type: !251)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "postList", scope: !468, file: !1, line: 979, type: !253)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !468, file: !1, line: 980, type: !11)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !468, file: !1, line: 980, type: !11)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !468, file: !1, line: 980, type: !11)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jthread", scope: !468, file: !1, line: 980, type: !11)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nchild", scope: !468, file: !1, line: 980, type: !11)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !468, file: !1, line: 980, type: !11)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nthread", scope: !468, file: !1, line: 980, type: !11)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "counts", scope: !468, file: !1, line: 981, type: !44)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch", scope: !468, file: !1, line: 981, type: !44)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontOwners", scope: !468, file: !1, line: 981, type: !44)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !468, file: !1, line: 981, type: !44)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib", scope: !468, file: !1, line: 981, type: !44)
!489 = !DISubprogram(name: "FrontMtx_aggregateList", scope: !1, file: !1, line: 1076, type: !469, isLocal: false, isDefinition: true, scopeLine: 1080, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ChvList* (%struct._FrontMtx*, %struct._IV*, i32)* @FrontMtx_aggregateList, variables: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !489, file: !1, line: 1077, type: !20)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontOwnersIV", arg: 2, scope: !489, file: !1, line: 1078, type: !57)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lockflag", arg: 3, scope: !489, file: !1, line: 1079, type: !11)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !489, file: !1, line: 1081, type: !251)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aggList", scope: !489, file: !1, line: 1082, type: !253)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !489, file: !1, line: 1083, type: !11)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !489, file: !1, line: 1083, type: !11)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !489, file: !1, line: 1083, type: !11)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !489, file: !1, line: 1083, type: !11)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jthread", scope: !489, file: !1, line: 1083, type: !11)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !489, file: !1, line: 1083, type: !11)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myid", scope: !489, file: !1, line: 1083, type: !11)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !489, file: !1, line: 1083, type: !11)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nthread", scope: !489, file: !1, line: 1083, type: !11)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !489, file: !1, line: 1083, type: !11)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "counts", scope: !489, file: !1, line: 1084, type: !44)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontOwners", scope: !489, file: !1, line: 1084, type: !44)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !489, file: !1, line: 1084, type: !44)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !489, file: !1, line: 1084, type: !44)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !489, file: !1, line: 1084, type: !44)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !489, file: !1, line: 1085, type: !44)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsets", scope: !489, file: !1, line: 1085, type: !44)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !489, file: !1, line: 1085, type: !44)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbfacIVL", scope: !489, file: !1, line: 1086, type: !70)
!515 = !DISubprogram(name: "assembleAggregates", scope: !1, file: !1, line: 480, type: !516, isLocal: true, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Chv*, %struct._ChvList*, %struct._ChvManager*, double*, i32, %struct.__sFILE*)* @assembleAggregates, variables: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !189, !253, !264, !111, !11, !280}
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontJ", arg: 1, scope: !515, file: !1, line: 481, type: !189)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aggList", arg: 2, scope: !515, file: !1, line: 482, type: !253)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvmanager", arg: 3, scope: !515, file: !1, line: 483, type: !264)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpus", arg: 4, scope: !515, file: !1, line: 484, type: !111)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 5, scope: !515, file: !1, line: 485, type: !11)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 6, scope: !515, file: !1, line: 486, type: !280)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv", scope: !515, file: !1, line: 488, type: !189)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "headchv", scope: !515, file: !1, line: 488, type: !189)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !515, file: !1, line: 489, type: !112)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !515, file: !1, line: 489, type: !112)
!529 = !DISubprogram(name: "assemblePostponedData", scope: !1, file: !1, line: 515, type: !530, isLocal: true, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, variables: !532)
!530 = !DISubroutineType(types: !531)
!531 = !{!217, !20, !189, !44, !250, !253, !264, !111, !11, !280}
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !529, file: !1, line: 516, type: !20)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontJ", arg: 2, scope: !529, file: !1, line: 517, type: !189)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pndelay", arg: 3, scope: !529, file: !1, line: 518, type: !44)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fronts", arg: 4, scope: !529, file: !1, line: 519, type: !250)
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "postList", arg: 5, scope: !529, file: !1, line: 520, type: !253)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvmanager", arg: 6, scope: !529, file: !1, line: 521, type: !264)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpus", arg: 7, scope: !529, file: !1, line: 522, type: !111)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 8, scope: !529, file: !1, line: 523, type: !11)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 9, scope: !529, file: !1, line: 524, type: !280)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !529, file: !1, line: 526, type: !217)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !529, file: !1, line: 527, type: !112)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !529, file: !1, line: 527, type: !112)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !529, file: !1, line: 528, type: !11)
!546 = !DISubprogram(name: "factorFront", scope: !1, file: !1, line: 586, type: !547, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, variables: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!11, !20, !189, !11, !112, !57, !187, !44, !111, !11, !280}
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !546, file: !1, line: 587, type: !20)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontJ", arg: 2, scope: !546, file: !1, line: 588, type: !189)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndelay", arg: 3, scope: !546, file: !1, line: 589, type: !11)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tau", arg: 4, scope: !546, file: !1, line: 590, type: !112)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivotsizesIV", arg: 5, scope: !546, file: !1, line: 591, type: !57)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "workDV", arg: 6, scope: !546, file: !1, line: 592, type: !187)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stats", arg: 7, scope: !546, file: !1, line: 593, type: !44)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpus", arg: 8, scope: !546, file: !1, line: 594, type: !111)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 9, scope: !546, file: !1, line: 595, type: !11)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 10, scope: !546, file: !1, line: 596, type: !280)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !546, file: !1, line: 598, type: !112)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !546, file: !1, line: 598, type: !112)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nelim", scope: !546, file: !1, line: 599, type: !11)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npost", scope: !546, file: !1, line: 599, type: !11)
!564 = !DISubprogram(name: "storeEntries", scope: !1, file: !1, line: 652, type: !565, isLocal: true, isDefinition: true, scopeLine: 665, flags: DIFlagPrototyped, isOptimized: true, variables: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !20, !189, !11, !112, !57, !253, !264, !44, !44, !111, !11, !280}
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !564, file: !1, line: 653, type: !20)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontJ", arg: 2, scope: !564, file: !1, line: 654, type: !189)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nelim", arg: 3, scope: !564, file: !1, line: 655, type: !11)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "droptol", arg: 4, scope: !564, file: !1, line: 656, type: !112)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivotsizesIV", arg: 5, scope: !564, file: !1, line: 657, type: !57)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "postList", arg: 6, scope: !564, file: !1, line: 658, type: !253)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chvmanager", arg: 7, scope: !564, file: !1, line: 659, type: !264)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parent", arg: 8, scope: !564, file: !1, line: 660, type: !44)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stats", arg: 9, scope: !564, file: !1, line: 661, type: !44)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpus", arg: 10, scope: !564, file: !1, line: 662, type: !111)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 11, scope: !564, file: !1, line: 663, type: !11)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 12, scope: !564, file: !1, line: 664, type: !280)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !564, file: !1, line: 666, type: !112)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !564, file: !1, line: 666, type: !112)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npost", scope: !564, file: !1, line: 667, type: !11)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "postponedchv", scope: !584, file: !1, line: 686, type: !189)
!584 = distinct !DILexicalBlock(scope: !585, file: !1, line: 685, column: 25)
!585 = distinct !DILexicalBlock(scope: !564, file: !1, line: 685, column: 6)
!586 = !{!587, !598}
!587 = !DIGlobalVariable(name: "TV", scope: !0, file: !588, line: 9, type: !589, isLocal: true, isDefinition: true, variable: %struct.timeval* @TV)
!588 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../timings.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !590, line: 30, size: 128, align: 64, elements: !591)
!590 = !DIFile(filename: "/usr/include/sys/_types/_timeval.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!591 = !{!592, !595}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !589, file: !590, line: 32, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !316, line: 120, baseType: !594)
!594 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !589, file: !590, line: 33, baseType: !596, size: 32, align: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !314, line: 74, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !316, line: 44, baseType: !11)
!598 = !DIGlobalVariable(name: "TZ", scope: !0, file: !588, line: 10, type: !599, isLocal: true, isDefinition: true, variable: %struct.timezone* @TZ)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !600, line: 124, size: 64, align: 32, elements: !601)
!600 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !599, file: !600, line: 125, baseType: !11, size: 32, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !599, file: !600, line: 126, baseType: !11, size: 32, align: 32, offset: 32)
!604 = !{i32 2, !"Dwarf Version", i32 2}
!605 = !{i32 2, !"Debug Info Version", i32 700000003}
!606 = !{i32 1, !"PIC Level", i32 2}
!607 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!608 = !DIExpression()
!609 = !DILocation(line: 16, column: 16, scope: !17)
!610 = !DILocation(line: 17, column: 16, scope: !17)
!611 = !DILocation(line: 18, column: 15, scope: !17)
!612 = !DILocation(line: 27, column: 32, scope: !17)
!613 = !{!614, !618, i64 48}
!614 = !{!"_FrontMtx", !615, i64 0, !615, i64 4, !615, i64 8, !615, i64 12, !615, i64 16, !615, i64 20, !615, i64 24, !615, i64 28, !615, i64 32, !615, i64 36, !618, i64 40, !618, i64 48, !618, i64 56, !618, i64 64, !618, i64 72, !618, i64 80, !618, i64 88, !618, i64 96, !618, i64 104, !618, i64 112, !618, i64 120, !618, i64 128, !618, i64 136, !618, i64 144, !618, i64 152, !618, i64 160, !618, i64 168, !618, i64 176, !615, i64 184}
!615 = !{!"int", !616, i64 0}
!616 = !{!"omnipotent char", !617, i64 0}
!617 = !{!"Simple C/C++ TBAA"}
!618 = !{!"any pointer", !616, i64 0}
!619 = !DILocation(line: 27, column: 6, scope: !17)
!620 = !DILocation(line: 20, column: 14, scope: !17)
!621 = !DILocation(line: 33, column: 27, scope: !17)
!622 = !{!614, !618, i64 64}
!623 = !DILocation(line: 20, column: 7, scope: !17)
!624 = !DILocation(line: 21, column: 8, scope: !17)
!625 = !DILocation(line: 33, column: 1, scope: !17)
!626 = !DILocation(line: 48, column: 25, scope: !17)
!627 = !{!615, !615, i64 0}
!628 = !DILocation(line: 48, column: 31, scope: !17)
!629 = !DILocation(line: 49, column: 20, scope: !17)
!630 = !{!614, !615, i64 8}
!631 = !DILocation(line: 49, column: 36, scope: !17)
!632 = !{!614, !615, i64 12}
!633 = !DILocation(line: 48, column: 1, scope: !17)
!634 = !DILocation(line: 21, column: 18, scope: !17)
!635 = !DILocation(line: 55, column: 1, scope: !17)
!636 = !DILocation(line: 56, column: 8, scope: !17)
!637 = !DILocation(line: 56, column: 15, scope: !17)
!638 = !{!618, !618, i64 0}
!639 = !DILocation(line: 56, column: 21, scope: !17)
!640 = !DILocation(line: 56, column: 1, scope: !17)
!641 = !DILocation(line: 62, column: 6, scope: !642)
!642 = distinct !DILexicalBlock(scope: !17, file: !1, line: 62, column: 6)
!643 = !DILocation(line: 62, column: 6, scope: !17)
!644 = !DILocation(line: 20, column: 18, scope: !17)
!645 = !DILocation(line: 68, column: 4, scope: !646)
!646 = distinct !DILexicalBlock(scope: !642, file: !1, line: 62, column: 43)
!647 = !DILocation(line: 69, column: 11, scope: !646)
!648 = !DILocation(line: 69, column: 18, scope: !646)
!649 = !DILocation(line: 69, column: 24, scope: !646)
!650 = !DILocation(line: 69, column: 4, scope: !646)
!651 = !DILocation(line: 70, column: 1, scope: !646)
!652 = !DILocation(line: 76, column: 1, scope: !17)
!653 = !DILocation(line: 83, column: 1, scope: !17)
!654 = !DILocation(line: 148, column: 18, scope: !214)
!655 = !DILocation(line: 149, column: 18, scope: !214)
!656 = !DILocation(line: 150, column: 17, scope: !214)
!657 = !DILocation(line: 151, column: 17, scope: !214)
!658 = !DILocation(line: 152, column: 17, scope: !214)
!659 = !DILocation(line: 153, column: 18, scope: !214)
!660 = !DILocation(line: 154, column: 17, scope: !214)
!661 = !DILocation(line: 155, column: 17, scope: !214)
!662 = !DILocation(line: 156, column: 17, scope: !214)
!663 = !DILocation(line: 157, column: 17, scope: !214)
!664 = !DILocation(line: 158, column: 18, scope: !214)
!665 = !DILocation(line: 159, column: 18, scope: !214)
!666 = !DILocation(line: 160, column: 18, scope: !214)
!667 = !DILocation(line: 161, column: 17, scope: !214)
!668 = !DILocation(line: 162, column: 18, scope: !214)
!669 = !DILocation(line: 163, column: 18, scope: !214)
!670 = !DILocation(line: 164, column: 18, scope: !214)
!671 = !DILocation(line: 165, column: 17, scope: !214)
!672 = !DILocation(line: 166, column: 17, scope: !214)
