; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_solveUtil.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._FrontMtx = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._Tree*, %struct._ETree*, %struct._IV*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._IVL*, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._SubMtx**, %struct._I2Ohash*, %struct._I2Ohash*, %struct._SubMtxManager*, %struct._Lock*, %struct._PatchAndGoInfo*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._I2Ohash = type { i32, i32, i32, %struct._I2OP*, %struct._I2OP*, %struct._I2OP** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !43, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/FrontMtx_solveUtil.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !32, !33, !34}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !7, line: 44, size: 576, align: 64, elements: !8)
!7 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !{!9, !11, !12, !13, !14, !15, !16, !17, !20, !29}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !6, file: !7, line: 45, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !6, file: !7, line: 46, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !6, file: !7, line: 47, baseType: !10, size: 32, align: 32, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !6, file: !7, line: 48, baseType: !10, size: 32, align: 32, offset: 96)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !6, file: !7, line: 49, baseType: !10, size: 32, align: 32, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !6, file: !7, line: 50, baseType: !10, size: 32, align: 32, offset: 160)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !6, file: !7, line: 51, baseType: !10, size: 32, align: 32, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !6, file: !7, line: 52, baseType: !18, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !6, file: !7, line: 53, baseType: !21, size: 192, align: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !22, line: 20, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !22, line: 21, size: 192, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !23, file: !22, line: 22, baseType: !10, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !23, file: !22, line: 23, baseType: !10, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !23, file: !22, line: 24, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !23, file: !22, line: 25, baseType: !18, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !6, file: !7, line: 54, baseType: !30, size: 64, align: 64, offset: 512)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !7, line: 43, baseType: !6)
!32 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IP", file: !37, line: 11, size: 128, align: 64, elements: !38)
!37 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/IP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !36, file: !37, line: 12, baseType: !10, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !37, line: 13, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP", file: !37, line: 10, baseType: !36)
!43 = !{!44, !300, !336, !353, !374, !406, !425, !441, !455, !471, !489, !511}
!44 = !DISubprogram(name: "FrontMtx_loadRightHandSide", scope: !1, file: !1, line: 26, type: !45, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, function: %struct._SubMtx** (%struct._FrontMtx*, %struct._DenseMtx*, i32*, i32, %struct._SubMtxManager*, i32, %struct.__sFILE*)* @FrontMtx_loadRightHandSide, variables: !270)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !48, !191, !72, !10, !153, !10, !208}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrontMtx", file: !50, line: 96, baseType: !51)
!50 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../FrontMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FrontMtx", file: !50, line: 97, size: 1536, align: 64, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !75, !96, !97, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !151, !152, !177, !178, !190}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !51, file: !50, line: 98, baseType: !10, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "neqns", scope: !51, file: !50, line: 99, baseType: !10, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !50, line: 100, baseType: !10, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "symmetryflag", scope: !51, file: !50, line: 101, baseType: !10, size: 32, align: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sparsityflag", scope: !51, file: !50, line: 102, baseType: !10, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pivotingflag", scope: !51, file: !50, line: 103, baseType: !10, size: 32, align: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dataMode", scope: !51, file: !50, line: 104, baseType: !10, size: 32, align: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nentD", scope: !51, file: !50, line: 105, baseType: !10, size: 32, align: 32, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nentL", scope: !51, file: !50, line: 106, baseType: !10, size: 32, align: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nentU", scope: !51, file: !50, line: 107, baseType: !10, size: 32, align: 32, offset: 288)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !51, file: !50, line: 108, baseType: !64, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !66, line: 15, baseType: !67)
!66 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !66, line: 16, size: 256, align: 64, elements: !68)
!68 = !{!69, !70, !71, !73, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !67, file: !66, line: 17, baseType: !10, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !67, file: !66, line: 18, baseType: !10, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !67, file: !66, line: 19, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !67, file: !66, line: 20, baseType: !72, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !67, file: !66, line: 21, baseType: !72, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "frontETree", scope: !51, file: !50, line: 109, baseType: !76, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !78, line: 31, baseType: !79)
!78 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !78, line: 32, size: 320, align: 64, elements: !80)
!80 = !{!81, !82, !83, !84, !94, !95}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !79, file: !78, line: 33, baseType: !10, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !79, file: !78, line: 34, baseType: !10, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !79, file: !78, line: 35, baseType: !64, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !79, file: !78, line: 36, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !87, line: 20, baseType: !88)
!87 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !87, line: 21, size: 192, align: 64, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !87, line: 22, baseType: !10, size: 32, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !88, file: !87, line: 23, baseType: !10, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !88, file: !87, line: 24, baseType: !10, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !88, file: !87, line: 25, baseType: !72, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !79, file: !78, line: 37, baseType: !85, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !79, file: !78, line: 38, baseType: !85, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "frontsizesIV", scope: !51, file: !50, line: 110, baseType: !85, size: 64, align: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "symbfacIVL", scope: !51, file: !50, line: 111, baseType: !98, size: 64, align: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !100, line: 55, baseType: !101)
!100 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !100, line: 79, size: 384, align: 64, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !110, !111}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !100, line: 80, baseType: !10, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !101, file: !100, line: 81, baseType: !10, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !101, file: !100, line: 82, baseType: !10, size: 32, align: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !101, file: !100, line: 83, baseType: !10, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !101, file: !100, line: 84, baseType: !72, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !101, file: !100, line: 85, baseType: !109, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !101, file: !100, line: 86, baseType: !10, size: 32, align: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !101, file: !100, line: 87, baseType: !112, size: 64, align: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !100, line: 56, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !100, line: 102, size: 192, align: 64, elements: !115)
!115 = !{!116, !117, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !114, file: !100, line: 103, baseType: !10, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !114, file: !100, line: 104, baseType: !10, size: 32, align: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !114, file: !100, line: 105, baseType: !72, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !100, line: 106, baseType: !112, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rowadjIVL", scope: !51, file: !50, line: 112, baseType: !98, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "coladjIVL", scope: !51, file: !50, line: 113, baseType: !98, size: 64, align: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "lowerblockIVL", scope: !51, file: !50, line: 114, baseType: !98, size: 64, align: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "upperblockIVL", scope: !51, file: !50, line: 115, baseType: !98, size: 64, align: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxDJJ", scope: !51, file: !50, line: 116, baseType: !47, size: 64, align: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJJ", scope: !51, file: !50, line: 117, baseType: !47, size: 64, align: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxUJN", scope: !51, file: !50, line: 118, baseType: !47, size: 64, align: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLJJ", scope: !51, file: !50, line: 119, baseType: !47, size: 64, align: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p_mtxLNJ", scope: !51, file: !50, line: 120, baseType: !47, size: 64, align: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lowerhash", scope: !51, file: !50, line: 121, baseType: !130, size: 64, align: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !132, line: 6, baseType: !133)
!132 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../I2Ohash/I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !132, line: 7, size: 320, align: 64, elements: !134)
!134 = !{!135, !136, !137, !138, !148, !149}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !133, file: !132, line: 8, baseType: !10, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !133, file: !132, line: 9, baseType: !10, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !133, file: !132, line: 10, baseType: !10, size: 32, align: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !133, file: !132, line: 11, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !141, line: 5, baseType: !142)
!141 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !141, line: 6, size: 192, align: 64, elements: !143)
!143 = !{!144, !145, !146, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !142, file: !141, line: 7, baseType: !10, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !142, file: !141, line: 8, baseType: !10, size: 32, align: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !142, file: !141, line: 9, baseType: !33, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !141, line: 10, baseType: !139, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !133, file: !132, line: 12, baseType: !139, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !133, file: !132, line: 13, baseType: !150, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "upperhash", scope: !51, file: !50, line: 122, baseType: !130, size: 64, align: 64, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !51, file: !50, line: 123, baseType: !153, size: 64, align: 64, offset: 1280)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !155, line: 9, baseType: !156)
!155 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxManager/SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !155, line: 10, size: 448, align: 64, elements: !157)
!157 = !{!158, !159, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !156, file: !155, line: 11, baseType: !30, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !156, file: !155, line: 12, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !162, line: 36, baseType: !163)
!162 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !162, line: 37, size: 128, align: 64, elements: !164)
!164 = !{!165, !166, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !163, file: !162, line: 45, baseType: !33, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !163, file: !162, line: 47, baseType: !10, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !163, file: !162, line: 48, baseType: !10, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !156, file: !155, line: 13, baseType: !10, size: 32, align: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !156, file: !155, line: 14, baseType: !10, size: 32, align: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !156, file: !155, line: 15, baseType: !10, size: 32, align: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !156, file: !155, line: 16, baseType: !10, size: 32, align: 32, offset: 224)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !156, file: !155, line: 17, baseType: !10, size: 32, align: 32, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !156, file: !155, line: 18, baseType: !10, size: 32, align: 32, offset: 288)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !156, file: !155, line: 19, baseType: !10, size: 32, align: 32, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !156, file: !155, line: 20, baseType: !10, size: 32, align: 32, offset: 352)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !156, file: !155, line: 21, baseType: !10, size: 32, align: 32, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !51, file: !50, line: 124, baseType: !160, size: 64, align: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "patchinfo", scope: !51, file: !50, line: 125, baseType: !179, size: 64, align: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PatchAndGoInfo", file: !181, line: 31, baseType: !182)
!181 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../PatchAndGoInfo/PatchAndGoInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PatchAndGoInfo", file: !181, line: 32, size: 320, align: 64, elements: !183)
!183 = !{!184, !185, !186, !187, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !182, file: !181, line: 33, baseType: !10, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "toosmall", scope: !182, file: !181, line: 34, baseType: !19, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fudge", scope: !182, file: !181, line: 35, baseType: !19, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeIV", scope: !182, file: !181, line: 36, baseType: !85, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeDV", scope: !182, file: !181, line: 37, baseType: !189, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !51, file: !50, line: 126, baseType: !10, size: 32, align: 32, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "DenseMtx", file: !193, line: 28, baseType: !194)
!193 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../DenseMtx/DenseMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DenseMtx", file: !193, line: 29, size: 704, align: 64, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !193, line: 30, baseType: !10, size: 32, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !194, file: !193, line: 31, baseType: !10, size: 32, align: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !194, file: !193, line: 32, baseType: !10, size: 32, align: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !194, file: !193, line: 33, baseType: !10, size: 32, align: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !194, file: !193, line: 34, baseType: !10, size: 32, align: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !194, file: !193, line: 35, baseType: !10, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !194, file: !193, line: 36, baseType: !10, size: 32, align: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rowind", scope: !194, file: !193, line: 37, baseType: !72, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "colind", scope: !194, file: !193, line: 38, baseType: !72, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !194, file: !193, line: 39, baseType: !18, size: 64, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !194, file: !193, line: 40, baseType: !21, size: 192, align: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !193, line: 41, baseType: !191, size: 64, align: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !210, line: 153, baseType: !211)
!210 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !210, line: 122, size: 1216, align: 64, elements: !212)
!212 = !{!213, !216, !217, !218, !220, !221, !226, !227, !228, !232, !238, !248, !254, !255, !258, !259, !263, !267, !268, !269}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !211, file: !210, line: 123, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !211, file: !210, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !211, file: !210, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !211, file: !210, line: 126, baseType: !219, size: 16, align: 16, offset: 128)
!219 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !211, file: !210, line: 127, baseType: !219, size: 16, align: 16, offset: 144)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !211, file: !210, line: 128, baseType: !222, size: 128, align: 64, offset: 192)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !210, line: 88, size: 128, align: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !222, file: !210, line: 89, baseType: !214, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !222, file: !210, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !211, file: !210, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !211, file: !210, line: 132, baseType: !33, size: 64, align: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !211, file: !210, line: 133, baseType: !229, size: 64, align: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!10, !33}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !211, file: !210, line: 134, baseType: !233, size: 64, align: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!10, !33, !236, !10}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !211, file: !210, line: 135, baseType: !239, size: 64, align: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !33, !242, !10}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !210, line: 77, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !244, line: 71, baseType: !245)
!244 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !246, line: 46, baseType: !247)
!246 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!247 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !211, file: !210, line: 136, baseType: !249, size: 64, align: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!10, !33, !252, !10}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !211, file: !210, line: 139, baseType: !222, size: 128, align: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !211, file: !210, line: 140, baseType: !256, size: 64, align: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !210, line: 94, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !211, file: !210, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !211, file: !210, line: 144, baseType: !260, size: 24, align: 8, offset: 928)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 24, align: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 3)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !211, file: !210, line: 145, baseType: !264, size: 8, align: 8, offset: 952)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 8, align: 8, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 1)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !211, file: !210, line: 148, baseType: !222, size: 128, align: 64, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !211, file: !210, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !211, file: !210, line: 152, baseType: !242, size: 64, align: 64, offset: 1152)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !44, file: !1, line: 27, type: !48)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rhsmtx", arg: 2, scope: !44, file: !1, line: 28, type: !191)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 3, scope: !44, file: !1, line: 29, type: !72)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 4, scope: !44, file: !1, line: 30, type: !10)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxmanager", arg: 5, scope: !44, file: !1, line: 31, type: !153)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 6, scope: !44, file: !1, line: 32, type: !10)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 7, scope: !44, file: !1, line: 33, type: !208)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "localrhs", scope: !44, file: !1, line: 35, type: !237)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "BJ", scope: !44, file: !1, line: 36, type: !30)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_agg", scope: !44, file: !1, line: 37, type: !47)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bJ", scope: !44, file: !1, line: 38, type: !18)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rhs", scope: !44, file: !1, line: 38, type: !18)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !44, file: !1, line: 39, type: !10)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !44, file: !1, line: 39, type: !10)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !44, file: !1, line: 39, type: !10)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrhs", scope: !44, file: !1, line: 39, type: !10)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !44, file: !1, line: 39, type: !10)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !44, file: !1, line: 39, type: !10)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !44, file: !1, line: 39, type: !10)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncolJ", scope: !44, file: !1, line: 39, type: !10)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neqns", scope: !44, file: !1, line: 40, type: !10)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !44, file: !1, line: 40, type: !10)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nJ", scope: !44, file: !1, line: 40, type: !10)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrhs", scope: !44, file: !1, line: 40, type: !10)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrowInRhs", scope: !44, file: !1, line: 40, type: !10)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrowJ", scope: !44, file: !1, line: 40, type: !10)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !44, file: !1, line: 41, type: !72)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowindJ", scope: !44, file: !1, line: 41, type: !72)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowmap", scope: !44, file: !1, line: 41, type: !72)
!300 = !DISubprogram(name: "FrontMtx_forwardVisit", scope: !1, file: !1, line: 174, type: !301, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i32, i32, i32*, i32, %struct._SubMtxManager*, %struct._SubMtxList*, %struct._SubMtx**, i8*, %struct._IP**, %struct._SubMtx**, i8*, i32, %struct.__sFILE*)* @FrontMtx_forwardVisit, variables: !315)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !48, !10, !10, !72, !10, !153, !303, !47, !236, !314, !47, !236, !10, !208}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxList", file: !305, line: 24, baseType: !306)
!305 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../SubMtxList/SubMtxList.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxList", file: !305, line: 25, size: 384, align: 64, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !306, file: !305, line: 26, baseType: !10, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !306, file: !305, line: 27, baseType: !47, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !306, file: !305, line: 28, baseType: !72, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !305, line: 29, baseType: !160, size: 64, align: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !305, line: 30, baseType: !236, size: 64, align: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !306, file: !305, line: 31, baseType: !10, size: 32, align: 32, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !300, file: !1, line: 175, type: !48)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 2, scope: !300, file: !1, line: 176, type: !10)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrhs", arg: 3, scope: !300, file: !1, line: 177, type: !10)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 4, scope: !300, file: !1, line: 178, type: !72)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 5, scope: !300, file: !1, line: 179, type: !10)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxmanager", arg: 6, scope: !300, file: !1, line: 180, type: !153)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aggList", arg: 7, scope: !300, file: !1, line: 181, type: !303)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_mtx", arg: 8, scope: !300, file: !1, line: 182, type: !47)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontIsDone", arg: 9, scope: !300, file: !1, line: 183, type: !236)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heads", arg: 10, scope: !300, file: !1, line: 184, type: !314)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_agg", arg: 11, scope: !300, file: !1, line: 185, type: !47)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 12, scope: !300, file: !1, line: 186, type: !236)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 13, scope: !300, file: !1, line: 187, type: !10)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 14, scope: !300, file: !1, line: 188, type: !208)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aggDone", scope: !300, file: !1, line: 190, type: !237)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "updDone", scope: !300, file: !1, line: 190, type: !237)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "BJ", scope: !300, file: !1, line: 191, type: !30)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LJJ", scope: !300, file: !1, line: 191, type: !30)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "UJJ", scope: !300, file: !1, line: 191, type: !30)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nJ", scope: !300, file: !1, line: 192, type: !10)
!336 = !DISubprogram(name: "FrontMtx_diagonalVisit", scope: !1, file: !1, line: 334, type: !337, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i32, i32*, i32, %struct._SubMtx**, i8*, %struct._SubMtx**, i32, %struct.__sFILE*)* @FrontMtx_diagonalVisit, variables: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !48, !10, !72, !10, !47, !236, !47, !10, !208}
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !352}
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !336, file: !1, line: 335, type: !48)
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 2, scope: !336, file: !1, line: 336, type: !10)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 3, scope: !336, file: !1, line: 337, type: !72)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 4, scope: !336, file: !1, line: 338, type: !10)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_mtx", arg: 5, scope: !336, file: !1, line: 339, type: !47)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontIsDone", arg: 6, scope: !336, file: !1, line: 340, type: !236)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_agg", arg: 7, scope: !336, file: !1, line: 341, type: !47)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 8, scope: !336, file: !1, line: 342, type: !10)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 9, scope: !336, file: !1, line: 343, type: !208)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "BJ", scope: !350, file: !1, line: 346, type: !30)
!350 = distinct !DILexicalBlock(scope: !351, file: !1, line: 345, column: 44)
!351 = distinct !DILexicalBlock(scope: !336, file: !1, line: 345, column: 6)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DJJ", scope: !350, file: !1, line: 346, type: !30)
!353 = !DISubprogram(name: "FrontMtx_backwardVisit", scope: !1, file: !1, line: 382, type: !301, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i32, i32, i32*, i32, %struct._SubMtxManager*, %struct._SubMtxList*, %struct._SubMtx**, i8*, %struct._IP**, %struct._SubMtx**, i8*, i32, %struct.__sFILE*)* @FrontMtx_backwardVisit, variables: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !353, file: !1, line: 383, type: !48)
!356 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "J", arg: 2, scope: !353, file: !1, line: 384, type: !10)
!357 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrhs", arg: 3, scope: !353, file: !1, line: 385, type: !10)
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 4, scope: !353, file: !1, line: 386, type: !72)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 5, scope: !353, file: !1, line: 387, type: !10)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxmanager", arg: 6, scope: !353, file: !1, line: 388, type: !153)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aggList", arg: 7, scope: !353, file: !1, line: 389, type: !303)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_mtx", arg: 8, scope: !353, file: !1, line: 390, type: !47)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontIsDone", arg: 9, scope: !353, file: !1, line: 391, type: !236)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heads", arg: 10, scope: !353, file: !1, line: 392, type: !314)
!365 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_agg", arg: 11, scope: !353, file: !1, line: 393, type: !47)
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 12, scope: !353, file: !1, line: 394, type: !236)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 13, scope: !353, file: !1, line: 395, type: !10)
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 14, scope: !353, file: !1, line: 396, type: !208)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aggDone", scope: !353, file: !1, line: 398, type: !237)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "updDone", scope: !353, file: !1, line: 398, type: !237)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "UJJ", scope: !353, file: !1, line: 399, type: !30)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ZJ", scope: !353, file: !1, line: 399, type: !30)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nJ", scope: !353, file: !1, line: 400, type: !10)
!374 = !DISubprogram(name: "FrontMtx_storeSolution", scope: !1, file: !1, line: 543, type: !375, isLocal: false, isDefinition: true, scopeLine: 552, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i32*, i32, %struct._SubMtxManager*, %struct._SubMtx**, %struct._DenseMtx*, i32, %struct.__sFILE*)* @FrontMtx_storeSolution, variables: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !48, !72, !10, !153, !47, !191, !10, !208}
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !374, file: !1, line: 544, type: !48)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owners", arg: 2, scope: !374, file: !1, line: 545, type: !72)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myid", arg: 3, scope: !374, file: !1, line: 546, type: !10)
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 4, scope: !374, file: !1, line: 547, type: !153)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_mtx", arg: 5, scope: !374, file: !1, line: 548, type: !47)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "solmtx", arg: 6, scope: !374, file: !1, line: 549, type: !191)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 7, scope: !374, file: !1, line: 550, type: !10)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 8, scope: !374, file: !1, line: 551, type: !208)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "localsol", scope: !374, file: !1, line: 553, type: !237)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmtxJ", scope: !374, file: !1, line: 554, type: !30)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sol", scope: !374, file: !1, line: 555, type: !18)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xJ", scope: !374, file: !1, line: 555, type: !18)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !374, file: !1, line: 556, type: !10)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !374, file: !1, line: 556, type: !10)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !374, file: !1, line: 556, type: !10)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrhs", scope: !374, file: !1, line: 556, type: !10)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !374, file: !1, line: 556, type: !10)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !374, file: !1, line: 556, type: !10)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncolJ", scope: !374, file: !1, line: 557, type: !10)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neqns", scope: !374, file: !1, line: 557, type: !10)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !374, file: !1, line: 557, type: !10)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nJ", scope: !374, file: !1, line: 557, type: !10)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrhs", scope: !374, file: !1, line: 557, type: !10)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrowInSol", scope: !374, file: !1, line: 557, type: !10)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrowJ", scope: !374, file: !1, line: 557, type: !10)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colindJ", scope: !374, file: !1, line: 558, type: !72)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colmap", scope: !374, file: !1, line: 558, type: !72)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !374, file: !1, line: 558, type: !72)
!406 = !DISubprogram(name: "FrontMtx_loadActiveRoots", scope: !1, file: !1, line: 981, type: !407, isLocal: false, isDefinition: true, scopeLine: 986, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._FrontMtx*, i8*, i8, %struct._Ideq*)* @FrontMtx_loadActiveRoots, variables: !418)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !48, !236, !237, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ideq", file: !411, line: 19, baseType: !412)
!411 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/FrontMtx/src/../../Ideq/Ideq.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ideq", file: !411, line: 20, size: 320, align: 64, elements: !413)
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !412, file: !411, line: 21, baseType: !10, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !412, file: !411, line: 22, baseType: !10, size: 32, align: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !412, file: !411, line: 23, baseType: !10, size: 32, align: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !412, file: !411, line: 24, baseType: !86, size: 192, align: 64, offset: 128)
!418 = !{!419, !420, !421, !422, !423, !424}
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !406, file: !1, line: 982, type: !48)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 2, scope: !406, file: !1, line: 983, type: !236)
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "activeFlag", arg: 3, scope: !406, file: !1, line: 984, type: !237)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dequeue", arg: 4, scope: !406, file: !1, line: 985, type: !409)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !406, file: !1, line: 987, type: !10)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib", scope: !406, file: !1, line: 988, type: !72)
!425 = !DISubprogram(name: "FrontMtx_forwardSetup", scope: !1, file: !1, line: 1013, type: !426, isLocal: false, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IP** (%struct._FrontMtx*, i32, %struct.__sFILE*)* @FrontMtx_forwardSetup, variables: !428)
!426 = !DISubroutineType(types: !427)
!427 = !{!314, !48, !10, !208}
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !425, file: !1, line: 1014, type: !48)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 2, scope: !425, file: !1, line: 1015, type: !10)
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 3, scope: !425, file: !1, line: 1016, type: !208)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !425, file: !1, line: 1018, type: !10)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !425, file: !1, line: 1018, type: !10)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !425, file: !1, line: 1018, type: !10)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nadj", scope: !425, file: !1, line: 1018, type: !10)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nblock", scope: !425, file: !1, line: 1018, type: !10)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !425, file: !1, line: 1018, type: !10)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !425, file: !1, line: 1019, type: !72)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !425, file: !1, line: 1020, type: !41)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heads", scope: !425, file: !1, line: 1021, type: !314)
!441 = !DISubprogram(name: "FrontMtx_backwardSetup", scope: !1, file: !1, line: 1059, type: !426, isLocal: false, isDefinition: true, scopeLine: 1063, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IP** (%struct._FrontMtx*, i32, %struct.__sFILE*)* @FrontMtx_backwardSetup, variables: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frontmtx", arg: 1, scope: !441, file: !1, line: 1060, type: !48)
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 2, scope: !441, file: !1, line: 1061, type: !10)
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 3, scope: !441, file: !1, line: 1062, type: !208)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !441, file: !1, line: 1064, type: !41)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heads", scope: !441, file: !1, line: 1065, type: !314)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !441, file: !1, line: 1066, type: !10)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !441, file: !1, line: 1066, type: !10)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !441, file: !1, line: 1066, type: !10)
