; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_domSegMap.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.timeval = type { i64, i32 }
%struct.timezone = type { i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IV = type { i32, i32, i32, i32* }
%struct._GPart = type { i32, %struct._Graph*, i32, i32, i32, %struct._IV, %struct._IV, %struct._GPart*, %struct._GPart*, %struct._GPart*, %struct._IV, i32, %struct.__sFILE* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@icputimes = internal unnamed_addr global i32 0, align 4
@TV = internal global %struct.timeval zeroinitializer, align 8
@TZ = internal global %struct.timezone zeroinitializer, align 4
@cputimes = internal unnamed_addr global [12 x double] zeroinitializer, align 16
@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [55 x i8] c"\0A fatal error in GPart_domSegMap(%p,%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !191, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_domSegMap.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6}
!6 = !DISubprogram(name: "GPart_domSegMap", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._GPart*, i32*, i32*)* @GPart_domSegMap, variables: !136)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !20, !19, !19}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !11, line: 20, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !11, line: 21, size: 192, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !11, line: 22, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !12, file: !11, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !12, file: !11, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !12, file: !11, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPart", file: !22, line: 37, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../GPart.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GPart", file: !22, line: 38, size: 1152, align: 64, elements: !24)
!24 = !{!25, !26, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !23, file: !22, line: 39, baseType: !15, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !23, file: !22, line: 40, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !29, line: 49, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !29, line: 50, size: 384, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !61, !62}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, file: !29, line: 51, baseType: !15, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !30, file: !29, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !30, file: !29, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !30, file: !29, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !30, file: !29, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !30, file: !29, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !30, file: !29, line: 57, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !41, line: 55, baseType: !42)
!41 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !41, line: 79, size: 384, align: 64, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !51, !52}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !41, line: 80, baseType: !15, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !42, file: !41, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !42, file: !41, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !42, file: !41, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !42, file: !41, line: 84, baseType: !19, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !42, file: !41, line: 85, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !42, file: !41, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !42, file: !41, line: 87, baseType: !53, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !41, line: 56, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !41, line: 102, size: 192, align: 64, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !41, line: 103, baseType: !15, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !55, file: !41, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !55, file: !41, line: 105, baseType: !19, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !41, line: 106, baseType: !53, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !30, file: !29, line: 58, baseType: !19, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !30, file: !29, line: 59, baseType: !39, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !23, file: !22, line: 41, baseType: !15, size: 32, align: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !23, file: !22, line: 42, baseType: !15, size: 32, align: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ncomp", scope: !23, file: !22, line: 43, baseType: !15, size: 32, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "compidsIV", scope: !23, file: !22, line: 44, baseType: !10, size: 192, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cweightsIV", scope: !23, file: !22, line: 45, baseType: !10, size: 192, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !23, file: !22, line: 46, baseType: !20, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !23, file: !22, line: 47, baseType: !20, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !23, file: !22, line: 48, baseType: !20, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "vtxMapIV", scope: !23, file: !22, line: 49, baseType: !10, size: 192, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !23, file: !22, line: 50, baseType: !15, size: 32, align: 32, offset: 1024)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !23, file: !22, line: 51, baseType: !74, size: 64, align: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !76, line: 153, baseType: !77)
!76 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !76, line: 122, size: 1216, align: 64, elements: !78)
!78 = !{!79, !82, !83, !84, !86, !87, !92, !93, !94, !98, !104, !114, !120, !121, !124, !125, !129, !133, !134, !135}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !77, file: !76, line: 123, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !77, file: !76, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !77, file: !76, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !77, file: !76, line: 126, baseType: !85, size: 16, align: 16, offset: 128)
!85 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !77, file: !76, line: 127, baseType: !85, size: 16, align: 16, offset: 144)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !77, file: !76, line: 128, baseType: !88, size: 128, align: 64, offset: 192)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !76, line: 88, size: 128, align: 64, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !88, file: !76, line: 89, baseType: !80, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !88, file: !76, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !77, file: !76, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !77, file: !76, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !77, file: !76, line: 133, baseType: !95, size: 64, align: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!15, !4}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !77, file: !76, line: 134, baseType: !99, size: 64, align: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!15, !4, !102, !15}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !77, file: !76, line: 135, baseType: !105, size: 64, align: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !4, !108, !15}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !76, line: 77, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !110, line: 71, baseType: !111)
!110 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !112, line: 46, baseType: !113)
!112 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!113 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !77, file: !76, line: 136, baseType: !115, size: 64, align: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!15, !4, !118, !15}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !77, file: !76, line: 139, baseType: !88, size: 128, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !77, file: !76, line: 140, baseType: !122, size: 64, align: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !76, line: 94, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !77, file: !76, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !77, file: !76, line: 144, baseType: !126, size: 24, align: 8, offset: 928)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 24, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !77, file: !76, line: 145, baseType: !130, size: 8, align: 8, offset: 952)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !77, file: !76, line: 148, baseType: !88, size: 128, align: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !77, file: !76, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !77, file: !76, line: 152, baseType: !108, size: 64, align: 64, offset: 1152)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gpart", arg: 1, scope: !6, file: !1, line: 24, type: !20)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pndom", arg: 2, scope: !6, file: !1, line: 25, type: !19)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnseg", arg: 3, scope: !6, file: !1, line: 26, type: !19)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msgFile", scope: !6, file: !1, line: 28, type: !74)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !6, file: !1, line: 29, type: !27)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adjdom", scope: !6, file: !1, line: 30, type: !15)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !6, file: !1, line: 30, type: !15)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !6, file: !1, line: 30, type: !15)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !6, file: !1, line: 30, type: !15)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !6, file: !1, line: 30, type: !15)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 30, type: !15)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj1", scope: !6, file: !1, line: 30, type: !15)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj2", scope: !6, file: !1, line: 30, type: !15)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !6, file: !1, line: 30, type: !15)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !6, file: !1, line: 30, type: !15)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msglvl", scope: !6, file: !1, line: 31, type: !15)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nextphi", scope: !6, file: !1, line: 31, type: !15)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nPhi", scope: !6, file: !1, line: 31, type: !15)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nPsi", scope: !6, file: !1, line: 31, type: !15)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nV", scope: !6, file: !1, line: 31, type: !15)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi", scope: !6, file: !1, line: 31, type: !15)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi0", scope: !6, file: !1, line: 31, type: !15)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi1", scope: !6, file: !1, line: 31, type: !15)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi2", scope: !6, file: !1, line: 31, type: !15)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi3", scope: !6, file: !1, line: 31, type: !15)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "psi", scope: !6, file: !1, line: 32, type: !15)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sigma", scope: !6, file: !1, line: 32, type: !15)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !6, file: !1, line: 32, type: !15)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size0", scope: !6, file: !1, line: 32, type: !15)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size1", scope: !6, file: !1, line: 32, type: !15)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size2", scope: !6, file: !1, line: 32, type: !15)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !6, file: !1, line: 32, type: !15)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !6, file: !1, line: 32, type: !15)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !6, file: !1, line: 32, type: !15)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !6, file: !1, line: 33, type: !19)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj0", scope: !6, file: !1, line: 33, type: !19)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj1", scope: !6, file: !1, line: 33, type: !19)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj2", scope: !6, file: !1, line: 33, type: !19)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compids", scope: !6, file: !1, line: 33, type: !19)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmark", scope: !6, file: !1, line: 33, type: !19)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsmap", scope: !6, file: !1, line: 33, type: !19)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !6, file: !1, line: 33, type: !19)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !6, file: !1, line: 34, type: !19)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !6, file: !1, line: 34, type: !19)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsets", scope: !6, file: !1, line: 34, type: !19)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PhiToPsi", scope: !6, file: !1, line: 34, type: !19)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PhiToV", scope: !6, file: !1, line: 34, type: !19)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PsiToSigma", scope: !6, file: !1, line: 34, type: !19)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !6, file: !1, line: 35, type: !19)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "VtoPhi", scope: !6, file: !1, line: 35, type: !19)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsmapIV", scope: !6, file: !1, line: 36, type: !9)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PhiByPhi", scope: !6, file: !1, line: 37, type: !39)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PhiByPowD", scope: !6, file: !1, line: 37, type: !39)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PsiByPowD", scope: !6, file: !1, line: 37, type: !39)
!191 = !{!192, !203, !209, !210}
!192 = !DIGlobalVariable(name: "TV", scope: !0, file: !193, line: 9, type: !194, isLocal: true, isDefinition: true, variable: %struct.timeval* @TV)
!193 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../timings.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !195, line: 30, size: 128, align: 64, elements: !196)
!195 = !DIFile(filename: "/usr/include/sys/_types/_timeval.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!196 = !{!197, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !194, file: !195, line: 32, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !112, line: 120, baseType: !199)
!199 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !194, file: !195, line: 33, baseType: !201, size: 32, align: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !110, line: 74, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !112, line: 44, baseType: !15)
!203 = !DIGlobalVariable(name: "TZ", scope: !0, file: !193, line: 10, type: !204, isLocal: true, isDefinition: true, variable: %struct.timezone* @TZ)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !205, line: 124, size: 64, align: 32, elements: !206)
!205 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !204, file: !205, line: 125, baseType: !15, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !204, file: !205, line: 126, baseType: !15, size: 32, align: 32, offset: 32)
!209 = !DIGlobalVariable(name: "icputimes", scope: !0, file: !1, line: 6, type: !15, isLocal: true, isDefinition: true, variable: i32* @icputimes)
!210 = !DIGlobalVariable(name: "cputimes", scope: !0, file: !1, line: 7, type: !211, isLocal: true, isDefinition: true, variable: [12 x double]* @cputimes)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 768, align: 64, elements: !213)
!212 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!213 = !{!214}
!214 = !DISubrange(count: 12)
!215 = !{i32 2, !"Dwarf Version", i32 2}
!216 = !{i32 2, !"Debug Info Version", i32 700000003}
!217 = !{i32 1, !"PIC Level", i32 2}
!218 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!219 = !DIExpression()
!220 = !DILocation(line: 24, column: 13, scope: !6)
!221 = !DILocation(line: 25, column: 13, scope: !6)
!222 = !DILocation(line: 26, column: 13, scope: !6)
!223 = !DILocation(line: 43, column: 11, scope: !6)
!224 = !{!225, !225, i64 0}
!225 = !{!"int", !226, i64 0}
!226 = !{!"omnipotent char", !227, i64 0}
!227 = !{!"Simple C/C++ TBAA"}
!228 = !DILocation(line: 44, column: 1, scope: !6)
!229 = !{!230, !231, i64 0}
!230 = !{!"timeval", !231, i64 0, !225, i64 8}
!231 = !{!"long", !226, i64 0}
!232 = !{!230, !225, i64 8}
!233 = !{!234, !234, i64 0}
!234 = !{!"double", !226, i64 0}
!235 = !DILocation(line: 50, column: 13, scope: !236)
!236 = distinct !DILexicalBlock(scope: !6, file: !1, line: 50, column: 7)
!237 = !DILocation(line: 51, column: 4, scope: !236)
!238 = !DILocation(line: 51, column: 19, scope: !236)
!239 = !{!240, !241, i64 8}
!240 = !{!"_GPart", !225, i64 0, !241, i64 8, !225, i64 16, !225, i64 20, !225, i64 24, !242, i64 32, !242, i64 56, !241, i64 80, !241, i64 88, !241, i64 96, !242, i64 104, !225, i64 128, !241, i64 136}
!241 = !{!"any pointer", !226, i64 0}
!242 = !{!"_IV", !225, i64 0, !225, i64 4, !225, i64 8, !241, i64 16}
!243 = !DILocation(line: 29, column: 10, scope: !6)
!244 = !DILocation(line: 51, column: 22, scope: !236)
!245 = !DILocation(line: 52, column: 13, scope: !236)
!246 = !DILocation(line: 52, column: 4, scope: !236)
!247 = !DILocation(line: 53, column: 13, scope: !236)
!248 = !DILocation(line: 54, column: 12, scope: !249)
!249 = distinct !DILexicalBlock(scope: !236, file: !1, line: 53, column: 23)
!250 = !{!241, !241, i64 0}
!251 = !DILocation(line: 54, column: 4, scope: !249)
!252 = !DILocation(line: 56, column: 4, scope: !249)
!253 = !DILocation(line: 58, column: 30, scope: !6)
!254 = !DILocation(line: 58, column: 11, scope: !6)
!255 = !DILocation(line: 33, column: 37, scope: !6)
!256 = !DILocation(line: 59, column: 18, scope: !6)
!257 = !{!240, !225, i64 128}
!258 = !DILocation(line: 31, column: 9, scope: !6)
!259 = !DILocation(line: 60, column: 18, scope: !6)
!260 = !{!240, !241, i64 136}
!261 = !DILocation(line: 28, column: 10, scope: !6)
!262 = !DILocation(line: 66, column: 9, scope: !6)
!263 = !{!264, !225, i64 4}
!264 = !{!"_Graph", !225, i64 0, !225, i64 4, !225, i64 8, !225, i64 12, !225, i64 16, !225, i64 20, !241, i64 24, !241, i64 32, !241, i64 40}
!265 = !DILocation(line: 31, column: 38, scope: !6)
!266 = !DILocation(line: 67, column: 11, scope: !6)
!267 = !DILocation(line: 36, column: 10, scope: !6)
!268 = !DILocation(line: 68, column: 1, scope: !6)
!269 = !DILocation(line: 69, column: 9, scope: !6)
!270 = !DILocation(line: 33, column: 55, scope: !6)
!271 = !DILocation(line: 76, column: 10, scope: !6)
!272 = !DILocation(line: 77, column: 1, scope: !6)
!273 = !DILocation(line: 31, column: 26, scope: !6)
!274 = !DILocation(line: 30, column: 60, scope: !6)
!275 = !DILocation(line: 32, column: 48, scope: !6)
!276 = !DILocation(line: 79, column: 17, scope: !277)
!277 = distinct !DILexicalBlock(scope: !278, file: !1, line: 79, column: 1)
!278 = distinct !DILexicalBlock(scope: !6, file: !1, line: 79, column: 1)
