; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_DDsepInfo.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._DDsepInfo = type { i32, i32, i32, double, double, i32, i32, i32, i32, double, double, double, double, double, double, double, i32, %struct.__sFILE* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str1 = private unnamed_addr constant [94 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_DDsepInfo.c\00", align 1
@.str2 = private unnamed_addr constant [60 x i8] c"\0A fatal error in DDsepInfo_setDefaultFields(%p)\0A bad input\0A\00", align 1
@__stdoutp = external global %struct.__sFILE*
@.str3 = private unnamed_addr constant [53 x i8] c"\0A fatal error in DDsepInfo_clearData(%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [48 x i8] c"\0A fatal error in DDsepInfo_free(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !92, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_DDsepInfo.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !91, !48, !57}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DDsepInfo", file: !6, line: 44, size: 960, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../DDsepInfo.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !11, !12, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !5, file: !6, line: 45, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "minweight", scope: !5, file: !6, line: 46, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "maxweight", scope: !5, file: !6, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "freeze", scope: !5, file: !6, line: 48, baseType: !13, size: 64, align: 64, offset: 128)
!13 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !5, file: !6, line: 49, baseType: !13, size: 64, align: 64, offset: 192)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "maxcompweight", scope: !5, file: !6, line: 50, baseType: !9, size: 32, align: 32, offset: 256)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ntreeobj", scope: !5, file: !6, line: 51, baseType: !9, size: 32, align: 32, offset: 288)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "DDoption", scope: !5, file: !6, line: 52, baseType: !9, size: 32, align: 32, offset: 320)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nlayer", scope: !5, file: !6, line: 53, baseType: !9, size: 32, align: 32, offset: 352)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cpuDD", scope: !5, file: !6, line: 54, baseType: !13, size: 64, align: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cpuMap", scope: !5, file: !6, line: 55, baseType: !13, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cpuBPG", scope: !5, file: !6, line: 56, baseType: !13, size: 64, align: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "cpuBKL", scope: !5, file: !6, line: 57, baseType: !13, size: 64, align: 64, offset: 576)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "cpuSmooth", scope: !5, file: !6, line: 58, baseType: !13, size: 64, align: 64, offset: 640)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cpuSplit", scope: !5, file: !6, line: 59, baseType: !13, size: 64, align: 64, offset: 704)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cpuTotal", scope: !5, file: !6, line: 60, baseType: !13, size: 64, align: 64, offset: 768)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !5, file: !6, line: 61, baseType: !9, size: 32, align: 32, offset: 832)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !5, file: !6, line: 62, baseType: !28, size: 64, align: 64, offset: 896)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !30, line: 153, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !30, line: 122, size: 1216, align: 64, elements: !32)
!32 = !{!33, !36, !37, !38, !40, !41, !46, !47, !49, !53, !59, !69, !75, !76, !79, !80, !84, !88, !89, !90}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !31, file: !30, line: 123, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !31, file: !30, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !31, file: !30, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !31, file: !30, line: 126, baseType: !39, size: 16, align: 16, offset: 128)
!39 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !31, file: !30, line: 127, baseType: !39, size: 16, align: 16, offset: 144)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !31, file: !30, line: 128, baseType: !42, size: 128, align: 64, offset: 192)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !30, line: 88, size: 128, align: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !42, file: !30, line: 89, baseType: !34, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !42, file: !30, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !31, file: !30, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !31, file: !30, line: 132, baseType: !48, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !31, file: !30, line: 133, baseType: !50, size: 64, align: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!9, !48}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !31, file: !30, line: 134, baseType: !54, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!9, !48, !57, !9}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !31, file: !30, line: 135, baseType: !60, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !48, !63, !9}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !30, line: 77, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !65, line: 71, baseType: !66)
!65 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !31, file: !30, line: 136, baseType: !70, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!9, !48, !73, !9}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !31, file: !30, line: 139, baseType: !42, size: 128, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !31, file: !30, line: 140, baseType: !77, size: 64, align: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !30, line: 94, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !31, file: !30, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !31, file: !30, line: 144, baseType: !81, size: 24, align: 8, offset: 928)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 24, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 3)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !31, file: !30, line: 145, baseType: !85, size: 8, align: 8, offset: 952)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !31, file: !30, line: 148, baseType: !42, size: 128, align: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !31, file: !30, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !31, file: !30, line: 152, baseType: !63, size: 64, align: 64, offset: 1152)
!91 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!92 = !{!93, !100, !105, !108, !111}
!93 = !DISubprogram(name: "DDsepInfo_new", scope: !1, file: !1, line: 16, type: !94, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: %struct._DDsepInfo* ()* @DDsepInfo_new, variables: !98)
!94 = !DISubroutineType(types: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "DDsepInfo", file: !6, line: 63, baseType: !5)
!98 = !{!99}
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !93, file: !1, line: 19, type: !96)
!100 = !DISubprogram(name: "DDsepInfo_setDefaultFields", scope: !1, file: !1, line: 36, type: !101, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DDsepInfo*)* @DDsepInfo_setDefaultFields, variables: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !96}
!103 = !{!104}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !100, file: !1, line: 37, type: !96)
!105 = !DISubprogram(name: "DDsepInfo_clearData", scope: !1, file: !1, line: 74, type: !101, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DDsepInfo*)* @DDsepInfo_clearData, variables: !106)
!106 = !{!107}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !105, file: !1, line: 75, type: !96)
!108 = !DISubprogram(name: "DDsepInfo_free", scope: !1, file: !1, line: 95, type: !101, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DDsepInfo*)* @DDsepInfo_free, variables: !109)
!109 = !{!110}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !108, file: !1, line: 96, type: !96)
!111 = !DISubprogram(name: "DDsepInfo_writeCpuTimes", scope: !1, file: !1, line: 121, type: !112, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._DDsepInfo*, %struct.__sFILE*)* @DDsepInfo_writeCpuTimes, variables: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !96, !28}
!114 = !{!115, !116, !117}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !111, file: !1, line: 122, type: !96)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 2, scope: !111, file: !1, line: 123, type: !28)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpuMisc", scope: !111, file: !1, line: 125, type: !13)
!118 = !{i32 2, !"Dwarf Version", i32 2}
!119 = !{i32 2, !"Debug Info Version", i32 700000003}
!120 = !{i32 1, !"PIC Level", i32 2}
!121 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!122 = !DILocation(line: 21, column: 1, scope: !123)
!123 = distinct !DILexicalBlock(scope: !124, file: !1, line: 21, column: 1)
!124 = distinct !DILexicalBlock(scope: !125, file: !1, line: 21, column: 1)
!125 = distinct !DILexicalBlock(scope: !93, file: !1, line: 21, column: 1)
!126 = !DIExpression()
!127 = !DILocation(line: 19, column: 14, scope: !93)
!128 = !DILocation(line: 21, column: 1, scope: !124)
!129 = !DILocation(line: 21, column: 1, scope: !130)
!130 = distinct !DILexicalBlock(scope: !123, file: !1, line: 21, column: 1)
!131 = !{!132, !132, i64 0}
!132 = !{!"any pointer", !133, i64 0}
!133 = !{!"omnipotent char", !134, i64 0}
!134 = !{!"Simple C/C++ TBAA"}
!135 = !DILocation(line: 23, column: 1, scope: !93)
!136 = !DILocation(line: 25, column: 1, scope: !93)
!137 = !DILocation(line: 37, column: 17, scope: !100)
!138 = !DILocation(line: 39, column: 11, scope: !139)
!139 = distinct !DILexicalBlock(scope: !100, file: !1, line: 39, column: 6)
