; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_smoothBisector.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._GPart = type { i32, %struct._Graph*, i32, i32, i32, %struct._IV, %struct._IV, %struct._GPart*, %struct._GPart*, %struct._GPart*, %struct._IV, i32, %struct.__sFILE* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [60 x i8] c"\0A fatal error in GPart_smoothBisector(%p,%d,%f)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [43 x i8] c"\0A smoothBisector : nlevel = %d, alpha = %f\00", align 1
@.str2 = private unnamed_addr constant [49 x i8] c"\0A old partition cost %.3f, weights = %5d %5d %5d\00", align 1
@.str3 = private unnamed_addr constant [10 x i8] c"\0A compids\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_smoothBisector.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!6 = !{!7, !156}
!7 = !DISubprogram(name: "GPart_smoothBisector", scope: !1, file: !1, line: 26, type: !8, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct._GPart*, i32, float)* @GPart_smoothBisector, variables: !137)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !17, !10}
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPart", file: !13, line: 37, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../GPart.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GPart", file: !13, line: 38, size: 1152, align: 64, elements: !15)
!15 = !{!16, !18, !56, !57, !58, !59, !68, !69, !70, !71, !72, !73, !74}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !14, file: !13, line: 39, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !14, file: !13, line: 40, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !21, line: 49, baseType: !22)
!21 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !21, line: 50, size: 384, align: 64, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !54, !55}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, file: !21, line: 51, baseType: !17, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !22, file: !21, line: 52, baseType: !17, size: 32, align: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !22, file: !21, line: 53, baseType: !17, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !22, file: !21, line: 54, baseType: !17, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !22, file: !21, line: 55, baseType: !17, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !22, file: !21, line: 56, baseType: !17, size: 32, align: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !22, file: !21, line: 57, baseType: !31, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !33, line: 55, baseType: !34)
!33 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !33, line: 79, size: 384, align: 64, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !42, !44, !45}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !33, line: 80, baseType: !17, size: 32, align: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !34, file: !33, line: 81, baseType: !17, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !34, file: !33, line: 82, baseType: !17, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !34, file: !33, line: 83, baseType: !17, size: 32, align: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !34, file: !33, line: 84, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !34, file: !33, line: 85, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !34, file: !33, line: 86, baseType: !17, size: 32, align: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !34, file: !33, line: 87, baseType: !46, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !33, line: 56, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !33, line: 102, size: 192, align: 64, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !33, line: 103, baseType: !17, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !48, file: !33, line: 104, baseType: !17, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !48, file: !33, line: 105, baseType: !41, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !33, line: 106, baseType: !46, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !22, file: !21, line: 58, baseType: !41, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !22, file: !21, line: 59, baseType: !31, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !14, file: !13, line: 41, baseType: !17, size: 32, align: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !14, file: !13, line: 42, baseType: !17, size: 32, align: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ncomp", scope: !14, file: !13, line: 43, baseType: !17, size: 32, align: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "compidsIV", scope: !14, file: !13, line: 44, baseType: !60, size: 192, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !61, line: 20, baseType: !62)
!61 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !61, line: 21, size: 192, align: 64, elements: !63)
!63 = !{!64, !65, !66, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !61, line: 22, baseType: !17, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !62, file: !61, line: 23, baseType: !17, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !62, file: !61, line: 24, baseType: !17, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !62, file: !61, line: 25, baseType: !41, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cweightsIV", scope: !14, file: !13, line: 45, baseType: !60, size: 192, align: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !14, file: !13, line: 46, baseType: !11, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !14, file: !13, line: 47, baseType: !11, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !14, file: !13, line: 48, baseType: !11, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "vtxMapIV", scope: !14, file: !13, line: 49, baseType: !60, size: 192, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !14, file: !13, line: 50, baseType: !17, size: 32, align: 32, offset: 1024)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !14, file: !13, line: 51, baseType: !75, size: 64, align: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 153, baseType: !78)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !77, line: 122, size: 1216, align: 64, elements: !79)
!79 = !{!80, !83, !84, !85, !87, !88, !93, !94, !95, !99, !105, !115, !121, !122, !125, !126, !130, !134, !135, !136}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !78, file: !77, line: 123, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !78, file: !77, line: 124, baseType: !17, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !78, file: !77, line: 125, baseType: !17, size: 32, align: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !77, line: 126, baseType: !86, size: 16, align: 16, offset: 128)
!86 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !78, file: !77, line: 127, baseType: !86, size: 16, align: 16, offset: 144)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !78, file: !77, line: 128, baseType: !89, size: 128, align: 64, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !77, line: 88, size: 128, align: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !89, file: !77, line: 89, baseType: !81, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !89, file: !77, line: 90, baseType: !17, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !78, file: !77, line: 129, baseType: !17, size: 32, align: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !78, file: !77, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !78, file: !77, line: 133, baseType: !96, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!17, !4}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !78, file: !77, line: 134, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!17, !4, !103, !17}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !78, file: !77, line: 135, baseType: !106, size: 64, align: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !4, !109, !17}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !77, line: 77, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !111, line: 71, baseType: !112)
!111 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!114 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !78, file: !77, line: 136, baseType: !116, size: 64, align: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!17, !4, !119, !17}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !78, file: !77, line: 139, baseType: !89, size: 128, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !78, file: !77, line: 140, baseType: !123, size: 64, align: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !77, line: 94, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !78, file: !77, line: 141, baseType: !17, size: 32, align: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !78, file: !77, line: 144, baseType: !127, size: 24, align: 8, offset: 928)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 24, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 3)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !78, file: !77, line: 145, baseType: !131, size: 8, align: 8, offset: 952)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !78, file: !77, line: 148, baseType: !89, size: 128, align: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !78, file: !77, line: 151, baseType: !17, size: 32, align: 32, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !77, line: 152, baseType: !109, size: 64, align: 64, offset: 1152)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !155}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gpart", arg: 1, scope: !7, file: !1, line: 27, type: !11)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nlevel", arg: 2, scope: !7, file: !1, line: 28, type: !17)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 3, scope: !7, file: !1, line: 29, type: !10)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msgFile", scope: !7, file: !1, line: 31, type: !75)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "balance", scope: !7, file: !1, line: 32, type: !10)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bestcost", scope: !7, file: !1, line: 32, type: !10)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !7, file: !1, line: 32, type: !10)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newcost", scope: !7, file: !1, line: 32, type: !10)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !7, file: !1, line: 33, type: !19)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !7, file: !1, line: 34, type: !17)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipass", scope: !7, file: !1, line: 34, type: !17)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msglvl", scope: !7, file: !1, line: 34, type: !17)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compids", scope: !7, file: !1, line: 35, type: !41)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cweights", scope: !7, file: !1, line: 35, type: !41)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghts", scope: !7, file: !1, line: 35, type: !41)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "YCmapIV", scope: !7, file: !1, line: 36, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "YVmapIV", scope: !7, file: !1, line: 36, type: !154)
!156 = !DISubprogram(name: "eval", scope: !1, file: !1, line: 155, type: !157, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, variables: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{!10, !10, !10, !10, !10}
!159 = !{!160, !161, !162, !163, !164}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 1, scope: !156, file: !1, line: 156, type: !10)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wS", arg: 2, scope: !156, file: !1, line: 157, type: !10)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wB", arg: 3, scope: !156, file: !1, line: 158, type: !10)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wW", arg: 4, scope: !156, file: !1, line: 159, type: !10)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !156, file: !1, line: 161, type: !10)
!165 = !{i32 2, !"Dwarf Version", i32 2}
!166 = !{i32 2, !"Debug Info Version", i32 700000003}
!167 = !{i32 1, !"PIC Level", i32 2}
!168 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!169 = !DIExpression()
!170 = !DILocation(line: 27, column: 13, scope: !7)
!171 = !DILocation(line: 28, column: 12, scope: !7)
!172 = !DILocation(line: 29, column: 12, scope: !7)
!173 = !DILocation(line: 42, column: 12, scope: !174)
!174 = distinct !DILexicalBlock(scope: !7, file: !1, line: 42, column: 6)
!175 = !DILocation(line: 42, column: 30, scope: !174)
!176 = !DILocation(line: 42, column: 20, scope: !174)
!177 = !DILocation(line: 44, column: 45, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !1, line: 42, column: 51)
!179 = !DILocation(line: 42, column: 43, scope: !174)
!180 = !DILocation(line: 43, column: 12, scope: !178)
!181 = !{!182, !182, i64 0}
!182 = !{!"any pointer", !183, i64 0}
