; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_smoothYSep.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._GPart = type { i32, %struct._Graph*, i32, i32, i32, %struct._IV, %struct._IV, %struct._GPart*, %struct._GPart*, %struct._GPart*, %struct._IV, i32, %struct.__sFILE* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._Network = type { i32, i32, i32, %struct._Arc**, %struct._Arc**, %struct._ArcChunk*, i32, %struct.__sFILE* }
%struct._Arc = type { i32, i32, i32, i32, %struct._Arc*, %struct._Arc* }
%struct._ArcChunk = type { i32, i32, %struct._Arc*, %struct._ArcChunk* }
%struct._Ideq = type { i32, i32, i32, %struct._IV }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [58 x i8] c"\0A fatal error in GPart_smoothSep(%p,%p,%p,%f)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/GPart_smoothYSep.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!6 = !{!7, !229, !273, !282}
!7 = !DISubprogram(name: "GPart_smoothYSep", scope: !1, file: !1, line: 39, type: !8, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct._GPart*, %struct._IV*, %struct._IV*, float)* @GPart_smoothYSep, variables: !138)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !137, !137, !10}
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPart", file: !13, line: 37, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../GPart.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GPart", file: !13, line: 38, size: 1152, align: 64, elements: !15)
!15 = !{!16, !18, !56, !57, !58, !59, !68, !69, !70, !71, !72, !73, !74}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !14, file: !13, line: 39, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !14, file: !13, line: 40, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !21, line: 49, baseType: !22)
!21 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !21, line: 50, size: 384, align: 64, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !54, !55}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, file: !21, line: 51, baseType: !17, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !22, file: !21, line: 52, baseType: !17, size: 32, align: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !22, file: !21, line: 53, baseType: !17, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !22, file: !21, line: 54, baseType: !17, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !22, file: !21, line: 55, baseType: !17, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !22, file: !21, line: 56, baseType: !17, size: 32, align: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !22, file: !21, line: 57, baseType: !31, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !33, line: 55, baseType: !34)
!33 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !33, line: 79, size: 384, align: 64, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !42, !44, !45}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !33, line: 80, baseType: !17, size: 32, align: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !34, file: !33, line: 81, baseType: !17, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !34, file: !33, line: 82, baseType: !17, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !34, file: !33, line: 83, baseType: !17, size: 32, align: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !34, file: !33, line: 84, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !34, file: !33, line: 85, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !34, file: !33, line: 86, baseType: !17, size: 32, align: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !34, file: !33, line: 87, baseType: !46, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !33, line: 56, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !33, line: 102, size: 192, align: 64, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !33, line: 103, baseType: !17, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !48, file: !33, line: 104, baseType: !17, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !48, file: !33, line: 105, baseType: !41, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !33, line: 106, baseType: !46, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !22, file: !21, line: 58, baseType: !41, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !22, file: !21, line: 59, baseType: !31, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !14, file: !13, line: 41, baseType: !17, size: 32, align: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !14, file: !13, line: 42, baseType: !17, size: 32, align: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ncomp", scope: !14, file: !13, line: 43, baseType: !17, size: 32, align: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "compidsIV", scope: !14, file: !13, line: 44, baseType: !60, size: 192, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !61, line: 20, baseType: !62)
!61 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !61, line: 21, size: 192, align: 64, elements: !63)
!63 = !{!64, !65, !66, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !61, line: 22, baseType: !17, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !62, file: !61, line: 23, baseType: !17, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !62, file: !61, line: 24, baseType: !17, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !62, file: !61, line: 25, baseType: !41, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cweightsIV", scope: !14, file: !13, line: 45, baseType: !60, size: 192, align: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !14, file: !13, line: 46, baseType: !11, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !14, file: !13, line: 47, baseType: !11, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !14, file: !13, line: 48, baseType: !11, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "vtxMapIV", scope: !14, file: !13, line: 49, baseType: !60, size: 192, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !14, file: !13, line: 50, baseType: !17, size: 32, align: 32, offset: 1024)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !14, file: !13, line: 51, baseType: !75, size: 64, align: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 153, baseType: !78)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !77, line: 122, size: 1216, align: 64, elements: !79)
!79 = !{!80, !83, !84, !85, !87, !88, !93, !94, !95, !99, !105, !115, !121, !122, !125, !126, !130, !134, !135, !136}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !78, file: !77, line: 123, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !78, file: !77, line: 124, baseType: !17, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !78, file: !77, line: 125, baseType: !17, size: 32, align: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !77, line: 126, baseType: !86, size: 16, align: 16, offset: 128)
!86 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !78, file: !77, line: 127, baseType: !86, size: 16, align: 16, offset: 144)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !78, file: !77, line: 128, baseType: !89, size: 128, align: 64, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !77, line: 88, size: 128, align: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !89, file: !77, line: 89, baseType: !81, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !89, file: !77, line: 90, baseType: !17, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !78, file: !77, line: 129, baseType: !17, size: 32, align: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !78, file: !77, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !78, file: !77, line: 133, baseType: !96, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!17, !4}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !78, file: !77, line: 134, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!17, !4, !103, !17}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !78, file: !77, line: 135, baseType: !106, size: 64, align: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !4, !109, !17}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !77, line: 77, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !111, line: 71, baseType: !112)
!111 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!114 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !78, file: !77, line: 136, baseType: !116, size: 64, align: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!17, !4, !119, !17}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !78, file: !77, line: 139, baseType: !89, size: 128, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !78, file: !77, line: 140, baseType: !123, size: 64, align: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !77, line: 94, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !78, file: !77, line: 141, baseType: !17, size: 32, align: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !78, file: !77, line: 144, baseType: !127, size: 24, align: 8, offset: 928)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 24, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 3)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !78, file: !77, line: 145, baseType: !131, size: 8, align: 8, offset: 952)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !78, file: !77, line: 148, baseType: !89, size: 128, align: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !78, file: !77, line: 151, baseType: !17, size: 32, align: 32, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !77, line: 152, baseType: !109, size: 64, align: 64, offset: 1152)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !178, !211, !214, !215, !216, !217, !220, !221, !222, !223, !226, !227, !228}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gpart", arg: 1, scope: !7, file: !1, line: 40, type: !11)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "YVmapIV", arg: 2, scope: !7, file: !1, line: 41, type: !137)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "YCmapIV", arg: 3, scope: !7, file: !1, line: 42, type: !137)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 4, scope: !7, file: !1, line: 43, type: !10)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msgFile", scope: !7, file: !1, line: 45, type: !75)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bestcost", scope: !7, file: !1, line: 46, type: !10)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newcost1", scope: !7, file: !1, line: 46, type: !10)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newcost2", scope: !7, file: !1, line: 46, type: !10)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !7, file: !1, line: 47, type: !19)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deq", scope: !7, file: !1, line: 48, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ideq", file: !151, line: 19, baseType: !152)
!151 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../Ideq/Ideq.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ideq", file: !151, line: 20, size: 320, align: 64, elements: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !152, file: !151, line: 21, baseType: !17, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !152, file: !151, line: 22, baseType: !17, size: 32, align: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !152, file: !151, line: 23, baseType: !17, size: 32, align: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !152, file: !151, line: 24, baseType: !60, size: 192, align: 64, offset: 128)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !7, file: !1, line: 49, type: !17)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msglvl", scope: !7, file: !1, line: 49, type: !17)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nnode", scope: !7, file: !1, line: 49, type: !17)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newcomp", scope: !7, file: !1, line: 49, type: !17)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nY", scope: !7, file: !1, line: 49, type: !17)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldcomp", scope: !7, file: !1, line: 49, type: !17)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !7, file: !1, line: 49, type: !17)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwght", scope: !7, file: !1, line: 49, type: !17)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !7, file: !1, line: 49, type: !17)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compids", scope: !7, file: !1, line: 50, type: !41)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cweights", scope: !7, file: !1, line: 50, type: !41)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !7, file: !1, line: 50, type: !41)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghts", scope: !7, file: !1, line: 50, type: !41)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Ycompids1", scope: !7, file: !1, line: 51, type: !41)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Ycompids2", scope: !7, file: !1, line: 51, type: !41)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "YCmap", scope: !7, file: !1, line: 51, type: !41)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "YVmap", scope: !7, file: !1, line: 51, type: !41)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deltas", scope: !7, file: !1, line: 52, type: !176)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 96, align: 32, elements: !128)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NYmapIV", scope: !7, file: !1, line: 53, type: !137)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "network", scope: !7, file: !1, line: 54, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "Network", file: !181, line: 12, baseType: !182)
!181 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/GPart/src/../../Network/Network.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Network", file: !181, line: 34, size: 448, align: 64, elements: !183)
!183 = !{!184, !185, !186, !187, !199, !200, !209, !210}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nnode", scope: !182, file: !181, line: 35, baseType: !17, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "narc", scope: !182, file: !181, line: 36, baseType: !17, size: 32, align: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ntrav", scope: !182, file: !181, line: 37, baseType: !17, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "inheads", scope: !182, file: !181, line: 38, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "Arc", file: !181, line: 13, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Arc", file: !181, line: 53, size: 256, align: 64, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !191, file: !181, line: 54, baseType: !17, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !191, file: !181, line: 55, baseType: !17, size: 32, align: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !191, file: !181, line: 56, baseType: !17, size: 32, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !191, file: !181, line: 57, baseType: !17, size: 32, align: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nextOut", scope: !191, file: !181, line: 58, baseType: !189, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nextIn", scope: !191, file: !181, line: 59, baseType: !189, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "outheads", scope: !182, file: !181, line: 39, baseType: !188, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !182, file: !181, line: 40, baseType: !201, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ArcChunk", file: !181, line: 14, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ArcChunk", file: !181, line: 74, size: 192, align: 64, elements: !204)
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !181, line: 75, baseType: !17, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !203, file: !181, line: 76, baseType: !17, size: 32, align: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !203, file: !181, line: 77, baseType: !189, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !181, line: 78, baseType: !201, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !182, file: !181, line: 41, baseType: !17, size: 32, align: 32, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !182, file: !181, line: 42, baseType: !75, size: 64, align: 64, offset: 384)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !212, file: !1, line: 122, type: !17)
!212 = distinct !DILexicalBlock(scope: !213, file: !1, line: 121, column: 19)
!213 = distinct !DILexicalBlock(scope: !7, file: !1, line: 121, column: 6)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !212, file: !1, line: 122, type: !17)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val1", scope: !212, file: !1, line: 122, type: !17)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val2", scope: !212, file: !1, line: 122, type: !17)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !218, file: !1, line: 186, type: !17)
!218 = distinct !DILexicalBlock(scope: !219, file: !1, line: 185, column: 19)
!219 = distinct !DILexicalBlock(scope: !7, file: !1, line: 185, column: 6)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !218, file: !1, line: 186, type: !17)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val1", scope: !218, file: !1, line: 186, type: !17)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val2", scope: !218, file: !1, line: 186, type: !17)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !224, file: !1, line: 237, type: !17)
!224 = distinct !DILexicalBlock(scope: !225, file: !1, line: 236, column: 19)
!225 = distinct !DILexicalBlock(scope: !7, file: !1, line: 236, column: 6)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !224, file: !1, line: 237, type: !17)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val1", scope: !224, file: !1, line: 237, type: !17)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val2", scope: !224, file: !1, line: 237, type: !17)
!229 = !DISubprogram(name: "createNetwork", scope: !1, file: !1, line: 325, type: !230, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, variables: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{!179, !19, !41, !137, !137, !137, !17, !75}
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !229, file: !1, line: 326, type: !19)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "compids", arg: 2, scope: !229, file: !1, line: 327, type: !41)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "YVmapIV", arg: 3, scope: !229, file: !1, line: 328, type: !137)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "YCmapIV", arg: 4, scope: !229, file: !1, line: 329, type: !137)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "NYmapIV", arg: 5, scope: !229, file: !1, line: 330, type: !137)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 6, scope: !229, file: !1, line: 331, type: !17)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 7, scope: !229, file: !1, line: 332, type: !75)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !229, file: !1, line: 334, type: !17)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !229, file: !1, line: 334, type: !17)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !229, file: !1, line: 334, type: !17)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !229, file: !1, line: 334, type: !17)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !229, file: !1, line: 334, type: !17)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i12", scope: !229, file: !1, line: 334, type: !17)
