; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [57 x i8] c"\0A fatal error in Graph_externalDegree(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [59 x i8] c"\0A fatal error in Graph_adjAndSize(%p,%d,%p,%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [67 x i8] c"\0A fatal error in Graph_adjAndSize(%p,%d,%p,%p)\0A g->adjIVL == NULL\0A\00", align 1
@.str3 = private unnamed_addr constant [64 x i8] c"\0A fatal error in Graph_adjAndEwghts(%p,%d,%p,%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !56, !64, !73, !79, !106, !119, !148}
!6 = !DISubprogram(name: "Graph_externalDegree", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Graph*, i32)* @Graph_externalDegree, variables: !47)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !12, line: 49, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !12, line: 50, size: 384, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !45, !46}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 51, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !13, file: !12, line: 52, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !13, file: !12, line: 53, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !13, file: !12, line: 54, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !13, file: !12, line: 55, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !13, file: !12, line: 56, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !13, file: !12, line: 57, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !24, line: 79, size: 384, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !33, !35, !36}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !24, line: 80, baseType: !9, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !25, file: !24, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !25, file: !24, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !25, file: !24, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !25, file: !24, line: 84, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !25, file: !24, line: 85, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !25, file: !24, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !25, file: !24, line: 87, baseType: !37, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !24, line: 56, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !24, line: 102, size: 192, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !24, line: 103, baseType: !9, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !39, file: !24, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !39, file: !24, line: 105, baseType: !32, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !24, line: 106, baseType: !37, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !13, file: !12, line: 58, baseType: !32, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !13, file: !12, line: 59, baseType: !22, size: 64, align: 64, offset: 320)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !6, file: !1, line: 17, type: !10)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !6, file: !1, line: 18, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 20, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !6, file: !1, line: 20, type: !9)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !6, file: !1, line: 20, type: !9)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !6, file: !1, line: 20, type: !9)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !6, file: !1, line: 21, type: !32)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghts", scope: !6, file: !1, line: 21, type: !32)
!56 = !DISubprogram(name: "Graph_adjAndSize", scope: !1, file: !1, line: 50, type: !57, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Graph*, i32, i32*, i32**)* @Graph_adjAndSize, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !10, !9, !32, !34}
!59 = !{!60, !61, !62, !63}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !56, file: !1, line: 51, type: !10)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jvtx", arg: 2, scope: !56, file: !1, line: 52, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "psize", arg: 3, scope: !56, file: !1, line: 53, type: !32)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "padj", arg: 4, scope: !56, file: !1, line: 54, type: !34)
!64 = !DISubprogram(name: "Graph_adjAndEweights", scope: !1, file: !1, line: 94, type: !65, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Graph*, i32, i32*, i32**, i32**)* @Graph_adjAndEweights, variables: !67)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !10, !9, !32, !34, !34}
!67 = !{!68, !69, !70, !71, !72}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !64, file: !1, line: 95, type: !10)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jvtx", arg: 2, scope: !64, file: !1, line: 96, type: !9)
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "psize", arg: 3, scope: !64, file: !1, line: 97, type: !32)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "padj", arg: 4, scope: !64, file: !1, line: 98, type: !34)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pewghts", arg: 5, scope: !64, file: !1, line: 99, type: !34)
!73 = !DISubprogram(name: "Graph_sizeOf", scope: !1, file: !1, line: 145, type: !74, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Graph*)* @Graph_sizeOf, variables: !76)
!74 = !DISubroutineType(types: !75)
!75 = !{!9, !10}
!76 = !{!77, !78}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !73, file: !1, line: 146, type: !10)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !73, file: !1, line: 148, type: !9)
!79 = !DISubprogram(name: "Graph_componentMap", scope: !1, file: !1, line: 181, type: !80, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._Graph*)* @Graph_componentMap, variables: !91)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !10}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !84, line: 20, baseType: !85)
!84 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !84, line: 21, size: 192, align: 64, elements: !86)
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !84, line: 22, baseType: !9, size: 32, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !85, file: !84, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !85, file: !84, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !85, file: !84, line: 25, baseType: !32, size: 64, align: 64, offset: 128)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !79, file: !1, line: 182, type: !10)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !79, file: !1, line: 184, type: !9)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !79, file: !1, line: 184, type: !9)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncomp", scope: !79, file: !1, line: 184, type: !9)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !79, file: !1, line: 184, type: !9)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !79, file: !1, line: 184, type: !9)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !79, file: !1, line: 184, type: !9)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "usize", scope: !79, file: !1, line: 184, type: !9)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !79, file: !1, line: 184, type: !9)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !79, file: !1, line: 184, type: !9)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !79, file: !1, line: 185, type: !32)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !79, file: !1, line: 185, type: !32)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uadj", scope: !79, file: !1, line: 185, type: !32)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !79, file: !1, line: 186, type: !82)
!106 = !DISubprogram(name: "Graph_componentStats", scope: !1, file: !1, line: 249, type: !107, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Graph*, i32*, i32*, i32*)* @Graph_componentStats, variables: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !10, !32, !32, !32}
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !106, file: !1, line: 250, type: !10)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 2, scope: !106, file: !1, line: 251, type: !32)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "counts", arg: 3, scope: !106, file: !1, line: 252, type: !32)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "weights", arg: 4, scope: !106, file: !1, line: 253, type: !32)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncomp", scope: !106, file: !1, line: 255, type: !9)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !106, file: !1, line: 255, type: !9)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !106, file: !1, line: 255, type: !9)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vcomp", scope: !106, file: !1, line: 255, type: !9)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghts", scope: !106, file: !1, line: 256, type: !32)
!119 = !DISubprogram(name: "Graph_subGraph", scope: !1, file: !1, line: 308, type: !120, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Graph* (%struct._Graph*, i32, i32*, i32**)* @Graph_subGraph, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{!10, !10, !9, !32, !34}
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !119, file: !1, line: 309, type: !10)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "icomp", arg: 2, scope: !119, file: !1, line: 310, type: !9)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "compids", arg: 3, scope: !119, file: !1, line: 311, type: !32)
