; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [67 x i8] c"\0A fatal error in Graph_init1(%p,%d,%d,%d,%d,%d,%d)\0A graph is NULL\0A\00", align 1
@.str1 = private unnamed_addr constant [89 x i8] c"\0A fatal error in Graph_init1(%p,%d,%d,%d,%d,%d,%d)\0A invalid type = %d, must be in [0,3]\0A\00", align 1
@.str2 = private unnamed_addr constant [81 x i8] c"\0A fatal error in Graph_init1(%p,%d,%d,%d,%d,%d,%d)\0A nvtx = %d, must be positive\0A\00", align 1
@.str3 = private unnamed_addr constant [85 x i8] c"\0A fatal error in Graph_init1(%p,%d,%d,%d,%d,%d,%d)\0A nvbnd = %d, must be nonnegative\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !56}
!6 = !DISubprogram(name: "Graph_init1", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Graph*, i32, i32, i32, i32, i32, i32)* @Graph_init1, variables: !47)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15, !15, !15, !15, !15, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !11, line: 49, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !11, line: 50, size: 384, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !45, !46}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !12, file: !11, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !12, file: !11, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !12, file: !11, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !12, file: !11, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !12, file: !11, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !12, file: !11, line: 57, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !24, line: 79, size: 384, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !33, !35, !36}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !24, line: 80, baseType: !15, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !25, file: !24, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !25, file: !24, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !25, file: !24, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !25, file: !24, line: 84, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !25, file: !24, line: 85, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !25, file: !24, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !25, file: !24, line: 87, baseType: !37, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !24, line: 56, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !24, line: 102, size: 192, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !24, line: 103, baseType: !15, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !39, file: !24, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !39, file: !24, line: 105, baseType: !32, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !24, line: 106, baseType: !37, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !12, file: !11, line: 58, baseType: !32, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !12, file: !11, line: 59, baseType: !22, size: 64, align: 64, offset: 320)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !6, file: !1, line: 24, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !6, file: !1, line: 25, type: !15)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nvtx", arg: 3, scope: !6, file: !1, line: 26, type: !15)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nvbnd", arg: 4, scope: !6, file: !1, line: 27, type: !15)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nedges", arg: 5, scope: !6, file: !1, line: 28, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "adjType", arg: 6, scope: !6, file: !1, line: 29, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ewghtType", arg: 7, scope: !6, file: !1, line: 30, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtot", scope: !6, file: !1, line: 32, type: !15)
!56 = !DISubprogram(name: "Graph_init2", scope: !1, file: !1, line: 180, type: !57, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Graph*, i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL*)* @Graph_init2, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !9, !15, !15, !15, !15, !15, !15, !22, !32, !22}
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !56, file: !1, line: 181, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !56, file: !1, line: 182, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nvtx", arg: 3, scope: !56, file: !1, line: 183, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nvbnd", arg: 4, scope: !56, file: !1, line: 184, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nedges", arg: 5, scope: !56, file: !1, line: 185, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "totvwght", arg: 6, scope: !56, file: !1, line: 186, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "totewght", arg: 7, scope: !56, file: !1, line: 187, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "adjIVL", arg: 8, scope: !56, file: !1, line: 188, type: !22)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vwghts", arg: 9, scope: !56, file: !1, line: 189, type: !32)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ewghtIVL", arg: 10, scope: !56, file: !1, line: 190, type: !22)
!70 = !{i32 2, !"Dwarf Version", i32 2}
!71 = !{i32 2, !"Debug Info Version", i32 700000003}
!72 = !{i32 1, !"PIC Level", i32 2}
!73 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!74 = !DIExpression()
!75 = !DILocation(line: 24, column: 13, scope: !6)
!76 = !DILocation(line: 25, column: 12, scope: !6)
!77 = !DILocation(line: 26, column: 12, scope: !6)
!78 = !DILocation(line: 27, column: 12, scope: !6)
!79 = !DILocation(line: 28, column: 12, scope: !6)
!80 = !DILocation(line: 29, column: 12, scope: !6)
!81 = !DILocation(line: 30, column: 12, scope: !6)
!82 = !DILocation(line: 43, column: 8, scope: !83)
!83 = distinct !DILexicalBlock(scope: !6, file: !1, line: 43, column: 6)
!84 = !DILocation(line: 43, column: 6, scope: !6)
!85 = !DILocation(line: 44, column: 12, scope: !86)
!86 = distinct !DILexicalBlock(scope: !83, file: !1, line: 43, column: 18)
!87 = !{!88, !88, i64 0}
!88 = !{!"any pointer", !89, i64 0}
!89 = !{!"omnipotent char", !90, i64 0}
!90 = !{!"Simple C/C++ TBAA"}
!91 = !DILocation(line: 44, column: 4, scope: !86)
!92 = !DILocation(line: 47, column: 4, scope: !86)
!93 = !DILocation(line: 49, column: 15, scope: !94)
!94 = distinct !DILexicalBlock(scope: !6, file: !1, line: 49, column: 6)
!95 = !DILocation(line: 50, column: 12, scope: !96)
