; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A error in Graph_readFromFile(%p,%s)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [61 x i8] c"\0A error in Graph_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [106 x i8] c"\0A error in Graph_readFromFile(%p,%s)\0A bad Graph file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str5 = private unnamed_addr constant [66 x i8] c"\0A error in Graph_readFromChacoFile(%p,%s)\0A unable to open file %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !68, globals: !234, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !7, line: 153, baseType: !8)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !7, line: 122, size: 1216, align: 64, elements: !9)
!9 = !{!10, !13, !15, !16, !18, !19, !24, !25, !26, !30, !36, !46, !52, !53, !56, !57, !61, !65, !66, !67}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !8, file: !7, line: 123, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !8, file: !7, line: 124, baseType: !14, size: 32, align: 32, offset: 64)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !8, file: !7, line: 125, baseType: !14, size: 32, align: 32, offset: 96)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !8, file: !7, line: 126, baseType: !17, size: 16, align: 16, offset: 128)
!17 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !8, file: !7, line: 127, baseType: !17, size: 16, align: 16, offset: 144)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !8, file: !7, line: 128, baseType: !20, size: 128, align: 64, offset: 192)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !7, line: 88, size: 128, align: 64, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !20, file: !7, line: 89, baseType: !11, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !20, file: !7, line: 90, baseType: !14, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !8, file: !7, line: 129, baseType: !14, size: 32, align: 32, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !8, file: !7, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !8, file: !7, line: 133, baseType: !27, size: 64, align: 64, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!14, !4}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !8, file: !7, line: 134, baseType: !31, size: 64, align: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!14, !4, !34, !14}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !8, file: !7, line: 135, baseType: !37, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !4, !40, !14}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !7, line: 77, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !42, line: 71, baseType: !43)
!42 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !44, line: 46, baseType: !45)
!44 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!45 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !8, file: !7, line: 136, baseType: !47, size: 64, align: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!14, !4, !50, !14}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !8, file: !7, line: 139, baseType: !20, size: 128, align: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !8, file: !7, line: 140, baseType: !54, size: 64, align: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !7, line: 94, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !8, file: !7, line: 141, baseType: !14, size: 32, align: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !8, file: !7, line: 144, baseType: !58, size: 24, align: 8, offset: 928)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 24, align: 8, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 3)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !8, file: !7, line: 145, baseType: !62, size: 8, align: 8, offset: 952)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !8, file: !7, line: 148, baseType: !20, size: 128, align: 64, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !8, file: !7, line: 151, baseType: !14, size: 32, align: 32, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !8, file: !7, line: 152, baseType: !40, size: 64, align: 64, offset: 1152)
!68 = !{!69, !116, !142, !169, !191, !199, !205, !211, !217, !222}
!69 = !DISubprogram(name: "Graph_readFromFile", scope: !1, file: !1, line: 25, type: !70, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Graph*, i8*)* @Graph_readFromFile, variables: !109)
!70 = !DISubroutineType(types: !71)
!71 = !{!14, !72, !34}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !74, line: 49, baseType: !75)
!74 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !74, line: 50, size: 384, align: 64, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !107, !108}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !74, line: 51, baseType: !14, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !75, file: !74, line: 52, baseType: !14, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !75, file: !74, line: 53, baseType: !14, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !75, file: !74, line: 54, baseType: !14, size: 32, align: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !75, file: !74, line: 55, baseType: !14, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !75, file: !74, line: 56, baseType: !14, size: 32, align: 32, offset: 160)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !75, file: !74, line: 57, baseType: !84, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !86, line: 55, baseType: !87)
!86 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !86, line: 79, size: 384, align: 64, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !95, !97, !98}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !86, line: 80, baseType: !14, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !87, file: !86, line: 81, baseType: !14, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !87, file: !86, line: 82, baseType: !14, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !87, file: !86, line: 83, baseType: !14, size: 32, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !87, file: !86, line: 84, baseType: !94, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !87, file: !86, line: 85, baseType: !96, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !87, file: !86, line: 86, baseType: !14, size: 32, align: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !87, file: !86, line: 87, baseType: !99, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !86, line: 56, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !86, line: 102, size: 192, align: 64, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !101, file: !86, line: 103, baseType: !14, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !101, file: !86, line: 104, baseType: !14, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !101, file: !86, line: 105, baseType: !94, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !86, line: 106, baseType: !99, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !75, file: !74, line: 58, baseType: !94, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !75, file: !74, line: 59, baseType: !84, size: 64, align: 64, offset: 320)
!109 = !{!110, !111, !112, !113, !114, !115}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "graph", arg: 1, scope: !69, file: !1, line: 26, type: !72)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !69, file: !1, line: 27, type: !34)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !69, file: !1, line: 29, type: !5)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !69, file: !1, line: 30, type: !14)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !69, file: !1, line: 30, type: !14)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !69, file: !1, line: 30, type: !14)
!116 = !DISubprogram(name: "Graph_readFromChacoFile", scope: !1, file: !1, line: 98, type: !70, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Graph*, i8*)* @Graph_readFromChacoFile, variables: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "graph", arg: 1, scope: !116, file: !1, line: 99, type: !72)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !116, file: !1, line: 100, type: !34)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !116, file: !1, line: 102, type: !34)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !116, file: !1, line: 103, type: !5)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !116, file: !1, line: 104, type: !14)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nedges", scope: !116, file: !1, line: 104, type: !14)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !116, file: !1, line: 104, type: !14)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !116, file: !1, line: 105, type: !126)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 800000, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 100000)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !116, file: !1, line: 105, type: !34)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !116, file: !1, line: 105, type: !34)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !116, file: !1, line: 106, type: !14)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !116, file: !1, line: 106, type: !14)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !116, file: !1, line: 106, type: !14)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !116, file: !1, line: 106, type: !14)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghts", scope: !116, file: !1, line: 106, type: !14)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ewghts", scope: !116, file: !1, line: 106, type: !14)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adjncy", scope: !116, file: !1, line: 107, type: !94)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weights", scope: !116, file: !1, line: 107, type: !94)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghtsINT", scope: !116, file: !1, line: 107, type: !94)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adjIVL", scope: !116, file: !1, line: 108, type: !84)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ewghtIVL", scope: !116, file: !1, line: 108, type: !84)
