; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_compress.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [55 x i8] c"\0A fatal error in Graph_compress2(%p,%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [54 x i8] c"\0A fatal error in Graph_compress(%p,%p,%d)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [54 x i8] c"\0A fatal error in Graph_compress(%p,%p,%d)\0A nvtx = %d\0A\00", align 1
@.str3 = private unnamed_addr constant [59 x i8] c"\0A fatal error in Graph_compress(%p,%p,%d)\0A adjIVL is NULL\0A\00", align 1
@.str4 = private unnamed_addr constant [79 x i8] c"\0A fatal error in Graph_compress(%p,%p,%d)\0A g->type = %d and g->vwghts is NULL\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_compress.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !60}
!6 = !DISubprogram(name: "Graph_compress2", scope: !1, file: !1, line: 20, type: !7, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Graph* (%struct._Graph*, %struct._IV*, i32)* @Graph_compress2, variables: !56)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !47, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !11, line: 49, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !11, line: 50, size: 384, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !45, !46}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !12, file: !11, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !12, file: !11, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !12, file: !11, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !12, file: !11, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !12, file: !11, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !12, file: !11, line: 57, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !24, line: 79, size: 384, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !33, !35, !36}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !24, line: 80, baseType: !15, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !25, file: !24, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !25, file: !24, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !25, file: !24, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !25, file: !24, line: 84, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !25, file: !24, line: 85, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !25, file: !24, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !25, file: !24, line: 87, baseType: !37, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !24, line: 56, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !24, line: 102, size: 192, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !24, line: 103, baseType: !15, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !39, file: !24, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !39, file: !24, line: 105, baseType: !32, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !24, line: 106, baseType: !37, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !12, file: !11, line: 58, baseType: !32, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !12, file: !11, line: 59, baseType: !22, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !49, line: 20, baseType: !50)
!49 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !49, line: 21, size: 192, align: 64, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !49, line: 22, baseType: !15, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !50, file: !49, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !50, file: !49, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !50, file: !49, line: 25, baseType: !32, size: 64, align: 64, offset: 128)
!56 = !{!57, !58, !59}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !6, file: !1, line: 21, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapIV", arg: 2, scope: !6, file: !1, line: 22, type: !47)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coarseType", arg: 3, scope: !6, file: !1, line: 23, type: !15)
!60 = !DISubprogram(name: "Graph_compress", scope: !1, file: !1, line: 57, type: !61, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Graph* (%struct._Graph*, i32*, i32)* @Graph_compress, variables: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{!9, !9, !32, !15}
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !60, file: !1, line: 58, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cmap", arg: 2, scope: !60, file: !1, line: 59, type: !32)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coarseType", arg: 3, scope: !60, file: !1, line: 60, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g2", scope: !60, file: !1, line: 62, type: !9)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !60, file: !1, line: 63, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !60, file: !1, line: 63, type: !15)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !60, file: !1, line: 63, type: !15)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !60, file: !1, line: 63, type: !15)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jsize", scope: !60, file: !1, line: 63, type: !15)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !60, file: !1, line: 63, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Jsize", scope: !60, file: !1, line: 63, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !60, file: !1, line: 63, type: !15)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !60, file: !1, line: 63, type: !15)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncvtx", scope: !60, file: !1, line: 63, type: !15)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !60, file: !1, line: 63, type: !15)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wght", scope: !60, file: !1, line: 63, type: !15)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !60, file: !1, line: 64, type: !32)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !60, file: !1, line: 64, type: !32)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jind", scope: !60, file: !1, line: 64, type: !32)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Jind", scope: !60, file: !1, line: 64, type: !32)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jwghts", scope: !60, file: !1, line: 64, type: !32)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Jwghts", scope: !60, file: !1, line: 64, type: !32)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !60, file: !1, line: 65, type: !32)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !60, file: !1, line: 65, type: !32)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghts", scope: !60, file: !1, line: 65, type: !32)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Vwghts", scope: !60, file: !1, line: 65, type: !32)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adjIVL", scope: !60, file: !1, line: 66, type: !22)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "AdjIVL", scope: !60, file: !1, line: 66, type: !22)
