; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_equivMap.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IV = type { i32, i32, i32, i32* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [48 x i8] c"\0A fatal error in Graph_equivMap(%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define %struct._IV* @Graph_equivMap(%struct._Graph* %g) #0 {
  %usize = alloca i32, align 4
  %vsize = alloca i32, align 4
  %uadj = alloca i32*, align 8
  %vadj = alloca i32*, align 8
  tail call void @llvm.dbg.value(metadata %struct._Graph* %g, i64 0, metadata !57, metadata !79), !dbg !80
  %1 = icmp eq %struct._Graph* %g, null, !dbg !81
  br i1 %1, label %6, label %2, !dbg !83

; <label>:2                                       ; preds = %0

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/Graph_equivMap.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6}
!6 = !DISubprogram(name: "Graph_equivMap", scope: !1, file: !1, line: 22, type: !7, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._Graph*)* @Graph_equivMap, variables: !56)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !20}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !11, line: 20, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !11, line: 21, size: 192, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !11, line: 22, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !12, file: !11, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !12, file: !11, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !12, file: !11, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !22, line: 49, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !22, line: 50, size: 384, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !54, !55}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, file: !22, line: 51, baseType: !15, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !23, file: !22, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !23, file: !22, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !23, file: !22, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !23, file: !22, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !23, file: !22, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !23, file: !22, line: 57, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !34, line: 55, baseType: !35)
!34 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Graph/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !34, line: 79, size: 384, align: 64, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42, !44, !45}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, file: !34, line: 80, baseType: !15, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !35, file: !34, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !35, file: !34, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !35, file: !34, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !35, file: !34, line: 84, baseType: !19, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !35, file: !34, line: 85, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !35, file: !34, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !35, file: !34, line: 87, baseType: !46, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !34, line: 56, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !34, line: 102, size: 192, align: 64, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !34, line: 103, baseType: !15, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !48, file: !34, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !48, file: !34, line: 105, baseType: !19, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !34, line: 106, baseType: !46, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !23, file: !22, line: 58, baseType: !19, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !23, file: !22, line: 59, baseType: !32, size: 64, align: 64, offset: 320)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !6, file: !1, line: 23, type: !20)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !6, file: !1, line: 25, type: !15)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 25, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ismapped", scope: !6, file: !1, line: 25, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !6, file: !1, line: 25, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !6, file: !1, line: 25, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx2", scope: !6, file: !1, line: 25, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !6, file: !1, line: 25, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "usize", scope: !6, file: !1, line: 25, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !6, file: !1, line: 25, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !6, file: !1, line: 25, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsum", scope: !6, file: !1, line: 25, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chksum", scope: !6, file: !1, line: 26, type: !19)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eqmap", scope: !6, file: !1, line: 26, type: !19)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !6, file: !1, line: 26, type: !19)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uadj", scope: !6, file: !1, line: 26, type: !19)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !6, file: !1, line: 26, type: !19)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eqmapIV", scope: !6, file: !1, line: 27, type: !9)
!75 = !{i32 2, !"Dwarf Version", i32 2}
!76 = !{i32 2, !"Debug Info Version", i32 700000003}
!77 = !{i32 1, !"PIC Level", i32 2}
!78 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!79 = !DIExpression()
!80 = !DILocation(line: 23, column: 13, scope: !6)
!81 = !DILocation(line: 33, column: 8, scope: !82)
!82 = distinct !DILexicalBlock(scope: !6, file: !1, line: 33, column: 6)
!83 = !DILocation(line: 33, column: 16, scope: !82)
!84 = !DILocation(line: 33, column: 30, scope: !82)
!85 = !{!86, !87, i64 4}
!86 = !{!"_Graph", !87, i64 0, !87, i64 4, !87, i64 8, !87, i64 12, !87, i64 16, !87, i64 20, !90, i64 24, !90, i64 32, !90, i64 40}
!87 = !{!"int", !88, i64 0}
!88 = !{!"omnipotent char", !89, i64 0}
!89 = !{!"Simple C/C++ TBAA"}
!90 = !{!"any pointer", !88, i64 0}
!91 = !DILocation(line: 25, column: 31, scope: !6)
!92 = !DILocation(line: 33, column: 36, scope: !82)
!93 = !DILocation(line: 33, column: 6, scope: !6)
!94 = !DILocation(line: 34, column: 12, scope: !95)
!95 = distinct !DILexicalBlock(scope: !82, file: !1, line: 33, column: 43)
!96 = !{!90, !90, i64 0}
!97 = !DILocation(line: 34, column: 4, scope: !95)
!98 = !DILocation(line: 36, column: 4, scope: !95)
!99 = !DILocation(line: 43, column: 11, scope: !6)
!100 = !DILocation(line: 27, column: 8, scope: !6)
!101 = !DILocation(line: 44, column: 1, scope: !6)
!102 = !DILocation(line: 45, column: 9, scope: !6)
!103 = !DILocation(line: 26, column: 17, scope: !6)
!104 = !DILocation(line: 46, column: 1, scope: !6)
!105 = !DILocation(line: 47, column: 10, scope: !6)
!106 = !DILocation(line: 26, column: 25, scope: !6)
!107 = !DILocation(line: 48, column: 10, scope: !6)
!108 = !DILocation(line: 26, column: 8, scope: !6)
!109 = !DILocation(line: 25, column: 37, scope: !6)
!110 = !DILocation(line: 25, column: 54, scope: !6)
!111 = !DILocation(line: 55, column: 1, scope: !112)
