; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/I2Ohash/src/I2Ohash_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._I2Ohash = type { i32, i32, i32, %struct._I2OP*, %struct._I2OP*, %struct._I2OP** }
%struct._I2OP = type { i32, i32, i8*, %struct._I2OP* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [60 x i8] c"\0A error in I2Ohash_insert(%p,%d,%d,%p)\0A hashtable is NULL \0A\00", align 1
@.str1 = private unnamed_addr constant [76 x i8] c"\0A fatal error in I2Ohash_insert(%p,%d,%d,%p)\0A no free list items, grow = %d\00", align 1
@.str2 = private unnamed_addr constant [69 x i8] c"\0A error in I2Ohash_locate(%p,%d,%d,%p)\0A hashtable or pvalue is NULL\0A\00", align 1
@.str3 = private unnamed_addr constant [69 x i8] c"\0A error in I2Ohash_remove(%p,%d,%d,%p)\0A hashtable or pvalue is NULL\0A\00", align 1
@.str4 = private unnamed_addr constant [57 x i8] c"\0A fatal error in I2Ohash_measure(%p)\0A hashtable is NULL\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/I2Ohash/src/I2Ohash_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!6 = !{!7, !43, !57, !69}
!7 = !DISubprogram(name: "I2Ohash_insert", scope: !1, file: !1, line: 16, type: !8, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._I2Ohash*, i32, i32, i8*)* @I2Ohash_insert, variables: !32)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !16, !16, !4}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2Ohash", file: !12, line: 6, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/I2Ohash/src/../I2Ohash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2Ohash", file: !12, line: 7, size: 320, align: 64, elements: !14)
!14 = !{!15, !17, !18, !19, !29, !30}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !13, file: !12, line: 8, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "grow", scope: !13, file: !12, line: 9, baseType: !16, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nitem", scope: !13, file: !12, line: 10, baseType: !16, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "baseI2OP", scope: !13, file: !12, line: 11, baseType: !20, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !22, line: 5, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/I2Ohash/src/../../Utilities/I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !22, line: 6, size: 192, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !23, file: !22, line: 7, baseType: !16, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !23, file: !22, line: 8, baseType: !16, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !23, file: !22, line: 9, baseType: !4, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !22, line: 10, baseType: !20, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "freeI2OP", scope: !13, file: !12, line: 12, baseType: !20, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !13, file: !12, line: 13, baseType: !31, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!33 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hashtable", arg: 1, scope: !7, file: !1, line: 17, type: !10)
!34 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key1", arg: 2, scope: !7, file: !1, line: 18, type: !16)
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key2", arg: 3, scope: !7, file: !1, line: 19, type: !16)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 4, scope: !7, file: !1, line: 20, type: !4)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !7, file: !1, line: 22, type: !16)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc1", scope: !7, file: !1, line: 22, type: !16)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc2", scope: !7, file: !1, line: 22, type: !16)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2op", scope: !7, file: !1, line: 23, type: !20)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j2op", scope: !7, file: !1, line: 23, type: !20)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !7, file: !1, line: 23, type: !20)
!43 = !DISubprogram(name: "I2Ohash_locate", scope: !1, file: !1, line: 135, type: !44, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._I2Ohash*, i32, i32, i8**)* @I2Ohash_locate, variables: !47)
!44 = !DISubroutineType(types: !45)
!45 = !{!16, !10, !16, !16, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hashtable", arg: 1, scope: !43, file: !1, line: 136, type: !10)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key1", arg: 2, scope: !43, file: !1, line: 137, type: !16)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key2", arg: 3, scope: !43, file: !1, line: 138, type: !16)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pvalue", arg: 4, scope: !43, file: !1, line: 139, type: !46)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !43, file: !1, line: 141, type: !16)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc1", scope: !43, file: !1, line: 141, type: !16)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc2", scope: !43, file: !1, line: 141, type: !16)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !43, file: !1, line: 141, type: !16)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2op", scope: !43, file: !1, line: 142, type: !20)
!57 = !DISubprogram(name: "I2Ohash_remove", scope: !1, file: !1, line: 211, type: !44, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._I2Ohash*, i32, i32, i8**)* @I2Ohash_remove, variables: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hashtable", arg: 1, scope: !57, file: !1, line: 212, type: !10)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key1", arg: 2, scope: !57, file: !1, line: 213, type: !16)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key2", arg: 3, scope: !57, file: !1, line: 214, type: !16)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pvalue", arg: 4, scope: !57, file: !1, line: 215, type: !46)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !57, file: !1, line: 217, type: !16)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc1", scope: !57, file: !1, line: 217, type: !16)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc2", scope: !57, file: !1, line: 217, type: !16)
