; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IIheap/src/IIheap_basics.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IIheap = type { i32, i32, i32*, i32*, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str1 = private unnamed_addr constant [93 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IIheap/src/IIheap_basics.c\00", align 1
@.str2 = private unnamed_addr constant [60 x i8] c"\0A fatal error in IIheap_setDefaultFields(%p)\0A heap is NULL\0A\00", align 1
@.str3 = private unnamed_addr constant [53 x i8] c"\0A fatal error in IIheap_clearData(%p)\0A heap is NULL\0A\00", align 1
@.str4 = private unnamed_addr constant [48 x i8] c"\0A fatal error in IIheap_free(%p)\0A heap is NULL\0A\00", align 1
@.str5 = private unnamed_addr constant [74 x i8] c"\0A\0A error in IIheap_init(%p,%d)\0A heap is NULL or size = %d is nonpositive\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !19, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IIheap/src/IIheap_basics.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !15, !16, !17}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IIheap", file: !6, line: 21, size: 256, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IIheap/src/../IIheap.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !11, !13, !14}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !5, file: !6, line: 22, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !5, file: !6, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "heapLoc", scope: !5, file: !6, line: 24, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !5, file: !6, line: 25, baseType: !12, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !5, file: !6, line: 26, baseType: !12, size: 64, align: 64, offset: 192)
!15 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !{!20, !27, !32, !35, !38, !44, !51, !59, !68, !136, !141, !153}
!20 = !DISubprogram(name: "IIheap_new", scope: !1, file: !1, line: 17, type: !21, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IIheap* ()* @IIheap_new, variables: !25)
!21 = !DISubroutineType(types: !22)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "IIheap", file: !6, line: 20, baseType: !5)
!25 = !{!26}
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heap", scope: !20, file: !1, line: 20, type: !23)
!27 = !DISubprogram(name: "IIheap_setDefaultFields", scope: !1, file: !1, line: 37, type: !28, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*)* @IIheap_setDefaultFields, variables: !30)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !23}
!30 = !{!31}
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !27, file: !1, line: 38, type: !23)
!32 = !DISubprogram(name: "IIheap_clearData", scope: !1, file: !1, line: 62, type: !28, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*)* @IIheap_clearData, variables: !33)
!33 = !{!34}
!34 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !32, file: !1, line: 63, type: !23)
!35 = !DISubprogram(name: "IIheap_free", scope: !1, file: !1, line: 92, type: !28, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*)* @IIheap_free, variables: !36)
!36 = !{!37}
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !35, file: !1, line: 93, type: !23)
!38 = !DISubprogram(name: "IIheap_init", scope: !1, file: !1, line: 116, type: !39, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*, i32)* @IIheap_init, variables: !41)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !23, !9}
!41 = !{!42, !43}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !38, file: !1, line: 117, type: !23)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxsize", arg: 2, scope: !38, file: !1, line: 118, type: !9)
!44 = !DISubprogram(name: "IIheap_root", scope: !1, file: !1, line: 144, type: !45, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*, i32*, i32*)* @IIheap_root, variables: !47)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !23, !12, !12}
!47 = !{!48, !49, !50}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !44, file: !1, line: 145, type: !23)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pkey", arg: 2, scope: !44, file: !1, line: 146, type: !12)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pvalue", arg: 3, scope: !44, file: !1, line: 147, type: !12)
!51 = !DISubprogram(name: "IIheap_insert", scope: !1, file: !1, line: 174, type: !52, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*, i32, i32)* @IIheap_insert, variables: !54)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !23, !9, !9}
!54 = !{!55, !56, !57, !58}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !51, file: !1, line: 175, type: !23)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !51, file: !1, line: 176, type: !9)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !51, file: !1, line: 177, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !51, file: !1, line: 179, type: !9)
!59 = !DISubprogram(name: "IIheap_remove", scope: !1, file: !1, line: 219, type: !39, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*, i32)* @IIheap_remove, variables: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67}
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !59, file: !1, line: 220, type: !23)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !59, file: !1, line: 221, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !59, file: !1, line: 223, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !59, file: !1, line: 223, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newkey", scope: !59, file: !1, line: 223, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newVal", scope: !59, file: !1, line: 223, type: !9)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldVal", scope: !59, file: !1, line: 223, type: !9)
!68 = !DISubprogram(name: "IIheap_print", scope: !1, file: !1, line: 286, type: !69, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*, %struct.__sFILE*)* @IIheap_print, variables: !131)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !23, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 153, baseType: !74)
!73 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !73, line: 122, size: 1216, align: 64, elements: !75)
!75 = !{!76, !79, !80, !81, !83, !84, !89, !90, !91, !95, !99, !109, !115, !116, !119, !120, !124, !128, !129, !130}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !74, file: !73, line: 123, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !74, file: !73, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !74, file: !73, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !73, line: 126, baseType: !82, size: 16, align: 16, offset: 128)
!82 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !74, file: !73, line: 127, baseType: !82, size: 16, align: 16, offset: 144)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !74, file: !73, line: 128, baseType: !85, size: 128, align: 64, offset: 192)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !73, line: 88, size: 128, align: 64, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !85, file: !73, line: 89, baseType: !77, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !85, file: !73, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !74, file: !73, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !74, file: !73, line: 132, baseType: !16, size: 64, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !74, file: !73, line: 133, baseType: !92, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!9, !16}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !74, file: !73, line: 134, baseType: !96, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!9, !16, !17, !9}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !74, file: !73, line: 135, baseType: !100, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !16, !103, !9}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !73, line: 77, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !105, line: 71, baseType: !106)
!105 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 46, baseType: !108)
!107 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !74, file: !73, line: 136, baseType: !110, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!9, !16, !113, !9}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !74, file: !73, line: 139, baseType: !85, size: 128, align: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !74, file: !73, line: 140, baseType: !117, size: 64, align: 64, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !73, line: 94, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !74, file: !73, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !74, file: !73, line: 144, baseType: !121, size: 24, align: 8, offset: 928)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 24, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 3)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !74, file: !73, line: 145, baseType: !125, size: 8, align: 8, offset: 952)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 8, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !74, file: !73, line: 148, baseType: !85, size: 128, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !74, file: !73, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !73, line: 152, baseType: !103, size: 64, align: 64, offset: 1152)
!131 = !{!132, !133, !134, !135}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !68, file: !1, line: 287, type: !23)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !68, file: !1, line: 288, type: !71)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !68, file: !1, line: 290, type: !9)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !68, file: !1, line: 290, type: !9)
!136 = !DISubprogram(name: "IIheap_sizeOf", scope: !1, file: !1, line: 320, type: !137, isLocal: false, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IIheap*)* @IIheap_sizeOf, variables: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{!9, !23}
!139 = !{!140}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !136, file: !1, line: 321, type: !23)
!141 = !DISubprogram(name: "IIheap_siftDown", scope: !1, file: !1, line: 334, type: !39, isLocal: true, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, variables: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !141, file: !1, line: 335, type: !23)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "loc", arg: 2, scope: !141, file: !1, line: 336, type: !9)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "desc", scope: !141, file: !1, line: 338, type: !9)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !141, file: !1, line: 338, type: !9)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !141, file: !1, line: 338, type: !9)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !141, file: !1, line: 338, type: !9)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !141, file: !1, line: 338, type: !9)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heapLoc", scope: !141, file: !1, line: 339, type: !12)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !141, file: !1, line: 339, type: !12)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "values", scope: !141, file: !1, line: 339, type: !12)
!153 = !DISubprogram(name: "IIheap_siftUp", scope: !1, file: !1, line: 399, type: !39, isLocal: true, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IIheap*, i32)* @IIheap_siftUp, variables: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !153, file: !1, line: 400, type: !23)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "loc", arg: 2, scope: !153, file: !1, line: 401, type: !9)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !153, file: !1, line: 403, type: !9)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !153, file: !1, line: 403, type: !9)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heapLoc", scope: !153, file: !1, line: 404, type: !12)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !153, file: !1, line: 404, type: !12)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "values", scope: !153, file: !1, line: 404, type: !12)
!162 = !{i32 2, !"Dwarf Version", i32 2}
!163 = !{i32 2, !"Debug Info Version", i32 700000003}
!164 = !{i32 1, !"PIC Level", i32 2}
!165 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!166 = !DILocation(line: 22, column: 1, scope: !167)
!167 = distinct !DILexicalBlock(scope: !168, file: !1, line: 22, column: 1)
!168 = distinct !DILexicalBlock(scope: !169, file: !1, line: 22, column: 1)
!169 = distinct !DILexicalBlock(scope: !20, file: !1, line: 22, column: 1)
!170 = !DIExpression()
