; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [50 x i8] c"\0A error in InpMtx_readFromFile(%p,%s)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [62 x i8] c"\0A error in InpMtx_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [108 x i8] c"\0A error in InpMtx_readFromFile(%p,%s)\0A bad InpMtx file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str5 = private unnamed_addr constant [59 x i8] c"\0A error in InpMtx_readFromFormattedFile(%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !227, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !117, !128, !134, !142, !147, !156, !184, !188, !208}
!6 = !DISubprogram(name: "InpMtx_readFromFile", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*, i8*)* @InpMtx_readFromFile, variables: !50)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !48}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !12, line: 51, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../InpMtx/InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !12, line: 52, size: 1472, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !22, !32, !33, !43, !44, !45, !46, !47}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !13, file: !12, line: 53, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !13, file: !12, line: 54, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !13, file: !12, line: 55, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !13, file: !12, line: 56, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !13, file: !12, line: 57, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !13, file: !12, line: 58, baseType: !21, size: 64, align: 64, offset: 192)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !13, file: !12, line: 59, baseType: !23, size: 192, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !24, line: 20, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !24, line: 21, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 22, baseType: !9, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !25, file: !24, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !25, file: !24, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !25, file: !24, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !13, file: !12, line: 60, baseType: !23, size: 192, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !13, file: !12, line: 61, baseType: !34, size: 192, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !35, line: 20, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !35, line: 21, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 22, baseType: !9, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !36, file: !35, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !36, file: !35, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !36, file: !35, line: 25, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !13, file: !12, line: 62, baseType: !9, size: 32, align: 32, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !13, file: !12, line: 63, baseType: !9, size: 32, align: 32, offset: 864)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !13, file: !12, line: 64, baseType: !23, size: 192, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !13, file: !12, line: 65, baseType: !23, size: 192, align: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !13, file: !12, line: 66, baseType: !23, size: 192, align: 64, offset: 1280)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !{!51, !52, !53, !114, !115, !116}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !6, file: !1, line: 24, type: !10)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !6, file: !1, line: 25, type: !48)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !6, file: !1, line: 27, type: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !56, line: 153, baseType: !57)
!56 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !56, line: 122, size: 1216, align: 64, elements: !58)
!58 = !{!59, !62, !63, !64, !66, !67, !72, !73, !74, !78, !82, !92, !98, !99, !102, !103, !107, !111, !112, !113}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !57, file: !56, line: 123, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !57, file: !56, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !57, file: !56, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !57, file: !56, line: 126, baseType: !65, size: 16, align: 16, offset: 128)
!65 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !57, file: !56, line: 127, baseType: !65, size: 16, align: 16, offset: 144)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !57, file: !56, line: 128, baseType: !68, size: 128, align: 64, offset: 192)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !56, line: 88, size: 128, align: 64, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !68, file: !56, line: 89, baseType: !60, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !68, file: !56, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !57, file: !56, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !57, file: !56, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !57, file: !56, line: 133, baseType: !75, size: 64, align: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!9, !4}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !57, file: !56, line: 134, baseType: !79, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!9, !4, !48, !9}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !57, file: !56, line: 135, baseType: !83, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !4, !86, !9}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !56, line: 77, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !88, line: 71, baseType: !89)
!88 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !90, line: 46, baseType: !91)
!90 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!91 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !57, file: !56, line: 136, baseType: !93, size: 64, align: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!9, !4, !96, !9}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !57, file: !56, line: 139, baseType: !68, size: 128, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !57, file: !56, line: 140, baseType: !100, size: 64, align: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !56, line: 94, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !57, file: !56, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !57, file: !56, line: 144, baseType: !104, size: 24, align: 8, offset: 928)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 24, align: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 3)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !57, file: !56, line: 145, baseType: !108, size: 8, align: 8, offset: 952)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !57, file: !56, line: 148, baseType: !68, size: 128, align: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !57, file: !56, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !57, file: !56, line: 152, baseType: !86, size: 64, align: 64, offset: 1152)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !6, file: !1, line: 28, type: !9)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !6, file: !1, line: 28, type: !9)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !6, file: !1, line: 28, type: !9)
!117 = !DISubprogram(name: "InpMtx_readFromFormattedFile", scope: !1, file: !1, line: 92, type: !118, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*, %struct.__sFILE*)* @InpMtx_readFromFormattedFile, variables: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{!9, !10, !54}
!120 = !{!121, !122, !123, !124}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !117, file: !1, line: 93, type: !10)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !117, file: !1, line: 94, type: !54)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !117, file: !1, line: 96, type: !9)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !117, file: !1, line: 97, type: !125)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, align: 32, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 5)
!128 = !DISubprogram(name: "InpMtx_readFromBinaryFile", scope: !1, file: !1, line: 158, type: !118, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*, %struct.__sFILE*)* @InpMtx_readFromBinaryFile, variables: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !128, file: !1, line: 159, type: !10)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !128, file: !1, line: 160, type: !54)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !128, file: !1, line: 162, type: !9)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !128, file: !1, line: 163, type: !125)
!134 = !DISubprogram(name: "InpMtx_writeToFile", scope: !1, file: !1, line: 231, type: !7, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*, i8*)* @InpMtx_writeToFile, variables: !135)
!135 = !{!136, !137, !138, !139, !140, !141}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !134, file: !1, line: 232, type: !10)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !134, file: !1, line: 233, type: !48)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !134, file: !1, line: 235, type: !54)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !134, file: !1, line: 236, type: !9)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !134, file: !1, line: 236, type: !9)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !134, file: !1, line: 236, type: !9)
!142 = !DISubprogram(name: "InpMtx_writeToFormattedFile", scope: !1, file: !1, line: 306, type: !118, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*, %struct.__sFILE*)* @InpMtx_writeToFormattedFile, variables: !143)
!143 = !{!144, !145, !146}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !142, file: !1, line: 307, type: !10)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !142, file: !1, line: 308, type: !54)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !142, file: !1, line: 310, type: !9)
