; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_instance.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [50 x i8] c"\0A fatal error in InpMtx_coordType(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [52 x i8] c"\0A fatal error in InpMtx_storageMode(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [50 x i8] c"\0A fatal error in InpMtx_inputMode(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [48 x i8] c"\0A fatal error in InpMtx_maxnent(%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [45 x i8] c"\0A fatal error in InpMtx_nent(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_instance.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !50, !53, !56, !59, !62, !65, !68, !73, !78, !81, !86, !89, !92, !95, !106, !118, !127, !133, !137, !141, !145, !151}
!6 = !DISubprogram(name: "InpMtx_coordType", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*)* @InpMtx_coordType, variables: !48)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !12, line: 51, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !12, line: 52, size: 1472, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !22, !32, !33, !43, !44, !45, !46, !47}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !13, file: !12, line: 53, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !13, file: !12, line: 54, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !13, file: !12, line: 55, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !13, file: !12, line: 56, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !13, file: !12, line: 57, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !13, file: !12, line: 58, baseType: !21, size: 64, align: 64, offset: 192)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !13, file: !12, line: 59, baseType: !23, size: 192, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !24, line: 20, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !24, line: 21, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 22, baseType: !9, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !25, file: !24, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !25, file: !24, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !25, file: !24, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !13, file: !12, line: 60, baseType: !23, size: 192, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !13, file: !12, line: 61, baseType: !34, size: 192, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !35, line: 20, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !35, line: 21, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 22, baseType: !9, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !36, file: !35, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !36, file: !35, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !36, file: !35, line: 25, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !13, file: !12, line: 62, baseType: !9, size: 32, align: 32, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !13, file: !12, line: 63, baseType: !9, size: 32, align: 32, offset: 864)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !13, file: !12, line: 64, baseType: !23, size: 192, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !13, file: !12, line: 65, baseType: !23, size: 192, align: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !13, file: !12, line: 66, baseType: !23, size: 192, align: 64, offset: 1280)
!48 = !{!49}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !6, file: !1, line: 15, type: !10)
!50 = !DISubprogram(name: "InpMtx_storageMode", scope: !1, file: !1, line: 38, type: !7, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*)* @InpMtx_storageMode, variables: !51)
!51 = !{!52}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !50, file: !1, line: 39, type: !10)
!53 = !DISubprogram(name: "InpMtx_inputMode", scope: !1, file: !1, line: 62, type: !7, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*)* @InpMtx_inputMode, variables: !54)
!54 = !{!55}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !53, file: !1, line: 63, type: !10)
!56 = !DISubprogram(name: "InpMtx_maxnent", scope: !1, file: !1, line: 86, type: !7, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*)* @InpMtx_maxnent, variables: !57)
!57 = !{!58}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !56, file: !1, line: 87, type: !10)
!59 = !DISubprogram(name: "InpMtx_nent", scope: !1, file: !1, line: 110, type: !7, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*)* @InpMtx_nent, variables: !60)
!60 = !{!61}
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !59, file: !1, line: 111, type: !10)
!62 = !DISubprogram(name: "InpMtx_maxnvector", scope: !1, file: !1, line: 134, type: !7, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*)* @InpMtx_maxnvector, variables: !63)
!63 = !{!64}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !62, file: !1, line: 135, type: !10)
!65 = !DISubprogram(name: "InpMtx_nvector", scope: !1, file: !1, line: 158, type: !7, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*)* @InpMtx_nvector, variables: !66)
!66 = !{!67}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !65, file: !1, line: 159, type: !10)
!68 = !DISubprogram(name: "InpMtx_resizeMultiple", scope: !1, file: !1, line: 182, type: !69, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._InpMtx*)* @InpMtx_resizeMultiple, variables: !71)
!69 = !DISubroutineType(types: !70)
!70 = !{!21, !10}
!71 = !{!72}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !68, file: !1, line: 183, type: !10)
!73 = !DISubprogram(name: "InpMtx_ivec1", scope: !1, file: !1, line: 201, type: !74, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct._InpMtx*)* @InpMtx_ivec1, variables: !76)
!74 = !DISubroutineType(types: !75)
!75 = !{!31, !10}
!76 = !{!77}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !73, file: !1, line: 202, type: !10)
!78 = !DISubprogram(name: "InpMtx_ivec2", scope: !1, file: !1, line: 225, type: !74, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct._InpMtx*)* @InpMtx_ivec2, variables: !79)
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !78, file: !1, line: 226, type: !10)
