; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [63 x i8] c"\0A fatal error in InpMtx_init(%p,%d,%d,%d,%d)\0A inpmtx is NULL \0A\00", align 1
@.str1 = private unnamed_addr constant [62 x i8] c"\0A fatal error in InpMtx_init(%p,%d,%d,%d,%d)\0A bad coordType \0A\00", align 1
@.str2 = private unnamed_addr constant [62 x i8] c"\0A fatal error in InpMtx_init(%p,%d,%d,%d,%d)\0A bad inputMode \0A\00", align 1
@.str3 = private unnamed_addr constant [78 x i8] c"\0A fatal error in InpMtx_init(%p,%d,%d,%d,%d)\0A maxnent = %d, maxnvector = %d \0A\00", align 1
@.str4 = private unnamed_addr constant [59 x i8] c"\0A fatal error in InpMtx_changeCoordType(%p,%d)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !54, !70}
!6 = !DISubprogram(name: "InpMtx_init", scope: !1, file: !1, line: 37, type: !7, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32, i32, i32, i32)* @InpMtx_init, variables: !48)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15, !15, !15, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !11, line: 51, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !11, line: 52, size: 1472, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !22, !32, !33, !43, !44, !45, !46, !47}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !12, file: !11, line: 53, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !12, file: !11, line: 54, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !12, file: !11, line: 55, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !12, file: !11, line: 56, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 57, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !12, file: !11, line: 58, baseType: !21, size: 64, align: 64, offset: 192)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !12, file: !11, line: 59, baseType: !23, size: 192, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !24, line: 20, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !24, line: 21, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 22, baseType: !15, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !25, file: !24, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !25, file: !24, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !25, file: !24, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !12, file: !11, line: 60, baseType: !23, size: 192, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !12, file: !11, line: 61, baseType: !34, size: 192, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !35, line: 20, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !35, line: 21, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 22, baseType: !15, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !36, file: !35, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !36, file: !35, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !36, file: !35, line: 25, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !12, file: !11, line: 62, baseType: !15, size: 32, align: 32, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !12, file: !11, line: 63, baseType: !15, size: 32, align: 32, offset: 864)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !12, file: !11, line: 64, baseType: !23, size: 192, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !12, file: !11, line: 65, baseType: !23, size: 192, align: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !12, file: !11, line: 66, baseType: !23, size: 192, align: 64, offset: 1280)
!48 = !{!49, !50, !51, !52, !53}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !6, file: !1, line: 38, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coordType", arg: 2, scope: !6, file: !1, line: 39, type: !15)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inputMode", arg: 3, scope: !6, file: !1, line: 40, type: !15)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxnent", arg: 4, scope: !6, file: !1, line: 41, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxnvector", arg: 5, scope: !6, file: !1, line: 42, type: !15)
!54 = !DISubprogram(name: "InpMtx_changeCoordType", scope: !1, file: !1, line: 114, type: !55, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32)* @InpMtx_changeCoordType, variables: !57)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !9, !15}
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !54, file: !1, line: 115, type: !9)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newType", arg: 2, scope: !54, file: !1, line: 116, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chev", scope: !54, file: !1, line: 118, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !54, file: !1, line: 118, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !54, file: !1, line: 118, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !54, file: !1, line: 118, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "off", scope: !54, file: !1, line: 118, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldType", scope: !54, file: !1, line: 118, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !54, file: !1, line: 118, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !54, file: !1, line: 118, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !54, file: !1, line: 119, type: !31)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !54, file: !1, line: 119, type: !31)
!70 = !DISubprogram(name: "InpMtx_changeStorageMode", scope: !1, file: !1, line: 286, type: !55, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32)* @InpMtx_changeStorageMode, variables: !71)
!71 = !{!72, !73, !74}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !70, file: !1, line: 287, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newMode", arg: 2, scope: !70, file: !1, line: 288, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldMode", scope: !70, file: !1, line: 290, type: !15)
!75 = !{i32 2, !"Dwarf Version", i32 2}
!76 = !{i32 2, !"Debug Info Version", i32 700000003}
!77 = !{i32 1, !"PIC Level", i32 2}
!78 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!79 = !DIExpression()
!80 = !DILocation(line: 38, column: 13, scope: !6)
!81 = !DILocation(line: 39, column: 12, scope: !6)
!82 = !DILocation(line: 40, column: 12, scope: !6)
!83 = !DILocation(line: 41, column: 12, scope: !6)
!84 = !DILocation(line: 42, column: 12, scope: !6)
!85 = !DILocation(line: 49, column: 14, scope: !86)
!86 = distinct !DILexicalBlock(scope: !6, file: !1, line: 49, column: 7)
!87 = !DILocation(line: 49, column: 7, scope: !6)
!88 = !DILocation(line: 50, column: 12, scope: !89)
!89 = distinct !DILexicalBlock(scope: !86, file: !1, line: 49, column: 24)
!90 = !{!91, !91, i64 0}
!91 = !{!"any pointer", !92, i64 0}
!92 = !{!"omnipotent char", !93, i64 0}
!93 = !{!"Simple C/C++ TBAA"}
