; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_fullAdj.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._IP = type { i32, %struct._IP* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [55 x i8] c"\0A fatal error in InpMtx_fullAdjacency(%p)\0A NULL input\0A\00", align 1
@.str1 = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str2 = private unnamed_addr constant [94 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_fullAdj.c\00", align 1
@.str3 = private unnamed_addr constant [47 x i8] c"\0A ALLOCATE error : bytes %zd, line %d, file %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !18, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_fullAdj.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !15, !16}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IP", file: !8, line: 11, size: 128, align: 64, elements: !9)
!8 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../Utilities/IP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !7, file: !8, line: 12, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 13, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP", file: !8, line: 10, baseType: !7)
!15 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !{!19, !99}
!19 = !DISubprogram(name: "InpMtx_fullAdjacency", scope: !1, file: !1, line: 17, type: !20, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IVL* (%struct._InpMtx*)* @InpMtx_fullAdjacency, variables: !82)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !45}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !24, line: 79, size: 384, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !33, !35, !36}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !24, line: 80, baseType: !11, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !25, file: !24, line: 81, baseType: !11, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !25, file: !24, line: 82, baseType: !11, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !25, file: !24, line: 83, baseType: !11, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !25, file: !24, line: 84, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !25, file: !24, line: 85, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !25, file: !24, line: 86, baseType: !11, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !25, file: !24, line: 87, baseType: !37, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !24, line: 56, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !24, line: 102, size: 192, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !24, line: 103, baseType: !11, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !39, file: !24, line: 104, baseType: !11, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !39, file: !24, line: 105, baseType: !32, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !24, line: 106, baseType: !37, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !47, line: 51, baseType: !48)
!47 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !47, line: 52, size: 1472, align: 64, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !57, !66, !67, !77, !78, !79, !80, !81}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !48, file: !47, line: 53, baseType: !11, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !48, file: !47, line: 54, baseType: !11, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !48, file: !47, line: 55, baseType: !11, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !48, file: !47, line: 56, baseType: !11, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !48, file: !47, line: 57, baseType: !11, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !48, file: !47, line: 58, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !48, file: !47, line: 59, baseType: !58, size: 192, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !59, line: 20, baseType: !60)
!59 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !59, line: 21, size: 192, align: 64, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !59, line: 22, baseType: !11, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !60, file: !59, line: 23, baseType: !11, size: 32, align: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !60, file: !59, line: 24, baseType: !11, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !60, file: !59, line: 25, baseType: !32, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !48, file: !47, line: 60, baseType: !58, size: 192, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !48, file: !47, line: 61, baseType: !68, size: 192, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !69, line: 20, baseType: !70)
!69 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !69, line: 21, size: 192, align: 64, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !69, line: 22, baseType: !11, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !70, file: !69, line: 23, baseType: !11, size: 32, align: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !70, file: !69, line: 24, baseType: !11, size: 32, align: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !70, file: !69, line: 25, baseType: !76, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !48, file: !47, line: 62, baseType: !11, size: 32, align: 32, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !48, file: !47, line: 63, baseType: !11, size: 32, align: 32, offset: 864)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !48, file: !47, line: 64, baseType: !58, size: 192, align: 64, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !48, file: !47, line: 65, baseType: !58, size: 192, align: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !48, file: !47, line: 66, baseType: !58, size: 192, align: 64, offset: 1280)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !98}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !19, file: !1, line: 18, type: !45)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !19, file: !1, line: 20, type: !11)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !19, file: !1, line: 20, type: !11)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jvtx", scope: !19, file: !1, line: 20, type: !11)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jsize", scope: !19, file: !1, line: 20, type: !11)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kvtx", scope: !19, file: !1, line: 20, type: !11)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !19, file: !1, line: 20, type: !11)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jind", scope: !19, file: !1, line: 21, type: !32)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !19, file: !1, line: 21, type: !32)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !19, file: !1, line: 21, type: !32)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseIP", scope: !19, file: !1, line: 22, type: !13)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freeIP", scope: !19, file: !1, line: 22, type: !13)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !19, file: !1, line: 22, type: !13)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !19, file: !1, line: 23, type: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adjIVL", scope: !19, file: !1, line: 24, type: !22)
!99 = !DISubprogram(name: "InpMtx_fullAdjacency2", scope: !1, file: !1, line: 224, type: !100, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IVL* (%struct._InpMtx*, %struct._InpMtx*)* @InpMtx_fullAdjacency2, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!22, !45, !45}
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtxA", arg: 1, scope: !99, file: !1, line: 225, type: !45)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtxB", arg: 2, scope: !99, file: !1, line: 226, type: !45)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !99, file: !1, line: 228, type: !11)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !99, file: !1, line: 228, type: !11)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !99, file: !1, line: 228, type: !11)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jvtx", scope: !99, file: !1, line: 228, type: !11)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jsize", scope: !99, file: !1, line: 228, type: !11)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kvtx", scope: !99, file: !1, line: 228, type: !11)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !99, file: !1, line: 228, type: !11)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jind", scope: !99, file: !1, line: 229, type: !32)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !99, file: !1, line: 229, type: !32)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !99, file: !1, line: 229, type: !32)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseIP", scope: !99, file: !1, line: 230, type: !13)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freeIP", scope: !99, file: !1, line: 230, type: !13)
