; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_input.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [57 x i8] c"\0A fatal error in InpMtx_inputEntry(%p,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [66 x i8] c"\0A fatal error in InpMtx_inputEntry(%p,%d,%d)\0A bad coordType = %d\0A\00", align 1
@.str2 = private unnamed_addr constant [84 x i8] c"\0A fatal error in InpMtx_inputEntry(%p,%d,%d)\0A inputMode is not INPMTX_INDICES_ONLY\0A\00", align 1
@.str3 = private unnamed_addr constant [68 x i8] c"\0A fatal error in InpMtx_inputRealEntry(%p,%d,%d,%e)\0A bad inputReal\0A\00", align 1
@.str4 = private unnamed_addr constant [73 x i8] c"\0A fatal error in InpMtx_inputRealEntry(%p,%d,%d,%e)\0A bad coordType = %d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_input.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !52, !60, !69, !77, !86, !93, !99, !106, !113, !119, !126, !133, !144, !156, !166, !174, !183, !190, !206, !215, !234, !253, !274, !300}
!6 = !DISubprogram(name: "InpMtx_inputEntry", scope: !1, file: !1, line: 106, type: !7, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32, i32)* @InpMtx_inputEntry, variables: !48)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !11, line: 51, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !11, line: 52, size: 1472, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !22, !32, !33, !43, !44, !45, !46, !47}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !12, file: !11, line: 53, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !12, file: !11, line: 54, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !12, file: !11, line: 55, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !12, file: !11, line: 56, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 57, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !12, file: !11, line: 58, baseType: !21, size: 64, align: 64, offset: 192)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !12, file: !11, line: 59, baseType: !23, size: 192, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !24, line: 20, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !24, line: 21, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 22, baseType: !15, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !25, file: !24, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !25, file: !24, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !25, file: !24, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !12, file: !11, line: 60, baseType: !23, size: 192, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !12, file: !11, line: 61, baseType: !34, size: 192, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !35, line: 20, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !35, line: 21, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 22, baseType: !15, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !36, file: !35, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !36, file: !35, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !36, file: !35, line: 25, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !12, file: !11, line: 62, baseType: !15, size: 32, align: 32, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !12, file: !11, line: 63, baseType: !15, size: 32, align: 32, offset: 864)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !12, file: !11, line: 64, baseType: !23, size: 192, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !12, file: !11, line: 65, baseType: !23, size: 192, align: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !12, file: !11, line: 66, baseType: !23, size: 192, align: 64, offset: 1280)
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !6, file: !1, line: 107, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "row", arg: 2, scope: !6, file: !1, line: 108, type: !15)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col", arg: 3, scope: !6, file: !1, line: 109, type: !15)
!52 = !DISubprogram(name: "InpMtx_inputRealEntry", scope: !1, file: !1, line: 151, type: !53, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32, i32, double)* @InpMtx_inputRealEntry, variables: !55)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !9, !15, !15, !21}
!55 = !{!56, !57, !58, !59}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !52, file: !1, line: 152, type: !9)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "row", arg: 2, scope: !52, file: !1, line: 153, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col", arg: 3, scope: !52, file: !1, line: 154, type: !15)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 4, scope: !52, file: !1, line: 155, type: !21)
!60 = !DISubprogram(name: "InpMtx_inputComplexEntry", scope: !1, file: !1, line: 197, type: !61, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32, i32, double, double)* @InpMtx_inputComplexEntry, variables: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !9, !15, !15, !21, !21}
!63 = !{!64, !65, !66, !67, !68}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !60, file: !1, line: 198, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "row", arg: 2, scope: !60, file: !1, line: 199, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col", arg: 3, scope: !60, file: !1, line: 200, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "real", arg: 4, scope: !60, file: !1, line: 201, type: !21)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imag", arg: 5, scope: !60, file: !1, line: 202, type: !21)
!69 = !DISubprogram(name: "InpMtx_inputRow", scope: !1, file: !1, line: 301, type: !70, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32, i32, i32*)* @InpMtx_inputRow, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !9, !15, !15, !31}
!72 = !{!73, !74, !75, !76}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !69, file: !1, line: 302, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "row", arg: 2, scope: !69, file: !1, line: 303, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowsize", arg: 3, scope: !69, file: !1, line: 304, type: !15)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowind", arg: 4, scope: !69, file: !1, line: 305, type: !31)
!77 = !DISubprogram(name: "InpMtx_inputRealRow", scope: !1, file: !1, line: 338, type: !78, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32, i32, i32*, double*)* @InpMtx_inputRealRow, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !9, !15, !15, !31, !42}
!80 = !{!81, !82, !83, !84, !85}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !77, file: !1, line: 339, type: !9)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "row", arg: 2, scope: !77, file: !1, line: 340, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowsize", arg: 3, scope: !77, file: !1, line: 341, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowind", arg: 4, scope: !77, file: !1, line: 342, type: !31)
