; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_permute.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [54 x i8] c"\0A fatal error in InpMtx_permute(%p,%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [78 x i8] c"\0A fatal error in InpMtx_permute(%p,%p,%p)\0A coordType = %d, must be 1, 2 or 3\0A\00", align 1
@.str2 = private unnamed_addr constant [77 x i8] c"\0A fatal error in InpMtx_permute(%p,%p,%p)\0A nent = %d, ivec1 = %p, ivec2 = %p\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define void @InpMtx_permute(%struct._InpMtx* %inpmtx, i32* %rowOldToNew, i32* %colOldToNew) #0 {
  tail call void @llvm.dbg.value(metadata %struct._InpMtx* %inpmtx, i64 0, metadata !49, metadata !68), !dbg !69

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_permute.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6}
!6 = !DISubprogram(name: "InpMtx_permute", scope: !1, file: !1, line: 14, type: !7, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, i32*, i32*)* @InpMtx_permute, variables: !48)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !31, !31}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !11, line: 51, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !11, line: 52, size: 1472, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !22, !32, !33, !43, !44, !45, !46, !47}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !12, file: !11, line: 53, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !12, file: !11, line: 54, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !12, file: !11, line: 55, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !12, file: !11, line: 56, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 57, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !12, file: !11, line: 58, baseType: !21, size: 64, align: 64, offset: 192)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !12, file: !11, line: 59, baseType: !23, size: 192, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !24, line: 20, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !24, line: 21, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 22, baseType: !15, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !25, file: !24, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !25, file: !24, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !25, file: !24, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !12, file: !11, line: 60, baseType: !23, size: 192, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !12, file: !11, line: 61, baseType: !34, size: 192, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !35, line: 20, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !35, line: 21, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 22, baseType: !15, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !36, file: !35, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !36, file: !35, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !36, file: !35, line: 25, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !12, file: !11, line: 62, baseType: !15, size: 32, align: 32, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !12, file: !11, line: 63, baseType: !15, size: 32, align: 32, offset: 864)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !12, file: !11, line: 64, baseType: !23, size: 192, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !12, file: !11, line: 65, baseType: !23, size: 192, align: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !12, file: !11, line: 66, baseType: !23, size: 192, align: 64, offset: 1280)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !63}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !6, file: !1, line: 15, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowOldToNew", arg: 2, scope: !6, file: !1, line: 16, type: !31)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colOldToNew", arg: 3, scope: !6, file: !1, line: 17, type: !31)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !6, file: !1, line: 19, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 19, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !6, file: !1, line: 19, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !6, file: !1, line: 19, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !6, file: !1, line: 20, type: !31)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !6, file: !1, line: 20, type: !31)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chv", scope: !59, file: !1, line: 84, type: !15)
!59 = distinct !DILexicalBlock(scope: !60, file: !1, line: 83, column: 45)
!60 = distinct !DILexicalBlock(scope: !61, file: !1, line: 83, column: 13)
!61 = distinct !DILexicalBlock(scope: !62, file: !1, line: 72, column: 13)
!62 = distinct !DILexicalBlock(scope: !6, file: !1, line: 61, column: 6)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "off", scope: !59, file: !1, line: 84, type: !15)
!64 = !{i32 2, !"Dwarf Version", i32 2}
!65 = !{i32 2, !"Debug Info Version", i32 700000003}
!66 = !{i32 1, !"PIC Level", i32 2}
!67 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!68 = !DIExpression()
!69 = !DILocation(line: 15, column: 14, scope: !6)
!70 = !DILocation(line: 16, column: 14, scope: !6)
!71 = !DILocation(line: 17, column: 14, scope: !6)
!72 = !DILocation(line: 26, column: 13, scope: !73)
!73 = distinct !DILexicalBlock(scope: !6, file: !1, line: 26, column: 6)
!74 = !DILocation(line: 26, column: 6, scope: !6)
!75 = !DILocation(line: 27, column: 12, scope: !76)
!76 = distinct !DILexicalBlock(scope: !73, file: !1, line: 26, column: 23)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !79, i64 0}
!79 = !{!"omnipotent char", !80, i64 0}
!80 = !{!"Simple C/C++ TBAA"}
!81 = !DILocation(line: 27, column: 4, scope: !76)
!82 = !DILocation(line: 29, column: 4, scope: !76)
!83 = !DILocation(line: 31, column: 14, scope: !84)
!84 = distinct !DILexicalBlock(scope: !6, file: !1, line: 31, column: 6)
!85 = !{!86, !87, i64 0}
!86 = !{!"_InpMtx", !87, i64 0, !87, i64 4, !87, i64 8, !87, i64 12, !87, i64 16, !88, i64 24, !89, i64 32, !89, i64 56, !90, i64 80, !87, i64 104, !87, i64 108, !89, i64 112, !89, i64 136, !89, i64 160}
!87 = !{!"int", !79, i64 0}
!88 = !{!"double", !79, i64 0}
!89 = !{!"_IV", !87, i64 0, !87, i64 4, !87, i64 8, !78, i64 16}
!90 = !{!"_DV", !87, i64 0, !87, i64 4, !87, i64 8, !78, i64 16}
!91 = !DILocation(line: 31, column: 29, scope: !84)
!92 = !DILocation(line: 32, column: 12, scope: !93)
!93 = distinct !DILexicalBlock(scope: !84, file: !1, line: 31, column: 57)
!94 = !DILocation(line: 32, column: 4, scope: !93)
!95 = !DILocation(line: 35, column: 4, scope: !93)
!96 = !DILocation(line: 42, column: 18, scope: !97)
!97 = distinct !DILexicalBlock(scope: !6, file: !1, line: 42, column: 6)
!98 = !DILocation(line: 42, column: 41, scope: !97)
!99 = !DILocation(line: 42, column: 26, scope: !97)
!100 = !DILocation(line: 45, column: 22, scope: !101)
!101 = distinct !DILexicalBlock(scope: !6, file: !1, line: 45, column: 6)
!102 = !{!86, !87, i64 16}
!103 = !DILocation(line: 19, column: 19, scope: !6)
!104 = !DILocation(line: 45, column: 28, scope: !101)
!105 = !DILocation(line: 45, column: 6, scope: !6)
!106 = !DILocation(line: 48, column: 9, scope: !6)
