; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._Drand = type { double, double, double, double, double, double, double, double, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [56 x i8] c"\0A fatal error in InpMtx_sortAndCompress(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [57 x i8] c"\0A fatal error in InpMtx_convertToVectors(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [63 x i8] c"\0A fatal error in InpMtx_dropOffdiagonalEntries(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [72 x i8] c"\0A fatal error in InpMtx_dropOffdiagonalEntries(%p)\0A bad coordType = %d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/InpMtx_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !64, !79, !88, !97, !106, !115, !124, !134, !149, !185}
!6 = !DISubprogram(name: "InpMtx_sortAndCompress", scope: !1, file: !1, line: 19, type: !7, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_sortAndCompress, variables: !48)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !11, line: 51, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !11, line: 52, size: 1472, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !22, !32, !33, !43, !44, !45, !46, !47}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !12, file: !11, line: 53, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !12, file: !11, line: 54, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !12, file: !11, line: 55, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !12, file: !11, line: 56, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 57, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !12, file: !11, line: 58, baseType: !21, size: 64, align: 64, offset: 192)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !12, file: !11, line: 59, baseType: !23, size: 192, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !24, line: 20, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !24, line: 21, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 22, baseType: !15, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !25, file: !24, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !25, file: !24, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !25, file: !24, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !12, file: !11, line: 60, baseType: !23, size: 192, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !12, file: !11, line: 61, baseType: !34, size: 192, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !35, line: 20, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !35, line: 21, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 22, baseType: !15, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !36, file: !35, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !36, file: !35, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !36, file: !35, line: 25, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !12, file: !11, line: 62, baseType: !15, size: 32, align: 32, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !12, file: !11, line: 63, baseType: !15, size: 32, align: 32, offset: 864)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !12, file: !11, line: 64, baseType: !23, size: 192, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !12, file: !11, line: 65, baseType: !23, size: 192, align: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !12, file: !11, line: 66, baseType: !23, size: 192, align: 64, offset: 1280)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !61}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !6, file: !1, line: 20, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ient", scope: !6, file: !1, line: 22, type: !15)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !6, file: !1, line: 22, type: !15)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sortMustBeDone", scope: !6, file: !1, line: 22, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !6, file: !1, line: 23, type: !31)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !6, file: !1, line: 23, type: !31)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !56, file: !1, line: 55, type: !42)
!56 = distinct !DILexicalBlock(scope: !57, file: !1, line: 54, column: 49)
!57 = distinct !DILexicalBlock(scope: !58, file: !1, line: 54, column: 16)
!58 = distinct !DILexicalBlock(scope: !59, file: !1, line: 52, column: 9)
!59 = distinct !DILexicalBlock(scope: !60, file: !1, line: 51, column: 28)
!60 = distinct !DILexicalBlock(scope: !6, file: !1, line: 51, column: 6)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !62, file: !1, line: 58, type: !42)
!62 = distinct !DILexicalBlock(scope: !63, file: !1, line: 57, column: 52)
!63 = distinct !DILexicalBlock(scope: !57, file: !1, line: 57, column: 16)
!64 = !DISubprogram(name: "InpMtx_convertToVectors", scope: !1, file: !1, line: 75, type: !7, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_convertToVectors, variables: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !64, file: !1, line: 76, type: !9)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !64, file: !1, line: 78, type: !31)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !64, file: !1, line: 78, type: !31)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsets", scope: !64, file: !1, line: 78, type: !31)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !64, file: !1, line: 78, type: !31)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vecids", scope: !64, file: !1, line: 78, type: !31)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !64, file: !1, line: 79, type: !15)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "id", scope: !64, file: !1, line: 79, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ient", scope: !64, file: !1, line: 79, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !64, file: !1, line: 79, type: !15)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !64, file: !1, line: 79, type: !15)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvector", scope: !64, file: !1, line: 79, type: !15)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !64, file: !1, line: 79, type: !15)
!79 = !DISubprogram(name: "InpMtx_dropOffdiagonalEntries", scope: !1, file: !1, line: 202, type: !7, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_dropOffdiagonalEntries, variables: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !79, file: !1, line: 203, type: !9)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !79, file: !1, line: 205, type: !42)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !79, file: !1, line: 206, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !79, file: !1, line: 206, type: !15)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !79, file: !1, line: 206, type: !15)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !79, file: !1, line: 207, type: !31)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !79, file: !1, line: 207, type: !31)
!88 = !DISubprogram(name: "InpMtx_dropLowerTriangle", scope: !1, file: !1, line: 296, type: !7, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_dropLowerTriangle, variables: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !88, file: !1, line: 297, type: !9)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !88, file: !1, line: 299, type: !42)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !88, file: !1, line: 300, type: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !88, file: !1, line: 300, type: !15)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !88, file: !1, line: 300, type: !15)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !88, file: !1, line: 301, type: !31)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !88, file: !1, line: 301, type: !31)
!97 = !DISubprogram(name: "InpMtx_dropUpperTriangle", scope: !1, file: !1, line: 396, type: !7, isLocal: false, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_dropUpperTriangle, variables: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !97, file: !1, line: 397, type: !9)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !97, file: !1, line: 399, type: !42)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !97, file: !1, line: 400, type: !15)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !97, file: !1, line: 400, type: !15)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !97, file: !1, line: 400, type: !15)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !97, file: !1, line: 401, type: !31)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !97, file: !1, line: 401, type: !31)
!106 = !DISubprogram(name: "InpMtx_mapToLowerTriangle", scope: !1, file: !1, line: 489, type: !7, isLocal: false, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_mapToLowerTriangle, variables: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !106, file: !1, line: 490, type: !9)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !106, file: !1, line: 492, type: !15)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !106, file: !1, line: 492, type: !15)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !106, file: !1, line: 492, type: !15)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !106, file: !1, line: 492, type: !15)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !106, file: !1, line: 493, type: !31)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !106, file: !1, line: 493, type: !31)
!115 = !DISubprogram(name: "InpMtx_mapToUpperTriangle", scope: !1, file: !1, line: 546, type: !7, isLocal: false, isDefinition: true, scopeLine: 548, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_mapToUpperTriangle, variables: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !115, file: !1, line: 547, type: !9)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !115, file: !1, line: 549, type: !15)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !115, file: !1, line: 549, type: !15)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !115, file: !1, line: 549, type: !15)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !115, file: !1, line: 549, type: !15)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !115, file: !1, line: 550, type: !31)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !115, file: !1, line: 550, type: !31)
!124 = !DISubprogram(name: "InpMtx_mapToUpperTriangleH", scope: !1, file: !1, line: 607, type: !7, isLocal: false, isDefinition: true, scopeLine: 609, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*)* @InpMtx_mapToUpperTriangleH, variables: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !124, file: !1, line: 608, type: !9)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !124, file: !1, line: 610, type: !42)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !124, file: !1, line: 611, type: !15)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !124, file: !1, line: 611, type: !15)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !124, file: !1, line: 611, type: !15)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !124, file: !1, line: 611, type: !15)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !124, file: !1, line: 612, type: !31)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !124, file: !1, line: 612, type: !31)
!134 = !DISubprogram(name: "InpMtx_checksums", scope: !1, file: !1, line: 683, type: !135, isLocal: false, isDefinition: true, scopeLine: 686, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._InpMtx*, double*)* @InpMtx_checksums, variables: !137)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !9, !42}
!137 = !{!138, !139, !140, !141, !142, !143, !144, !147}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 1, scope: !134, file: !1, line: 684, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sums", arg: 2, scope: !134, file: !1, line: 685, type: !42)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ient", scope: !134, file: !1, line: 687, type: !15)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !134, file: !1, line: 687, type: !15)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec1", scope: !134, file: !1, line: 688, type: !31)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec2", scope: !134, file: !1, line: 688, type: !31)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !145, file: !1, line: 723, type: !42)
!145 = distinct !DILexicalBlock(scope: !146, file: !1, line: 722, column: 21)
!146 = distinct !DILexicalBlock(scope: !134, file: !1, line: 719, column: 30)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !148, file: !1, line: 729, type: !42)
!148 = distinct !DILexicalBlock(scope: !146, file: !1, line: 728, column: 24)
!149 = !DISubprogram(name: "InpMtx_randomMatrix", scope: !1, file: !1, line: 773, type: !150, isLocal: false, isDefinition: true, scopeLine: 784, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*, i32, i32, i32, i32, i32, i32, i32, i32, i32)* @InpMtx_randomMatrix, variables: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!15, !9, !15, !15, !15, !15, !15, !15, !15, !15, !15}
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !179, !180, !181, !182, !183, !184}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !149, file: !1, line: 774, type: !9)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inputMode", arg: 2, scope: !149, file: !1, line: 775, type: !15)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coordType", arg: 3, scope: !149, file: !1, line: 776, type: !15)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "storageMode", arg: 4, scope: !149, file: !1, line: 777, type: !15)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrow", arg: 5, scope: !149, file: !1, line: 778, type: !15)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncol", arg: 6, scope: !149, file: !1, line: 779, type: !15)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symflag", arg: 7, scope: !149, file: !1, line: 780, type: !15)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nonzerodiag", arg: 8, scope: !149, file: !1, line: 781, type: !15)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nitem", arg: 9, scope: !149, file: !1, line: 782, type: !15)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 10, scope: !149, file: !1, line: 783, type: !15)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dvec", scope: !149, file: !1, line: 785, type: !42)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "drand", scope: !149, file: !1, line: 786, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drand", file: !167, line: 27, baseType: !168)
!167 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/InpMtx/src/../../Drand/Drand.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Drand", file: !167, line: 17, size: 576, align: 64, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !168, file: !167, line: 18, baseType: !21, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !168, file: !167, line: 19, baseType: !21, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "base1", scope: !168, file: !167, line: 20, baseType: !21, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !168, file: !167, line: 21, baseType: !21, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !168, file: !167, line: 22, baseType: !21, size: 64, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !168, file: !167, line: 23, baseType: !21, size: 64, align: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !168, file: !167, line: 24, baseType: !21, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !168, file: !167, line: 25, baseType: !21, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !168, file: !167, line: 26, baseType: !15, size: 32, align: 32, offset: 512)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !149, file: !1, line: 787, type: !15)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !149, file: !1, line: 787, type: !15)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neqns", scope: !149, file: !1, line: 787, type: !15)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !149, file: !1, line: 787, type: !15)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colids", scope: !149, file: !1, line: 788, type: !31)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowids", scope: !149, file: !1, line: 788, type: !31)
!185 = !DISubprogram(name: "InpMtx_range", scope: !1, file: !1, line: 981, type: !186, isLocal: false, isDefinition: true, scopeLine: 987, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._InpMtx*, i32*, i32*, i32*, i32*)* @InpMtx_range, variables: !188)
!186 = !DISubroutineType(types: !187)
!187 = !{!15, !9, !31, !31, !31, !31}
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !203, !204, !205, !206, !209, !210, !211, !212, !213, !216, !217, !218, !219, !220}
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !185, file: !1, line: 982, type: !9)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pmincol", arg: 2, scope: !185, file: !1, line: 983, type: !31)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pmaxcol", arg: 3, scope: !185, file: !1, line: 984, type: !31)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pminrow", arg: 4, scope: !185, file: !1, line: 985, type: !31)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pmaxrow", arg: 5, scope: !185, file: !1, line: 986, type: !31)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxcol", scope: !185, file: !1, line: 988, type: !15)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxrow", scope: !185, file: !1, line: 988, type: !15)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mincol", scope: !185, file: !1, line: 988, type: !15)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minrow", scope: !185, file: !1, line: 988, type: !15)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !185, file: !1, line: 988, type: !15)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !200, file: !1, line: 1005, type: !31)
!200 = distinct !DILexicalBlock(scope: !201, file: !1, line: 1004, column: 31)
!201 = distinct !DILexicalBlock(scope: !185, file: !1, line: 1004, column: 6)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !200, file: !1, line: 1006, type: !31)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !200, file: !1, line: 1007, type: !15)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !200, file: !1, line: 1007, type: !15)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !200, file: !1, line: 1007, type: !15)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !207, file: !1, line: 1026, type: !31)
!207 = distinct !DILexicalBlock(scope: !208, file: !1, line: 1025, column: 42)
!208 = distinct !DILexicalBlock(scope: !201, file: !1, line: 1025, column: 14)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !207, file: !1, line: 1027, type: !31)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !207, file: !1, line: 1028, type: !15)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !207, file: !1, line: 1028, type: !15)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !207, file: !1, line: 1028, type: !15)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chvind", scope: !214, file: !1, line: 1047, type: !31)
