; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IV/src/IV_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [64 x i8] c"\0A error in IV_readFromFile(%p,%s), file %s, line %d\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [81 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IV/src/IV_IO.c\00", align 1
@.str2 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str3 = private unnamed_addr constant [58 x i8] c"\0A error in IV_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str5 = private unnamed_addr constant [100 x i8] c"\0A error in IV_readFromFile(%p,%s)\0A bad IV file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str6 = private unnamed_addr constant [55 x i8] c"\0A error in IV_readFromFormattedFile(%p,%p)\0A bad input\0A\00", align 1
@.str7 = private unnamed_addr constant [3 x i8] c"%d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !152, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IV/src/IV_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !89, !97, !103, !111, !117, !122, !128, !133, !141}
!6 = !DISubprogram(name: "IV_readFromFile", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IV*, i8*)* @IV_readFromFile, variables: !22)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !20}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !12, line: 20, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IV/src/../IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !12, line: 21, size: 192, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !13, file: !12, line: 22, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !13, file: !12, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !13, file: !12, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !13, file: !12, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !{!23, !24, !25, !86, !87, !88}
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iv", arg: 1, scope: !6, file: !1, line: 24, type: !10)
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !6, file: !1, line: 25, type: !20)
!25 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !6, file: !1, line: 27, type: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 153, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !28, line: 122, size: 1216, align: 64, elements: !30)
!30 = !{!31, !34, !35, !36, !38, !39, !44, !45, !46, !50, !54, !64, !70, !71, !74, !75, !79, !83, !84, !85}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !29, file: !28, line: 123, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !29, file: !28, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !29, file: !28, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !29, file: !28, line: 126, baseType: !37, size: 16, align: 16, offset: 128)
!37 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !29, file: !28, line: 127, baseType: !37, size: 16, align: 16, offset: 144)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !29, file: !28, line: 128, baseType: !40, size: 128, align: 64, offset: 192)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !28, line: 88, size: 128, align: 64, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !40, file: !28, line: 89, baseType: !32, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !40, file: !28, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !29, file: !28, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !29, file: !28, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !29, file: !28, line: 133, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!9, !4}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !29, file: !28, line: 134, baseType: !51, size: 64, align: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!9, !4, !20, !9}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !29, file: !28, line: 135, baseType: !55, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !4, !58, !9}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !28, line: 77, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !60, line: 71, baseType: !61)
!60 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !29, file: !28, line: 136, baseType: !65, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!9, !4, !68, !9}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !29, file: !28, line: 139, baseType: !40, size: 128, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !29, file: !28, line: 140, baseType: !72, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !28, line: 94, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !29, file: !28, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !29, file: !28, line: 144, baseType: !76, size: 24, align: 8, offset: 928)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 3)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !29, file: !28, line: 145, baseType: !80, size: 8, align: 8, offset: 952)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !29, file: !28, line: 148, baseType: !40, size: 128, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !29, file: !28, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !29, file: !28, line: 152, baseType: !58, size: 64, align: 64, offset: 1152)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !6, file: !1, line: 28, type: !9)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !6, file: !1, line: 28, type: !9)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !6, file: !1, line: 28, type: !9)
!89 = !DISubprogram(name: "IV_readFromFormattedFile", scope: !1, file: !1, line: 93, type: !90, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IV*, %struct.__sFILE*)* @IV_readFromFormattedFile, variables: !92)
!90 = !DISubroutineType(types: !91)
!91 = !{!9, !10, !26}
!92 = !{!93, !94, !95, !96}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iv", arg: 1, scope: !89, file: !1, line: 94, type: !10)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !89, file: !1, line: 95, type: !26)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !89, file: !1, line: 97, type: !9)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !89, file: !1, line: 97, type: !9)
!97 = !DISubprogram(name: "IV_readFromBinaryFile", scope: !1, file: !1, line: 149, type: !90, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IV*, %struct.__sFILE*)* @IV_readFromBinaryFile, variables: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iv", arg: 1, scope: !97, file: !1, line: 150, type: !10)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !97, file: !1, line: 151, type: !26)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !97, file: !1, line: 153, type: !9)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !97, file: !1, line: 153, type: !9)
!103 = !DISubprogram(name: "IV_writeToFile", scope: !1, file: !1, line: 213, type: !7, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IV*, i8*)* @IV_writeToFile, variables: !104)
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iv", arg: 1, scope: !103, file: !1, line: 214, type: !10)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !103, file: !1, line: 215, type: !20)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !103, file: !1, line: 217, type: !26)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !103, file: !1, line: 218, type: !9)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !103, file: !1, line: 218, type: !9)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !103, file: !1, line: 218, type: !9)
!111 = !DISubprogram(name: "IV_writeToFormattedFile", scope: !1, file: !1, line: 287, type: !90, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IV*, %struct.__sFILE*)* @IV_writeToFormattedFile, variables: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iv", arg: 1, scope: !111, file: !1, line: 288, type: !10)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !111, file: !1, line: 289, type: !26)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !111, file: !1, line: 291, type: !9)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !111, file: !1, line: 291, type: !9)
!117 = !DISubprogram(name: "IV_writeToBinaryFile", scope: !1, file: !1, line: 338, type: !90, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IV*, %struct.__sFILE*)* @IV_writeToBinaryFile, variables: !118)
