; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_listmanip.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [58 x i8] c"\0A fatal error in IVL_listAndSize(%p,%d,%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [25 x i8] c"\0A ilist = %d, nlist = %d\00", align 1
@.str2 = private unnamed_addr constant [65 x i8] c"\0A fatal error in IVL_firstInList(%p,%d)\0A bad input, ivl is NULL\0A\00", align 1
@.str3 = private unnamed_addr constant [84 x i8] c"\0A fatal error in IVL_firstInList(%p,%d)\0A bad input, ilist = %d, must be in [0,%d) \0A\00", align 1
@.str4 = private unnamed_addr constant [68 x i8] c"\0A fatal error in IVL_firstInList(%p,%d)\0A size > 0 but list is NULL\0A\00", align 1
@.str5 = private unnamed_addr constant [67 x i8] c"\0A fatal error in IVL_nextInList(%p,%d,%p)\0A bad input, ivl is NULL\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !18, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_listmanip.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !17}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !8, line: 102, size: 192, align: 64, elements: !9)
!8 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/../IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !{!10, !11, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !7, file: !8, line: 103, baseType: !5, size: 32, align: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !7, file: !8, line: 104, baseType: !5, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !7, file: !8, line: 105, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 106, baseType: !15, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !8, line: 56, baseType: !7)
!17 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!18 = !{!19, !40, !46, !54, !73}
!19 = !DISubprogram(name: "IVL_listAndSize", scope: !1, file: !1, line: 26, type: !20, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32, i32*, i32**)* @IVL_listAndSize, variables: !35)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !5, !13, !32}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !8, line: 55, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !8, line: 79, size: 384, align: 64, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !33, !34}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !24, file: !8, line: 80, baseType: !5, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !24, file: !8, line: 81, baseType: !5, size: 32, align: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !24, file: !8, line: 82, baseType: !5, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !24, file: !8, line: 83, baseType: !5, size: 32, align: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !24, file: !8, line: 84, baseType: !13, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !24, file: !8, line: 85, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !24, file: !8, line: 86, baseType: !5, size: 32, align: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !24, file: !8, line: 87, baseType: !15, size: 64, align: 64, offset: 320)
!35 = !{!36, !37, !38, !39}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !19, file: !1, line: 27, type: !22)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !19, file: !1, line: 28, type: !5)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "psize", arg: 3, scope: !19, file: !1, line: 29, type: !13)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pivec", arg: 4, scope: !19, file: !1, line: 30, type: !32)
!40 = !DISubprogram(name: "IVL_firstInList", scope: !1, file: !1, line: 75, type: !41, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct._IVL*, i32)* @IVL_firstInList, variables: !43)
!41 = !DISubroutineType(types: !42)
!42 = !{!13, !22, !5}
!43 = !{!44, !45}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !40, file: !1, line: 76, type: !22)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !40, file: !1, line: 77, type: !5)
!46 = !DISubprogram(name: "IVL_nextInList", scope: !1, file: !1, line: 122, type: !47, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct._IVL*, i32, i32*)* @IVL_nextInList, variables: !49)
!47 = !DISubroutineType(types: !48)
!48 = !{!13, !22, !5, !13}
!49 = !{!50, !51, !52, !53}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !46, file: !1, line: 123, type: !22)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !46, file: !1, line: 124, type: !5)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pi", arg: 3, scope: !46, file: !1, line: 125, type: !13)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !46, file: !1, line: 127, type: !5)
!54 = !DISubprogram(name: "IVL_setList", scope: !1, file: !1, line: 185, type: !55, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32, i32, i32*)* @IVL_setList, variables: !57)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !22, !5, !5, !13}
!57 = !{!58, !59, !60, !61, !62, !65}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !54, file: !1, line: 186, type: !22)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !54, file: !1, line: 187, type: !5)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isize", arg: 3, scope: !54, file: !1, line: 188, type: !5)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivec", arg: 4, scope: !54, file: !1, line: 189, type: !13)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newmaxnlist", scope: !63, file: !1, line: 207, type: !5)
!63 = distinct !DILexicalBlock(scope: !64, file: !1, line: 206, column: 31)
!64 = distinct !DILexicalBlock(scope: !54, file: !1, line: 206, column: 6)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunk", scope: !66, file: !1, line: 271, type: !15)
!66 = distinct !DILexicalBlock(scope: !67, file: !1, line: 270, column: 26)
!67 = distinct !DILexicalBlock(scope: !68, file: !1, line: 257, column: 28)
!68 = distinct !DILexicalBlock(scope: !69, file: !1, line: 250, column: 37)
!69 = distinct !DILexicalBlock(scope: !70, file: !1, line: 250, column: 9)
!70 = distinct !DILexicalBlock(scope: !71, file: !1, line: 244, column: 8)
!71 = distinct !DILexicalBlock(scope: !72, file: !1, line: 233, column: 13)
!72 = distinct !DILexicalBlock(scope: !54, file: !1, line: 219, column: 6)
!73 = !DISubprogram(name: "IVL_setPointerToList", scope: !1, file: !1, line: 334, type: !55, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32, i32, i32*)* @IVL_setPointerToList, variables: !74)
!74 = !{!75, !76, !77, !78, !79}
