; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [48 x i8] c"\0A fatal error in IVL_init1(%p,%d,%d)\0A bad input\00", align 1
@.str1 = private unnamed_addr constant [51 x i8] c"\0A fatal error in IVL_init2(%p,%d,%d,%d)\0A bad input\00", align 1
@.str2 = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str3 = private unnamed_addr constant [85 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_init.c\00", align 1
@.str4 = private unnamed_addr constant [51 x i8] c"\0A fatal error in IVL_init3(%p,%d,%d,%p)\0A bad input\00", align 1
@.str5 = private unnamed_addr constant [52 x i8] c"\0A fatal error in IVL_setMaxnlist(%p,%d)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !18, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !17}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !7, line: 102, size: 192, align: 64, elements: !8)
!7 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/../IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !{!9, !11, !12, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !6, file: !7, line: 103, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !6, file: !7, line: 104, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !6, file: !7, line: 105, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !6, file: !7, line: 106, baseType: !15, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !7, line: 56, baseType: !6)
!17 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!18 = !{!19, !39, !47, !56, !66}
!19 = !DISubprogram(name: "IVL_init1", scope: !1, file: !1, line: 17, type: !20, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32, i32)* @IVL_init1, variables: !35)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !10, !10}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !7, line: 55, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !7, line: 79, size: 384, align: 64, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !33, !34}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !24, file: !7, line: 80, baseType: !10, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !24, file: !7, line: 81, baseType: !10, size: 32, align: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !24, file: !7, line: 82, baseType: !10, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !24, file: !7, line: 83, baseType: !10, size: 32, align: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !24, file: !7, line: 84, baseType: !13, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !24, file: !7, line: 85, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !24, file: !7, line: 86, baseType: !10, size: 32, align: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !24, file: !7, line: 87, baseType: !15, size: 64, align: 64, offset: 320)
!35 = !{!36, !37, !38}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !19, file: !1, line: 18, type: !22)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !19, file: !1, line: 19, type: !10)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxnlist", arg: 3, scope: !19, file: !1, line: 20, type: !10)
!39 = !DISubprogram(name: "IVL_init2", scope: !1, file: !1, line: 65, type: !40, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32, i32, i32)* @IVL_init2, variables: !42)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !22, !10, !10, !10}
!42 = !{!43, !44, !45, !46}
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !39, file: !1, line: 66, type: !22)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !39, file: !1, line: 67, type: !10)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxnlist", arg: 3, scope: !39, file: !1, line: 68, type: !10)
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tsize", arg: 4, scope: !39, file: !1, line: 69, type: !10)
!47 = !DISubprogram(name: "IVL_init3", scope: !1, file: !1, line: 111, type: !48, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32, i32, i32*)* @IVL_init3, variables: !50)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !22, !10, !10, !13}
!50 = !{!51, !52, !53, !54, !55}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !47, file: !1, line: 112, type: !22)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !47, file: !1, line: 113, type: !10)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxnlist", arg: 3, scope: !47, file: !1, line: 114, type: !10)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sizes", arg: 4, scope: !47, file: !1, line: 115, type: !13)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !47, file: !1, line: 117, type: !10)
!56 = !DISubprogram(name: "IVL_setMaxnlist", scope: !1, file: !1, line: 170, type: !57, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32)* @IVL_setMaxnlist, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !22, !10}
!59 = !{!60, !61, !62, !65}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !56, file: !1, line: 171, type: !22)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newmaxnlist", arg: 2, scope: !56, file: !1, line: 172, type: !10)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivec", scope: !63, file: !1, line: 180, type: !13)
!63 = distinct !DILexicalBlock(scope: !64, file: !1, line: 179, column: 37)
!64 = distinct !DILexicalBlock(scope: !56, file: !1, line: 179, column: 6)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivec", scope: !63, file: !1, line: 180, type: !32)
!66 = !DISubprogram(name: "IVL_setNlist", scope: !1, file: !1, line: 234, type: !57, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, i32)* @IVL_setNlist, variables: !67)
!67 = !{!68, !69}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !66, file: !1, line: 235, type: !22)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newnlist", arg: 2, scope: !66, file: !1, line: 236, type: !10)
!70 = !{i32 2, !"Dwarf Version", i32 2}
!71 = !{i32 2, !"Debug Info Version", i32 700000003}
!72 = !{i32 1, !"PIC Level", i32 2}
!73 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!74 = !DIExpression()
!75 = !DILocation(line: 18, column: 11, scope: !19)
!76 = !DILocation(line: 19, column: 10, scope: !19)
