; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [65 x i8] c"\0A error in IVL_readFromFile(%p,%s), file %s, line %d\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [83 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_IO.c\00", align 1
@.str2 = private unnamed_addr constant [50 x i8] c"\0A error in IVL_readFromFile(%p,%s)\0A bad type = %d\00", align 1
@.str3 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str4 = private unnamed_addr constant [59 x i8] c"\0A error in IVL_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str5 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !182, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !102, !119, !133, !141, !152, !162, !171}
!6 = !DISubprogram(name: "IVL_readFromFile", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*, i8*)* @IVL_readFromFile, variables: !35)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !33}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !12, line: 55, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/../IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !12, line: 79, size: 384, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !21, !23, !24}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 80, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !13, file: !12, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !13, file: !12, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !13, file: !12, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !13, file: !12, line: 84, baseType: !20, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !13, file: !12, line: 85, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !13, file: !12, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !13, file: !12, line: 87, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !12, line: 56, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !12, line: 102, size: 192, align: 64, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !27, file: !12, line: 103, baseType: !9, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !27, file: !12, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !27, file: !12, line: 105, baseType: !20, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !12, line: 106, baseType: !25, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !{!36, !37, !38, !99, !100, !101}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !6, file: !1, line: 24, type: !10)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !6, file: !1, line: 25, type: !33)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !6, file: !1, line: 27, type: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 153, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !41, line: 122, size: 1216, align: 64, elements: !43)
!43 = !{!44, !47, !48, !49, !51, !52, !57, !58, !59, !63, !67, !77, !83, !84, !87, !88, !92, !96, !97, !98}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !42, file: !41, line: 123, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !42, file: !41, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !42, file: !41, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !41, line: 126, baseType: !50, size: 16, align: 16, offset: 128)
!50 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !42, file: !41, line: 127, baseType: !50, size: 16, align: 16, offset: 144)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !42, file: !41, line: 128, baseType: !53, size: 128, align: 64, offset: 192)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !41, line: 88, size: 128, align: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !53, file: !41, line: 89, baseType: !45, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !53, file: !41, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !42, file: !41, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !42, file: !41, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !42, file: !41, line: 133, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!9, !4}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !42, file: !41, line: 134, baseType: !64, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!9, !4, !33, !9}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !42, file: !41, line: 135, baseType: !68, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !4, !71, !9}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !41, line: 77, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !73, line: 71, baseType: !74)
!73 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!76 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !42, file: !41, line: 136, baseType: !78, size: 64, align: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!9, !4, !81, !9}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !42, file: !41, line: 139, baseType: !53, size: 128, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !42, file: !41, line: 140, baseType: !85, size: 64, align: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !41, line: 94, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !42, file: !41, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !42, file: !41, line: 144, baseType: !89, size: 24, align: 8, offset: 928)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 3)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !42, file: !41, line: 145, baseType: !93, size: 8, align: 8, offset: 952)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !42, file: !41, line: 148, baseType: !53, size: 128, align: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !42, file: !41, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !41, line: 152, baseType: !71, size: 64, align: 64, offset: 1152)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !6, file: !1, line: 28, type: !9)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !6, file: !1, line: 28, type: !9)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !6, file: !1, line: 28, type: !9)
!102 = !DISubprogram(name: "IVL_readFromFormattedFile", scope: !1, file: !1, line: 103, type: !103, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*, %struct.__sFILE*)* @IVL_readFromFormattedFile, variables: !105)
!103 = !DISubroutineType(types: !104)
!104 = !{!9, !10, !39}
!105 = !{!106, !107, !108, !109, !110, !111, !113, !114, !117, !118}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !102, file: !1, line: 104, type: !10)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !102, file: !1, line: 105, type: !39)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !102, file: !1, line: 107, type: !9)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !102, file: !1, line: 107, type: !9)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !102, file: !1, line: 107, type: !9)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !102, file: !1, line: 108, type: !112)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 96, align: 32, elements: !90)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !102, file: !1, line: 109, type: !20)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !115, file: !1, line: 177, type: !9)
!115 = distinct !DILexicalBlock(scope: !116, file: !1, line: 176, column: 17)
!116 = distinct !DILexicalBlock(scope: !102, file: !1, line: 175, column: 17)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !115, file: !1, line: 177, type: !9)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ind", scope: !115, file: !1, line: 178, type: !20)
!119 = !DISubprogram(name: "IVL_readFromBinaryFile", scope: !1, file: !1, line: 220, type: !103, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*, %struct.__sFILE*)* @IVL_readFromBinaryFile, variables: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !131, !132}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !119, file: !1, line: 221, type: !10)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !119, file: !1, line: 222, type: !39)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !119, file: !1, line: 224, type: !9)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !119, file: !1, line: 224, type: !9)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !119, file: !1, line: 224, type: !9)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !119, file: !1, line: 225, type: !112)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !119, file: !1, line: 226, type: !20)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !129, file: !1, line: 291, type: !9)
!129 = distinct !DILexicalBlock(scope: !130, file: !1, line: 290, column: 17)
!130 = distinct !DILexicalBlock(scope: !119, file: !1, line: 289, column: 17)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !129, file: !1, line: 291, type: !9)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ind", scope: !129, file: !1, line: 292, type: !20)
