; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [44 x i8] c"\0A fatal error in IVL_sizeOf(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [41 x i8] c"\0A fatal error in IVL_min(%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [41 x i8] c"\0A fatal error in IVL_max(%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [48 x i8] c"\0A fatal error in IVL_maxListSize(%p)\0A bad input\00", align 1
@.str4 = private unnamed_addr constant [41 x i8] c"\0A fatal error in IVL_sum(%p)\0A bad input\0A\00", align 1
@.str5 = private unnamed_addr constant [44 x i8] c"\0A fatal error in IVL_sortUp(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/IVL_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !41, !52, !63, !71, !78, !87, !114, !130, !143, !162, !176}
!6 = !DISubprogram(name: "IVL_sizeOf", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*)* @IVL_sizeOf, variables: !33)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !12, line: 55, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/../IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !12, line: 79, size: 384, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !21, !23, !24}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 80, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !13, file: !12, line: 81, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !13, file: !12, line: 82, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !13, file: !12, line: 83, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !13, file: !12, line: 84, baseType: !20, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !13, file: !12, line: 85, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !13, file: !12, line: 86, baseType: !9, size: 32, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !13, file: !12, line: 87, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !12, line: 56, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !12, line: 102, size: 192, align: 64, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !27, file: !12, line: 103, baseType: !9, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !27, file: !12, line: 104, baseType: !9, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !27, file: !12, line: 105, baseType: !20, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !12, line: 106, baseType: !25, size: 64, align: 64, offset: 128)
!33 = !{!34, !35, !36}
!34 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !6, file: !1, line: 17, type: !10)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !6, file: !1, line: 19, type: !9)
!36 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunk", scope: !37, file: !1, line: 36, type: !25)
!37 = distinct !DILexicalBlock(scope: !38, file: !1, line: 35, column: 11)
!38 = distinct !DILexicalBlock(scope: !39, file: !1, line: 33, column: 9)
!39 = distinct !DILexicalBlock(scope: !40, file: !1, line: 31, column: 23)
!40 = distinct !DILexicalBlock(scope: !6, file: !1, line: 31, column: 6)
!41 = !DISubprogram(name: "IVL_min", scope: !1, file: !1, line: 55, type: !7, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*)* @IVL_min, variables: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51}
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !41, file: !1, line: 56, type: !10)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !41, file: !1, line: 58, type: !9)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !41, file: !1, line: 58, type: !9)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !41, file: !1, line: 58, type: !9)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !41, file: !1, line: 58, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !41, file: !1, line: 58, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !41, file: !1, line: 58, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !41, file: !1, line: 58, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ent", scope: !41, file: !1, line: 59, type: !20)
!52 = !DISubprogram(name: "IVL_max", scope: !1, file: !1, line: 95, type: !7, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*)* @IVL_max, variables: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62}
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !52, file: !1, line: 96, type: !10)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !52, file: !1, line: 98, type: !9)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !52, file: !1, line: 98, type: !9)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !52, file: !1, line: 98, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !52, file: !1, line: 98, type: !9)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !52, file: !1, line: 98, type: !9)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !52, file: !1, line: 98, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !52, file: !1, line: 98, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ent", scope: !52, file: !1, line: 99, type: !20)
!63 = !DISubprogram(name: "IVL_maxListSize", scope: !1, file: !1, line: 135, type: !7, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*)* @IVL_maxListSize, variables: !64)
!64 = !{!65, !66, !67, !68, !69, !70}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !63, file: !1, line: 136, type: !10)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !63, file: !1, line: 138, type: !9)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxsize", scope: !63, file: !1, line: 138, type: !9)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !63, file: !1, line: 138, type: !9)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !63, file: !1, line: 138, type: !9)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ent", scope: !63, file: !1, line: 139, type: !20)
!71 = !DISubprogram(name: "IVL_sum", scope: !1, file: !1, line: 167, type: !7, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IVL*)* @IVL_sum, variables: !72)
!72 = !{!73, !74, !75, !76, !77}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !71, file: !1, line: 168, type: !10)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !71, file: !1, line: 170, type: !9)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jsize", scope: !71, file: !1, line: 170, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !71, file: !1, line: 170, type: !9)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jind", scope: !71, file: !1, line: 171, type: !20)
!78 = !DISubprogram(name: "IVL_sortUp", scope: !1, file: !1, line: 196, type: !79, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*)* @IVL_sortUp, variables: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !10}
!81 = !{!82, !83, !84, !85, !86}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !78, file: !1, line: 197, type: !10)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !78, file: !1, line: 199, type: !9)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !78, file: !1, line: 199, type: !9)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !78, file: !1, line: 199, type: !9)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ent", scope: !78, file: !1, line: 200, type: !20)
!87 = !DISubprogram(name: "IVL_equivMap1", scope: !1, file: !1, line: 235, type: !88, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct._IVL*)* @IVL_equivMap1, variables: !90)
!88 = !DISubroutineType(types: !89)
!89 = !{!20, !10}
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !87, file: !1, line: 236, type: !10)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !87, file: !1, line: 238, type: !9)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !87, file: !1, line: 238, type: !9)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !87, file: !1, line: 238, type: !9)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itest", scope: !87, file: !1, line: 238, type: !9)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jtest", scope: !87, file: !1, line: 238, type: !9)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !87, file: !1, line: 238, type: !9)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist2", scope: !87, file: !1, line: 238, type: !9)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntest", scope: !87, file: !1, line: 238, type: !9)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nv2", scope: !87, file: !1, line: 238, type: !9)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !87, file: !1, line: 238, type: !9)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !87, file: !1, line: 239, type: !9)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v2", scope: !87, file: !1, line: 239, type: !9)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsize", scope: !87, file: !1, line: 239, type: !9)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !87, file: !1, line: 239, type: !9)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wsize", scope: !87, file: !1, line: 239, type: !9)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chksum", scope: !87, file: !1, line: 240, type: !20)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "issorted", scope: !87, file: !1, line: 240, type: !20)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !87, file: !1, line: 240, type: !20)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mark", scope: !87, file: !1, line: 240, type: !20)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vadj", scope: !87, file: !1, line: 240, type: !20)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vids", scope: !87, file: !1, line: 240, type: !20)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wadj", scope: !87, file: !1, line: 240, type: !20)
!114 = !DISubprogram(name: "IVL_equivMap2", scope: !1, file: !1, line: 448, type: !115, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._IVL*)* @IVL_equivMap2, variables: !126)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !10}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !119, line: 20, baseType: !120)
!119 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/IVL/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !119, line: 21, size: 192, align: 64, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !120, file: !119, line: 22, baseType: !9, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !120, file: !119, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !120, file: !119, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !120, file: !119, line: 25, baseType: !20, size: 64, align: 64, offset: 128)
!126 = !{!127, !128, !129}
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !114, file: !1, line: 449, type: !10)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !114, file: !1, line: 451, type: !20)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapIV", scope: !114, file: !1, line: 452, type: !117)
!130 = !DISubprogram(name: "IVL_overwrite", scope: !1, file: !1, line: 471, type: !131, isLocal: false, isDefinition: true, scopeLine: 474, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IVL*, %struct._IV*)* @IVL_overwrite, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !10, !117}
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !130, file: !1, line: 472, type: !10)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldToNewIV", arg: 2, scope: !130, file: !1, line: 473, type: !117)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !130, file: !1, line: 475, type: !9)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !130, file: !1, line: 475, type: !9)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !130, file: !1, line: 475, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "range", scope: !130, file: !1, line: 475, type: !9)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !130, file: !1, line: 475, type: !9)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !130, file: !1, line: 476, type: !20)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldToNew", scope: !130, file: !1, line: 476, type: !20)
!143 = !DISubprogram(name: "IVL_mapEntries", scope: !1, file: !1, line: 513, type: !144, isLocal: false, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IVL* (%struct._IVL*, %struct._IV*)* @IVL_mapEntries, variables: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{!10, !10, !117}
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivl", arg: 1, scope: !143, file: !1, line: 514, type: !10)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapIV", arg: 2, scope: !143, file: !1, line: 515, type: !117)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !143, file: !1, line: 517, type: !9)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !143, file: !1, line: 517, type: !9)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !143, file: !1, line: 517, type: !9)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilist", scope: !143, file: !1, line: 517, type: !9)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxsize", scope: !143, file: !1, line: 517, type: !9)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlist", scope: !143, file: !1, line: 517, type: !9)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "range", scope: !143, file: !1, line: 517, type: !9)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !143, file: !1, line: 517, type: !9)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !143, file: !1, line: 517, type: !9)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !143, file: !1, line: 518, type: !20)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !143, file: !1, line: 518, type: !20)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newlist", scope: !143, file: !1, line: 518, type: !20)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newIVL", scope: !143, file: !1, line: 519, type: !10)
