; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_frontETree.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._MSMD = type { i32, %struct._IIheap*, i32, %struct._IP*, %struct._IP*, %struct._MSMDvtx*, %struct._IV, %struct._IV }
%struct._IIheap = type { i32, i32, i32*, i32*, i32* }
%struct._IP = type { i32, %struct._IP* }
%struct._MSMDvtx = type { i32, i8, i8, i32, i32, i32, i32*, i32, %struct._MSMDvtx*, %struct._IP* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A fatal error in MSMD_frontETree(%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define %struct._ETree* @MSMD_frontETree(%struct._MSMD* %msmd) #0 {
  tail call void @llvm.dbg.value(metadata %struct._MSMD* %msmd, i64 0, metadata !87, metadata !106), !dbg !107
  %1 = icmp eq %struct._MSMD* %msmd, null, !dbg !108

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_frontETree.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6}
!6 = !DISubprogram(name: "MSMD_frontETree", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ETree* (%struct._MSMD*)* @MSMD_frontETree, variables: !86)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !41}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !11, line: 31, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !11, line: 32, size: 320, align: 64, elements: !13)
!13 = !{!14, !16, !17, !29, !39, !40}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !12, file: !11, line: 33, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !12, file: !11, line: 34, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !12, file: !11, line: 35, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !20, line: 15, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !20, line: 16, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !27, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !21, file: !20, line: 17, baseType: !15, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !21, file: !20, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !21, file: !20, line: 19, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !21, file: !20, line: 20, baseType: !26, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !21, file: !20, line: 21, baseType: !26, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !12, file: !11, line: 36, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !32, line: 20, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !32, line: 21, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 22, baseType: !15, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !33, file: !32, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !33, file: !32, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !33, file: !32, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !12, file: !11, line: 37, baseType: !30, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !12, file: !11, line: 38, baseType: !30, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMD", file: !43, line: 15, baseType: !44)
!43 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../MSMD.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMD", file: !43, line: 38, size: 768, align: 64, elements: !45)
!45 = !{!46, !47, !58, !59, !67, !68, !84, !85}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !44, file: !43, line: 39, baseType: !15, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !44, file: !43, line: 40, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "IIheap", file: !50, line: 20, baseType: !51)
!50 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../IIheap/IIheap.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IIheap", file: !50, line: 21, size: 256, align: 64, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !51, file: !50, line: 22, baseType: !15, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !51, file: !50, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "heapLoc", scope: !51, file: !50, line: 24, baseType: !26, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !51, file: !50, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !51, file: !50, line: 26, baseType: !26, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "incrIP", scope: !44, file: !43, line: 41, baseType: !15, size: 32, align: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "baseIP", scope: !44, file: !43, line: 42, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP", file: !62, line: 10, baseType: !63)
!62 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../Utilities/IP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IP", file: !62, line: 11, size: 128, align: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !63, file: !62, line: 12, baseType: !15, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !62, line: 13, baseType: !60, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "freeIP", scope: !44, file: !43, line: 43, baseType: !60, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "vertices", scope: !44, file: !43, line: 44, baseType: !69, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMDvtx", file: !43, line: 18, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMDvtx", file: !43, line: 180, size: 448, align: 64, elements: !72)
!72 = !{!73, !74, !76, !77, !78, !79, !80, !81, !82, !83}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !71, file: !43, line: 181, baseType: !15, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !71, file: !43, line: 182, baseType: !75, size: 8, align: 8, offset: 32)
!75 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !71, file: !43, line: 183, baseType: !75, size: 8, align: 8, offset: 40)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !71, file: !43, line: 184, baseType: !15, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "wght", scope: !71, file: !43, line: 185, baseType: !15, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "nadj", scope: !71, file: !43, line: 186, baseType: !15, size: 32, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "adj", scope: !71, file: !43, line: 187, baseType: !26, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bndwght", scope: !71, file: !43, line: 188, baseType: !15, size: 32, align: 32, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !71, file: !43, line: 189, baseType: !69, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "subtrees", scope: !71, file: !43, line: 190, baseType: !60, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ivtmpIV", scope: !44, file: !43, line: 45, baseType: !31, size: 192, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reachIV", scope: !44, file: !43, line: 46, baseType: !31, size: 192, align: 64, offset: 576)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msmd", arg: 1, scope: !6, file: !1, line: 17, type: !41)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etree", scope: !6, file: !1, line: 19, type: !9)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "front", scope: !6, file: !1, line: 20, type: !15)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !6, file: !1, line: 20, type: !15)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !6, file: !1, line: 20, type: !15)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !6, file: !1, line: 20, type: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "root", scope: !6, file: !1, line: 20, type: !15)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !6, file: !1, line: 21, type: !26)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch", scope: !6, file: !1, line: 21, type: !26)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !6, file: !1, line: 21, type: !26)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "par", scope: !6, file: !1, line: 21, type: !26)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib", scope: !6, file: !1, line: 21, type: !26)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !6, file: !1, line: 21, type: !26)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !6, file: !1, line: 22, type: !69)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !6, file: !1, line: 22, type: !69)
!102 = !{i32 2, !"Dwarf Version", i32 2}
!103 = !{i32 2, !"Debug Info Version", i32 700000003}
!104 = !{i32 1, !"PIC Level", i32 2}
!105 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!106 = !DIExpression()
!107 = !DILocation(line: 17, column: 12, scope: !6)
!108 = !DILocation(line: 28, column: 11, scope: !109)
!109 = distinct !DILexicalBlock(scope: !6, file: !1, line: 28, column: 6)
!110 = !DILocation(line: 28, column: 6, scope: !6)
!111 = !DILocation(line: 29, column: 12, scope: !112)
!112 = distinct !DILexicalBlock(scope: !109, file: !1, line: 28, column: 21)
!113 = !{!114, !114, i64 0}
!114 = !{!"any pointer", !115, i64 0}
!115 = !{!"omnipotent char", !116, i64 0}
!116 = !{!"Simple C/C++ TBAA"}
!117 = !DILocation(line: 29, column: 4, scope: !112)
!118 = !DILocation(line: 31, column: 4, scope: !112)
!119 = !DILocation(line: 33, column: 14, scope: !6)
!120 = !{!121, !122, i64 0}
!121 = !{!"_MSMD", !122, i64 0, !114, i64 8, !122, i64 16, !114, i64 24, !114, i64 32, !114, i64 40, !123, i64 48, !123, i64 72}
!122 = !{!"int", !115, i64 0}
!123 = !{!"_IV", !122, i64 0, !122, i64 4, !122, i64 8, !114, i64 16}
!124 = !DILocation(line: 20, column: 30, scope: !6)
!125 = !DILocation(line: 20, column: 22, scope: !6)
!126 = !DILocation(line: 40, column: 7, scope: !6)
!127 = !DILocation(line: 21, column: 23, scope: !6)
!128 = !DILocation(line: 41, column: 7, scope: !6)
!129 = !DILocation(line: 21, column: 46, scope: !6)
!130 = !DILocation(line: 20, column: 36, scope: !6)
!131 = !DILocation(line: 20, column: 18, scope: !6)
!132 = !DILocation(line: 43, column: 25, scope: !133)
!133 = distinct !DILexicalBlock(scope: !6, file: !1, line: 43, column: 1)
!134 = !DILocation(line: 22, column: 12, scope: !6)
!135 = !DILocation(line: 43, column: 39, scope: !136)
!136 = distinct !DILexicalBlock(scope: !133, file: !1, line: 43, column: 1)
!137 = !DILocation(line: 43, column: 1, scope: !133)
!138 = !{!121, !114, i64 40}
!139 = !DILocation(line: 52, column: 16, scope: !140)
!140 = distinct !DILexicalBlock(scope: !136, file: !1, line: 43, column: 60)
!141 = !{!142, !115, i64 5}
