; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_MSMDinfo.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._MSMDinfo = type { i32, i32, double, i32, i32, %struct.__sFILE*, i32, i32, i32, i32, %struct._MSMDstageInfo*, double }
%struct._MSMDstageInfo = type { i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, double }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str1 = private unnamed_addr constant [91 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_MSMDinfo.c\00", align 1
@__stdoutp = external global %struct.__sFILE*
@.str2 = private unnamed_addr constant [51 x i8] c"\0A fatal error in MSMDinfo_print(%p,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [14 x i8] c"\0A\0A MSMDinfo :\00", align 1
@.str4 = private unnamed_addr constant [26 x i8] c"\0A    compressFlag = %d : \00", align 1
@.str5 = private unnamed_addr constant [17 x i8] c"compress graph, \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !103, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_MSMDinfo.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !102, !36, !45}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMDinfo", file: !6, line: 100, size: 512, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../MSMD.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !11, !13, !14, !15, !79, !80, !81, !82, !83, !101}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "compressFlag", scope: !5, file: !6, line: 101, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "prioType", scope: !5, file: !6, line: 102, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "stepType", scope: !5, file: !6, line: 103, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !5, file: !6, line: 104, baseType: !9, size: 32, align: 32, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !5, file: !6, line: 105, baseType: !9, size: 32, align: 32, offset: 160)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !5, file: !6, line: 106, baseType: !16, size: 64, align: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 153, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !18, line: 122, size: 1216, align: 64, elements: !20)
!20 = !{!21, !24, !25, !26, !28, !29, !34, !35, !37, !41, !47, !57, !63, !64, !67, !68, !72, !76, !77, !78}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !19, file: !18, line: 123, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !19, file: !18, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !19, file: !18, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !18, line: 126, baseType: !27, size: 16, align: 16, offset: 128)
!27 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !19, file: !18, line: 127, baseType: !27, size: 16, align: 16, offset: 144)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !19, file: !18, line: 128, baseType: !30, size: 128, align: 64, offset: 192)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !18, line: 88, size: 128, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !30, file: !18, line: 89, baseType: !22, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !30, file: !18, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !19, file: !18, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !19, file: !18, line: 132, baseType: !36, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !19, file: !18, line: 133, baseType: !38, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!9, !36}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !19, file: !18, line: 134, baseType: !42, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!9, !36, !45, !9}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !19, file: !18, line: 135, baseType: !48, size: 64, align: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !36, !51, !9}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !18, line: 77, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !53, line: 71, baseType: !54)
!53 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !55, line: 46, baseType: !56)
!55 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !19, file: !18, line: 136, baseType: !58, size: 64, align: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!9, !36, !61, !9}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !19, file: !18, line: 139, baseType: !30, size: 128, align: 64, offset: 704)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !19, file: !18, line: 140, baseType: !65, size: 64, align: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !18, line: 94, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !19, file: !18, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !19, file: !18, line: 144, baseType: !69, size: 24, align: 8, offset: 928)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 24, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 3)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !19, file: !18, line: 145, baseType: !73, size: 8, align: 8, offset: 952)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !19, file: !18, line: 148, baseType: !30, size: 128, align: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !19, file: !18, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !18, line: 152, baseType: !51, size: 64, align: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "maxnbytes", scope: !5, file: !6, line: 107, baseType: !9, size: 32, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !5, file: !6, line: 108, baseType: !9, size: 32, align: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "istage", scope: !5, file: !6, line: 109, baseType: !9, size: 32, align: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nstage", scope: !5, file: !6, line: 110, baseType: !9, size: 32, align: 32, offset: 352)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stageInfo", scope: !5, file: !6, line: 111, baseType: !84, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMDstageInfo", file: !6, line: 17, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMDstageInfo", file: !6, line: 132, size: 512, align: 64, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nstep", scope: !86, file: !6, line: 133, baseType: !9, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !86, file: !6, line: 134, baseType: !9, size: 32, align: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "welim", scope: !86, file: !6, line: 135, baseType: !9, size: 32, align: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nfind", scope: !86, file: !6, line: 136, baseType: !9, size: 32, align: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nzf", scope: !86, file: !6, line: 137, baseType: !9, size: 32, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !86, file: !6, line: 138, baseType: !12, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nexact2", scope: !86, file: !6, line: 139, baseType: !9, size: 32, align: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nexact3", scope: !86, file: !6, line: 140, baseType: !9, size: 32, align: 32, offset: 288)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "napprox", scope: !86, file: !6, line: 141, baseType: !9, size: 32, align: 32, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ncheck", scope: !86, file: !6, line: 142, baseType: !9, size: 32, align: 32, offset: 352)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nindst", scope: !86, file: !6, line: 143, baseType: !9, size: 32, align: 32, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "noutmtch", scope: !86, file: !6, line: 144, baseType: !9, size: 32, align: 32, offset: 416)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !86, file: !6, line: 145, baseType: !12, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "totalCPU", scope: !5, file: !6, line: 112, baseType: !12, size: 64, align: 64, offset: 448)
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !{!104, !111, !116, !119, !122, !130}
!104 = !DISubprogram(name: "MSMDinfo_new", scope: !1, file: !1, line: 16, type: !105, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: %struct._MSMDinfo* ()* @MSMDinfo_new, variables: !109)
!105 = !DISubroutineType(types: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMDinfo", file: !6, line: 16, baseType: !5)
!109 = !{!110}
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !104, file: !1, line: 19, type: !107)
!111 = !DISubprogram(name: "MSMDinfo_setDefaultFields", scope: !1, file: !1, line: 35, type: !112, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMDinfo*)* @MSMDinfo_setDefaultFields, variables: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !107}
!114 = !{!115}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !111, file: !1, line: 36, type: !107)
!116 = !DISubprogram(name: "MSMDinfo_clearData", scope: !1, file: !1, line: 62, type: !112, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMDinfo*)* @MSMDinfo_clearData, variables: !117)
!117 = !{!118}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !116, file: !1, line: 63, type: !107)
!119 = !DISubprogram(name: "MSMDinfo_free", scope: !1, file: !1, line: 81, type: !112, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMDinfo*)* @MSMDinfo_free, variables: !120)
!120 = !{!121}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !119, file: !1, line: 82, type: !107)
!122 = !DISubprogram(name: "MSMDinfo_print", scope: !1, file: !1, line: 98, type: !123, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMDinfo*, %struct.__sFILE*)* @MSMDinfo_print, variables: !125)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !107, !16}
!125 = !{!126, !127, !128, !129}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !122, file: !1, line: 99, type: !107)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !122, file: !1, line: 100, type: !16)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istage", scope: !122, file: !1, line: 102, type: !9)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stageinfo", scope: !122, file: !1, line: 103, type: !84)
!130 = !DISubprogram(name: "MSMDinfo_isValid", scope: !1, file: !1, line: 195, type: !131, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._MSMDinfo*)* @MSMDinfo_isValid, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!9, !107}
!133 = !{!134, !135}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !130, file: !1, line: 196, type: !107)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !130, file: !1, line: 198, type: !9)
!136 = !{i32 2, !"Dwarf Version", i32 2}
!137 = !{i32 2, !"Debug Info Version", i32 700000003}
!138 = !{i32 1, !"PIC Level", i32 2}
!139 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!140 = !DILocation(line: 21, column: 1, scope: !141)
!141 = distinct !DILexicalBlock(scope: !142, file: !1, line: 21, column: 1)
!142 = distinct !DILexicalBlock(scope: !143, file: !1, line: 21, column: 1)
!143 = distinct !DILexicalBlock(scope: !104, file: !1, line: 21, column: 1)
!144 = !DIExpression()
