; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_basics.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._MSMD = type { i32, %struct._IIheap*, i32, %struct._IP*, %struct._IP*, %struct._MSMDvtx*, %struct._IV, %struct._IV }
%struct._IIheap = type { i32, i32, i32*, i32*, i32* }
%struct._IP = type { i32, %struct._IP* }
%struct._MSMDvtx = type { i32, i8, i8, i32, i32, i32, i32*, i32, %struct._MSMDvtx*, %struct._IP* }
%struct._IV = type { i32, i32, i32, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str1 = private unnamed_addr constant [89 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_basics.c\00", align 1
@.str2 = private unnamed_addr constant [48 x i8] c"\0A fatal error in MSMD_clearData(%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define %struct._MSMD* @MSMD_new() #0 {
  %1 = tail call i8* @malloc(i64 96) #6, !dbg !88

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !61, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_basics.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !58, !59, !60}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMD", file: !6, line: 38, size: 768, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../MSMD.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !22, !23, !31, !32, !48, !57}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !5, file: !6, line: 39, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !5, file: !6, line: 40, baseType: !11, size: 64, align: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "IIheap", file: !13, line: 20, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../IIheap/IIheap.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IIheap", file: !13, line: 21, size: 256, align: 64, elements: !15)
!15 = !{!16, !17, !18, !20, !21}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !14, file: !13, line: 22, baseType: !9, size: 32, align: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !14, file: !13, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "heapLoc", scope: !14, file: !13, line: 24, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !14, file: !13, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !14, file: !13, line: 26, baseType: !19, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "incrIP", scope: !5, file: !6, line: 41, baseType: !9, size: 32, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "baseIP", scope: !5, file: !6, line: 42, baseType: !24, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP", file: !26, line: 10, baseType: !27)
!26 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../Utilities/IP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IP", file: !26, line: 11, size: 128, align: 64, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !27, file: !26, line: 12, baseType: !9, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !26, line: 13, baseType: !24, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "freeIP", scope: !5, file: !6, line: 43, baseType: !24, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "vertices", scope: !5, file: !6, line: 44, baseType: !33, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMDvtx", file: !6, line: 18, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMDvtx", file: !6, line: 180, size: 448, align: 64, elements: !36)
!36 = !{!37, !38, !40, !41, !42, !43, !44, !45, !46, !47}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !35, file: !6, line: 181, baseType: !9, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !35, file: !6, line: 182, baseType: !39, size: 8, align: 8, offset: 32)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !35, file: !6, line: 183, baseType: !39, size: 8, align: 8, offset: 40)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !35, file: !6, line: 184, baseType: !9, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "wght", scope: !35, file: !6, line: 185, baseType: !9, size: 32, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nadj", scope: !35, file: !6, line: 186, baseType: !9, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "adj", scope: !35, file: !6, line: 187, baseType: !19, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "bndwght", scope: !35, file: !6, line: 188, baseType: !9, size: 32, align: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !35, file: !6, line: 189, baseType: !33, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "subtrees", scope: !35, file: !6, line: 190, baseType: !24, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ivtmpIV", scope: !5, file: !6, line: 45, baseType: !49, size: 192, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !50, line: 20, baseType: !51)
!50 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !50, line: 21, size: 192, align: 64, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !51, file: !50, line: 22, baseType: !9, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !51, file: !50, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !51, file: !50, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !51, file: !50, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "reachIV", scope: !5, file: !6, line: 46, baseType: !49, size: 192, align: 64, offset: 576)
!58 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!61 = !{!62, !69, !74, !81}
!62 = !DISubprogram(name: "MSMD_new", scope: !1, file: !1, line: 16, type: !63, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: %struct._MSMD* ()* @MSMD_new, variables: !67)
!63 = !DISubroutineType(types: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMD", file: !6, line: 15, baseType: !5)
!67 = !{!68}
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msmd", scope: !62, file: !1, line: 19, type: !65)
!69 = !DISubprogram(name: "MSMD_setDefaultFields", scope: !1, file: !1, line: 35, type: !70, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMD*)* @MSMD_setDefaultFields, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !65}
!72 = !{!73}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msmd", arg: 1, scope: !69, file: !1, line: 36, type: !65)
!74 = !DISubprogram(name: "MSMD_clearData", scope: !1, file: !1, line: 58, type: !70, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMD*)* @MSMD_clearData, variables: !75)
!75 = !{!76, !77, !78, !79, !80}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msmd", arg: 1, scope: !74, file: !1, line: 59, type: !65)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !74, file: !1, line: 61, type: !24)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !74, file: !1, line: 62, type: !33)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !74, file: !1, line: 62, type: !33)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !74, file: !1, line: 62, type: !33)
!81 = !DISubprogram(name: "MSMD_free", scope: !1, file: !1, line: 113, type: !70, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMD*)* @MSMD_free, variables: !82)
!82 = !{!83}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msmd", arg: 1, scope: !81, file: !1, line: 114, type: !65)
!84 = !{i32 2, !"Dwarf Version", i32 2}
!85 = !{i32 2, !"Debug Info Version", i32 700000003}
!86 = !{i32 1, !"PIC Level", i32 2}
!87 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!88 = !DILocation(line: 21, column: 1, scope: !89)
!89 = distinct !DILexicalBlock(scope: !90, file: !1, line: 21, column: 1)
!90 = distinct !DILexicalBlock(scope: !91, file: !1, line: 21, column: 1)
!91 = distinct !DILexicalBlock(scope: !62, file: !1, line: 21, column: 1)
!92 = !DIExpression()
!93 = !DILocation(line: 19, column: 9, scope: !62)
!94 = !DILocation(line: 21, column: 1, scope: !90)
!95 = !DILocation(line: 21, column: 1, scope: !96)
!96 = distinct !DILexicalBlock(scope: !89, file: !1, line: 21, column: 1)
!97 = !{!98, !98, i64 0}
!98 = !{!"any pointer", !99, i64 0}
!99 = !{!"omnipotent char", !100, i64 0}
!100 = !{!"Simple C/C++ TBAA"}
!101 = !DILocation(line: 36, column: 12, scope: !69, inlinedAt: !102)
!102 = distinct !DILocation(line: 22, column: 1, scope: !62)
!103 = !DILocation(line: 38, column: 7, scope: !69, inlinedAt: !102)
!104 = !DILocation(line: 38, column: 17, scope: !69, inlinedAt: !102)
!105 = !{!106, !107, i64 0}
!106 = !{!"_MSMD", !107, i64 0, !98, i64 8, !107, i64 16, !98, i64 24, !98, i64 32, !98, i64 40, !108, i64 48, !108, i64 72}
!107 = !{!"int", !99, i64 0}
!108 = !{!"_IV", !107, i64 0, !107, i64 4, !107, i64 8, !98, i64 16}
