; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_eliminate.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._MSMD = type { i32, %struct._IIheap*, i32, %struct._IP*, %struct._IP*, %struct._MSMDvtx*, %struct._IV, %struct._IV }
%struct._IIheap = type { i32, i32, i32*, i32*, i32* }
%struct._IP = type { i32, %struct._IP* }
%struct._MSMDvtx = type { i32, i8, i8, i32, i32, i32, i32*, i32, %struct._MSMDvtx*, %struct._IP* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._MSMDinfo = type { i32, i32, double, i32, i32, %struct.__sFILE*, i32, i32, i32, i32, %struct._MSMDstageInfo*, double }
%struct._MSMDstageInfo = type { i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, double }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [56 x i8] c"\0A fatal error in MSMD_eliminateStage(%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [26 x i8] c"\0A after loading reach set\00", align 1
@.str2 = private unnamed_addr constant [24 x i8] c"\0A reach set at stage %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/MSMD_eliminate.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!7 = !{!8, !174, !189}
!8 = !DISubprogram(name: "MSMD_eliminateStage", scope: !1, file: !1, line: 14, type: !9, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMD*, %struct._MSMDinfo*)* @MSMD_eliminateStage, variables: !159)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !65}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMD", file: !13, line: 15, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../MSMD.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMD", file: !13, line: 38, size: 768, align: 64, elements: !15)
!15 = !{!16, !17, !29, !30, !38, !39, !55, !64}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !14, file: !13, line: 39, baseType: !5, size: 32, align: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !14, file: !13, line: 40, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "IIheap", file: !20, line: 20, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../IIheap/IIheap.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IIheap", file: !20, line: 21, size: 256, align: 64, elements: !22)
!22 = !{!23, !24, !25, !27, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !20, line: 22, baseType: !5, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !21, file: !20, line: 23, baseType: !5, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "heapLoc", scope: !21, file: !20, line: 24, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !21, file: !20, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !21, file: !20, line: 26, baseType: !26, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "incrIP", scope: !14, file: !13, line: 41, baseType: !5, size: 32, align: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "baseIP", scope: !14, file: !13, line: 42, baseType: !31, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP", file: !33, line: 10, baseType: !34)
!33 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../Utilities/IP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IP", file: !33, line: 11, size: 128, align: 64, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !34, file: !33, line: 12, baseType: !5, size: 32, align: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 13, baseType: !31, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "freeIP", scope: !14, file: !13, line: 43, baseType: !31, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "vertices", scope: !14, file: !13, line: 44, baseType: !40, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMDvtx", file: !13, line: 18, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMDvtx", file: !13, line: 180, size: 448, align: 64, elements: !43)
!43 = !{!44, !45, !47, !48, !49, !50, !51, !52, !53, !54}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !42, file: !13, line: 181, baseType: !5, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !42, file: !13, line: 182, baseType: !46, size: 8, align: 8, offset: 32)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !42, file: !13, line: 183, baseType: !46, size: 8, align: 8, offset: 40)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !42, file: !13, line: 184, baseType: !5, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "wght", scope: !42, file: !13, line: 185, baseType: !5, size: 32, align: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nadj", scope: !42, file: !13, line: 186, baseType: !5, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "adj", scope: !42, file: !13, line: 187, baseType: !26, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bndwght", scope: !42, file: !13, line: 188, baseType: !5, size: 32, align: 32, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !42, file: !13, line: 189, baseType: !40, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "subtrees", scope: !42, file: !13, line: 190, baseType: !31, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ivtmpIV", scope: !14, file: !13, line: 45, baseType: !56, size: 192, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !57, line: 20, baseType: !58)
!57 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/MSMD/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !57, line: 21, size: 192, align: 64, elements: !59)
!59 = !{!60, !61, !62, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !58, file: !57, line: 22, baseType: !5, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !58, file: !57, line: 23, baseType: !5, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !58, file: !57, line: 24, baseType: !5, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !58, file: !57, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reachIV", scope: !14, file: !13, line: 46, baseType: !56, size: 192, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMDinfo", file: !13, line: 16, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMDinfo", file: !13, line: 100, size: 512, align: 64, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !136, !137, !138, !139, !140, !158}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "compressFlag", scope: !67, file: !13, line: 101, baseType: !5, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prioType", scope: !67, file: !13, line: 102, baseType: !5, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "stepType", scope: !67, file: !13, line: 103, baseType: !6, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !67, file: !13, line: 104, baseType: !5, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !67, file: !13, line: 105, baseType: !5, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !67, file: !13, line: 106, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 153, baseType: !78)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !77, line: 122, size: 1216, align: 64, elements: !79)
!79 = !{!80, !83, !84, !85, !87, !88, !93, !94, !95, !99, !104, !114, !120, !121, !124, !125, !129, !133, !134, !135}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !78, file: !77, line: 123, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !78, file: !77, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !78, file: !77, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !77, line: 126, baseType: !86, size: 16, align: 16, offset: 128)
!86 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !78, file: !77, line: 127, baseType: !86, size: 16, align: 16, offset: 144)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !78, file: !77, line: 128, baseType: !89, size: 128, align: 64, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !77, line: 88, size: 128, align: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !89, file: !77, line: 89, baseType: !81, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !89, file: !77, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !78, file: !77, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !78, file: !77, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !78, file: !77, line: 133, baseType: !96, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!5, !4}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !78, file: !77, line: 134, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!5, !4, !103, !5}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !78, file: !77, line: 135, baseType: !105, size: 64, align: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !4, !108, !5}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !77, line: 77, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !110, line: 71, baseType: !111)
!110 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !112, line: 46, baseType: !113)
!112 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!113 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !78, file: !77, line: 136, baseType: !115, size: 64, align: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !4, !118, !5}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !78, file: !77, line: 139, baseType: !89, size: 128, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !78, file: !77, line: 140, baseType: !122, size: 64, align: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !77, line: 94, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !78, file: !77, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !78, file: !77, line: 144, baseType: !126, size: 24, align: 8, offset: 928)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 24, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !78, file: !77, line: 145, baseType: !130, size: 8, align: 8, offset: 952)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !78, file: !77, line: 148, baseType: !89, size: 128, align: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !78, file: !77, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !77, line: 152, baseType: !108, size: 64, align: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "maxnbytes", scope: !67, file: !13, line: 107, baseType: !5, size: 32, align: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !67, file: !13, line: 108, baseType: !5, size: 32, align: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "istage", scope: !67, file: !13, line: 109, baseType: !5, size: 32, align: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nstage", scope: !67, file: !13, line: 110, baseType: !5, size: 32, align: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "stageInfo", scope: !67, file: !13, line: 111, baseType: !141, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSMDstageInfo", file: !13, line: 17, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MSMDstageInfo", file: !13, line: 132, size: 512, align: 64, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nstep", scope: !143, file: !13, line: 133, baseType: !5, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !143, file: !13, line: 134, baseType: !5, size: 32, align: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "welim", scope: !143, file: !13, line: 135, baseType: !5, size: 32, align: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nfind", scope: !143, file: !13, line: 136, baseType: !5, size: 32, align: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nzf", scope: !143, file: !13, line: 137, baseType: !5, size: 32, align: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !143, file: !13, line: 138, baseType: !6, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nexact2", scope: !143, file: !13, line: 139, baseType: !5, size: 32, align: 32, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nexact3", scope: !143, file: !13, line: 140, baseType: !5, size: 32, align: 32, offset: 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "napprox", scope: !143, file: !13, line: 141, baseType: !5, size: 32, align: 32, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ncheck", scope: !143, file: !13, line: 142, baseType: !5, size: 32, align: 32, offset: 352)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nindst", scope: !143, file: !13, line: 143, baseType: !5, size: 32, align: 32, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "noutmtch", scope: !143, file: !13, line: 144, baseType: !5, size: 32, align: 32, offset: 416)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !143, file: !13, line: 145, baseType: !6, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "totalCPU", scope: !67, file: !13, line: 112, baseType: !6, size: 64, align: 64, offset: 448)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !173}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msmd", arg: 1, scope: !8, file: !1, line: 15, type: !11)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 2, scope: !8, file: !1, line: 16, type: !65)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !8, file: !1, line: 18, type: !5)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !8, file: !1, line: 18, type: !5)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !8, file: !1, line: 18, type: !5)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !8, file: !1, line: 18, type: !5)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nelim", scope: !8, file: !1, line: 18, type: !5)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nreach", scope: !8, file: !1, line: 18, type: !5)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stage", scope: !8, file: !1, line: 18, type: !5)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !8, file: !1, line: 18, type: !5)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reach", scope: !8, file: !1, line: 19, type: !26)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reachIV", scope: !8, file: !1, line: 20, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !8, file: !1, line: 21, type: !40)
!174 = !DISubprogram(name: "MSMD_eliminateStep", scope: !1, file: !1, line: 186, type: !175, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._MSMD*, %struct._MSMDinfo*)* @MSMD_eliminateStep, variables: !177)
!175 = !DISubroutineType(types: !176)
!176 = !{!5, !11, !65}
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msmd", arg: 1, scope: !174, file: !1, line: 187, type: !11)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 2, scope: !174, file: !1, line: 188, type: !65)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deg", scope: !174, file: !1, line: 190, type: !5)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxdeg", scope: !174, file: !1, line: 190, type: !5)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mindeg", scope: !174, file: !1, line: 190, type: !5)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !174, file: !1, line: 190, type: !5)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nelim", scope: !174, file: !1, line: 190, type: !5)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !174, file: !1, line: 190, type: !5)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vid", scope: !174, file: !1, line: 190, type: !5)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !174, file: !1, line: 190, type: !5)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !174, file: !1, line: 191, type: !40)
!189 = !DISubprogram(name: "MSMD_eliminateVtx", scope: !1, file: !1, line: 304, type: !190, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._MSMD*, %struct._MSMDvtx*, %struct._MSMDinfo*)* @MSMD_eliminateVtx, variables: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !11, !40, !65}
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msmd", arg: 1, scope: !189, file: !1, line: 305, type: !11)
