; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Network/src/Network_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Network = type { i32, i32, i32, %struct._Arc**, %struct._Arc**, %struct._ArcChunk*, i32, %struct.__sFILE* }
%struct._Arc = type { i32, i32, i32, i32, %struct._Arc*, %struct._Arc* }
%struct._ArcChunk = type { i32, i32, %struct._Arc*, %struct._ArcChunk* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [52 x i8] c"\0A fatal error in Network_init(%p,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str2 = private unnamed_addr constant [93 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Network/src/Network_init.c\00", align 1
@.str3 = private unnamed_addr constant [47 x i8] c"\0A ALLOCATE error : bytes %zd, line %d, file %s\00", align 1
@.str4 = private unnamed_addr constant [62 x i8] c"\0A fatal error in Network_setMessageInfo(%p,%d,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !29, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Network/src/Network_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !19, !20, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Arc", file: !8, line: 53, size: 256, align: 64, elements: !9)
!8 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Network/src/../Network.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !{!10, !12, !13, !14, !15, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !7, file: !8, line: 54, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !7, file: !8, line: 55, baseType: !11, size: 32, align: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !7, file: !8, line: 56, baseType: !11, size: 32, align: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !7, file: !8, line: 57, baseType: !11, size: 32, align: 32, offset: 96)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nextOut", scope: !7, file: !8, line: 58, baseType: !16, size: 64, align: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Arc", file: !8, line: 13, baseType: !7)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nextIn", scope: !7, file: !8, line: 59, baseType: !16, size: 64, align: 64, offset: 192)
!19 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ArcChunk", file: !8, line: 74, size: 192, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !8, line: 75, baseType: !11, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !21, file: !8, line: 76, baseType: !11, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !21, file: !8, line: 77, baseType: !16, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !8, line: 78, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ArcChunk", file: !8, line: 14, baseType: !21)
!29 = !{!30, !116}
!30 = !DISubprogram(name: "Network_init", scope: !1, file: !1, line: 20, type: !31, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Network*, i32, i32)* @Network_init, variables: !108)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33, !11, !11}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Network", file: !8, line: 12, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Network", file: !8, line: 34, size: 448, align: 64, elements: !36)
!36 = !{!37, !38, !39, !40, !42, !43, !44, !45}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nnode", scope: !35, file: !8, line: 35, baseType: !11, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "narc", scope: !35, file: !8, line: 36, baseType: !11, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ntrav", scope: !35, file: !8, line: 37, baseType: !11, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "inheads", scope: !35, file: !8, line: 38, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "outheads", scope: !35, file: !8, line: 39, baseType: !41, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !35, file: !8, line: 40, baseType: !27, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "msglvl", scope: !35, file: !8, line: 41, baseType: !11, size: 32, align: 32, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "msgFile", scope: !35, file: !8, line: 42, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !48, line: 153, baseType: !49)
!48 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !48, line: 122, size: 1216, align: 64, elements: !50)
!50 = !{!51, !54, !55, !56, !58, !59, !64, !65, !66, !70, !76, !86, !92, !93, !96, !97, !101, !105, !106, !107}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !49, file: !48, line: 123, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !49, file: !48, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !49, file: !48, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !49, file: !48, line: 126, baseType: !57, size: 16, align: 16, offset: 128)
!57 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !49, file: !48, line: 127, baseType: !57, size: 16, align: 16, offset: 144)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !49, file: !48, line: 128, baseType: !60, size: 128, align: 64, offset: 192)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !48, line: 88, size: 128, align: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !60, file: !48, line: 89, baseType: !52, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !60, file: !48, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !49, file: !48, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !49, file: !48, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !49, file: !48, line: 133, baseType: !67, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!11, !4}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !49, file: !48, line: 134, baseType: !71, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!11, !4, !74, !11}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !49, file: !48, line: 135, baseType: !77, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !4, !80, !11}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !48, line: 77, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !82, line: 71, baseType: !83)
!82 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !84, line: 46, baseType: !85)
!84 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !49, file: !48, line: 136, baseType: !87, size: 64, align: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!11, !4, !90, !11}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !49, file: !48, line: 139, baseType: !60, size: 128, align: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !49, file: !48, line: 140, baseType: !94, size: 64, align: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !48, line: 94, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !49, file: !48, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !49, file: !48, line: 144, baseType: !98, size: 24, align: 8, offset: 928)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 24, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 3)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !49, file: !48, line: 145, baseType: !102, size: 8, align: 8, offset: 952)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !49, file: !48, line: 148, baseType: !60, size: 128, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !49, file: !48, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !49, file: !48, line: 152, baseType: !80, size: 64, align: 64, offset: 1152)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "network", arg: 1, scope: !30, file: !1, line: 21, type: !33)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnode", arg: 2, scope: !30, file: !1, line: 22, type: !11)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "narc", arg: 3, scope: !30, file: !1, line: 23, type: !11)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !30, file: !1, line: 25, type: !11)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunk", scope: !114, file: !1, line: 54, type: !27)
!114 = distinct !DILexicalBlock(scope: !115, file: !1, line: 53, column: 17)
!115 = distinct !DILexicalBlock(scope: !30, file: !1, line: 53, column: 6)
!116 = !DISubprogram(name: "Network_setMessageInfo", scope: !1, file: !1, line: 78, type: !117, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Network*, i32, %struct.__sFILE*)* @Network_setMessageInfo, variables: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !33, !11, !46}
!119 = !{!120, !121, !122}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "network", arg: 1, scope: !116, file: !1, line: 79, type: !33)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msglvl", arg: 2, scope: !116, file: !1, line: 80, type: !11)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgFile", arg: 3, scope: !116, file: !1, line: 81, type: !46)
!123 = !{i32 2, !"Dwarf Version", i32 2}
!124 = !{i32 2, !"Debug Info Version", i32 700000003}
!125 = !{i32 1, !"PIC Level", i32 2}
!126 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!127 = !DIExpression()
!128 = !DILocation(line: 21, column: 15, scope: !30)
!129 = !DILocation(line: 22, column: 14, scope: !30)
!130 = !DILocation(line: 23, column: 14, scope: !30)
!131 = !DILocation(line: 31, column: 14, scope: !132)
!132 = distinct !DILexicalBlock(scope: !30, file: !1, line: 31, column: 6)
!133 = !DILocation(line: 31, column: 31, scope: !132)
!134 = !DILocation(line: 31, column: 22, scope: !132)
!135 = !DILocation(line: 31, column: 44, scope: !132)
!136 = !DILocation(line: 32, column: 12, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !1, line: 31, column: 50)
!138 = !{!139, !139, i64 0}
!139 = !{!"any pointer", !140, i64 0}
!140 = !{!"omnipotent char", !141, i64 0}
!141 = !{!"Simple C/C++ TBAA"}
!142 = !DILocation(line: 32, column: 4, scope: !137)
!143 = !DILocation(line: 34, column: 4, scope: !137)
!144 = !DILocation(line: 41, column: 1, scope: !30)
!145 = !DILocation(line: 42, column: 10, scope: !30)
!146 = !DILocation(line: 42, column: 16, scope: !30)
!147 = !{!148, !149, i64 0}
!148 = !{!"_Network", !149, i64 0, !149, i64 4, !149, i64 8, !139, i64 16, !139, i64 24, !139, i64 32, !149, i64 40, !139, i64 48}
!149 = !{!"int", !140, i64 0}
!150 = !DILocation(line: 48, column: 1, scope: !151)
!151 = distinct !DILexicalBlock(scope: !30, file: !1, line: 48, column: 1)
!152 = !DILocation(line: 48, column: 1, scope: !30)
!153 = !DILocation(line: 48, column: 1, scope: !154)
!154 = distinct !DILexicalBlock(scope: !155, file: !1, line: 48, column: 1)
!155 = distinct !DILexicalBlock(scope: !151, file: !1, line: 48, column: 1)
!156 = !{!148, !139, i64 16}
!157 = !DILocation(line: 48, column: 1, scope: !155)
!158 = !DILocation(line: 48, column: 1, scope: !159)
!159 = distinct !DILexicalBlock(scope: !154, file: !1, line: 48, column: 1)
!160 = !DILocation(line: 48, column: 1, scope: !161)
!161 = distinct !DILexicalBlock(scope: !151, file: !1, line: 48, column: 1)
!162 = !DILocation(line: 48, column: 1, scope: !163)
!163 = distinct !DILexicalBlock(scope: !161, file: !1, line: 48, column: 1)
!164 = !DILocation(line: 49, column: 1, scope: !165)
!165 = distinct !DILexicalBlock(scope: !166, file: !1, line: 49, column: 1)
