; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_sort.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [51 x i8] c"\0A fatal error in SubMtx_sortRowsUp(%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [94 x i8] c"\0A fatal error in SubMtx_sortRowsUp(%p)\0A bad type %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1
@.str2 = private unnamed_addr constant [54 x i8] c"\0A fatal error in SubMtx_sortRowsUp(%p)\0A bad type = %d\00", align 1
@.str3 = private unnamed_addr constant [57 x i8] c"\0A fatal error in SubMtx_sortColumnsUp(%p)\0A bad type = %d\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define void @SubMtx_sortRowsUp(%struct._SubMtx* %mtx) #0 {
  %a2 = alloca %struct._A2, align 8
  %entries = alloca double*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_sort.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !73}
!6 = !DISubprogram(name: "SubMtx_sortRowsUp", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*)* @SubMtx_sortRowsUp, variables: !35)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !11, line: 43, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !11, line: 44, size: 576, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !25, !34}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 45, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !12, file: !11, line: 46, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !12, file: !11, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !12, file: !11, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !12, file: !11, line: 49, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !12, file: !11, line: 50, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 52, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 53, baseType: !26, size: 192, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !27, line: 20, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !27, line: 21, size: 192, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !27, line: 22, baseType: !15, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !28, file: !27, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !28, file: !27, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !28, file: !27, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 54, baseType: !9, size: 64, align: 64, offset: 512)
!35 = !{!36, !37, !51, !52, !53, !54, !55, !56, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !6, file: !1, line: 17, type: !9)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !38, file: !1, line: 38, type: !40)
!38 = distinct !DILexicalBlock(scope: !39, file: !1, line: 37, column: 29)
!39 = distinct !DILexicalBlock(scope: !6, file: !1, line: 35, column: 22)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !41, line: 49, baseType: !42)
!41 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../A2/A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !41, line: 41, size: 256, align: 64, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !41, line: 42, baseType: !15, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !42, file: !41, line: 43, baseType: !15, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !42, file: !41, line: 44, baseType: !15, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !42, file: !41, line: 45, baseType: !15, size: 32, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !42, file: !41, line: 46, baseType: !15, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !42, file: !41, line: 47, baseType: !15, size: 32, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !42, file: !41, line: 48, baseType: !23, size: 64, align: 64, offset: 192)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !38, file: !1, line: 39, type: !23)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !38, file: !1, line: 40, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !38, file: !1, line: 40, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !38, file: !1, line: 40, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !38, file: !1, line: 40, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !38, file: !1, line: 41, type: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !59, file: !1, line: 50, type: !23)
!59 = distinct !DILexicalBlock(scope: !39, file: !1, line: 49, column: 27)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !59, file: !1, line: 51, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !59, file: !1, line: 51, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrow", scope: !59, file: !1, line: 51, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !59, file: !1, line: 51, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !59, file: !1, line: 51, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !59, file: !1, line: 51, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !59, file: !1, line: 51, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowid", scope: !59, file: !1, line: 51, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !59, file: !1, line: 51, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !59, file: !1, line: 52, type: !57)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivtemp", scope: !59, file: !1, line: 52, type: !57)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !59, file: !1, line: 52, type: !57)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !59, file: !1, line: 52, type: !57)
!73 = !DISubprogram(name: "SubMtx_sortColumnsUp", scope: !1, file: !1, line: 166, type: !7, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*)* @SubMtx_sortColumnsUp, variables: !74)
!74 = !{!75, !76, !79, !80, !81, !82, !83, !84, !85, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !73, file: !1, line: 167, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !77, file: !1, line: 172, type: !40)
!77 = distinct !DILexicalBlock(scope: !78, file: !1, line: 171, column: 29)
!78 = distinct !DILexicalBlock(scope: !73, file: !1, line: 169, column: 22)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !77, file: !1, line: 173, type: !23)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !77, file: !1, line: 174, type: !15)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !77, file: !1, line: 174, type: !15)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !77, file: !1, line: 174, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !77, file: !1, line: 174, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !77, file: !1, line: 175, type: !57)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !86, file: !1, line: 184, type: !23)
