; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_instance.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [50 x i8] c"\0A fatal error in SubMtx_ids(%p,%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [50 x i8] c"\0A fatal error in SubMtx_ids(%p,%d,%d)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [53 x i8] c"\0A fatal error in SubMtx_ids(%p,%p,%p,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [65 x i8] c"\0A fatal error in SubMtx_denseInfo(%p,%p,%p,%p,%p,%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [108 x i8] c"\0A fatal error in SubMtx_denseInfo(%p,%p,%p,%p,%p,%p)\0A bad type %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_instance.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{!8, !40, !48, !56, !64, !69, !82, !95, !106, !118, !129, !140, !150, !162, !246, !331, !403}
!8 = !DISubprogram(name: "SubMtx_ids", scope: !1, file: !1, line: 15, type: !9, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32*, i32*)* @SubMtx_ids, variables: !36)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !5, !5}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !13, line: 43, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !13, line: 44, size: 576, align: 64, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !26, !35}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !14, file: !13, line: 45, baseType: !6, size: 32, align: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !14, file: !13, line: 46, baseType: !6, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !14, file: !13, line: 47, baseType: !6, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !14, file: !13, line: 48, baseType: !6, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !14, file: !13, line: 49, baseType: !6, size: 32, align: 32, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !14, file: !13, line: 50, baseType: !6, size: 32, align: 32, offset: 160)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !14, file: !13, line: 51, baseType: !6, size: 32, align: 32, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !14, file: !13, line: 52, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !14, file: !13, line: 53, baseType: !27, size: 192, align: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !28, line: 20, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !28, line: 21, size: 192, align: 64, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !29, file: !28, line: 22, baseType: !6, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !29, file: !28, line: 23, baseType: !6, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !29, file: !28, line: 24, baseType: !6, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !29, file: !28, line: 25, baseType: !24, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 54, baseType: !11, size: 64, align: 64, offset: 512)
!36 = !{!37, !38, !39}
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !8, file: !1, line: 16, type: !11)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prowid", arg: 2, scope: !8, file: !1, line: 17, type: !5)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pcolid", arg: 3, scope: !8, file: !1, line: 18, type: !5)
!40 = !DISubprogram(name: "SubMtx_setIds", scope: !1, file: !1, line: 45, type: !41, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32, i32)* @SubMtx_setIds, variables: !43)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !11, !6, !6}
!43 = !{!44, !45, !46, !47}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !40, file: !1, line: 46, type: !11)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowid", arg: 2, scope: !40, file: !1, line: 47, type: !6)
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colid", arg: 3, scope: !40, file: !1, line: 48, type: !6)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !40, file: !1, line: 50, type: !5)
!48 = !DISubprogram(name: "SubMtx_dimensions", scope: !1, file: !1, line: 79, type: !49, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32*, i32*, i32*)* @SubMtx_dimensions, variables: !51)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !11, !5, !5, !5}
!51 = !{!52, !53, !54, !55}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !48, file: !1, line: 80, type: !11)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnrow", arg: 2, scope: !48, file: !1, line: 81, type: !5)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pncol", arg: 3, scope: !48, file: !1, line: 82, type: !5)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnent", arg: 4, scope: !48, file: !1, line: 83, type: !5)
!56 = !DISubprogram(name: "SubMtx_rowIndices", scope: !1, file: !1, line: 115, type: !57, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32*, i32**)* @SubMtx_rowIndices, variables: !60)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !11, !5, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!60 = !{!61, !62, !63}
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !56, file: !1, line: 116, type: !11)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pnrow", arg: 2, scope: !56, file: !1, line: 117, type: !5)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prowind", arg: 3, scope: !56, file: !1, line: 118, type: !59)
!64 = !DISubprogram(name: "SubMtx_columnIndices", scope: !1, file: !1, line: 139, type: !57, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32*, i32**)* @SubMtx_columnIndices, variables: !65)
!65 = !{!66, !67, !68}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !64, file: !1, line: 140, type: !11)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pncol", arg: 2, scope: !64, file: !1, line: 141, type: !5)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pcolind", arg: 3, scope: !64, file: !1, line: 142, type: !59)
!69 = !DISubprogram(name: "SubMtx_denseInfo", scope: !1, file: !1, line: 164, type: !70, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32*, i32*, i32*, i32*, double**)* @SubMtx_denseInfo, variables: !73)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !11, !5, !5, !5, !5, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
