; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_scalevec.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [56 x i8] c"\0A fatal error in SubMtx_scale1vec(%p,%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [99 x i8] c"\0A fatal error in SubMtx_scale1vec(%p,%p,%p)\0A bad type %d, must be SPOOLES_REAL or SPOOLES_COMPLEX\0A\00", align 1
@.str2 = private unnamed_addr constant [95 x i8] c"\0A fatal error in SubMtx_scale1vec(%p,%p,%p)\0A hermitian matrix, type %d is not SPOOLES_COMPLEX\0A\00", align 1
@.str3 = private unnamed_addr constant [161 x i8] c"\0A fatal error in SubMtx_scale1vec()\0A matrix mode not supported\0A must be SUBMTX_DIAGONAL,\0A      or SUBMTX_BLOCK_DIAGONAL_SYM\0A      or SUBMTX_BLOCK_DIAGONAL_HERM\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_scalevec.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !39, !48, !59, !87, !111, !131, !214, !285, !345, !400, !447}
!6 = !DISubprogram(name: "SubMtx_scale1vec", scope: !1, file: !1, line: 33, type: !7, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, double*, double*)* @SubMtx_scale1vec, variables: !35)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !23, !23}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !11, line: 43, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !11, line: 44, size: 576, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !25, !34}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 45, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !12, file: !11, line: 46, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !12, file: !11, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !12, file: !11, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !12, file: !11, line: 49, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !12, file: !11, line: 50, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 52, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 53, baseType: !26, size: 192, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !27, line: 20, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !27, line: 21, size: 192, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !27, line: 22, baseType: !15, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !28, file: !27, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !28, file: !27, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !28, file: !27, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 54, baseType: !9, size: 64, align: 64, offset: 512)
!35 = !{!36, !37, !38}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 1, scope: !6, file: !1, line: 34, type: !9)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y0", arg: 2, scope: !6, file: !1, line: 35, type: !23)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x0", arg: 3, scope: !6, file: !1, line: 36, type: !23)
!39 = !DISubprogram(name: "SubMtx_scale2vec", scope: !1, file: !1, line: 89, type: !40, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, double*, double*, double*, double*)* @SubMtx_scale2vec, variables: !42)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !9, !23, !23, !23, !23}
!42 = !{!43, !44, !45, !46, !47}
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 1, scope: !39, file: !1, line: 90, type: !9)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y0", arg: 2, scope: !39, file: !1, line: 91, type: !23)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y1", arg: 3, scope: !39, file: !1, line: 92, type: !23)
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x0", arg: 4, scope: !39, file: !1, line: 93, type: !23)
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x1", arg: 5, scope: !39, file: !1, line: 94, type: !23)
!48 = !DISubprogram(name: "SubMtx_scale3vec", scope: !1, file: !1, line: 149, type: !49, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, double*, double*, double*, double*, double*, double*)* @SubMtx_scale3vec, variables: !51)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !9, !23, !23, !23, !23, !23, !23}
!51 = !{!52, !53, !54, !55, !56, !57, !58}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 1, scope: !48, file: !1, line: 150, type: !9)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y0", arg: 2, scope: !48, file: !1, line: 151, type: !23)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y1", arg: 3, scope: !48, file: !1, line: 152, type: !23)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y2", arg: 4, scope: !48, file: !1, line: 153, type: !23)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x0", arg: 5, scope: !48, file: !1, line: 154, type: !23)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x1", arg: 6, scope: !48, file: !1, line: 155, type: !23)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x2", arg: 7, scope: !48, file: !1, line: 156, type: !23)
!59 = !DISubprogram(name: "diagonal_scale3vec", scope: !1, file: !1, line: 214, type: !49, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, variables: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !73, !74, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 1, scope: !59, file: !1, line: 215, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y0", arg: 2, scope: !59, file: !1, line: 216, type: !23)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y1", arg: 3, scope: !59, file: !1, line: 217, type: !23)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y2", arg: 4, scope: !59, file: !1, line: 218, type: !23)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x0", arg: 5, scope: !59, file: !1, line: 219, type: !23)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x1", arg: 6, scope: !59, file: !1, line: 220, type: !23)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x2", arg: 7, scope: !59, file: !1, line: 221, type: !23)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entriesA", scope: !59, file: !1, line: 223, type: !23)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrowA", scope: !59, file: !1, line: 224, type: !15)
