; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._A2 = type { i32, i32, i32, i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [50 x i8] c"\0A error in SubMtx_readFromFile(%p,%s)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [62 x i8] c"\0A error in SubMtx_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [108 x i8] c"\0A error in SubMtx_readFromFile(%p,%s)\0A bad SubMtx file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str5 = private unnamed_addr constant [59 x i8] c"\0A error in SubMtx_readFromFormattedFile(%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !331, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !104, !130, !150, !158, !177, !197, !222, !226}
!6 = !DISubprogram(name: "SubMtx_readFromFile", scope: !1, file: !1, line: 25, type: !7, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, i8*)* @SubMtx_readFromFile, variables: !37)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !35}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !12, line: 43, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !12, line: 44, size: 576, align: 64, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !25, !34}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !12, line: 45, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !13, file: !12, line: 46, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !13, file: !12, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !13, file: !12, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !13, file: !12, line: 49, baseType: !9, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !13, file: !12, line: 50, baseType: !9, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !13, file: !12, line: 51, baseType: !9, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 52, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !13, file: !12, line: 53, baseType: !26, size: 192, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !27, line: 20, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !27, line: 21, size: 192, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !27, line: 22, baseType: !9, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !28, file: !27, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !28, file: !27, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !28, file: !27, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !12, line: 54, baseType: !10, size: 64, align: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !{!38, !39, !40, !101, !102, !103}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !6, file: !1, line: 26, type: !10)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !6, file: !1, line: 27, type: !35)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !6, file: !1, line: 29, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !43, line: 153, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !43, line: 122, size: 1216, align: 64, elements: !45)
!45 = !{!46, !49, !50, !51, !53, !54, !59, !60, !61, !65, !69, !79, !85, !86, !89, !90, !94, !98, !99, !100}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !44, file: !43, line: 123, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !44, file: !43, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !44, file: !43, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !44, file: !43, line: 126, baseType: !52, size: 16, align: 16, offset: 128)
!52 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !44, file: !43, line: 127, baseType: !52, size: 16, align: 16, offset: 144)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !44, file: !43, line: 128, baseType: !55, size: 128, align: 64, offset: 192)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !43, line: 88, size: 128, align: 64, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !55, file: !43, line: 89, baseType: !47, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !55, file: !43, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !44, file: !43, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !44, file: !43, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !44, file: !43, line: 133, baseType: !62, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!9, !4}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !44, file: !43, line: 134, baseType: !66, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!9, !4, !35, !9}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !44, file: !43, line: 135, baseType: !70, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !4, !73, !9}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !43, line: 77, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !75, line: 71, baseType: !76)
!75 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !77, line: 46, baseType: !78)
!77 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !44, file: !43, line: 136, baseType: !80, size: 64, align: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!9, !4, !83, !9}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !44, file: !43, line: 139, baseType: !55, size: 128, align: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !44, file: !43, line: 140, baseType: !87, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !43, line: 94, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !44, file: !43, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !44, file: !43, line: 144, baseType: !91, size: 24, align: 8, offset: 928)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 24, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 3)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !44, file: !43, line: 145, baseType: !95, size: 8, align: 8, offset: 952)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !44, file: !43, line: 148, baseType: !55, size: 128, align: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !44, file: !43, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !44, file: !43, line: 152, baseType: !73, size: 64, align: 64, offset: 1152)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !6, file: !1, line: 30, type: !9)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !6, file: !1, line: 30, type: !9)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !6, file: !1, line: 30, type: !9)
!104 = !DISubprogram(name: "SubMtx_readFromFormattedFile", scope: !1, file: !1, line: 94, type: !105, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, %struct.__sFILE*)* @SubMtx_readFromFormattedFile, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{!9, !10, !41}
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !121, !123, !124, !125, !126, !127, !128, !129}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !104, file: !1, line: 95, type: !10)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !104, file: !1, line: 96, type: !41)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !104, file: !1, line: 98, type: !23)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !104, file: !1, line: 99, type: !9)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !104, file: !1, line: 99, type: !9)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !104, file: !1, line: 99, type: !9)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !104, file: !1, line: 99, type: !9)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !104, file: !1, line: 99, type: !9)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !104, file: !1, line: 99, type: !9)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !104, file: !1, line: 100, type: !118)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 224, align: 32, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 7)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colids", scope: !104, file: !1, line: 101, type: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !104, file: !1, line: 101, type: !122)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstlocs", scope: !104, file: !1, line: 101, type: !122)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !104, file: !1, line: 101, type: !122)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivotsizes", scope: !104, file: !1, line: 102, type: !122)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowids", scope: !104, file: !1, line: 102, type: !122)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !104, file: !1, line: 102, type: !122)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !104, file: !1, line: 102, type: !122)
!130 = !DISubprogram(name: "SubMtx_readFromBinaryFile", scope: !1, file: !1, line: 324, type: !105, isLocal: false, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, %struct.__sFILE*)* @SubMtx_readFromBinaryFile, variables: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !130, file: !1, line: 325, type: !10)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !130, file: !1, line: 326, type: !41)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !130, file: !1, line: 328, type: !23)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !130, file: !1, line: 329, type: !9)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !130, file: !1, line: 329, type: !9)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !130, file: !1, line: 329, type: !9)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !130, file: !1, line: 329, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !130, file: !1, line: 329, type: !9)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !130, file: !1, line: 329, type: !9)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !130, file: !1, line: 330, type: !118)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colids", scope: !130, file: !1, line: 331, type: !122)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !130, file: !1, line: 331, type: !122)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstlocs", scope: !130, file: !1, line: 331, type: !122)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !130, file: !1, line: 331, type: !122)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivotsizes", scope: !130, file: !1, line: 332, type: !122)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowids", scope: !130, file: !1, line: 332, type: !122)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !130, file: !1, line: 332, type: !122)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !130, file: !1, line: 332, type: !122)
!150 = !DISubprogram(name: "SubMtx_writeToFile", scope: !1, file: !1, line: 564, type: !7, isLocal: false, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, i8*)* @SubMtx_writeToFile, variables: !151)
!151 = !{!152, !153, !154, !155, !156, !157}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !150, file: !1, line: 565, type: !10)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !150, file: !1, line: 566, type: !35)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !150, file: !1, line: 568, type: !41)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !150, file: !1, line: 569, type: !9)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !150, file: !1, line: 569, type: !9)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !150, file: !1, line: 569, type: !9)
!158 = !DISubprogram(name: "SubMtx_writeToFormattedFile", scope: !1, file: !1, line: 638, type: !105, isLocal: false, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, %struct.__sFILE*)* @SubMtx_writeToFormattedFile, variables: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !158, file: !1, line: 639, type: !10)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !158, file: !1, line: 640, type: !41)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !158, file: !1, line: 642, type: !23)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !158, file: !1, line: 643, type: !9)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !158, file: !1, line: 643, type: !9)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !158, file: !1, line: 643, type: !9)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !158, file: !1, line: 643, type: !9)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !158, file: !1, line: 643, type: !9)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !158, file: !1, line: 644, type: !118)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colids", scope: !158, file: !1, line: 645, type: !122)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !158, file: !1, line: 645, type: !122)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstlocs", scope: !158, file: !1, line: 645, type: !122)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !158, file: !1, line: 645, type: !122)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivotsizes", scope: !158, file: !1, line: 646, type: !122)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowids", scope: !158, file: !1, line: 646, type: !122)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !158, file: !1, line: 646, type: !122)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !158, file: !1, line: 646, type: !122)
!177 = !DISubprogram(name: "SubMtx_writeToBinaryFile", scope: !1, file: !1, line: 751, type: !105, isLocal: false, isDefinition: true, scopeLine: 754, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, %struct.__sFILE*)* @SubMtx_writeToBinaryFile, variables: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !177, file: !1, line: 752, type: !10)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !177, file: !1, line: 753, type: !41)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !177, file: !1, line: 755, type: !23)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !177, file: !1, line: 756, type: !9)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !177, file: !1, line: 756, type: !9)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !177, file: !1, line: 756, type: !9)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !177, file: !1, line: 756, type: !9)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !177, file: !1, line: 756, type: !9)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !177, file: !1, line: 756, type: !9)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !177, file: !1, line: 757, type: !118)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colids", scope: !177, file: !1, line: 758, type: !122)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !177, file: !1, line: 758, type: !122)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstlocs", scope: !177, file: !1, line: 758, type: !122)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !177, file: !1, line: 758, type: !122)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivotsizes", scope: !177, file: !1, line: 759, type: !122)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowids", scope: !177, file: !1, line: 759, type: !122)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !177, file: !1, line: 759, type: !122)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !177, file: !1, line: 759, type: !122)
!197 = !DISubprogram(name: "SubMtx_writeForHumanEye", scope: !1, file: !1, line: 862, type: !105, isLocal: false, isDefinition: true, scopeLine: 865, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, %struct.__sFILE*)* @SubMtx_writeForHumanEye, variables: !198)
!198 = !{!199, !200, !201, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !197, file: !1, line: 863, type: !10)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !197, file: !1, line: 864, type: !41)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !197, file: !1, line: 866, type: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "A2", file: !203, line: 49, baseType: !204)
!203 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../A2/A2.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_A2", file: !203, line: 41, size: 256, align: 64, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !203, line: 42, baseType: !9, size: 32, align: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "n1", scope: !204, file: !203, line: 43, baseType: !9, size: 32, align: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !204, file: !203, line: 44, baseType: !9, size: 32, align: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "inc1", scope: !204, file: !203, line: 45, baseType: !9, size: 32, align: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "inc2", scope: !204, file: !203, line: 46, baseType: !9, size: 32, align: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nowned", scope: !204, file: !203, line: 47, baseType: !9, size: 32, align: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !204, file: !203, line: 48, baseType: !23, size: 64, align: 64, offset: 192)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imag", scope: !197, file: !1, line: 867, type: !24)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "real", scope: !197, file: !1, line: 867, type: !24)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !197, file: !1, line: 868, type: !9)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !197, file: !1, line: 868, type: !9)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !197, file: !1, line: 868, type: !9)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !197, file: !1, line: 868, type: !9)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !197, file: !1, line: 868, type: !9)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !197, file: !1, line: 869, type: !122)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !197, file: !1, line: 869, type: !122)
!222 = !DISubprogram(name: "SubMtx_writeStats", scope: !1, file: !1, line: 916, type: !105, isLocal: false, isDefinition: true, scopeLine: 919, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*, %struct.__sFILE*)* @SubMtx_writeStats, variables: !223)
!223 = !{!224, !225}
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !222, file: !1, line: 917, type: !10)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !222, file: !1, line: 918, type: !41)
!226 = !DISubprogram(name: "SubMtx_writeForMatlab", scope: !1, file: !1, line: 995, type: !227, isLocal: false, isDefinition: true, scopeLine: 999, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i8*, %struct.__sFILE*)* @SubMtx_writeForMatlab, variables: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !10, !35, !41}
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !240, !241, !242, !243, !244, !245, !246, !247, !250, !251, !252, !253, !254, !255, !256, !257, !258, !261, !262, !263, !264, !265, !266, !267, !268, !269, !272, !273, !274, !275, !276, !277, !278, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !305, !306, !307, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !226, file: !1, line: 996, type: !10)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxname", arg: 2, scope: !226, file: !1, line: 997, type: !35)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 3, scope: !226, file: !1, line: 998, type: !41)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !226, file: !1, line: 1000, type: !9)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !226, file: !1, line: 1000, type: !9)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colind", scope: !226, file: !1, line: 1001, type: !122)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowind", scope: !226, file: !1, line: 1001, type: !122)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ij", scope: !238, file: !1, line: 1015, type: !9)
!238 = distinct !DILexicalBlock(scope: !239, file: !1, line: 1014, column: 66)
!239 = distinct !DILexicalBlock(scope: !226, file: !1, line: 1014, column: 6)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !238, file: !1, line: 1015, type: !9)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !238, file: !1, line: 1015, type: !9)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irow", scope: !238, file: !1, line: 1015, type: !9)
