; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._ZV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [56 x i8] c"\0A fatal error in SubMtx_fillRowDV(%p,%d,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [78 x i8] c"\0A fatal error in SubMtx_fillRowDV(%p,%d,%p)\0A type = %d, must be SPOOLES_REAL\0A\00", align 1
@.str2 = private unnamed_addr constant [56 x i8] c"\0A fatal error in SubMtx_fillRowZV(%p,%d,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [81 x i8] c"\0A fatal error in SubMtx_fillRowZV(%p,%d,%p)\0A type = %d, must be SPOOLES_COMPLEX\0A\00", align 1
@.str4 = private unnamed_addr constant [59 x i8] c"\0A fatal error in SubMtx_fillColumnDV(%p,%d,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !125, !225, !314, !403, !443}
!6 = !DISubprogram(name: "SubMtx_fillRowDV", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32, %struct._DV*)* @SubMtx_fillRowDV, variables: !36)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !15, !35}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !11, line: 43, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !11, line: 44, size: 576, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !25, !34}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 45, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !12, file: !11, line: 46, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !12, file: !11, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !12, file: !11, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !12, file: !11, line: 49, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !12, file: !11, line: 50, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 52, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 53, baseType: !26, size: 192, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !27, line: 20, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !27, line: 21, size: 192, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !27, line: 22, baseType: !15, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !28, file: !27, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !28, file: !27, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !28, file: !27, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 54, baseType: !9, size: 64, align: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!36 = !{!37, !38, !39, !40, !41, !44, !45, !46, !47, !48, !49, !50, !52, !53, !54, !55, !56, !57, !58, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !73, !74, !75, !76, !77, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !102, !103, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !6, file: !1, line: 18, type: !9)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 2, scope: !6, file: !1, line: 19, type: !15)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowDV", arg: 3, scope: !6, file: !1, line: 20, type: !35)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowvec", scope: !6, file: !1, line: 22, type: !23)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !42, file: !1, line: 50, type: !23)
!42 = distinct !DILexicalBlock(scope: !43, file: !1, line: 49, column: 29)
!43 = distinct !DILexicalBlock(scope: !6, file: !1, line: 47, column: 22)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !42, file: !1, line: 51, type: !15)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !42, file: !1, line: 51, type: !15)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !42, file: !1, line: 51, type: !15)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !42, file: !1, line: 51, type: !15)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !42, file: !1, line: 51, type: !15)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !42, file: !1, line: 51, type: !15)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !51, file: !1, line: 60, type: !23)
!51 = distinct !DILexicalBlock(scope: !43, file: !1, line: 59, column: 27)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !51, file: !1, line: 61, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrow", scope: !51, file: !1, line: 61, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !51, file: !1, line: 61, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !51, file: !1, line: 61, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !51, file: !1, line: 61, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !51, file: !1, line: 61, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !51, file: !1, line: 62, type: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !51, file: !1, line: 62, type: !59)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !62, file: !1, line: 74, type: !23)
!62 = distinct !DILexicalBlock(scope: !43, file: !1, line: 73, column: 30)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !62, file: !1, line: 75, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !62, file: !1, line: 75, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !62, file: !1, line: 75, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !62, file: !1, line: 75, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !62, file: !1, line: 75, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !62, file: !1, line: 75, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !62, file: !1, line: 76, type: !59)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !62, file: !1, line: 76, type: !59)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !72, file: !1, line: 91, type: !23)
!72 = distinct !DILexicalBlock(scope: !43, file: !1, line: 90, column: 30)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !72, file: !1, line: 92, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !72, file: !1, line: 92, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colids", scope: !72, file: !1, line: 93, type: !59)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowids", scope: !72, file: !1, line: 93, type: !59)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !78, file: !1, line: 103, type: !23)
!78 = distinct !DILexicalBlock(scope: !43, file: !1, line: 102, column: 29)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !78, file: !1, line: 104, type: !15)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !78, file: !1, line: 104, type: !15)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrow", scope: !78, file: !1, line: 104, type: !15)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !78, file: !1, line: 104, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !78, file: !1, line: 104, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !78, file: !1, line: 104, type: !15)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !78, file: !1, line: 104, type: !15)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !78, file: !1, line: 104, type: !15)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstlocs", scope: !78, file: !1, line: 105, type: !59)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !78, file: !1, line: 105, type: !59)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !90, file: !1, line: 134, type: !23)
!90 = distinct !DILexicalBlock(scope: !43, file: !1, line: 133, column: 32)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !90, file: !1, line: 135, type: !15)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !90, file: !1, line: 135, type: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !90, file: !1, line: 135, type: !15)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !90, file: !1, line: 135, type: !15)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !90, file: !1, line: 135, type: !15)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !90, file: !1, line: 135, type: !15)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !90, file: !1, line: 135, type: !15)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstlocs", scope: !90, file: !1, line: 136, type: !59)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !90, file: !1, line: 136, type: !59)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !101, file: !1, line: 153, type: !23)
!101 = distinct !DILexicalBlock(scope: !43, file: !1, line: 152, column: 24)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !101, file: !1, line: 154, type: !15)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !104, file: !1, line: 160, type: !23)
!104 = distinct !DILexicalBlock(scope: !43, file: !1, line: 159, column: 34)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !104, file: !1, line: 161, type: !15)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipivot", scope: !104, file: !1, line: 161, type: !15)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrow", scope: !104, file: !1, line: 161, type: !15)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !104, file: !1, line: 161, type: !15)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !104, file: !1, line: 161, type: !15)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !104, file: !1, line: 161, type: !15)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !104, file: !1, line: 161, type: !15)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !104, file: !1, line: 161, type: !15)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivotsizes", scope: !104, file: !1, line: 162, type: !59)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !115, file: !1, line: 201, type: !23)
!115 = distinct !DILexicalBlock(scope: !43, file: !1, line: 200, column: 35)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !115, file: !1, line: 202, type: !15)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipivot", scope: !115, file: !1, line: 202, type: !15)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrow", scope: !115, file: !1, line: 202, type: !15)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !115, file: !1, line: 202, type: !15)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !115, file: !1, line: 202, type: !15)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !115, file: !1, line: 202, type: !15)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !115, file: !1, line: 202, type: !15)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stride", scope: !115, file: !1, line: 202, type: !15)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivotsizes", scope: !115, file: !1, line: 203, type: !59)
!125 = !DISubprogram(name: "SubMtx_fillRowZV", scope: !1, file: !1, line: 256, type: !126, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32, %struct._ZV*)* @SubMtx_fillRowZV, variables: !137)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !9, !15, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZV", file: !130, line: 20, baseType: !131)
!130 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../ZV/ZV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ZV", file: !130, line: 21, size: 192, align: 64, elements: !132)
!132 = !{!133, !134, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !131, file: !130, line: 22, baseType: !15, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !131, file: !130, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !131, file: !130, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !131, file: !130, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!137 = !{!138, !139, !140, !141, !142, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !163, !164, !165, !166, !167, !168, !169, !170, !171, !173, !174, !175, !176, !177, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !202, !203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !125, file: !1, line: 257, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "irow", arg: 2, scope: !125, file: !1, line: 258, type: !15)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowZV", arg: 3, scope: !125, file: !1, line: 259, type: !128)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rowvec", scope: !125, file: !1, line: 261, type: !23)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !143, file: !1, line: 289, type: !23)
!143 = distinct !DILexicalBlock(scope: !144, file: !1, line: 288, column: 29)
!144 = distinct !DILexicalBlock(scope: !125, file: !1, line: 286, column: 22)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !143, file: !1, line: 290, type: !15)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !143, file: !1, line: 290, type: !15)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !143, file: !1, line: 290, type: !15)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !143, file: !1, line: 290, type: !15)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !143, file: !1, line: 290, type: !15)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !143, file: !1, line: 290, type: !15)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !152, file: !1, line: 300, type: !23)
!152 = distinct !DILexicalBlock(scope: !144, file: !1, line: 299, column: 27)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !152, file: !1, line: 301, type: !15)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jrow", scope: !152, file: !1, line: 301, type: !15)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !152, file: !1, line: 301, type: !15)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !152, file: !1, line: 301, type: !15)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrow", scope: !152, file: !1, line: 301, type: !15)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !152, file: !1, line: 301, type: !15)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !152, file: !1, line: 302, type: !59)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizes", scope: !152, file: !1, line: 302, type: !59)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entries", scope: !162, file: !1, line: 314, type: !23)
!162 = distinct !DILexicalBlock(scope: !144, file: !1, line: 313, column: 30)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !162, file: !1, line: 315, type: !15)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcol", scope: !162, file: !1, line: 315, type: !15)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !162, file: !1, line: 315, type: !15)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nent", scope: !162, file: !1, line: 315, type: !15)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncol", scope: !162, file: !1, line: 315, type: !15)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !162, file: !1, line: 315, type: !15)
