; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxList/src/SubMtxList_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtxList = type { i32, %struct._SubMtx**, i32*, %struct._Lock*, i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._Lock = type { i8*, i32, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [62 x i8] c"\0A fatal error in SubMtxList_isListNonempty(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [59 x i8] c"\0A fatal error in SubMtxList_isCountZero(%p,%d)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [66 x i8] c"\0A fatal error in SubMtxList_addObjectToList(%p,%p,%d)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [55 x i8] c"\0A fatal error in SubMtxList_getList(%p,%d)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define i32 @SubMtxList_isListNonempty(%struct._SubMtxList* %list, i32 %ilist) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxList/src/SubMtxList_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !61, !65, !72}
!6 = !DISubprogram(name: "SubMtxList_isListNonempty", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtxList*, i32)* @SubMtxList_isListNonempty, variables: !58)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxList", file: !12, line: 24, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxList/src/../SubMtxList.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxList", file: !12, line: 25, size: 384, align: 64, elements: !14)
!14 = !{!15, !16, !43, !45, !54, !57}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !13, file: !12, line: 26, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !13, file: !12, line: 27, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !20, line: 43, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxList/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !20, line: 44, size: 576, align: 64, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !33, !42}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !20, line: 45, baseType: !9, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !21, file: !20, line: 46, baseType: !9, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !21, file: !20, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !21, file: !20, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !21, file: !20, line: 49, baseType: !9, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !21, file: !20, line: 50, baseType: !9, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !21, file: !20, line: 51, baseType: !9, size: 32, align: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !21, file: !20, line: 52, baseType: !31, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !21, file: !20, line: 53, baseType: !34, size: 192, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !35, line: 20, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxList/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !35, line: 21, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 22, baseType: !9, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !36, file: !35, line: 23, baseType: !9, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !36, file: !35, line: 24, baseType: !9, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !36, file: !35, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !20, line: 54, baseType: !18, size: 64, align: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !13, file: !12, line: 28, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !13, file: !12, line: 29, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !48, line: 36, baseType: !49)
!48 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxList/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !48, line: 37, size: 128, align: 64, elements: !50)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !49, file: !48, line: 45, baseType: !4, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !49, file: !48, line: 47, baseType: !9, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !49, file: !48, line: 48, baseType: !9, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !13, file: !12, line: 30, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !13, file: !12, line: 31, baseType: !9, size: 32, align: 32, offset: 320)
!58 = !{!59, !60}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !6, file: !1, line: 18, type: !10)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !6, file: !1, line: 19, type: !9)
!61 = !DISubprogram(name: "SubMtxList_isCountZero", scope: !1, file: !1, line: 43, type: !7, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtxList*, i32)* @SubMtxList_isCountZero, variables: !62)
!62 = !{!63, !64}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !61, file: !1, line: 44, type: !10)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !61, file: !1, line: 45, type: !9)
!65 = !DISubprogram(name: "SubMtxList_addObjectToList", scope: !1, file: !1, line: 73, type: !66, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtxList*, %struct._SubMtx*, i32)* @SubMtxList_addObjectToList, variables: !68)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !10, !18, !9}
!68 = !{!69, !70, !71}
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !65, file: !1, line: 74, type: !10)
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 2, scope: !65, file: !1, line: 75, type: !18)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 3, scope: !65, file: !1, line: 76, type: !9)
!72 = !DISubprogram(name: "SubMtxList_getList", scope: !1, file: !1, line: 145, type: !73, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, function: %struct._SubMtx* (%struct._SubMtxList*, i32)* @SubMtxList_getList, variables: !75)
!73 = !DISubroutineType(types: !74)
!74 = !{!18, !10, !9}
!75 = !{!76, !77, !78}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !72, file: !1, line: 146, type: !10)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilist", arg: 2, scope: !72, file: !1, line: 147, type: !9)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtx", scope: !72, file: !1, line: 149, type: !18)
!79 = !{i32 2, !"Dwarf Version", i32 2}
!80 = !{i32 2, !"Debug Info Version", i32 700000003}
!81 = !{i32 1, !"PIC Level", i32 2}
!82 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!83 = !DIExpression()
!84 = !DILocation(line: 18, column: 18, scope: !6)
!85 = !DILocation(line: 19, column: 17, scope: !6)
!86 = !DILocation(line: 26, column: 11, scope: !87)
!87 = distinct !DILexicalBlock(scope: !6, file: !1, line: 26, column: 6)
!88 = !DILocation(line: 26, column: 28, scope: !87)
!89 = !DILocation(line: 26, column: 19, scope: !87)
!90 = !DILocation(line: 26, column: 50, scope: !87)
!91 = !{!92, !93, i64 0}
!92 = !{!"_SubMtxList", !93, i64 0, !96, i64 8, !96, i64 16, !96, i64 24, !96, i64 32, !93, i64 40}
!93 = !{!"int", !94, i64 0}
!94 = !{!"omnipotent char", !95, i64 0}
!95 = !{!"Simple C/C++ TBAA"}
!96 = !{!"any pointer", !94, i64 0}
!97 = !DILocation(line: 26, column: 41, scope: !87)
!98 = !DILocation(line: 26, column: 6, scope: !6)
!99 = !DILocation(line: 27, column: 12, scope: !100)
!100 = distinct !DILexicalBlock(scope: !87, file: !1, line: 26, column: 58)
!101 = !{!96, !96, i64 0}
!102 = !DILocation(line: 27, column: 4, scope: !100)
!103 = !DILocation(line: 30, column: 1, scope: !100)
!104 = !DILocation(line: 31, column: 8, scope: !6)
!105 = !DILocation(line: 31, column: 14, scope: !6)
!106 = !{!92, !96, i64 8}
!107 = !DILocation(line: 31, column: 27, scope: !6)
!108 = !DILocation(line: 31, column: 1, scope: !6)
!109 = !DILocation(line: 44, column: 18, scope: !61)
!110 = !DILocation(line: 45, column: 17, scope: !61)
!111 = !DILocation(line: 52, column: 11, scope: !112)
!112 = distinct !DILexicalBlock(scope: !61, file: !1, line: 52, column: 6)
