; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxManager/src/SubMtxManager_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }
%struct._SubMtxManager = type { %struct._SubMtx*, %struct._Lock*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._Lock = type { i8*, i32, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [73 x i8] c"\0A fatal error in SubMtxMananger_newObjectOfSizeNbytes(%p,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [64 x i8] c"\0A fatal error in SubMtxManager_releaseObject(%p,%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [71 x i8] c"\0A fatal error in SubMtxManager_releaseListOfObjects(%p,%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define %struct._SubMtx* @SubMtxManager_newObjectOfSizeNbytes(%struct._SubMtxManager* %manager, i32 %nbytesNeeded) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxManager/src/SubMtxManager_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !66, !76}
!6 = !DISubprogram(name: "SubMtxManager_newObjectOfSizeNbytes", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: %struct._SubMtx* (%struct._SubMtxManager*, i32)* @SubMtxManager_newObjectOfSizeNbytes, variables: !59)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !35, !15}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !11, line: 43, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxManager/src/../../SubMtx/SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !11, line: 44, size: 576, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !25, !34}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 45, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !12, file: !11, line: 46, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !12, file: !11, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !12, file: !11, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !12, file: !11, line: 49, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !12, file: !11, line: 50, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 52, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 53, baseType: !26, size: 192, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !27, line: 20, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxManager/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !27, line: 21, size: 192, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !27, line: 22, baseType: !15, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !28, file: !27, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !28, file: !27, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !28, file: !27, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 54, baseType: !9, size: 64, align: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtxManager", file: !37, line: 9, baseType: !38)
!37 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxManager/src/../SubMtxManager.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtxManager", file: !37, line: 10, size: 448, align: 64, elements: !39)
!39 = !{!40, !41, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !38, file: !37, line: 11, baseType: !9, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !38, file: !37, line: 12, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lock", file: !44, line: 36, baseType: !45)
!44 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtxManager/src/../../Lock/Lock.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Lock", file: !44, line: 37, size: 128, align: 64, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !45, file: !44, line: 45, baseType: !4, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !45, file: !44, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !45, file: !44, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !38, file: !37, line: 13, baseType: !15, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nactive", scope: !38, file: !37, line: 14, baseType: !15, size: 32, align: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesactive", scope: !38, file: !37, line: 15, baseType: !15, size: 32, align: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesrequested", scope: !38, file: !37, line: 16, baseType: !15, size: 32, align: 32, offset: 224)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nbytesalloc", scope: !38, file: !37, line: 17, baseType: !15, size: 32, align: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "nrequests", scope: !38, file: !37, line: 18, baseType: !15, size: 32, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nreleases", scope: !38, file: !37, line: 19, baseType: !15, size: 32, align: 32, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nlocks", scope: !38, file: !37, line: 20, baseType: !15, size: 32, align: 32, offset: 352)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nunlocks", scope: !38, file: !37, line: 21, baseType: !15, size: 32, align: 32, offset: 384)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 1, scope: !6, file: !1, line: 18, type: !35)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbytesNeeded", arg: 2, scope: !6, file: !1, line: 19, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtx", scope: !6, file: !1, line: 21, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !6, file: !1, line: 21, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytesAvailable", scope: !6, file: !1, line: 22, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newinstance", scope: !6, file: !1, line: 22, type: !15)
!66 = !DISubprogram(name: "SubMtxManager_releaseObject", scope: !1, file: !1, line: 144, type: !67, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtxManager*, %struct._SubMtx*)* @SubMtxManager_releaseObject, variables: !69)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !35, !9}
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 1, scope: !66, file: !1, line: 145, type: !35)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx1", arg: 2, scope: !66, file: !1, line: 146, type: !9)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtx2", scope: !66, file: !1, line: 148, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !66, file: !1, line: 148, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes1", scope: !66, file: !1, line: 149, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes2", scope: !66, file: !1, line: 149, type: !15)
!76 = !DISubprogram(name: "SubMtxManager_releaseListOfObjects", scope: !1, file: !1, line: 251, type: !67, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtxManager*, %struct._SubMtx*)* @SubMtxManager_releaseListOfObjects, variables: !77)
!77 = !{!78, !79, !80, !81, !82, !83, !84}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "manager", arg: 1, scope: !76, file: !1, line: 252, type: !35)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 2, scope: !76, file: !1, line: 253, type: !9)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtx1", scope: !76, file: !1, line: 255, type: !9)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtx2", scope: !76, file: !1, line: 255, type: !9)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !76, file: !1, line: 255, type: !9)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes1", scope: !76, file: !1, line: 256, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes2", scope: !76, file: !1, line: 256, type: !15)
!85 = !{i32 2, !"Dwarf Version", i32 2}
!86 = !{i32 2, !"Debug Info Version", i32 700000003}
!87 = !{i32 1, !"PIC Level", i32 2}
!88 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!89 = !DIExpression()
!90 = !DILocation(line: 18, column: 21, scope: !6)
!91 = !DILocation(line: 19, column: 20, scope: !6)
!92 = !DILocation(line: 28, column: 14, scope: !93)
!93 = distinct !DILexicalBlock(scope: !6, file: !1, line: 28, column: 6)
!94 = !DILocation(line: 28, column: 38, scope: !93)
!95 = !DILocation(line: 28, column: 22, scope: !93)
!96 = !DILocation(line: 29, column: 12, scope: !97)
!97 = distinct !DILexicalBlock(scope: !93, file: !1, line: 28, column: 45)
!98 = !{!99, !99, i64 0}
!99 = !{!"any pointer", !100, i64 0}
!100 = !{!"omnipotent char", !101, i64 0}
!101 = !{!"Simple C/C++ TBAA"}
!102 = !DILocation(line: 29, column: 4, scope: !97)
!103 = !DILocation(line: 32, column: 4, scope: !97)
!104 = !DILocation(line: 39, column: 15, scope: !105)
