; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_solveH.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [50 x i8] c"\0A fatal error in SubMtx_solveH(%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [61 x i8] c"\0A fatal error in SubMtx_solveH(%p,%p)\0A mtxB has bad type %d\0A\00", align 1
@.str2 = private unnamed_addr constant [61 x i8] c"\0A fatal error in SubMtx_solveH(%p,%p)\0A mtxB has bad mode %d\0A\00", align 1
@.str3 = private unnamed_addr constant [73 x i8] c"\0A fatal error in SubMtx_solveH(%p,%p)\0A mtxA->nrow = %d, mtxB->nrwo = %d\0A\00", align 1
@.str4 = private unnamed_addr constant [52 x i8] c"\0A fatal error in SubMtx_solveH(%p,%p)\0A bad mode %d\0A\00", align 1
@.str5 = private unnamed_addr constant [52 x i8] c"\0A fatal error, irowA = %d, kk =%d, ii = %d, jj = %d\00", align 1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_solveH.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !38, !78, !117, !151}
!6 = !DISubprogram(name: "SubMtx_solveH", scope: !1, file: !1, line: 32, type: !7, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, %struct._SubMtx*)* @SubMtx_solveH, variables: !35)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !11, line: 43, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !11, line: 44, size: 576, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !20, !21, !22, !25, !34}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 45, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !12, file: !11, line: 46, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !12, file: !11, line: 47, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !12, file: !11, line: 48, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !12, file: !11, line: 49, baseType: !15, size: 32, align: 32, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !12, file: !11, line: 50, baseType: !15, size: 32, align: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !12, file: !11, line: 51, baseType: !15, size: 32, align: 32, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !12, file: !11, line: 52, baseType: !23, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !12, file: !11, line: 53, baseType: !26, size: 192, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !27, line: 20, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !27, line: 21, size: 192, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !27, line: 22, baseType: !15, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !28, file: !27, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !28, file: !27, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !28, file: !27, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 54, baseType: !9, size: 64, align: 64, offset: 512)
!35 = !{!36, !37}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 1, scope: !6, file: !1, line: 33, type: !9)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxB", arg: 2, scope: !6, file: !1, line: 34, type: !9)
!38 = !DISubprogram(name: "solveDenseSubcolumns", scope: !1, file: !1, line: 100, type: !7, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, variables: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !77}
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxA", arg: 1, scope: !38, file: !1, line: 101, type: !9)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtxB", arg: 2, scope: !38, file: !1, line: 102, type: !9)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !38, file: !1, line: 104, type: !24)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ar", scope: !38, file: !1, line: 104, type: !24)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bi0", scope: !38, file: !1, line: 104, type: !24)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bi1", scope: !38, file: !1, line: 104, type: !24)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bi2", scope: !38, file: !1, line: 104, type: !24)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "br0", scope: !38, file: !1, line: 104, type: !24)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "br1", scope: !38, file: !1, line: 104, type: !24)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "br2", scope: !38, file: !1, line: 104, type: !24)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isum0", scope: !38, file: !1, line: 105, type: !24)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isum1", scope: !38, file: !1, line: 105, type: !24)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isum2", scope: !38, file: !1, line: 105, type: !24)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rsum0", scope: !38, file: !1, line: 105, type: !24)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rsum1", scope: !38, file: !1, line: 105, type: !24)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rsum2", scope: !38, file: !1, line: 105, type: !24)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colB0", scope: !38, file: !1, line: 106, type: !23)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colB1", scope: !38, file: !1, line: 106, type: !23)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colB2", scope: !38, file: !1, line: 106, type: !23)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entriesA", scope: !38, file: !1, line: 106, type: !23)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entriesB", scope: !38, file: !1, line: 106, type: !23)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !38, file: !1, line: 107, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !38, file: !1, line: 107, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iloc", scope: !38, file: !1, line: 107, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc1", scope: !38, file: !1, line: 107, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inc2", scope: !38, file: !1, line: 107, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irowA", scope: !38, file: !1, line: 107, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jcolB", scope: !38, file: !1, line: 107, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !38, file: !1, line: 107, type: !15)
