; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_init.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._SubMtx = type { i32, i32, i32, i32, i32, i32, i32, double*, %struct._DV, %struct._SubMtx* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [65 x i8] c"\0A fatal error in SubMtx_nbytesNeeded(%d,%d,%d,%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [64 x i8] c"\0A fatal error in SubMtx_nbytesNeeded(%d,%d,%d,%d,%d)\0A bad type\0A\00", align 1
@.str2 = private unnamed_addr constant [64 x i8] c"\0A fatal error in SubMtx_nbytesNeeded(%d,%d,%d,%d,%d)\0A bad mode\0A\00", align 1
@.str3 = private unnamed_addr constant [52 x i8] c"\0A fatal error in SubMtx_nbytesInUse(%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [50 x i8] c"\0A fatal error in SubMtx_workspace(%p)\0A bad input\0A\00", align 1
@.str5 = private unnamed_addr constant [58 x i8] c"\0A fatal error in SubMtx_nbytesInWorkspace(%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !9, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/SubMtx_init.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!9 = !{!10, !22, !50, !55, !58, !64, !79, !92}
!10 = !DISubprogram(name: "SubMtx_nbytesNeeded", scope: !1, file: !1, line: 16, type: !11, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32, i32)* @SubMtx_nbytesNeeded, variables: !13)
!11 = !DISubroutineType(types: !12)
!12 = !{!6, !6, !6, !6, !6, !6}
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21}
!14 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !10, file: !1, line: 17, type: !6)
!15 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !10, file: !1, line: 18, type: !6)
!16 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrow", arg: 3, scope: !10, file: !1, line: 19, type: !6)
!17 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncol", arg: 4, scope: !10, file: !1, line: 20, type: !6)
!18 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nent", arg: 5, scope: !10, file: !1, line: 21, type: !6)
!19 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !10, file: !1, line: 23, type: !6)
!20 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndouble", scope: !10, file: !1, line: 23, type: !6)
!21 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !10, file: !1, line: 23, type: !6)
!22 = !DISubprogram(name: "SubMtx_nbytesInUse", scope: !1, file: !1, line: 130, type: !23, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*)* @SubMtx_nbytesInUse, variables: !48)
!23 = !DISubroutineType(types: !24)
!24 = !{!6, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubMtx", file: !27, line: 43, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../SubMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SubMtx", file: !27, line: 44, size: 576, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !47}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !27, line: 45, baseType: !6, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !28, file: !27, line: 46, baseType: !6, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "rowid", scope: !28, file: !27, line: 47, baseType: !6, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "colid", scope: !28, file: !27, line: 48, baseType: !6, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nrow", scope: !28, file: !27, line: 49, baseType: !6, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ncol", scope: !28, file: !27, line: 50, baseType: !6, size: 32, align: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !28, file: !27, line: 51, baseType: !6, size: 32, align: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !28, file: !27, line: 52, baseType: !7, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "wrkDV", scope: !28, file: !27, line: 53, baseType: !39, size: 192, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !40, line: 20, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SubMtx/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !40, line: 21, size: 192, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !41, file: !40, line: 22, baseType: !6, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !41, file: !40, line: 23, baseType: !6, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !41, file: !40, line: 24, baseType: !6, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !41, file: !40, line: 25, baseType: !7, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !27, line: 54, baseType: !25, size: 64, align: 64, offset: 512)
!48 = !{!49}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !22, file: !1, line: 131, type: !25)
!50 = !DISubprogram(name: "SubMtx_workspace", scope: !1, file: !1, line: 149, type: !51, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._SubMtx*)* @SubMtx_workspace, variables: !53)
!51 = !DISubroutineType(types: !52)
!52 = !{!4, !25}
!53 = !{!54}
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !50, file: !1, line: 150, type: !25)
!55 = !DISubprogram(name: "SubMtx_nbytesInWorkspace", scope: !1, file: !1, line: 168, type: !23, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._SubMtx*)* @SubMtx_nbytesInWorkspace, variables: !56)
!56 = !{!57}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !55, file: !1, line: 169, type: !25)
!58 = !DISubprogram(name: "SubMtx_setNbytesInWorkspace", scope: !1, file: !1, line: 187, type: !59, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32)* @SubMtx_setNbytesInWorkspace, variables: !61)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !25, !6}
!61 = !{!62, !63}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !58, file: !1, line: 188, type: !25)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbytes", arg: 2, scope: !58, file: !1, line: 189, type: !6)
!64 = !DISubprogram(name: "SubMtx_setFields", scope: !1, file: !1, line: 210, type: !65, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32, i32, i32, i32, i32, i32, i32)* @SubMtx_setFields, variables: !67)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !25, !6, !6, !6, !6, !6, !6, !6}
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !64, file: !1, line: 211, type: !25)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !64, file: !1, line: 212, type: !6)
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !64, file: !1, line: 213, type: !6)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rowid", arg: 4, scope: !64, file: !1, line: 214, type: !6)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colid", arg: 5, scope: !64, file: !1, line: 215, type: !6)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrow", arg: 6, scope: !64, file: !1, line: 216, type: !6)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncol", arg: 7, scope: !64, file: !1, line: 217, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nent", arg: 8, scope: !64, file: !1, line: 218, type: !6)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dbuffer", scope: !64, file: !1, line: 220, type: !7)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !64, file: !1, line: 221, type: !6)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuffer", scope: !64, file: !1, line: 222, type: !5)
!79 = !DISubprogram(name: "SubMtx_init", scope: !1, file: !1, line: 330, type: !65, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._SubMtx*, i32, i32, i32, i32, i32, i32, i32)* @SubMtx_init, variables: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtx", arg: 1, scope: !79, file: !1, line: 331, type: !25)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !79, file: !1, line: 332, type: !6)
