; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/SymbFac_symbfac.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IVL = type { i32, i32, i32, i32, i32*, i32**, i32, %struct._Ichunk* }
%struct._Ichunk = type { i32, i32, i32*, %struct._Ichunk* }
%struct._ETree = type { i32, i32, %struct._Tree*, %struct._IV*, %struct._IV*, %struct._IV* }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._Graph = type { i32, i32, i32, i32, i32, i32, %struct._IVL*, i32*, %struct._IVL* }
%struct._InpMtx = type { i32, i32, i32, i32, i32, double, %struct._IV, %struct._IV, %struct._DV, i32, i32, %struct._IV, %struct._IV, %struct._IV }
%struct._DV = type { i32, i32, i32, double* }
%struct._Pencil = type { i32, i32, %struct._InpMtx*, %struct._InpMtx*, [2 x double] }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [54 x i8] c"\0A fatal error in SymbFac_fromGraph(%p,%p)\0A bad input\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/SymbFac_symbfac.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !111, !173}
!6 = !DISubprogram(name: "SymbFac_initFromGraph", scope: !1, file: !1, line: 17, type: !7, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IVL* (%struct._ETree*, %struct._Graph*)* @SymbFac_initFromGraph, variables: !77)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !33, !63}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "IVL", file: !11, line: 55, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../IVL/IVL.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IVL", file: !11, line: 79, size: 384, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !21, !23, !24}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 80, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxnlist", scope: !12, file: !11, line: 81, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !12, file: !11, line: 82, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !12, file: !11, line: 83, baseType: !15, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sizes", scope: !12, file: !11, line: 84, baseType: !20, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "p_vec", scope: !12, file: !11, line: 85, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !12, file: !11, line: 86, baseType: !15, size: 32, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !12, file: !11, line: 87, baseType: !25, size: 64, align: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ichunk", file: !11, line: 56, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ichunk", file: !11, line: 102, size: 192, align: 64, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !27, file: !11, line: 103, baseType: !15, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !27, file: !11, line: 104, baseType: !15, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !27, file: !11, line: 105, baseType: !20, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !11, line: 106, baseType: !25, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETree", file: !35, line: 31, baseType: !36)
!35 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../ETree/ETree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ETree", file: !35, line: 32, size: 320, align: 64, elements: !37)
!37 = !{!38, !39, !40, !51, !61, !62}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nfront", scope: !36, file: !35, line: 33, baseType: !15, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !36, file: !35, line: 34, baseType: !15, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !36, file: !35, line: 35, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !43, line: 15, baseType: !44)
!43 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../Tree/Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !43, line: 16, size: 256, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !44, file: !43, line: 17, baseType: !15, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !44, file: !43, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !44, file: !43, line: 19, baseType: !20, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !44, file: !43, line: 20, baseType: !20, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !44, file: !43, line: 21, baseType: !20, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nodwghtsIV", scope: !36, file: !35, line: 36, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !54, line: 20, baseType: !55)
!54 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !54, line: 21, size: 192, align: 64, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !54, line: 22, baseType: !15, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !55, file: !54, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !55, file: !54, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !55, file: !54, line: 25, baseType: !20, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bndwghtsIV", scope: !36, file: !35, line: 37, baseType: !52, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "vtxToFrontIV", scope: !36, file: !35, line: 38, baseType: !52, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "Graph", file: !65, line: 49, baseType: !66)
!65 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../Graph/Graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Graph", file: !65, line: 50, size: 384, align: 64, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !65, line: 51, baseType: !15, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nvtx", scope: !66, file: !65, line: 52, baseType: !15, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nvbnd", scope: !66, file: !65, line: 53, baseType: !15, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "nedges", scope: !66, file: !65, line: 54, baseType: !15, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "totvwght", scope: !66, file: !65, line: 55, baseType: !15, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "totewght", scope: !66, file: !65, line: 56, baseType: !15, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "adjIVL", scope: !66, file: !65, line: 57, baseType: !9, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "vwghts", scope: !66, file: !65, line: 58, baseType: !20, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ewghtIVL", scope: !66, file: !65, line: 59, baseType: !9, size: 64, align: 64, offset: 320)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !6, file: !1, line: 18, type: !33)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "graph", arg: 2, scope: !6, file: !1, line: 19, type: !63)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndweight", scope: !6, file: !1, line: 21, type: !15)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !6, file: !1, line: 21, type: !15)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !6, file: !1, line: 21, type: !15)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "front", scope: !6, file: !1, line: 21, type: !15)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !6, file: !1, line: 21, type: !15)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !6, file: !1, line: 21, type: !15)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intweight", scope: !6, file: !1, line: 21, type: !15)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !6, file: !1, line: 21, type: !15)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !6, file: !1, line: 21, type: !15)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !6, file: !1, line: 22, type: !15)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfromchildren", scope: !6, file: !1, line: 22, type: !15)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !6, file: !1, line: 22, type: !15)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !6, file: !1, line: 22, type: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !6, file: !1, line: 22, type: !15)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !6, file: !1, line: 22, type: !15)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !6, file: !1, line: 22, type: !15)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !6, file: !1, line: 22, type: !15)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !6, file: !1, line: 23, type: !20)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !6, file: !1, line: 23, type: !20)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch", scope: !6, file: !1, line: 23, type: !20)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !6, file: !1, line: 23, type: !20)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !6, file: !1, line: 23, type: !20)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !6, file: !1, line: 23, type: !20)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !6, file: !1, line: 23, type: !20)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "marker", scope: !6, file: !1, line: 23, type: !20)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !6, file: !1, line: 24, type: !20)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib", scope: !6, file: !1, line: 24, type: !20)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vwghts", scope: !6, file: !1, line: 24, type: !20)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !6, file: !1, line: 24, type: !20)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontToVtxIVL", scope: !6, file: !1, line: 25, type: !9)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !6, file: !1, line: 26, type: !41)
!111 = !DISubprogram(name: "SymbFac_initFromInpMtx", scope: !1, file: !1, line: 233, type: !112, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IVL* (%struct._ETree*, %struct._InpMtx*)* @SymbFac_initFromInpMtx, variables: !143)
!112 = !DISubroutineType(types: !113)
!113 = !{!9, !33, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "InpMtx", file: !116, line: 51, baseType: !117)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../InpMtx/InpMtx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_InpMtx", file: !116, line: 52, size: 1472, align: 64, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !126, !127, !128, !138, !139, !140, !141, !142}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "coordType", scope: !117, file: !116, line: 53, baseType: !15, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "storageMode", scope: !117, file: !116, line: 54, baseType: !15, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "inputMode", scope: !117, file: !116, line: 55, baseType: !15, size: 32, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "maxnent", scope: !117, file: !116, line: 56, baseType: !15, size: 32, align: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !117, file: !116, line: 57, baseType: !15, size: 32, align: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "resizeMultiple", scope: !117, file: !116, line: 58, baseType: !125, size: 64, align: 64, offset: 192)
!125 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ivec1IV", scope: !117, file: !116, line: 59, baseType: !53, size: 192, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ivec2IV", scope: !117, file: !116, line: 60, baseType: !53, size: 192, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "dvecDV", scope: !117, file: !116, line: 61, baseType: !129, size: 192, align: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !130, line: 20, baseType: !131)
!130 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !130, line: 21, size: 192, align: 64, elements: !132)
!132 = !{!133, !134, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !131, file: !130, line: 22, baseType: !15, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !131, file: !130, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !131, file: !130, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !131, file: !130, line: 25, baseType: !137, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "maxnvector", scope: !117, file: !116, line: 62, baseType: !15, size: 32, align: 32, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nvector", scope: !117, file: !116, line: 63, baseType: !15, size: 32, align: 32, offset: 864)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "vecidsIV", scope: !117, file: !116, line: 64, baseType: !53, size: 192, align: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sizesIV", scope: !117, file: !116, line: 65, baseType: !53, size: 192, align: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "offsetsIV", scope: !117, file: !116, line: 66, baseType: !53, size: 192, align: 64, offset: 1280)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !111, file: !1, line: 234, type: !33)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpmtx", arg: 2, scope: !111, file: !1, line: 235, type: !114)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !111, file: !1, line: 237, type: !15)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "front", scope: !111, file: !1, line: 237, type: !15)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !111, file: !1, line: 237, type: !15)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !111, file: !1, line: 237, type: !15)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !111, file: !1, line: 237, type: !15)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !111, file: !1, line: 237, type: !15)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfromchildren", scope: !111, file: !1, line: 237, type: !15)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !111, file: !1, line: 237, type: !15)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !111, file: !1, line: 237, type: !15)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvector", scope: !111, file: !1, line: 238, type: !15)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !111, file: !1, line: 238, type: !15)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !111, file: !1, line: 238, type: !15)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !111, file: !1, line: 238, type: !15)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !111, file: !1, line: 238, type: !15)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !111, file: !1, line: 239, type: !20)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !111, file: !1, line: 239, type: !20)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch", scope: !111, file: !1, line: 239, type: !20)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !111, file: !1, line: 239, type: !20)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !111, file: !1, line: 239, type: !20)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !111, file: !1, line: 239, type: !20)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !111, file: !1, line: 239, type: !20)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "marker", scope: !111, file: !1, line: 239, type: !20)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !111, file: !1, line: 240, type: !20)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib", scope: !111, file: !1, line: 240, type: !20)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !111, file: !1, line: 240, type: !20)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontToVtxIVL", scope: !111, file: !1, line: 241, type: !9)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !111, file: !1, line: 242, type: !41)
!173 = !DISubprogram(name: "SymbFac_initFromPencil", scope: !1, file: !1, line: 435, type: !174, isLocal: false, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IVL* (%struct._ETree*, %struct._Pencil*)* @SymbFac_initFromPencil, variables: !189)
!174 = !DISubroutineType(types: !175)
!175 = !{!9, !33, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pencil", file: !178, line: 17, baseType: !179)
!178 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/SymbFac/src/../../Pencil/Pencil.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Pencil", file: !178, line: 18, size: 320, align: 64, elements: !180)
!180 = !{!181, !182, !183, !184, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !178, line: 19, baseType: !15, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "symflag", scope: !179, file: !178, line: 20, baseType: !15, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "inpmtxA", scope: !179, file: !178, line: 21, baseType: !114, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "inpmtxB", scope: !179, file: !178, line: 22, baseType: !114, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !179, file: !178, line: 23, baseType: !186, size: 128, align: 64, offset: 192)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, align: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 2)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "etree", arg: 1, scope: !173, file: !1, line: 436, type: !33)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pencil", arg: 2, scope: !173, file: !1, line: 437, type: !176)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inpmtxA", scope: !173, file: !1, line: 439, type: !114)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inpmtxB", scope: !173, file: !1, line: 439, type: !114)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !173, file: !1, line: 440, type: !15)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "front", scope: !173, file: !1, line: 440, type: !15)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !173, file: !1, line: 440, type: !15)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !173, file: !1, line: 440, type: !15)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !173, file: !1, line: 440, type: !15)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "J", scope: !173, file: !1, line: 440, type: !15)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfromchildren", scope: !173, file: !1, line: 440, type: !15)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nint", scope: !173, file: !1, line: 440, type: !15)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfront", scope: !173, file: !1, line: 440, type: !15)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvectorA", scope: !173, file: !1, line: 441, type: !15)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvectorB", scope: !173, file: !1, line: 441, type: !15)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nvtx", scope: !173, file: !1, line: 441, type: !15)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !173, file: !1, line: 441, type: !15)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !173, file: !1, line: 441, type: !15)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !173, file: !1, line: 441, type: !15)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !173, file: !1, line: 442, type: !20)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bndwghts", scope: !173, file: !1, line: 442, type: !20)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fch", scope: !173, file: !1, line: 442, type: !20)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !173, file: !1, line: 442, type: !20)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !173, file: !1, line: 442, type: !20)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !173, file: !1, line: 442, type: !20)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "link", scope: !173, file: !1, line: 442, type: !20)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "marker", scope: !173, file: !1, line: 443, type: !20)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodwghts", scope: !173, file: !1, line: 443, type: !20)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sib", scope: !173, file: !1, line: 443, type: !20)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtxToFront", scope: !173, file: !1, line: 443, type: !20)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frontToVtxIVL", scope: !173, file: !1, line: 444, type: !9)
