; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/Tree_IO.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [48 x i8] c"\0A error in Tree_readFromFile(%p,%s)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str2 = private unnamed_addr constant [60 x i8] c"\0A error in Tree_readFromFile(%p,%s)\0A unable to open file %s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str4 = private unnamed_addr constant [104 x i8] c"\0A error in Tree_readFromFile(%p,%s)\0A bad Tree file name %s,\0A must end in %s (binary) or %s (formatted)\0A\00", align 1
@.str5 = private unnamed_addr constant [57 x i8] c"\0A error in Tree_readFromFormattedFile(%p,%p)\0A bad input\0A\00", align 1
@.str6 = private unnamed_addr constant [67 x i8] c"\0A error in Tree_readFromFormattedFile(%p,%p)\0A %d items of %d read\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !138, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/Tree_IO.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !90, !101, !107, !115, !121, !127, !133}
!6 = !DISubprogram(name: "Tree_readFromFile", scope: !1, file: !1, line: 23, type: !7, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Tree*, i8*)* @Tree_readFromFile, variables: !23)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !21}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !12, line: 15, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/../Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !12, line: 16, size: 256, align: 64, elements: !14)
!14 = !{!15, !16, !17, !19, !20}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !13, file: !12, line: 17, baseType: !9, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !13, file: !12, line: 18, baseType: !9, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !13, file: !12, line: 19, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !13, file: !12, line: 20, baseType: !18, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !13, file: !12, line: 21, baseType: !18, size: 64, align: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !{!24, !25, !26, !87, !88, !89}
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !6, file: !1, line: 24, type: !10)
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !6, file: !1, line: 25, type: !21)
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !6, file: !1, line: 27, type: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 153, baseType: !30)
!29 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !29, line: 122, size: 1216, align: 64, elements: !31)
!31 = !{!32, !35, !36, !37, !39, !40, !45, !46, !47, !51, !55, !65, !71, !72, !75, !76, !80, !84, !85, !86}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !30, file: !29, line: 123, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !30, file: !29, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !30, file: !29, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !30, file: !29, line: 126, baseType: !38, size: 16, align: 16, offset: 128)
!38 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !30, file: !29, line: 127, baseType: !38, size: 16, align: 16, offset: 144)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !30, file: !29, line: 128, baseType: !41, size: 128, align: 64, offset: 192)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !29, line: 88, size: 128, align: 64, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !41, file: !29, line: 89, baseType: !33, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !41, file: !29, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !30, file: !29, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !30, file: !29, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !30, file: !29, line: 133, baseType: !48, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!9, !4}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !30, file: !29, line: 134, baseType: !52, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!9, !4, !21, !9}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !30, file: !29, line: 135, baseType: !56, size: 64, align: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !4, !59, !9}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !29, line: 77, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !61, line: 71, baseType: !62)
!61 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !30, file: !29, line: 136, baseType: !66, size: 64, align: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!9, !4, !69, !9}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !30, file: !29, line: 139, baseType: !41, size: 128, align: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !30, file: !29, line: 140, baseType: !73, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !29, line: 94, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !30, file: !29, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !30, file: !29, line: 144, baseType: !77, size: 24, align: 8, offset: 928)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 24, align: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 3)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !30, file: !29, line: 145, baseType: !81, size: 8, align: 8, offset: 952)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !30, file: !29, line: 148, baseType: !41, size: 128, align: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !30, file: !29, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !30, file: !29, line: 152, baseType: !59, size: 64, align: 64, offset: 1152)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !6, file: !1, line: 28, type: !9)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !6, file: !1, line: 28, type: !9)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !6, file: !1, line: 28, type: !9)
!90 = !DISubprogram(name: "Tree_readFromFormattedFile", scope: !1, file: !1, line: 92, type: !91, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Tree*, %struct.__sFILE*)* @Tree_readFromFormattedFile, variables: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{!9, !10, !27}
!93 = !{!94, !95, !96, !97}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !90, file: !1, line: 93, type: !10)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !90, file: !1, line: 94, type: !27)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !90, file: !1, line: 96, type: !9)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !90, file: !1, line: 97, type: !98)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 64, align: 32, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 2)
!101 = !DISubprogram(name: "Tree_readFromBinaryFile", scope: !1, file: !1, line: 169, type: !91, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Tree*, %struct.__sFILE*)* @Tree_readFromBinaryFile, variables: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !101, file: !1, line: 170, type: !10)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !101, file: !1, line: 171, type: !27)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !101, file: !1, line: 173, type: !9)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemp", scope: !101, file: !1, line: 174, type: !98)
!107 = !DISubprogram(name: "Tree_writeToFile", scope: !1, file: !1, line: 255, type: !7, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Tree*, i8*)* @Tree_writeToFile, variables: !108)
!108 = !{!109, !110, !111, !112, !113, !114}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !107, file: !1, line: 256, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !107, file: !1, line: 257, type: !21)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !107, file: !1, line: 259, type: !27)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnlength", scope: !107, file: !1, line: 260, type: !9)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !107, file: !1, line: 260, type: !9)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sulength", scope: !107, file: !1, line: 260, type: !9)
!115 = !DISubprogram(name: "Tree_writeToFormattedFile", scope: !1, file: !1, line: 329, type: !91, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Tree*, %struct.__sFILE*)* @Tree_writeToFormattedFile, variables: !116)
!116 = !{!117, !118, !119, !120}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !115, file: !1, line: 330, type: !10)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !115, file: !1, line: 331, type: !27)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !115, file: !1, line: 333, type: !9)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !115, file: !1, line: 333, type: !9)
