; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/Tree_metrics.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Tree = type { i32, i32, i32*, i32*, i32* }
%struct._IV = type { i32, i32, i32, i32* }
%struct._DV = type { i32, i32, i32, double* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [59 x i8] c"\0A fatal error in Tree_setSubtreeImetric(%p,%p)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [57 x i8] c"\0A fatal error in Tree_setDepthImetric(%p,%p)\0A bad input\0A\00", align 1
@.str2 = private unnamed_addr constant [57 x i8] c"\0A fatal error in Tree_setDepthDmetric(%p,%p)\0A bad input\0A\00", align 1
@.str3 = private unnamed_addr constant [58 x i8] c"\0A fatal error in Tree_setHeightImetric(%p,%p)\0A bad input\0A\00", align 1
@.str4 = private unnamed_addr constant [58 x i8] c"\0A fatal error in Tree_setHeightDmetric(%p,%p)\0A bad input\0A\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define %struct._IV* @Tree_setSubtreeImetric(%struct._Tree* %tree, %struct._IV* %vmetricIV) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/Tree_metrics.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !38, !60, !69, !78, !88}
!6 = !DISubprogram(name: "Tree_setSubtreeImetric", scope: !1, file: !1, line: 16, type: !7, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._Tree*, %struct._IV*)* @Tree_setSubtreeImetric, variables: !30)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !20, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "IV", file: !11, line: 20, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/../../IV/IV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IV", file: !11, line: 21, size: 192, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !12, file: !11, line: 22, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !12, file: !11, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !12, file: !11, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !12, file: !11, line: 25, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tree", file: !22, line: 15, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/../Tree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Tree", file: !22, line: 16, size: 256, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !23, file: !22, line: 17, baseType: !15, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !23, file: !22, line: 18, baseType: !15, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !23, file: !22, line: 19, baseType: !19, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fch", scope: !23, file: !22, line: 20, baseType: !19, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sib", scope: !23, file: !22, line: 21, baseType: !19, size: 64, align: 64, offset: 192)
!30 = !{!31, !32, !33, !34, !35, !36, !37}
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !6, file: !1, line: 17, type: !20)
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vmetricIV", arg: 2, scope: !6, file: !1, line: 18, type: !9)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !6, file: !1, line: 20, type: !15)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !6, file: !1, line: 20, type: !15)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmetric", scope: !6, file: !1, line: 21, type: !19)
!36 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetric", scope: !6, file: !1, line: 21, type: !19)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmetricIV", scope: !6, file: !1, line: 22, type: !9)
!38 = !DISubprogram(name: "Tree_setSubtreeDmetric", scope: !1, file: !1, line: 60, type: !39, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: %struct._DV* (%struct._Tree*, %struct._DV*)* @Tree_setSubtreeDmetric, variables: !52)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !20, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "DV", file: !43, line: 20, baseType: !44)
!43 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Tree/src/../../DV/DV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_DV", file: !43, line: 21, size: 192, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !44, file: !43, line: 22, baseType: !15, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !44, file: !43, line: 23, baseType: !15, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !44, file: !43, line: 24, baseType: !15, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !44, file: !43, line: 25, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!52 = !{!53, !54, !55, !56, !57, !58, !59}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !38, file: !1, line: 61, type: !20)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vmetricDV", arg: 2, scope: !38, file: !1, line: 62, type: !41)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !38, file: !1, line: 64, type: !15)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !38, file: !1, line: 64, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmetric", scope: !38, file: !1, line: 65, type: !50)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetric", scope: !38, file: !1, line: 65, type: !50)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmetricDV", scope: !38, file: !1, line: 66, type: !41)
!60 = !DISubprogram(name: "Tree_setDepthImetric", scope: !1, file: !1, line: 107, type: !7, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._Tree*, %struct._IV*)* @Tree_setDepthImetric, variables: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !60, file: !1, line: 108, type: !20)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vmetricIV", arg: 2, scope: !60, file: !1, line: 109, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !60, file: !1, line: 111, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !60, file: !1, line: 111, type: !15)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmetric", scope: !60, file: !1, line: 112, type: !19)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetric", scope: !60, file: !1, line: 112, type: !19)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmetricIV", scope: !60, file: !1, line: 113, type: !9)
!69 = !DISubprogram(name: "Tree_setDepthDmetric", scope: !1, file: !1, line: 154, type: !39, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: %struct._DV* (%struct._Tree*, %struct._DV*)* @Tree_setDepthDmetric, variables: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !69, file: !1, line: 155, type: !20)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vmetricDV", arg: 2, scope: !69, file: !1, line: 156, type: !41)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !69, file: !1, line: 158, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !69, file: !1, line: 158, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmetric", scope: !69, file: !1, line: 159, type: !50)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vmetric", scope: !69, file: !1, line: 159, type: !50)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmetricDV", scope: !69, file: !1, line: 160, type: !41)
!78 = !DISubprogram(name: "Tree_setHeightImetric", scope: !1, file: !1, line: 201, type: !7, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IV* (%struct._Tree*, %struct._IV*)* @Tree_setHeightImetric, variables: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !78, file: !1, line: 202, type: !20)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vmetricIV", arg: 2, scope: !78, file: !1, line: 203, type: !9)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !78, file: !1, line: 205, type: !15)
