; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_CV.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str1 = private unnamed_addr constant [95 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_CV.c\00", align 1
@.str3 = private unnamed_addr constant [52 x i8] c"\0A fatal error in CVcopy, size = %d, y = %p, x = %p\0A\00", align 1
@.str4 = private unnamed_addr constant [44 x i8] c"\0A fatal error in CVfill, size = %d, y = %p\0A\00", align 1
@.str5 = private unnamed_addr constant [56 x i8] c"\0A fatal error in CVfprintf, fp = %p, size = %d, y = %p\0A\00", align 1
@.str7 = private unnamed_addr constant [3 x i8] c"%c\00", align 1
@.str8 = private unnamed_addr constant [66 x i8] c"\0A fatal error in CVfp80\0A fp = %p, size = %d, y = %p, column = %d\0A\00", align 1
@.str9 = private unnamed_addr constant [4 x i8] c" %c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_CV.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !{!9, !17, !23, !34, !45, !117, !132, !137}
!9 = !DISubprogram(name: "CVinit", scope: !1, file: !1, line: 17, type: !10, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32, i8)* @CVinit, variables: !13)
!10 = !DISubroutineType(types: !11)
!11 = !{!4, !12, !5}
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !{!14, !15, !16}
!14 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !9, file: !1, line: 18, type: !12)
!15 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !9, file: !1, line: 19, type: !5)
!16 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !9, file: !1, line: 21, type: !4)
!17 = !DISubprogram(name: "CVinit2", scope: !1, file: !1, line: 42, type: !18, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CVinit2, variables: !20)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !12}
!20 = !{!21, !22}
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !17, file: !1, line: 43, type: !12)
!22 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !17, file: !1, line: 45, type: !4)
!23 = !DISubprogram(name: "CVcopy", scope: !1, file: !1, line: 62, type: !24, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, i8*)* @CVcopy, variables: !26)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !12, !4, !4}
!26 = !{!27, !28, !29, !30}
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !23, file: !1, line: 63, type: !12)
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !23, file: !1, line: 64, type: !4)
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !23, file: !1, line: 65, type: !4)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !31, file: !1, line: 75, type: !12)
!31 = distinct !DILexicalBlock(scope: !32, file: !1, line: 74, column: 8)
!32 = distinct !DILexicalBlock(scope: !33, file: !1, line: 69, column: 13)
!33 = distinct !DILexicalBlock(scope: !23, file: !1, line: 67, column: 6)
!34 = !DISubprogram(name: "CVfill", scope: !1, file: !1, line: 91, type: !35, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, i8)* @CVfill, variables: !37)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !12, !4, !5}
!37 = !{!38, !39, !40, !41}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !34, file: !1, line: 92, type: !12)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !34, file: !1, line: 93, type: !4)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 3, scope: !34, file: !1, line: 94, type: !5)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !42, file: !1, line: 104, type: !12)
!42 = distinct !DILexicalBlock(scope: !43, file: !1, line: 103, column: 8)
!43 = distinct !DILexicalBlock(scope: !44, file: !1, line: 98, column: 13)
!44 = distinct !DILexicalBlock(scope: !34, file: !1, line: 96, column: 6)
!45 = !DISubprogram(name: "CVfprintf", scope: !1, file: !1, line: 122, type: !46, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i8*)* @CVfprintf, variables: !108)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !12, !4}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !50, line: 153, baseType: !51)
!50 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !50, line: 122, size: 1216, align: 64, elements: !52)
!52 = !{!53, !56, !57, !58, !60, !61, !66, !67, !68, !72, !76, !86, !92, !93, !96, !97, !101, !105, !106, !107}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !51, file: !50, line: 123, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !51, file: !50, line: 124, baseType: !12, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !51, file: !50, line: 125, baseType: !12, size: 32, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !51, file: !50, line: 126, baseType: !59, size: 16, align: 16, offset: 128)
!59 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !51, file: !50, line: 127, baseType: !59, size: 16, align: 16, offset: 144)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !51, file: !50, line: 128, baseType: !62, size: 128, align: 64, offset: 192)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !50, line: 88, size: 128, align: 64, elements: !63)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !62, file: !50, line: 89, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !62, file: !50, line: 90, baseType: !12, size: 32, align: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !51, file: !50, line: 129, baseType: !12, size: 32, align: 32, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !51, file: !50, line: 132, baseType: !7, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !51, file: !50, line: 133, baseType: !69, size: 64, align: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!12, !7}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !51, file: !50, line: 134, baseType: !73, size: 64, align: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!12, !7, !4, !12}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !51, file: !50, line: 135, baseType: !77, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !7, !80, !12}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !50, line: 77, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !82, line: 71, baseType: !83)
!82 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !84, line: 46, baseType: !85)
!84 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !51, file: !50, line: 136, baseType: !87, size: 64, align: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!12, !7, !90, !12}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !51, file: !50, line: 139, baseType: !62, size: 128, align: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !51, file: !50, line: 140, baseType: !94, size: 64, align: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !50, line: 94, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !51, file: !50, line: 141, baseType: !12, size: 32, align: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !51, file: !50, line: 144, baseType: !98, size: 24, align: 8, offset: 928)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 3)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !51, file: !50, line: 145, baseType: !102, size: 8, align: 8, offset: 952)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !51, file: !50, line: 148, baseType: !62, size: 128, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !51, file: !50, line: 151, baseType: !12, size: 32, align: 32, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !51, file: !50, line: 152, baseType: !80, size: 64, align: 64, offset: 1152)
!108 = !{!109, !110, !111, !112}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !45, file: !1, line: 123, type: !48)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !45, file: !1, line: 124, type: !12)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !45, file: !1, line: 125, type: !4)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !113, file: !1, line: 134, type: !12)
!113 = distinct !DILexicalBlock(scope: !114, file: !1, line: 133, column: 11)
!114 = distinct !DILexicalBlock(scope: !115, file: !1, line: 128, column: 9)
!115 = distinct !DILexicalBlock(scope: !116, file: !1, line: 127, column: 31)
!116 = distinct !DILexicalBlock(scope: !45, file: !1, line: 127, column: 6)
!117 = !DISubprogram(name: "CVfp80", scope: !1, file: !1, line: 164, type: !118, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, i8*, i32, i32*)* @CVfp80, variables: !121)
!118 = !DISubroutineType(types: !119)
!119 = !{!12, !48, !12, !4, !12, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!121 = !{!122, !123, !124, !125, !126, !127}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !117, file: !1, line: 165, type: !48)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !117, file: !1, line: 166, type: !12)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !117, file: !1, line: 167, type: !4)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "column", arg: 4, scope: !117, file: !1, line: 168, type: !12)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pierr", arg: 5, scope: !117, file: !1, line: 169, type: !120)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !128, file: !1, line: 179, type: !12)
!128 = distinct !DILexicalBlock(scope: !129, file: !1, line: 178, column: 11)
!129 = distinct !DILexicalBlock(scope: !130, file: !1, line: 173, column: 9)
!130 = distinct !DILexicalBlock(scope: !131, file: !1, line: 172, column: 31)
!131 = distinct !DILexicalBlock(scope: !117, file: !1, line: 172, column: 6)
!132 = !DISubprogram(name: "CVfree", scope: !1, file: !1, line: 208, type: !133, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CVfree, variables: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !4}
!135 = !{!136}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 1, scope: !132, file: !1, line: 209, type: !4)
!137 = !DISubprogram(name: "CVfscanf", scope: !1, file: !1, line: 227, type: !138, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, i8*)* @CVfscanf, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{!12, !48, !12, !4}
!140 = !{!141, !142, !143, !144}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !137, file: !1, line: 228, type: !48)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !137, file: !1, line: 229, type: !12)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !137, file: !1, line: 230, type: !4)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !137, file: !1, line: 232, type: !12)
!145 = !{i32 2, !"Dwarf Version", i32 2}
!146 = !{i32 2, !"Debug Info Version", i32 700000003}
!147 = !{i32 1, !"PIC Level", i32 2}
!148 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!149 = !DIExpression()
!150 = !DILocation(line: 18, column: 11, scope: !9)
!151 = !DILocation(line: 19, column: 11, scope: !9)
!152 = !DILocation(line: 23, column: 11, scope: !153)
