; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_iohb.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [34 x i8] c"Insufficient memory for mat_typen\00", align 1
@.str1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str2 = private unnamed_addr constant [29 x i8] c"Error: Cannot open file: %s\0A\00", align 1
@.str3 = private unnamed_addr constant [4 x i8] c"%*s\00", align 1
@.str4 = private unnamed_addr constant [48 x i8] c"iohb.c: Null (or blank) first line of HB file.\0A\00", align 1
@.str5 = private unnamed_addr constant [11 x i8] c"%72c%8[^\0A]\00", align 1
@.str6 = private unnamed_addr constant [49 x i8] c"iohb.c: Null (or blank) second line of HB file.\0A\00", align 1
@.str7 = private unnamed_addr constant [3 x i8] c"%i\00", align 1
@.str8 = private unnamed_addr constant [6 x i8] c"%*i%i\00", align 1
@.str9 = private unnamed_addr constant [9 x i8] c"%*i%*i%i\00", align 1
@.str10 = private unnamed_addr constant [12 x i8] c"%*i%*i%*i%i\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !11, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_iohb.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7, !9, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!11 = !{!12, !114, !142, !185, !200, !242, !254, !317, !363, !392, !434, !462, !515, !525, !543, !550, !556}
!12 = !DISubprogram(name: "readHB_info", scope: !1, file: !1, line: 226, type: !13, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32*, i32*, i32*, i8**, i32*)* @readHB_info, variables: !18)
!13 = !DISubroutineType(types: !14)
!14 = !{!8, !15, !7, !7, !7, !17, !7}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !84, !85, !86, !87, !88, !89, !90, !91, !92, !96, !100, !104, !108, !109, !113}
!19 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !12, file: !1, line: 226, type: !15)
!20 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !12, file: !1, line: 226, type: !7)
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 3, scope: !12, file: !1, line: 226, type: !7)
!22 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !12, file: !1, line: 226, type: !7)
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Type", arg: 5, scope: !12, file: !1, line: 226, type: !17)
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Nrhs", arg: 6, scope: !12, file: !1, line: 227, type: !7)
!25 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_file", scope: !12, file: !1, line: 246, type: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 153, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !28, line: 122, size: 1216, align: 64, elements: !30)
!30 = !{!31, !34, !35, !36, !38, !39, !44, !45, !46, !50, !54, !64, !68, !69, !72, !73, !77, !81, !82, !83}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !29, file: !28, line: 123, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !29, file: !28, line: 124, baseType: !8, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !29, file: !28, line: 125, baseType: !8, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !29, file: !28, line: 126, baseType: !37, size: 16, align: 16, offset: 128)
!37 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !29, file: !28, line: 127, baseType: !37, size: 16, align: 16, offset: 144)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !29, file: !28, line: 128, baseType: !40, size: 128, align: 64, offset: 192)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !28, line: 88, size: 128, align: 64, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !40, file: !28, line: 89, baseType: !32, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !40, file: !28, line: 90, baseType: !8, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !29, file: !28, line: 129, baseType: !8, size: 32, align: 32, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !29, file: !28, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !29, file: !28, line: 133, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!8, !4}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !29, file: !28, line: 134, baseType: !51, size: 64, align: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!8, !4, !6, !8}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !29, file: !28, line: 135, baseType: !55, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !4, !58, !8}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !28, line: 77, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !60, line: 71, baseType: !61)
!60 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !29, file: !28, line: 136, baseType: !65, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!8, !4, !15, !8}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !29, file: !28, line: 139, baseType: !40, size: 128, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !29, file: !28, line: 140, baseType: !70, size: 64, align: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !28, line: 94, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !29, file: !28, line: 141, baseType: !8, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !29, file: !28, line: 144, baseType: !74, size: 24, align: 8, offset: 928)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !29, file: !28, line: 145, baseType: !78, size: 8, align: 8, offset: 952)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !29, file: !28, line: 148, baseType: !40, size: 128, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !29, file: !28, line: 151, baseType: !8, size: 32, align: 32, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !29, file: !28, line: 152, baseType: !58, size: 64, align: 64, offset: 1152)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Ptrcrd", scope: !12, file: !1, line: 247, type: !8)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Indcrd", scope: !12, file: !1, line: 247, type: !8)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Valcrd", scope: !12, file: !1, line: 247, type: !8)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Rhscrd", scope: !12, file: !1, line: 247, type: !8)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Nrow", scope: !12, file: !1, line: 248, type: !8)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Ncol", scope: !12, file: !1, line: 248, type: !8)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Nnzero", scope: !12, file: !1, line: 248, type: !8)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mat_type", scope: !12, file: !1, line: 249, type: !6)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Title", scope: !12, file: !1, line: 250, type: !93)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 584, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 73)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Key", scope: !12, file: !1, line: 250, type: !97)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 72, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 9)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Rhstype", scope: !12, file: !1, line: 250, type: !101)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 4)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Ptrfmt", scope: !12, file: !1, line: 251, type: !105)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 136, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 17)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Indfmt", scope: !12, file: !1, line: 251, type: !105)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Valfmt", scope: !12, file: !1, line: 251, type: !110)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 168, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 21)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Rhsfmt", scope: !12, file: !1, line: 251, type: !110)
!114 = !DISubprogram(name: "readHB_header", scope: !1, file: !1, line: 294, type: !115, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i8*, i8*, i8*, i32*, i32*, i32*, i32*, i8*, i8*, i8*, i8*, i32*, i32*, i32*, i32*, i8*)* @readHB_header, variables: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{!8, !26, !6, !6, !6, !7, !7, !7, !7, !6, !6, !6, !6, !7, !7, !7, !7, !6}
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in_file", arg: 1, scope: !114, file: !1, line: 294, type: !26)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Title", arg: 2, scope: !114, file: !1, line: 294, type: !6)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Key", arg: 3, scope: !114, file: !1, line: 294, type: !6)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Type", arg: 4, scope: !114, file: !1, line: 294, type: !6)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Nrow", arg: 5, scope: !114, file: !1, line: 295, type: !7)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Ncol", arg: 6, scope: !114, file: !1, line: 295, type: !7)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Nnzero", arg: 7, scope: !114, file: !1, line: 295, type: !7)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Nrhs", arg: 8, scope: !114, file: !1, line: 295, type: !7)
