; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_ZV.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [46 x i8] c"\0A fatal error in ZVinit(%d,%f,%f)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str2 = private unnamed_addr constant [95 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_ZV.c\00", align 1
@.str4 = private unnamed_addr constant [52 x i8] c"\0A fatal error in ZVdotU(%d,%p,%p,%p,%p)\0A bad input\0A\00", align 1
@.str5 = private unnamed_addr constant [52 x i8] c"\0A fatal error in ZVdotC(%d,%p,%p,%p,%p)\0A bad input\0A\00", align 1
@.str6 = private unnamed_addr constant [56 x i8] c"\0A fatal error in ZVdotiU(%d,%p,%p,%p,%p,%p)\0A bad input\0A\00", align 1
@.str7 = private unnamed_addr constant [52 x i8] c"\0A fatal error in ZVaxpy(%d,%p,%f,%f,%p)\0A bad input\0A\00", align 1

!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !95, file: !1, line: 296, type: !20)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !95, file: !1, line: 296, type: !20)
!114 = !DISubprogram(name: "ZVdotiC", scope: !1, file: !1, line: 336, type: !96, isLocal: false, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32*, double*, double*, double*)* @ZVdotiC, variables: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !114, file: !1, line: 337, type: !20)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !114, file: !1, line: 338, type: !5)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !114, file: !1, line: 339, type: !98)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !114, file: !1, line: 340, type: !5)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prdot", arg: 5, scope: !114, file: !1, line: 341, type: !5)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pidot", arg: 6, scope: !114, file: !1, line: 342, type: !5)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isum", scope: !114, file: !1, line: 344, type: !6)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rsum", scope: !114, file: !1, line: 344, type: !6)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ximag", scope: !114, file: !1, line: 344, type: !6)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xreal", scope: !114, file: !1, line: 344, type: !6)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yimag", scope: !114, file: !1, line: 344, type: !6)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yreal", scope: !114, file: !1, line: 344, type: !6)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !114, file: !1, line: 345, type: !20)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !114, file: !1, line: 345, type: !20)
!130 = !DISubprogram(name: "ZVaxpy", scope: !1, file: !1, line: 380, type: !131, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double, double, double*)* @ZVaxpy, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !20, !5, !6, !6, !5}
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !130, file: !1, line: 381, type: !20)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !130, file: !1, line: 382, type: !5)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "areal", arg: 3, scope: !130, file: !1, line: 383, type: !6)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aimag", arg: 4, scope: !130, file: !1, line: 384, type: !6)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !130, file: !1, line: 385, type: !5)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ximag", scope: !130, file: !1, line: 387, type: !6)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xreal", scope: !130, file: !1, line: 387, type: !6)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !130, file: !1, line: 388, type: !20)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !130, file: !1, line: 388, type: !20)
!143 = !DISubprogram(name: "ZVscale", scope: !1, file: !1, line: 424, type: !144, isLocal: false, isDefinition: true, scopeLine: 429, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double, double)* @ZVscale, variables: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !20, !5, !6, !6}
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !143, file: !1, line: 425, type: !20)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !143, file: !1, line: 426, type: !5)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "areal", arg: 3, scope: !143, file: !1, line: 427, type: !6)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aimag", arg: 4, scope: !143, file: !1, line: 428, type: !6)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yimag", scope: !143, file: !1, line: 430, type: !6)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yreal", scope: !143, file: !1, line: 430, type: !6)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !143, file: !1, line: 431, type: !20)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !143, file: !1, line: 431, type: !20)
!155 = !DISubprogram(name: "ZVfprintf", scope: !1, file: !1, line: 455, type: !156, isLocal: false, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, double*)* @ZVfprintf, variables: !220)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !158, !20, !5}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !160, line: 153, baseType: !161)
!160 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !160, line: 122, size: 1216, align: 64, elements: !162)
!162 = !{!163, !166, !167, !168, !170, !171, !176, !177, !178, !182, !188, !198, !204, !205, !208, !209, !213, !217, !218, !219}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !161, file: !160, line: 123, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !161, file: !160, line: 124, baseType: !20, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !161, file: !160, line: 125, baseType: !20, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !161, file: !160, line: 126, baseType: !169, size: 16, align: 16, offset: 128)
!169 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !161, file: !160, line: 127, baseType: !169, size: 16, align: 16, offset: 144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !161, file: !160, line: 128, baseType: !172, size: 128, align: 64, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !160, line: 88, size: 128, align: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !172, file: !160, line: 89, baseType: !164, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !172, file: !160, line: 90, baseType: !20, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !161, file: !160, line: 129, baseType: !20, size: 32, align: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !161, file: !160, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !161, file: !160, line: 133, baseType: !179, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!20, !4}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !161, file: !160, line: 134, baseType: !183, size: 64, align: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!20, !4, !186, !20}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !161, file: !160, line: 135, baseType: !189, size: 64, align: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !4, !192, !20}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !160, line: 77, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !194, line: 71, baseType: !195)
!194 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !196, line: 46, baseType: !197)
!196 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!197 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !161, file: !160, line: 136, baseType: !199, size: 64, align: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!20, !4, !202, !20}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !161, file: !160, line: 139, baseType: !172, size: 128, align: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !161, file: !160, line: 140, baseType: !206, size: 64, align: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !160, line: 94, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !161, file: !160, line: 141, baseType: !20, size: 32, align: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !161, file: !160, line: 144, baseType: !210, size: 24, align: 8, offset: 928)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 24, align: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !161, file: !160, line: 145, baseType: !214, size: 8, align: 8, offset: 952)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 8, align: 8, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 1)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !161, file: !160, line: 148, baseType: !172, size: 128, align: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !161, file: !160, line: 151, baseType: !20, size: 32, align: 32, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !161, file: !160, line: 152, baseType: !192, size: 64, align: 64, offset: 1152)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !155, file: !1, line: 456, type: !158)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !155, file: !1, line: 457, type: !20)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !155, file: !1, line: 458, type: !5)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !155, file: !1, line: 460, type: !20)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !155, file: !1, line: 460, type: !20)
!226 = !DISubprogram(name: "ZVminabs", scope: !1, file: !1, line: 488, type: !227, isLocal: false, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*)* @ZVminabs, variables: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{!6, !20, !5}
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238}
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !226, file: !1, line: 489, type: !20)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !226, file: !1, line: 490, type: !5)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs", scope: !226, file: !1, line: 492, type: !6)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imag", scope: !226, file: !1, line: 492, type: !6)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minabs", scope: !226, file: !1, line: 492, type: !6)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "real", scope: !226, file: !1, line: 492, type: !6)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !226, file: !1, line: 492, type: !6)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !226, file: !1, line: 493, type: !20)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !226, file: !1, line: 493, type: !20)
!239 = !DISubprogram(name: "ZVmaxabs", scope: !1, file: !1, line: 541, type: !227, isLocal: false, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*)* @ZVmaxabs, variables: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249}
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !239, file: !1, line: 542, type: !20)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !239, file: !1, line: 543, type: !5)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs", scope: !239, file: !1, line: 545, type: !6)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imag", scope: !239, file: !1, line: 545, type: !6)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxabs", scope: !239, file: !1, line: 545, type: !6)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "real", scope: !239, file: !1, line: 545, type: !6)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !239, file: !1, line: 545, type: !6)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !239, file: !1, line: 546, type: !20)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !239, file: !1, line: 546, type: !20)
!250 = !DISubprogram(name: "ZVcopy", scope: !1, file: !1, line: 594, type: !251, isLocal: false, isDefinition: true, scopeLine: 598, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*)* @ZVcopy, variables: !253)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !20, !5, !5}
!253 = !{!254, !255, !256, !257, !258}
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !250, file: !1, line: 595, type: !20)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !250, file: !1, line: 596, type: !5)
