; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_DV.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Drand = type { double, double, double, double, double, double, double, double, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [66 x i8] c"\0A fatal error in DVadd\0A invalid input, size = %d, y = %p, x = %p\0A\00", align 1
@.str1 = private unnamed_addr constant [79 x i8] c"\0A fatal error in DVaxpy\0A invalid input, size = %d, y = %p, alpha = %f, x = %p\0A\00", align 1
@.str2 = private unnamed_addr constant [91 x i8] c"\0A fatal error in DVaxpyi, invalid input\0A size = %d, y = %p, index = %p, alpha = %f, x = %p\00", align 1
@.str3 = private unnamed_addr constant [67 x i8] c"\0A fatal error in DVcopy, invalid input\0A size = %d, y = %p, x = %p\0A\00", align 1
@.str4 = private unnamed_addr constant [102 x i8] c"\0A fatal error in DVcompress, invalid data\0A size1 = %d, x1 = %p, y1 = %p\0A size2 = %d, x2 = %p, y2 = %p\00", align 1

!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size1", arg: 1, scope: !58, file: !1, line: 139, type: !10)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x1", arg: 2, scope: !58, file: !1, line: 140, type: !7)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y1", arg: 3, scope: !58, file: !1, line: 141, type: !7)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size2", arg: 4, scope: !58, file: !1, line: 142, type: !10)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x2", arg: 5, scope: !58, file: !1, line: 143, type: !7)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y2", arg: 6, scope: !58, file: !1, line: 144, type: !7)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !58, file: !1, line: 146, type: !8)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !58, file: !1, line: 146, type: !8)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !58, file: !1, line: 146, type: !8)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !58, file: !1, line: 146, type: !8)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totalPath", scope: !58, file: !1, line: 146, type: !8)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ds", scope: !58, file: !1, line: 147, type: !7)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !58, file: !1, line: 148, type: !10)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !58, file: !1, line: 148, type: !10)
!76 = !DISubprogram(name: "DVdot", scope: !1, file: !1, line: 227, type: !77, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*, double*)* @DVdot, variables: !79)
!77 = !DISubroutineType(types: !78)
!78 = !{!8, !10, !7, !7}
!79 = !{!80, !81, !82, !83, !84}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !76, file: !1, line: 228, type: !10)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !76, file: !1, line: 229, type: !7)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !76, file: !1, line: 230, type: !7)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !76, file: !1, line: 232, type: !8)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !85, file: !1, line: 239, type: !10)
!85 = distinct !DILexicalBlock(scope: !86, file: !1, line: 238, column: 11)
!86 = distinct !DILexicalBlock(scope: !87, file: !1, line: 234, column: 9)
!87 = distinct !DILexicalBlock(scope: !88, file: !1, line: 233, column: 17)
!88 = distinct !DILexicalBlock(scope: !76, file: !1, line: 233, column: 6)
!89 = !DISubprogram(name: "DVdoti", scope: !1, file: !1, line: 260, type: !90, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*, i32*, double*)* @DVdoti, variables: !92)
!90 = !DISubroutineType(types: !91)
!91 = !{!8, !10, !7, !38, !7}
!92 = !{!93, !94, !95, !96, !97, !98}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !89, file: !1, line: 261, type: !10)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !89, file: !1, line: 262, type: !7)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !89, file: !1, line: 263, type: !38)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !89, file: !1, line: 264, type: !7)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !89, file: !1, line: 266, type: !8)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !89, file: !1, line: 267, type: !10)
!99 = !DISubprogram(name: "DVfill", scope: !1, file: !1, line: 288, type: !100, isLocal: false, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double)* @DVfill, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !10, !7, !8}
!102 = !{!103, !104, !105, !106}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !99, file: !1, line: 289, type: !10)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !99, file: !1, line: 290, type: !7)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dval", arg: 3, scope: !99, file: !1, line: 291, type: !8)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !107, file: !1, line: 299, type: !10)
!107 = distinct !DILexicalBlock(scope: !108, file: !1, line: 298, column: 11)
!108 = distinct !DILexicalBlock(scope: !109, file: !1, line: 294, column: 9)
!109 = distinct !DILexicalBlock(scope: !110, file: !1, line: 293, column: 17)
!110 = distinct !DILexicalBlock(scope: !99, file: !1, line: 293, column: 6)
!111 = !DISubprogram(name: "DVfprintf", scope: !1, file: !1, line: 316, type: !112, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, double*)* @DVfprintf, variables: !174)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114, !10, !7}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !116, line: 153, baseType: !117)
!116 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !116, line: 122, size: 1216, align: 64, elements: !118)
!118 = !{!119, !122, !123, !124, !126, !127, !132, !133, !134, !138, !142, !152, !158, !159, !162, !163, !167, !171, !172, !173}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !117, file: !116, line: 123, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !117, file: !116, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !117, file: !116, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !117, file: !116, line: 126, baseType: !125, size: 16, align: 16, offset: 128)
!125 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !117, file: !116, line: 127, baseType: !125, size: 16, align: 16, offset: 144)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !117, file: !116, line: 128, baseType: !128, size: 128, align: 64, offset: 192)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !116, line: 88, size: 128, align: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !128, file: !116, line: 89, baseType: !120, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !128, file: !116, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !117, file: !116, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !117, file: !116, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !117, file: !116, line: 133, baseType: !135, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!10, !4}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !117, file: !116, line: 134, baseType: !139, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!10, !4, !5, !10}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !117, file: !116, line: 135, baseType: !143, size: 64, align: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !4, !146, !10}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !116, line: 77, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !148, line: 71, baseType: !149)
!148 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!151 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !117, file: !116, line: 136, baseType: !153, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!10, !4, !156, !10}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !117, file: !116, line: 139, baseType: !128, size: 128, align: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !117, file: !116, line: 140, baseType: !160, size: 64, align: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !116, line: 94, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !117, file: !116, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !117, file: !116, line: 144, baseType: !164, size: 24, align: 8, offset: 928)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 24, align: 8, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 3)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !117, file: !116, line: 145, baseType: !168, size: 8, align: 8, offset: 952)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 8, align: 8, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 1)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !117, file: !116, line: 148, baseType: !128, size: 128, align: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !117, file: !116, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !117, file: !116, line: 152, baseType: !146, size: 64, align: 64, offset: 1152)
!174 = !{!175, !176, !177, !178}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !111, file: !1, line: 317, type: !114)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !111, file: !1, line: 318, type: !10)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !111, file: !1, line: 319, type: !7)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !179, file: !1, line: 327, type: !10)
!179 = distinct !DILexicalBlock(scope: !180, file: !1, line: 326, column: 11)
!180 = distinct !DILexicalBlock(scope: !181, file: !1, line: 322, column: 9)
!181 = distinct !DILexicalBlock(scope: !182, file: !1, line: 321, column: 31)
!182 = distinct !DILexicalBlock(scope: !111, file: !1, line: 321, column: 6)
!183 = !DISubprogram(name: "DVfree", scope: !1, file: !1, line: 346, type: !184, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: void (double*)* @DVfree, variables: !186)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !7}
!186 = !{!187}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 1, scope: !183, file: !1, line: 347, type: !7)
!188 = !DISubprogram(name: "DVfscanf", scope: !1, file: !1, line: 364, type: !189, isLocal: false, isDefinition: true, scopeLine: 368, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, double*)* @DVfscanf, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!10, !114, !10, !7}
!191 = !{!192, !193, !194, !195, !196}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !188, file: !1, line: 365, type: !114)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !188, file: !1, line: 366, type: !10)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !188, file: !1, line: 367, type: !7)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !188, file: !1, line: 369, type: !10)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !188, file: !1, line: 369, type: !10)
!197 = !DISubprogram(name: "DVgather", scope: !1, file: !1, line: 393, type: !198, isLocal: false, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*, i32*)* @DVgather, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !10, !7, !7, !38}
!200 = !{!201, !202, !203, !204, !205}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !197, file: !1, line: 394, type: !10)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !197, file: !1, line: 395, type: !7)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !197, file: !1, line: 396, type: !7)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !197, file: !1, line: 397, type: !38)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !206, file: !1, line: 406, type: !10)
!206 = distinct !DILexicalBlock(scope: !207, file: !1, line: 405, column: 11)
!207 = distinct !DILexicalBlock(scope: !208, file: !1, line: 400, column: 9)
!208 = distinct !DILexicalBlock(scope: !209, file: !1, line: 399, column: 17)
!209 = distinct !DILexicalBlock(scope: !197, file: !1, line: 399, column: 6)
!210 = !DISubprogram(name: "DVgatherAddZero", scope: !1, file: !1, line: 423, type: !198, isLocal: false, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*, i32*)* @DVgatherAddZero, variables: !211)
!211 = !{!212, !213, !214, !215, !216, !221}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !210, file: !1, line: 424, type: !10)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !210, file: !1, line: 425, type: !7)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !210, file: !1, line: 426, type: !7)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !210, file: !1, line: 427, type: !38)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !217, file: !1, line: 436, type: !10)
!217 = distinct !DILexicalBlock(scope: !218, file: !1, line: 435, column: 11)
!218 = distinct !DILexicalBlock(scope: !219, file: !1, line: 430, column: 9)
!219 = distinct !DILexicalBlock(scope: !220, file: !1, line: 429, column: 17)
!220 = distinct !DILexicalBlock(scope: !210, file: !1, line: 429, column: 6)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !217, file: !1, line: 436, type: !10)
!222 = !DISubprogram(name: "DVgatherZero", scope: !1, file: !1, line: 455, type: !198, isLocal: false, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*, i32*)* @DVgatherZero, variables: !223)
!223 = !{!224, !225, !226, !227, !228, !233}
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !222, file: !1, line: 456, type: !10)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !222, file: !1, line: 457, type: !7)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !222, file: !1, line: 458, type: !7)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !222, file: !1, line: 459, type: !38)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !229, file: !1, line: 468, type: !10)
!229 = distinct !DILexicalBlock(scope: !230, file: !1, line: 467, column: 11)
!230 = distinct !DILexicalBlock(scope: !231, file: !1, line: 462, column: 9)
!231 = distinct !DILexicalBlock(scope: !232, file: !1, line: 461, column: 17)
!232 = distinct !DILexicalBlock(scope: !222, file: !1, line: 461, column: 6)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !229, file: !1, line: 468, type: !10)
!234 = !DISubprogram(name: "DVinit", scope: !1, file: !1, line: 490, type: !235, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: double* (i32, double)* @DVinit, variables: !237)
!235 = !DISubroutineType(types: !236)
!236 = !{!7, !10, !8}
!237 = !{!238, !239, !240}
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !234, file: !1, line: 491, type: !10)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dval", arg: 2, scope: !234, file: !1, line: 492, type: !8)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !234, file: !1, line: 494, type: !7)
!241 = !DISubprogram(name: "DVinit2", scope: !1, file: !1, line: 512, type: !242, isLocal: false, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, function: double* (i32)* @DVinit2, variables: !244)
!242 = !DISubroutineType(types: !243)
!243 = !{!7, !10}
!244 = !{!245, !246}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !241, file: !1, line: 513, type: !10)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !241, file: !1, line: 515, type: !7)
!247 = !DISubprogram(name: "DVinvPerm", scope: !1, file: !1, line: 531, type: !248, isLocal: false, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32*)* @DVinvPerm, variables: !250)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !10, !7, !38}
!250 = !{!251, !252, !253, !254, !259}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !247, file: !1, line: 532, type: !10)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !247, file: !1, line: 533, type: !7)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !247, file: !1, line: 534, type: !38)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !255, file: !1, line: 542, type: !7)
!255 = distinct !DILexicalBlock(scope: !256, file: !1, line: 541, column: 11)
!256 = distinct !DILexicalBlock(scope: !257, file: !1, line: 537, column: 9)
!257 = distinct !DILexicalBlock(scope: !258, file: !1, line: 536, column: 17)
!258 = distinct !DILexicalBlock(scope: !247, file: !1, line: 536, column: 6)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !255, file: !1, line: 543, type: !10)
!260 = !DISubprogram(name: "DVmax", scope: !1, file: !1, line: 564, type: !261, isLocal: false, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*, i32*)* @DVmax, variables: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{!8, !10, !7, !38}
!263 = !{!264, !265, !266, !267, !268, !269}
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !260, file: !1, line: 565, type: !10)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !260, file: !1, line: 566, type: !7)
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !260, file: !1, line: 567, type: !38)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !260, file: !1, line: 569, type: !8)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !260, file: !1, line: 570, type: !10)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !270, file: !1, line: 577, type: !10)
!270 = distinct !DILexicalBlock(scope: !271, file: !1, line: 576, column: 11)
!271 = distinct !DILexicalBlock(scope: !272, file: !1, line: 572, column: 9)
!272 = distinct !DILexicalBlock(scope: !273, file: !1, line: 571, column: 17)
!273 = distinct !DILexicalBlock(scope: !260, file: !1, line: 571, column: 6)
!274 = !DISubprogram(name: "DVmaxabs", scope: !1, file: !1, line: 603, type: !261, isLocal: false, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*, i32*)* @DVmaxabs, variables: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !286}
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !274, file: !1, line: 604, type: !10)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !274, file: !1, line: 605, type: !7)
!278 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !274, file: !1, line: 606, type: !38)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !274, file: !1, line: 608, type: !8)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !274, file: !1, line: 609, type: !10)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !282, file: !1, line: 617, type: !10)
!282 = distinct !DILexicalBlock(scope: !283, file: !1, line: 616, column: 11)
!283 = distinct !DILexicalBlock(scope: !284, file: !1, line: 612, column: 9)
!284 = distinct !DILexicalBlock(scope: !285, file: !1, line: 611, column: 17)
!285 = distinct !DILexicalBlock(scope: !274, file: !1, line: 611, column: 6)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !282, file: !1, line: 618, type: !8)
!287 = !DISubprogram(name: "DVmin", scope: !1, file: !1, line: 645, type: !261, isLocal: false, isDefinition: true, scopeLine: 649, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*, i32*)* @DVmin, variables: !288)
!288 = !{!289, !290, !291, !292, !293, !294}
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !287, file: !1, line: 646, type: !10)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !287, file: !1, line: 647, type: !7)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !287, file: !1, line: 648, type: !38)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !287, file: !1, line: 650, type: !8)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !287, file: !1, line: 651, type: !10)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !295, file: !1, line: 658, type: !10)
!295 = distinct !DILexicalBlock(scope: !296, file: !1, line: 657, column: 11)
!296 = distinct !DILexicalBlock(scope: !297, file: !1, line: 653, column: 9)
!297 = distinct !DILexicalBlock(scope: !298, file: !1, line: 652, column: 17)
!298 = distinct !DILexicalBlock(scope: !287, file: !1, line: 652, column: 6)
!299 = !DISubprogram(name: "DVminabs", scope: !1, file: !1, line: 684, type: !261, isLocal: false, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*, i32*)* @DVminabs, variables: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !311}
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !299, file: !1, line: 685, type: !10)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !299, file: !1, line: 686, type: !7)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !299, file: !1, line: 687, type: !38)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !299, file: !1, line: 689, type: !8)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !299, file: !1, line: 690, type: !10)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !307, file: !1, line: 698, type: !10)
!307 = distinct !DILexicalBlock(scope: !308, file: !1, line: 697, column: 11)
!308 = distinct !DILexicalBlock(scope: !309, file: !1, line: 693, column: 9)
!309 = distinct !DILexicalBlock(scope: !310, file: !1, line: 692, column: 17)
!310 = distinct !DILexicalBlock(scope: !299, file: !1, line: 692, column: 6)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !307, file: !1, line: 699, type: !8)
!312 = !DISubprogram(name: "DVperm", scope: !1, file: !1, line: 726, type: !248, isLocal: false, isDefinition: true, scopeLine: 730, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32*)* @DVperm, variables: !313)
!313 = !{!314, !315, !316, !317, !322}
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !312, file: !1, line: 727, type: !10)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !312, file: !1, line: 728, type: !7)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !312, file: !1, line: 729, type: !38)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !318, file: !1, line: 737, type: !7)
!318 = distinct !DILexicalBlock(scope: !319, file: !1, line: 736, column: 11)
!319 = distinct !DILexicalBlock(scope: !320, file: !1, line: 732, column: 9)
!320 = distinct !DILexicalBlock(scope: !321, file: !1, line: 731, column: 17)
!321 = distinct !DILexicalBlock(scope: !312, file: !1, line: 731, column: 6)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !318, file: !1, line: 738, type: !10)
!323 = !DISubprogram(name: "DVramp", scope: !1, file: !1, line: 758, type: !324, isLocal: false, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double, double)* @DVramp, variables: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !10, !7, !8, !8}
!326 = !{!327, !328, !329, !330, !331, !336}
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !323, file: !1, line: 759, type: !10)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !323, file: !1, line: 760, type: !7)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !323, file: !1, line: 761, type: !8)
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc", arg: 4, scope: !323, file: !1, line: 762, type: !8)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !332, file: !1, line: 771, type: !10)
!332 = distinct !DILexicalBlock(scope: !333, file: !1, line: 770, column: 11)
!333 = distinct !DILexicalBlock(scope: !334, file: !1, line: 765, column: 9)
!334 = distinct !DILexicalBlock(scope: !335, file: !1, line: 764, column: 17)
!335 = distinct !DILexicalBlock(scope: !323, file: !1, line: 764, column: 6)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !332, file: !1, line: 772, type: !8)
!337 = !DISubprogram(name: "DVsub", scope: !1, file: !1, line: 789, type: !13, isLocal: false, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*)* @DVsub, variables: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !337, file: !1, line: 790, type: !10)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !337, file: !1, line: 791, type: !7)
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !337, file: !1, line: 792, type: !7)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !343, file: !1, line: 800, type: !10)
!343 = distinct !DILexicalBlock(scope: !344, file: !1, line: 799, column: 11)
!344 = distinct !DILexicalBlock(scope: !345, file: !1, line: 795, column: 9)
!345 = distinct !DILexicalBlock(scope: !346, file: !1, line: 794, column: 17)
!346 = distinct !DILexicalBlock(scope: !337, file: !1, line: 794, column: 6)
!347 = !DISubprogram(name: "DVscale", scope: !1, file: !1, line: 817, type: !100, isLocal: false, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double)* @DVscale, variables: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !347, file: !1, line: 818, type: !10)
!350 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !347, file: !1, line: 819, type: !7)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 3, scope: !347, file: !1, line: 820, type: !8)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !353, file: !1, line: 829, type: !10)
!353 = distinct !DILexicalBlock(scope: !354, file: !1, line: 828, column: 11)
!354 = distinct !DILexicalBlock(scope: !355, file: !1, line: 823, column: 9)
!355 = distinct !DILexicalBlock(scope: !356, file: !1, line: 822, column: 33)
!356 = distinct !DILexicalBlock(scope: !347, file: !1, line: 822, column: 6)
!357 = !DISubprogram(name: "DVscatter", scope: !1, file: !1, line: 846, type: !358, isLocal: false, isDefinition: true, scopeLine: 851, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32*, double*)* @DVscatter, variables: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !10, !7, !38, !7}
!360 = !{!361, !362, !363, !364, !365}
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !357, file: !1, line: 847, type: !10)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !357, file: !1, line: 848, type: !7)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !357, file: !1, line: 849, type: !38)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !357, file: !1, line: 850, type: !7)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !366, file: !1, line: 859, type: !10)
!366 = distinct !DILexicalBlock(scope: !367, file: !1, line: 858, column: 11)
!367 = distinct !DILexicalBlock(scope: !368, file: !1, line: 853, column: 9)
!368 = distinct !DILexicalBlock(scope: !369, file: !1, line: 852, column: 17)
!369 = distinct !DILexicalBlock(scope: !357, file: !1, line: 852, column: 6)
!370 = !DISubprogram(name: "DVscatterAdd", scope: !1, file: !1, line: 876, type: !358, isLocal: false, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32*, double*)* @DVscatterAdd, variables: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !370, file: !1, line: 877, type: !10)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !370, file: !1, line: 878, type: !7)
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !370, file: !1, line: 879, type: !38)
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !370, file: !1, line: 880, type: !7)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !377, file: !1, line: 889, type: !10)
!377 = distinct !DILexicalBlock(scope: !378, file: !1, line: 888, column: 11)
!378 = distinct !DILexicalBlock(scope: !379, file: !1, line: 883, column: 9)
!379 = distinct !DILexicalBlock(scope: !380, file: !1, line: 882, column: 17)
!380 = distinct !DILexicalBlock(scope: !370, file: !1, line: 882, column: 6)
!381 = !DISubprogram(name: "DVscatterAddZero", scope: !1, file: !1, line: 906, type: !358, isLocal: false, isDefinition: true, scopeLine: 911, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32*, double*)* @DVscatterAddZero, variables: !382)
!382 = !{!383, !384, !385, !386, !387}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !381, file: !1, line: 907, type: !10)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !381, file: !1, line: 908, type: !7)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !381, file: !1, line: 909, type: !38)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !381, file: !1, line: 910, type: !7)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !388, file: !1, line: 919, type: !10)
!388 = distinct !DILexicalBlock(scope: !389, file: !1, line: 918, column: 11)
!389 = distinct !DILexicalBlock(scope: !390, file: !1, line: 913, column: 9)
!390 = distinct !DILexicalBlock(scope: !391, file: !1, line: 912, column: 17)
!391 = distinct !DILexicalBlock(scope: !381, file: !1, line: 912, column: 6)
!392 = !DISubprogram(name: "DVscatterZero", scope: !1, file: !1, line: 937, type: !358, isLocal: false, isDefinition: true, scopeLine: 942, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32*, double*)* @DVscatterZero, variables: !393)
!393 = !{!394, !395, !396, !397, !398}
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !392, file: !1, line: 938, type: !10)
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !392, file: !1, line: 939, type: !7)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !392, file: !1, line: 940, type: !38)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !392, file: !1, line: 941, type: !7)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !399, file: !1, line: 950, type: !10)
!399 = distinct !DILexicalBlock(scope: !400, file: !1, line: 949, column: 11)
!400 = distinct !DILexicalBlock(scope: !401, file: !1, line: 944, column: 9)
!401 = distinct !DILexicalBlock(scope: !402, file: !1, line: 943, column: 17)
!402 = distinct !DILexicalBlock(scope: !392, file: !1, line: 943, column: 6)
!403 = !DISubprogram(name: "DVsum", scope: !1, file: !1, line: 968, type: !404, isLocal: false, isDefinition: true, scopeLine: 971, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*)* @DVsum, variables: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{!8, !10, !7}
!406 = !{!407, !408, !409, !410}
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !403, file: !1, line: 969, type: !10)
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !403, file: !1, line: 970, type: !7)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !403, file: !1, line: 972, type: !8)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !411, file: !1, line: 979, type: !10)
!411 = distinct !DILexicalBlock(scope: !412, file: !1, line: 978, column: 11)
!412 = distinct !DILexicalBlock(scope: !413, file: !1, line: 974, column: 9)
!413 = distinct !DILexicalBlock(scope: !414, file: !1, line: 973, column: 17)
!414 = distinct !DILexicalBlock(scope: !403, file: !1, line: 973, column: 6)
!415 = !DISubprogram(name: "DVsumabs", scope: !1, file: !1, line: 997, type: !404, isLocal: false, isDefinition: true, scopeLine: 1000, flags: DIFlagPrototyped, isOptimized: true, function: double (i32, double*)* @DVsumabs, variables: !416)
!416 = !{!417, !418, !419, !420}
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !415, file: !1, line: 998, type: !10)
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !415, file: !1, line: 999, type: !7)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !415, file: !1, line: 1001, type: !8)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !421, file: !1, line: 1008, type: !10)
!421 = distinct !DILexicalBlock(scope: !422, file: !1, line: 1007, column: 11)
!422 = distinct !DILexicalBlock(scope: !423, file: !1, line: 1003, column: 9)
!423 = distinct !DILexicalBlock(scope: !424, file: !1, line: 1002, column: 17)
!424 = distinct !DILexicalBlock(scope: !415, file: !1, line: 1002, column: 6)
!425 = !DISubprogram(name: "DVswap", scope: !1, file: !1, line: 1025, type: !13, isLocal: false, isDefinition: true, scopeLine: 1029, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*)* @DVswap, variables: !426)
!426 = !{!427, !428, !429, !430, !435}
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !425, file: !1, line: 1026, type: !10)
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !425, file: !1, line: 1027, type: !7)
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !425, file: !1, line: 1028, type: !7)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !431, file: !1, line: 1036, type: !8)
!431 = distinct !DILexicalBlock(scope: !432, file: !1, line: 1035, column: 11)
!432 = distinct !DILexicalBlock(scope: !433, file: !1, line: 1031, column: 9)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 1030, column: 17)
!434 = distinct !DILexicalBlock(scope: !425, file: !1, line: 1030, column: 6)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !431, file: !1, line: 1037, type: !10)
!436 = !DISubprogram(name: "DVzero", scope: !1, file: !1, line: 1056, type: !437, isLocal: false, isDefinition: true, scopeLine: 1059, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*)* @DVzero, variables: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !10, !7}
!439 = !{!440, !441, !442}
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !436, file: !1, line: 1057, type: !10)
!441 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !436, file: !1, line: 1058, type: !7)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !443, file: !1, line: 1066, type: !10)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 1065, column: 11)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 1061, column: 9)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 1060, column: 17)
!446 = distinct !DILexicalBlock(scope: !436, file: !1, line: 1060, column: 6)
!447 = !DISubprogram(name: "DVshuffle", scope: !1, file: !1, line: 1091, type: !448, isLocal: false, isDefinition: true, scopeLine: 1095, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, i32)* @DVshuffle, variables: !450)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !10, !7, !10}
!450 = !{!451, !452, !453, !454, !472, !473, !474}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !447, file: !1, line: 1092, type: !10)
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !447, file: !1, line: 1093, type: !7)
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 3, scope: !447, file: !1, line: 1094, type: !10)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "drand", scope: !455, file: !1, line: 1102, type: !459)
!455 = distinct !DILexicalBlock(scope: !456, file: !1, line: 1101, column: 11)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 1097, column: 9)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 1096, column: 30)
!458 = distinct !DILexicalBlock(scope: !447, file: !1, line: 1096, column: 6)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drand", file: !460, line: 27, baseType: !461)
!460 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/../../Drand/Drand.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Drand", file: !460, line: 17, size: 576, align: 64, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !461, file: !460, line: 18, baseType: !8, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !461, file: !460, line: 19, baseType: !8, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "base1", scope: !461, file: !460, line: 20, baseType: !8, size: 64, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !461, file: !460, line: 21, baseType: !8, size: 64, align: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !461, file: !460, line: 22, baseType: !8, size: 64, align: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !461, file: !460, line: 23, baseType: !8, size: 64, align: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !461, file: !460, line: 24, baseType: !8, size: 64, align: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !461, file: !460, line: 25, baseType: !8, size: 64, align: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !461, file: !460, line: 26, baseType: !10, size: 32, align: 32, offset: 512)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !455, file: !1, line: 1103, type: !8)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !455, file: !1, line: 1104, type: !10)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !455, file: !1, line: 1104, type: !10)
!475 = !DISubprogram(name: "DVscale2", scope: !1, file: !1, line: 1130, type: !476, isLocal: false, isDefinition: true, scopeLine: 1138, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*, double, double, double, double)* @DVscale2, variables: !478)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !10, !7, !7, !8, !8, !8, !8}
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !475, file: !1, line: 1131, type: !10)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !475, file: !1, line: 1132, type: !7)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !475, file: !1, line: 1133, type: !7)
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 4, scope: !475, file: !1, line: 1134, type: !8)
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 5, scope: !475, file: !1, line: 1135, type: !8)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 6, scope: !475, file: !1, line: 1136, type: !8)
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 7, scope: !475, file: !1, line: 1137, type: !8)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xi", scope: !475, file: !1, line: 1139, type: !8)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yi", scope: !475, file: !1, line: 1139, type: !8)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !475, file: !1, line: 1140, type: !10)
!489 = !DISubprogram(name: "DVaxpy2", scope: !1, file: !1, line: 1168, type: !490, isLocal: false, isDefinition: true, scopeLine: 1175, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double, double*, double, double*)* @DVaxpy2, variables: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !10, !7, !8, !7, !8, !7}
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501}
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !489, file: !1, line: 1169, type: !10)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 2, scope: !489, file: !1, line: 1170, type: !7)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 3, scope: !489, file: !1, line: 1171, type: !8)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !489, file: !1, line: 1172, type: !7)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 5, scope: !489, file: !1, line: 1173, type: !8)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 6, scope: !489, file: !1, line: 1174, type: !7)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xi", scope: !489, file: !1, line: 1176, type: !8)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yi", scope: !489, file: !1, line: 1176, type: !8)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !489, file: !1, line: 1177, type: !10)
!502 = !DISubprogram(name: "DVdot33", scope: !1, file: !1, line: 1210, type: !503, isLocal: false, isDefinition: true, scopeLine: 1219, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, double*, double*, double*, double*, double*, double*, double*)* @DVdot33, variables: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !10, !7, !7, !7, !7, !7, !7, !7}
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !528, !529, !530, !531, !532}
