; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_IV.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._Drand = type { double, double, double, double, double, double, double, double, i32 }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [103 x i8] c"\0A fatal error in IVcompress, invalid data\0A size1 = %d, x1 = %p, y1 = %p\0A size2 = %d, x2 = %p, y2 = %p\0A\00", align 1
@.str1 = private unnamed_addr constant [65 x i8] c"\0A fatal error in IVcopy, invalid data\0A size = %d, y = %p, x = %p\00", align 1
@.str2 = private unnamed_addr constant [69 x i8] c"\0A fatal error in IVfill, invalid data\0A size = %d, y = %p, ival = %d\0A\00", align 1
@.str3 = private unnamed_addr constant [70 x i8] c"\0A fatal error in IVfprintf, invalid data\0A fp = %p, size = %d, y = %p\0A\00", align 1
@.str5 = private unnamed_addr constant [5 x i8] c" %4d\00", align 1
@.str6 = private unnamed_addr constant [81 x i8] c"\0A fatal error in IVfp80, invalid input\0A fp = %p, size = %d, y = %p, column = %d\0A\00", align 1

!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !{!12, !31, !43, !55, !127, !143, !148, !156, !169, !176, !182, !195, !206, !220, !233, !245, !258, !269, !283, !294, !306, !317, !328, !339, !366}
!12 = !DISubprogram(name: "IVcompress", scope: !1, file: !1, line: 20, type: !13, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32*, i32, i32*, i32*)* @IVcompress, variables: !15)
!13 = !DISubroutineType(types: !14)
!14 = !{!9, !9, !8, !8, !9, !8, !8}
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !29, !30}
!16 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size1", arg: 1, scope: !12, file: !1, line: 21, type: !9)
!17 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x1", arg: 2, scope: !12, file: !1, line: 22, type: !8)
!18 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y1", arg: 3, scope: !12, file: !1, line: 23, type: !8)
!19 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size2", arg: 4, scope: !12, file: !1, line: 24, type: !9)
!20 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x2", arg: 5, scope: !12, file: !1, line: 25, type: !8)
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y2", arg: 6, scope: !12, file: !1, line: 26, type: !8)
!22 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !12, file: !1, line: 28, type: !5)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !12, file: !1, line: 28, type: !5)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !12, file: !1, line: 28, type: !5)
!25 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !12, file: !1, line: 28, type: !5)
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totalPath", scope: !12, file: !1, line: 28, type: !5)
!27 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ds", scope: !12, file: !1, line: 29, type: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !12, file: !1, line: 30, type: !9)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !12, file: !1, line: 30, type: !9)
!31 = !DISubprogram(name: "IVcopy", scope: !1, file: !1, line: 109, type: !32, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*)* @IVcopy, variables: !34)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !9, !8, !8}
!34 = !{!35, !36, !37, !38}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !31, file: !1, line: 110, type: !9)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !31, file: !1, line: 111, type: !8)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !31, file: !1, line: 112, type: !8)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !39, file: !1, line: 120, type: !9)
!39 = distinct !DILexicalBlock(scope: !40, file: !1, line: 119, column: 11)
!40 = distinct !DILexicalBlock(scope: !41, file: !1, line: 115, column: 9)
!41 = distinct !DILexicalBlock(scope: !42, file: !1, line: 114, column: 17)
!42 = distinct !DILexicalBlock(scope: !31, file: !1, line: 114, column: 6)
!43 = !DISubprogram(name: "IVfill", scope: !1, file: !1, line: 137, type: !44, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32)* @IVfill, variables: !46)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !9, !8, !9}
!46 = !{!47, !48, !49, !50}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !43, file: !1, line: 138, type: !9)
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !43, file: !1, line: 139, type: !8)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 3, scope: !43, file: !1, line: 140, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !51, file: !1, line: 149, type: !9)
!51 = distinct !DILexicalBlock(scope: !52, file: !1, line: 148, column: 11)
!52 = distinct !DILexicalBlock(scope: !53, file: !1, line: 143, column: 9)
!53 = distinct !DILexicalBlock(scope: !54, file: !1, line: 142, column: 17)
!54 = distinct !DILexicalBlock(scope: !43, file: !1, line: 142, column: 6)
!55 = !DISubprogram(name: "IVfprintf", scope: !1, file: !1, line: 166, type: !56, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32*)* @IVfprintf, variables: !118)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !9, !8}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !60, line: 153, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !60, line: 122, size: 1216, align: 64, elements: !62)
!62 = !{!63, !66, !67, !68, !70, !71, !76, !77, !78, !82, !86, !96, !102, !103, !106, !107, !111, !115, !116, !117}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !61, file: !60, line: 123, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !61, file: !60, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !61, file: !60, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !60, line: 126, baseType: !69, size: 16, align: 16, offset: 128)
!69 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !61, file: !60, line: 127, baseType: !69, size: 16, align: 16, offset: 144)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !61, file: !60, line: 128, baseType: !72, size: 128, align: 64, offset: 192)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !60, line: 88, size: 128, align: 64, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !72, file: !60, line: 89, baseType: !64, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !72, file: !60, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !61, file: !60, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !61, file: !60, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !61, file: !60, line: 133, baseType: !79, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!9, !4}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !61, file: !60, line: 134, baseType: !83, size: 64, align: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!9, !4, !6, !9}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !61, file: !60, line: 135, baseType: !87, size: 64, align: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !4, !90, !9}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !60, line: 77, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !92, line: 71, baseType: !93)
!92 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !61, file: !60, line: 136, baseType: !97, size: 64, align: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!9, !4, !100, !9}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !61, file: !60, line: 139, baseType: !72, size: 128, align: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !61, file: !60, line: 140, baseType: !104, size: 64, align: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !60, line: 94, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !61, file: !60, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !61, file: !60, line: 144, baseType: !108, size: 24, align: 8, offset: 928)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 24, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 3)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !61, file: !60, line: 145, baseType: !112, size: 8, align: 8, offset: 952)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !61, file: !60, line: 148, baseType: !72, size: 128, align: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !61, file: !60, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !60, line: 152, baseType: !90, size: 64, align: 64, offset: 1152)
!118 = !{!119, !120, !121, !122}
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !55, file: !1, line: 167, type: !58)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !55, file: !1, line: 168, type: !9)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !55, file: !1, line: 169, type: !8)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !123, file: !1, line: 178, type: !9)
!123 = distinct !DILexicalBlock(scope: !124, file: !1, line: 177, column: 11)
!124 = distinct !DILexicalBlock(scope: !125, file: !1, line: 172, column: 9)
!125 = distinct !DILexicalBlock(scope: !126, file: !1, line: 171, column: 31)
!126 = distinct !DILexicalBlock(scope: !55, file: !1, line: 171, column: 6)
!127 = !DISubprogram(name: "IVfp80", scope: !1, file: !1, line: 210, type: !128, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, i32*, i32, i32*)* @IVfp80, variables: !130)
!128 = !DISubroutineType(types: !129)
!129 = !{!9, !58, !9, !8, !9, !8}
!130 = !{!131, !132, !133, !134, !135, !136, !141, !142}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !127, file: !1, line: 211, type: !58)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !127, file: !1, line: 212, type: !9)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !127, file: !1, line: 213, type: !8)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "column", arg: 4, scope: !127, file: !1, line: 214, type: !9)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pierr", arg: 5, scope: !127, file: !1, line: 215, type: !8)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !137, file: !1, line: 225, type: !9)
!137 = distinct !DILexicalBlock(scope: !138, file: !1, line: 224, column: 11)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 219, column: 9)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 218, column: 31)
!140 = distinct !DILexicalBlock(scope: !127, file: !1, line: 218, column: 6)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inum", scope: !137, file: !1, line: 225, type: !9)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nchar", scope: !137, file: !1, line: 225, type: !9)
!143 = !DISubprogram(name: "IVfree", scope: !1, file: !1, line: 267, type: !144, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @IVfree, variables: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !8}
!146 = !{!147}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 1, scope: !143, file: !1, line: 268, type: !8)
!148 = !DISubprogram(name: "IVfscanf", scope: !1, file: !1, line: 284, type: !149, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, i32*)* @IVfscanf, variables: !151)
!149 = !DISubroutineType(types: !150)
!150 = !{!9, !58, !9, !8}
!151 = !{!152, !153, !154, !155}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !148, file: !1, line: 285, type: !58)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !148, file: !1, line: 286, type: !9)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !148, file: !1, line: 287, type: !8)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !148, file: !1, line: 289, type: !9)
!156 = !DISubprogram(name: "IVgather", scope: !1, file: !1, line: 314, type: !157, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*, i32*)* @IVgather, variables: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !9, !8, !8, !8}
!159 = !{!160, !161, !162, !163, !164}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !156, file: !1, line: 315, type: !9)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !156, file: !1, line: 316, type: !8)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !156, file: !1, line: 317, type: !8)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !156, file: !1, line: 318, type: !8)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !165, file: !1, line: 327, type: !9)
!165 = distinct !DILexicalBlock(scope: !166, file: !1, line: 326, column: 11)
!166 = distinct !DILexicalBlock(scope: !167, file: !1, line: 321, column: 9)
!167 = distinct !DILexicalBlock(scope: !168, file: !1, line: 320, column: 17)
!168 = distinct !DILexicalBlock(scope: !156, file: !1, line: 320, column: 6)
!169 = !DISubprogram(name: "IVinit", scope: !1, file: !1, line: 347, type: !170, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32, i32)* @IVinit, variables: !172)
!170 = !DISubroutineType(types: !171)
!171 = !{!8, !9, !9}
!172 = !{!173, !174, !175}
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !169, file: !1, line: 348, type: !9)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 2, scope: !169, file: !1, line: 349, type: !9)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !169, file: !1, line: 351, type: !8)
!176 = !DISubprogram(name: "IVinit2", scope: !1, file: !1, line: 369, type: !177, isLocal: false, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32)* @IVinit2, variables: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{!8, !9}
!179 = !{!180, !181}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !176, file: !1, line: 370, type: !9)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !176, file: !1, line: 372, type: !8)
!182 = !DISubprogram(name: "IVinverse", scope: !1, file: !1, line: 388, type: !183, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32, i32*)* @IVinverse, variables: !185)
!183 = !DISubroutineType(types: !184)
!184 = !{!8, !9, !8}
!185 = !{!186, !187, !188, !189, !194}
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !182, file: !1, line: 389, type: !9)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !182, file: !1, line: 390, type: !8)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !182, file: !1, line: 392, type: !8)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !190, file: !1, line: 399, type: !9)
!190 = distinct !DILexicalBlock(scope: !191, file: !1, line: 398, column: 11)
!191 = distinct !DILexicalBlock(scope: !192, file: !1, line: 394, column: 9)
!192 = distinct !DILexicalBlock(scope: !193, file: !1, line: 393, column: 17)
!193 = distinct !DILexicalBlock(scope: !182, file: !1, line: 393, column: 6)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !190, file: !1, line: 399, type: !9)
!195 = !DISubprogram(name: "IVinvPerm", scope: !1, file: !1, line: 426, type: !32, isLocal: false, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*)* @IVinvPerm, variables: !196)
!196 = !{!197, !198, !199, !200, !205}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !195, file: !1, line: 427, type: !9)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !195, file: !1, line: 428, type: !8)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !195, file: !1, line: 429, type: !8)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !201, file: !1, line: 437, type: !8)
!201 = distinct !DILexicalBlock(scope: !202, file: !1, line: 436, column: 11)
!202 = distinct !DILexicalBlock(scope: !203, file: !1, line: 432, column: 9)
!203 = distinct !DILexicalBlock(scope: !204, file: !1, line: 431, column: 17)
!204 = distinct !DILexicalBlock(scope: !195, file: !1, line: 431, column: 6)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !201, file: !1, line: 438, type: !9)
!206 = !DISubprogram(name: "IVmax", scope: !1, file: !1, line: 460, type: !207, isLocal: false, isDefinition: true, scopeLine: 464, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32*)* @IVmax, variables: !209)
!207 = !DISubroutineType(types: !208)
!208 = !{!9, !9, !8, !8}
!209 = !{!210, !211, !212, !213, !214, !215}
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !206, file: !1, line: 461, type: !9)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !206, file: !1, line: 462, type: !8)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !206, file: !1, line: 463, type: !8)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !206, file: !1, line: 465, type: !9)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !206, file: !1, line: 466, type: !9)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !216, file: !1, line: 473, type: !9)
!216 = distinct !DILexicalBlock(scope: !217, file: !1, line: 472, column: 11)
!217 = distinct !DILexicalBlock(scope: !218, file: !1, line: 468, column: 9)
!218 = distinct !DILexicalBlock(scope: !219, file: !1, line: 467, column: 17)
!219 = distinct !DILexicalBlock(scope: !206, file: !1, line: 467, column: 6)
!220 = !DISubprogram(name: "IVmaxabs", scope: !1, file: !1, line: 498, type: !207, isLocal: false, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32*)* @IVmaxabs, variables: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !232}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !220, file: !1, line: 499, type: !9)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !220, file: !1, line: 500, type: !8)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !220, file: !1, line: 501, type: !8)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxval", scope: !220, file: !1, line: 503, type: !9)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !220, file: !1, line: 504, type: !9)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !228, file: !1, line: 512, type: !9)
!228 = distinct !DILexicalBlock(scope: !229, file: !1, line: 511, column: 11)
!229 = distinct !DILexicalBlock(scope: !230, file: !1, line: 507, column: 9)
!230 = distinct !DILexicalBlock(scope: !231, file: !1, line: 506, column: 17)
!231 = distinct !DILexicalBlock(scope: !220, file: !1, line: 506, column: 6)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !228, file: !1, line: 512, type: !9)
!233 = !DISubprogram(name: "IVmin", scope: !1, file: !1, line: 539, type: !207, isLocal: false, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32*)* @IVmin, variables: !234)
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !233, file: !1, line: 540, type: !9)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !233, file: !1, line: 541, type: !8)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !233, file: !1, line: 542, type: !8)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !233, file: !1, line: 544, type: !9)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !233, file: !1, line: 545, type: !9)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !241, file: !1, line: 552, type: !9)
!241 = distinct !DILexicalBlock(scope: !242, file: !1, line: 551, column: 11)
!242 = distinct !DILexicalBlock(scope: !243, file: !1, line: 547, column: 9)
!243 = distinct !DILexicalBlock(scope: !244, file: !1, line: 546, column: 17)
!244 = distinct !DILexicalBlock(scope: !233, file: !1, line: 546, column: 6)
!245 = !DISubprogram(name: "IVminabs", scope: !1, file: !1, line: 578, type: !207, isLocal: false, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32*)* @IVminabs, variables: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !257}
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !245, file: !1, line: 579, type: !9)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !245, file: !1, line: 580, type: !8)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ploc", arg: 3, scope: !245, file: !1, line: 581, type: !8)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minval", scope: !245, file: !1, line: 583, type: !9)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !245, file: !1, line: 584, type: !9)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !253, file: !1, line: 592, type: !9)
!253 = distinct !DILexicalBlock(scope: !254, file: !1, line: 591, column: 11)
!254 = distinct !DILexicalBlock(scope: !255, file: !1, line: 587, column: 9)
!255 = distinct !DILexicalBlock(scope: !256, file: !1, line: 586, column: 17)
!256 = distinct !DILexicalBlock(scope: !245, file: !1, line: 586, column: 6)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !253, file: !1, line: 592, type: !9)
!258 = !DISubprogram(name: "IVperm", scope: !1, file: !1, line: 619, type: !32, isLocal: false, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*)* @IVperm, variables: !259)
!259 = !{!260, !261, !262, !263, !268}
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !258, file: !1, line: 620, type: !9)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !258, file: !1, line: 621, type: !8)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !258, file: !1, line: 622, type: !8)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !264, file: !1, line: 631, type: !8)
!264 = distinct !DILexicalBlock(scope: !265, file: !1, line: 630, column: 11)
!265 = distinct !DILexicalBlock(scope: !266, file: !1, line: 625, column: 9)
!266 = distinct !DILexicalBlock(scope: !267, file: !1, line: 624, column: 17)
!267 = distinct !DILexicalBlock(scope: !258, file: !1, line: 624, column: 6)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !264, file: !1, line: 632, type: !9)
!269 = !DISubprogram(name: "IVramp", scope: !1, file: !1, line: 652, type: !270, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32, i32)* @IVramp, variables: !272)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !9, !8, !9, !9}
!272 = !{!273, !274, !275, !276, !277, !282}
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !269, file: !1, line: 653, type: !9)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !269, file: !1, line: 654, type: !8)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !269, file: !1, line: 655, type: !9)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc", arg: 4, scope: !269, file: !1, line: 656, type: !9)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !278, file: !1, line: 665, type: !9)
!278 = distinct !DILexicalBlock(scope: !279, file: !1, line: 664, column: 11)
!279 = distinct !DILexicalBlock(scope: !280, file: !1, line: 659, column: 9)
!280 = distinct !DILexicalBlock(scope: !281, file: !1, line: 658, column: 17)
!281 = distinct !DILexicalBlock(scope: !269, file: !1, line: 658, column: 6)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !278, file: !1, line: 665, type: !9)
!283 = !DISubprogram(name: "IVscatter", scope: !1, file: !1, line: 682, type: !157, isLocal: false, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*, i32*)* @IVscatter, variables: !284)
!284 = !{!285, !286, !287, !288, !289}
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !283, file: !1, line: 683, type: !9)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !283, file: !1, line: 684, type: !8)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !283, file: !1, line: 685, type: !8)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !283, file: !1, line: 686, type: !8)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !290, file: !1, line: 695, type: !9)
!290 = distinct !DILexicalBlock(scope: !291, file: !1, line: 694, column: 11)
!291 = distinct !DILexicalBlock(scope: !292, file: !1, line: 689, column: 9)
!292 = distinct !DILexicalBlock(scope: !293, file: !1, line: 688, column: 17)
!293 = distinct !DILexicalBlock(scope: !283, file: !1, line: 688, column: 6)
!294 = !DISubprogram(name: "IVsum", scope: !1, file: !1, line: 712, type: !295, isLocal: false, isDefinition: true, scopeLine: 715, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*)* @IVsum, variables: !297)
!295 = !DISubroutineType(types: !296)
!296 = !{!9, !9, !8}
!297 = !{!298, !299, !300, !301}
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !294, file: !1, line: 713, type: !9)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !294, file: !1, line: 714, type: !8)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !294, file: !1, line: 716, type: !9)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !302, file: !1, line: 724, type: !9)
!302 = distinct !DILexicalBlock(scope: !303, file: !1, line: 723, column: 11)
!303 = distinct !DILexicalBlock(scope: !304, file: !1, line: 719, column: 9)
!304 = distinct !DILexicalBlock(scope: !305, file: !1, line: 718, column: 17)
!305 = distinct !DILexicalBlock(scope: !294, file: !1, line: 718, column: 6)
!306 = !DISubprogram(name: "IVsumabs", scope: !1, file: !1, line: 742, type: !295, isLocal: false, isDefinition: true, scopeLine: 745, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*)* @IVsumabs, variables: !307)
!307 = !{!308, !309, !310, !311, !316}
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !306, file: !1, line: 743, type: !9)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !306, file: !1, line: 744, type: !8)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !306, file: !1, line: 746, type: !9)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !312, file: !1, line: 753, type: !9)
!312 = distinct !DILexicalBlock(scope: !313, file: !1, line: 752, column: 11)
!313 = distinct !DILexicalBlock(scope: !314, file: !1, line: 748, column: 9)
!314 = distinct !DILexicalBlock(scope: !315, file: !1, line: 747, column: 17)
!315 = distinct !DILexicalBlock(scope: !306, file: !1, line: 747, column: 6)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !312, file: !1, line: 753, type: !9)
!317 = !DISubprogram(name: "IVswap", scope: !1, file: !1, line: 770, type: !32, isLocal: false, isDefinition: true, scopeLine: 774, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*)* @IVswap, variables: !318)
!318 = !{!319, !320, !321, !322, !327}
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !317, file: !1, line: 771, type: !9)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !317, file: !1, line: 772, type: !8)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !317, file: !1, line: 773, type: !8)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !323, file: !1, line: 781, type: !9)
!323 = distinct !DILexicalBlock(scope: !324, file: !1, line: 780, column: 11)
!324 = distinct !DILexicalBlock(scope: !325, file: !1, line: 776, column: 9)
!325 = distinct !DILexicalBlock(scope: !326, file: !1, line: 775, column: 17)
!326 = distinct !DILexicalBlock(scope: !317, file: !1, line: 775, column: 6)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !323, file: !1, line: 781, type: !9)
!328 = !DISubprogram(name: "IVzero", scope: !1, file: !1, line: 800, type: !329, isLocal: false, isDefinition: true, scopeLine: 803, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*)* @IVzero, variables: !331)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !9, !8}
!331 = !{!332, !333, !334}
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !328, file: !1, line: 801, type: !9)
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !328, file: !1, line: 802, type: !8)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !335, file: !1, line: 810, type: !9)
!335 = distinct !DILexicalBlock(scope: !336, file: !1, line: 809, column: 11)
!336 = distinct !DILexicalBlock(scope: !337, file: !1, line: 805, column: 9)
!337 = distinct !DILexicalBlock(scope: !338, file: !1, line: 804, column: 17)
!338 = distinct !DILexicalBlock(scope: !328, file: !1, line: 804, column: 6)
!339 = !DISubprogram(name: "IVshuffle", scope: !1, file: !1, line: 835, type: !44, isLocal: false, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32)* @IVshuffle, variables: !340)
!340 = !{!341, !342, !343, !344, !349, !350, !351, !352}
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !339, file: !1, line: 836, type: !9)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !339, file: !1, line: 837, type: !8)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 3, scope: !339, file: !1, line: 838, type: !9)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !345, file: !1, line: 846, type: !9)
!345 = distinct !DILexicalBlock(scope: !346, file: !1, line: 845, column: 11)
!346 = distinct !DILexicalBlock(scope: !347, file: !1, line: 841, column: 9)
!347 = distinct !DILexicalBlock(scope: !348, file: !1, line: 840, column: 29)
!348 = distinct !DILexicalBlock(scope: !339, file: !1, line: 840, column: 6)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !345, file: !1, line: 846, type: !9)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !345, file: !1, line: 846, type: !9)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !345, file: !1, line: 847, type: !5)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "drand", scope: !345, file: !1, line: 848, type: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drand", file: !354, line: 27, baseType: !355)
!354 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/../../Drand/Drand.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Drand", file: !354, line: 17, size: 576, align: 64, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !355, file: !354, line: 18, baseType: !5, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !355, file: !354, line: 19, baseType: !5, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "base1", scope: !355, file: !354, line: 20, baseType: !5, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !355, file: !354, line: 21, baseType: !5, size: 64, align: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !355, file: !354, line: 22, baseType: !5, size: 64, align: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !355, file: !354, line: 23, baseType: !5, size: 64, align: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !355, file: !354, line: 24, baseType: !5, size: 64, align: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !355, file: !354, line: 25, baseType: !5, size: 64, align: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !355, file: !354, line: 26, baseType: !9, size: 32, align: 32, offset: 512)
!366 = !DISubprogram(name: "IVlocateViaBinarySearch", scope: !1, file: !1, line: 879, type: !367, isLocal: false, isDefinition: true, scopeLine: 883, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32)* @IVlocateViaBinarySearch, variables: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{!9, !9, !8, !9}
!369 = !{!370, !371, !372, !373, !374, !375}
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !366, file: !1, line: 880, type: !9)
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ivec", arg: 2, scope: !366, file: !1, line: 881, type: !8)
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 3, scope: !366, file: !1, line: 882, type: !9)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !366, file: !1, line: 884, type: !9)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mid", scope: !366, file: !1, line: 884, type: !9)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !366, file: !1, line: 884, type: !9)
!376 = !{i32 2, !"Dwarf Version", i32 2}
!377 = !{i32 2, !"Debug Info Version", i32 700000003}
!378 = !{i32 1, !"PIC Level", i32 2}
!379 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!380 = !DIExpression()
!381 = !DILocation(line: 21, column: 10, scope: !12)
!382 = !DILocation(line: 22, column: 10, scope: !12)
!383 = !DILocation(line: 23, column: 10, scope: !12)
!384 = !DILocation(line: 24, column: 10, scope: !12)
!385 = !DILocation(line: 25, column: 10, scope: !12)
!386 = !DILocation(line: 26, column: 10, scope: !12)
!387 = !DILocation(line: 36, column: 12, scope: !388)
!388 = distinct !DILexicalBlock(scope: !12, file: !1, line: 36, column: 6)
!389 = !DILocation(line: 36, column: 26, scope: !388)
!390 = !DILocation(line: 36, column: 17, scope: !388)
!391 = !DILocation(line: 38, column: 16, scope: !392)
!392 = distinct !DILexicalBlock(scope: !388, file: !1, line: 38, column: 13)
!393 = !DILocation(line: 38, column: 30, scope: !392)
!394 = !DILocation(line: 38, column: 24, scope: !392)
!395 = !DILocation(line: 38, column: 44, scope: !392)
!396 = !DILocation(line: 38, column: 58, scope: !392)
!397 = !DILocation(line: 39, column: 12, scope: !398)
!398 = distinct !DILexicalBlock(scope: !392, file: !1, line: 38, column: 68)
!399 = !{!400, !400, i64 0}
!400 = !{!"any pointer", !401, i64 0}
!401 = !{!"omnipotent char", !402, i64 0}
!402 = !{!"Simple C/C++ TBAA"}
!403 = !DILocation(line: 39, column: 4, scope: !398)
!404 = !DILocation(line: 43, column: 4, scope: !398)
!405 = !DILocation(line: 50, column: 6, scope: !12)
!406 = !DILocation(line: 29, column: 11, scope: !12)
!407 = !DILocation(line: 30, column: 13, scope: !12)
!408 = !DILocation(line: 51, column: 17, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !1, line: 51, column: 1)
!410 = distinct !DILexicalBlock(scope: !12, file: !1, line: 51, column: 1)
!411 = !DILocation(line: 51, column: 1, scope: !410)
!412 = !DILocation(line: 52, column: 17, scope: !413)
!413 = distinct !DILexicalBlock(scope: !409, file: !1, line: 51, column: 33)
!414 = !{!415, !415, i64 0}
!415 = !{!"int", !401, i64 0}
!416 = !DILocation(line: 53, column: 17, scope: !413)
!417 = !DILocation(line: 52, column: 9, scope: !413)
!418 = !DILocation(line: 52, column: 21, scope: !413)
!419 = !DILocation(line: 52, column: 15, scope: !413)
!420 = !DILocation(line: 28, column: 17, scope: !12)
!421 = !DILocation(line: 53, column: 9, scope: !413)
!422 = !DILocation(line: 53, column: 15, scope: !413)
!423 = !DILocation(line: 28, column: 21, scope: !12)
!424 = !DILocation(line: 54, column: 31, scope: !413)
!425 = !DILocation(line: 54, column: 39, scope: !413)
!426 = !DILocation(line: 54, column: 35, scope: !413)
!427 = !DILocation(line: 54, column: 14, scope: !413)
!428 = !DILocation(line: 54, column: 4, scope: !413)
