; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_I2OP.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._I2OP = type { i32, i32, i8*, %struct._I2OP* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [46 x i8] c"\0A fatal error in I2OP_init(%d,%d)\0A bad input\0A\00", align 1
@.str1 = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str2 = private unnamed_addr constant [97 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_I2OP.c\00", align 1
@.str3 = private unnamed_addr constant [47 x i8] c"\0A ALLOCATE error : bytes %zd, line %d, file %s\00", align 1
@.str4 = private unnamed_addr constant [56 x i8] c"\0A fatal error in I2OP_initStorage(%d,%d,%p)\0A bad input\0A\00", align 1
@.str5 = private unnamed_addr constant [3 x i8] c"\0A \00", align 1
@.str6 = private unnamed_addr constant [14 x i8] c" <%4d,%4d,%p>\00", align 1

; Function Attrs: nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !19, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_I2OP.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !16, !12, !17}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "_I2OP", file: !6, line: 6, size: 192, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/../I2OP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !11, !13}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "value0", scope: !5, file: !6, line: 7, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !5, file: !6, line: 8, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !5, file: !6, line: 9, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !5, file: !6, line: 10, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2OP", file: !6, line: 5, baseType: !5)
!16 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !{!20, !27, !37, !42}
!20 = !DISubprogram(name: "I2OP_init", scope: !1, file: !1, line: 21, type: !21, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: %struct._I2OP* (i32, i32)* @I2OP_init, variables: !23)
!21 = !DISubroutineType(types: !22)
!22 = !{!14, !9, !9}
!23 = !{!24, !25, !26}
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !20, file: !1, line: 22, type: !9)
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !20, file: !1, line: 23, type: !9)
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !20, file: !1, line: 25, type: !14)
!27 = !DISubprogram(name: "I2OP_initStorage", scope: !1, file: !1, line: 65, type: !28, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct._I2OP*)* @I2OP_initStorage, variables: !30)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !9, !9, !14}
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !27, file: !1, line: 66, type: !9)
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !27, file: !1, line: 67, type: !9)
!33 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !27, file: !1, line: 68, type: !14)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !27, file: !1, line: 70, type: !14)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstelem", scope: !27, file: !1, line: 70, type: !14)
!36 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastelem", scope: !27, file: !1, line: 70, type: !14)
!37 = !DISubprogram(name: "I2OP_free", scope: !1, file: !1, line: 151, type: !38, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._I2OP*)* @I2OP_free, variables: !40)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !14}
!40 = !{!41}
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 1, scope: !37, file: !1, line: 152, type: !14)
!42 = !DISubprogram(name: "I2OP_fprintf", scope: !1, file: !1, line: 168, type: !43, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct._I2OP*)* @I2OP_fprintf, variables: !105)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45, !14}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !47, line: 153, baseType: !48)
!47 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !47, line: 122, size: 1216, align: 64, elements: !49)
!49 = !{!50, !53, !54, !55, !57, !58, !63, !64, !65, !69, !73, !83, !89, !90, !93, !94, !98, !102, !103, !104}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !48, file: !47, line: 123, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !48, file: !47, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !48, file: !47, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !47, line: 126, baseType: !56, size: 16, align: 16, offset: 128)
!56 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !48, file: !47, line: 127, baseType: !56, size: 16, align: 16, offset: 144)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !48, file: !47, line: 128, baseType: !59, size: 128, align: 64, offset: 192)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !47, line: 88, size: 128, align: 64, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !59, file: !47, line: 89, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !59, file: !47, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !48, file: !47, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !48, file: !47, line: 132, baseType: !12, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !48, file: !47, line: 133, baseType: !66, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!9, !12}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !48, file: !47, line: 134, baseType: !70, size: 64, align: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!9, !12, !17, !9}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !48, file: !47, line: 135, baseType: !74, size: 64, align: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !12, !77, !9}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !47, line: 77, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !79, line: 71, baseType: !80)
!79 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !81, line: 46, baseType: !82)
!81 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!82 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !48, file: !47, line: 136, baseType: !84, size: 64, align: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!9, !12, !87, !9}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !48, file: !47, line: 139, baseType: !59, size: 128, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !48, file: !47, line: 140, baseType: !91, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !47, line: 94, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !48, file: !47, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !48, file: !47, line: 144, baseType: !95, size: 24, align: 8, offset: 928)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !48, file: !47, line: 145, baseType: !99, size: 8, align: 8, offset: 952)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !48, file: !47, line: 148, baseType: !59, size: 128, align: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !48, file: !47, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !47, line: 152, baseType: !77, size: 64, align: 64, offset: 1152)
!105 = !{!106, !107, !108}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !42, file: !1, line: 169, type: !45)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "elem", arg: 2, scope: !42, file: !1, line: 170, type: !14)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !109, file: !1, line: 173, type: !9)
!109 = distinct !DILexicalBlock(scope: !110, file: !1, line: 172, column: 35)
!110 = distinct !DILexicalBlock(scope: !42, file: !1, line: 172, column: 6)
!111 = !{i32 2, !"Dwarf Version", i32 2}
!112 = !{i32 2, !"Debug Info Version", i32 700000003}
!113 = !{i32 1, !"PIC Level", i32 2}
!114 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!115 = !DIExpression()
!116 = !DILocation(line: 22, column: 10, scope: !20)
!117 = !DILocation(line: 23, column: 10, scope: !20)
!118 = !DILocation(line: 31, column: 8, scope: !119)
!119 = distinct !DILexicalBlock(scope: !20, file: !1, line: 31, column: 6)
!120 = !DILocation(line: 31, column: 13, scope: !119)
!121 = !DILocation(line: 32, column: 12, scope: !122)
!122 = distinct !DILexicalBlock(scope: !119, file: !1, line: 31, column: 59)
!123 = !{!124, !124, i64 0}
!124 = !{!"any pointer", !125, i64 0}
!125 = !{!"omnipotent char", !126, i64 0}
!126 = !{!"Simple C/C++ TBAA"}
!127 = !DILocation(line: 32, column: 4, scope: !122)
!128 = !DILocation(line: 34, column: 4, scope: !122)
!129 = !DILocation(line: 41, column: 1, scope: !130)
!130 = distinct !DILexicalBlock(scope: !20, file: !1, line: 41, column: 1)
!131 = !DILocation(line: 41, column: 1, scope: !20)
!132 = !DILocation(line: 41, column: 1, scope: !133)
!133 = distinct !DILexicalBlock(scope: !134, file: !1, line: 41, column: 1)
!134 = distinct !DILexicalBlock(scope: !130, file: !1, line: 41, column: 1)
!135 = !DILocation(line: 25, column: 10, scope: !20)
!136 = !DILocation(line: 41, column: 1, scope: !134)
!137 = !DILocation(line: 41, column: 1, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !1, line: 41, column: 1)
!139 = !DILocation(line: 41, column: 1, scope: !140)
!140 = distinct !DILexicalBlock(scope: !130, file: !1, line: 41, column: 1)
!141 = !DILocation(line: 41, column: 1, scope: !142)
!142 = distinct !DILexicalBlock(scope: !140, file: !1, line: 41, column: 1)
!143 = !DILocation(line: 47, column: 1, scope: !20)
!144 = !DILocation(line: 49, column: 1, scope: !20)
!145 = !DILocation(line: 66, column: 10, scope: !27)
!146 = !DILocation(line: 67, column: 10, scope: !27)
!147 = !DILocation(line: 68, column: 12, scope: !27)
!148 = !DILocation(line: 76, column: 9, scope: !149)
!149 = distinct !DILexicalBlock(scope: !27, file: !1, line: 76, column: 7)
!150 = !DILocation(line: 76, column: 14, scope: !149)
!151 = !DILocation(line: 77, column: 12, scope: !149)
!152 = !DILocation(line: 78, column: 12, scope: !153)
!153 = distinct !DILexicalBlock(scope: !149, file: !1, line: 77, column: 22)
!154 = !DILocation(line: 78, column: 4, scope: !153)
!155 = !DILocation(line: 80, column: 4, scope: !153)
!156 = !DILocation(line: 70, column: 16, scope: !27)
!157 = !DILocation(line: 92, column: 23, scope: !27)
!158 = !DILocation(line: 92, column: 27, scope: !27)
!159 = !DILocation(line: 70, column: 28, scope: !27)
!160 = !DILocation(line: 97, column: 1, scope: !27)
!161 = !DILocation(line: 120, column: 38, scope: !162)
!162 = distinct !DILexicalBlock(scope: !163, file: !1, line: 120, column: 4)
!163 = distinct !DILexicalBlock(scope: !164, file: !1, line: 120, column: 4)
!164 = distinct !DILexicalBlock(scope: !27, file: !1, line: 97, column: 17)
!165 = !DILocation(line: 120, column: 4, scope: !163)
!166 = !DILocation(line: 120, column: 27, scope: !163)
!167 = !DILocation(line: 99, column: 34, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !1, line: 99, column: 4)
!169 = distinct !DILexicalBlock(scope: !164, file: !1, line: 99, column: 4)
