; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_IP.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._IP = type { i32, %struct._IP* }

@.str = private unnamed_addr constant [3 x i8] c"\0A \00", align 1
@.str1 = private unnamed_addr constant [5 x i8] c" %4d\00", align 1
@.str3 = private unnamed_addr constant [4 x i8] c" %d\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str4 = private unnamed_addr constant [118 x i8] c"\0A fatal error in IPinit, invalid data\0A n = %d, flag = %d\0A flag must be 0 (IP_NULL), 1 (IP_FORWARD) or 2(IP_BACKWARD)\0A\00", align 1
@.str5 = private unnamed_addr constant [49 x i8] c"\0A ALLOCATE failure : bytes %zd, line %d, file %s\00", align 1
@.str6 = private unnamed_addr constant [95 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_IP.c\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define void @IP_fprintf(%struct.__sFILE* %fp, %struct._IP* readonly %ip) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !17, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/Utilities_IP.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !14, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IP", file: !7, line: 11, size: 128, align: 64, elements: !8)
!7 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/454.calculix/src/SPOOLES/Utilities/src/../IP.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !{!9, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !6, file: !7, line: 12, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !6, file: !7, line: 13, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP", file: !7, line: 10, baseType: !6)
!14 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = !{!18, !87, !99, !114, !119, !127, !155, !162}
!18 = !DISubprogram(name: "IP_fprintf", scope: !1, file: !1, line: 16, type: !19, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct._IP*)* @IP_fprintf, variables: !81)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21, !12}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !23, line: 153, baseType: !24)
!23 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !23, line: 122, size: 1216, align: 64, elements: !25)
!25 = !{!26, !29, !30, !31, !33, !34, !39, !40, !41, !45, !49, !59, !65, !66, !69, !70, !74, !78, !79, !80}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !24, file: !23, line: 123, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !24, file: !23, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !24, file: !23, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !24, file: !23, line: 126, baseType: !32, size: 16, align: 16, offset: 128)
!32 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !24, file: !23, line: 127, baseType: !32, size: 16, align: 16, offset: 144)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !24, file: !23, line: 128, baseType: !35, size: 128, align: 64, offset: 192)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !23, line: 88, size: 128, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !35, file: !23, line: 89, baseType: !27, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !35, file: !23, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !24, file: !23, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !24, file: !23, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !24, file: !23, line: 133, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!10, !4}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !24, file: !23, line: 134, baseType: !46, size: 64, align: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!10, !4, !15, !10}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !24, file: !23, line: 135, baseType: !50, size: 64, align: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !4, !53, !10}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !23, line: 77, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !55, line: 71, baseType: !56)
!55 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !57, line: 46, baseType: !58)
!57 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !24, file: !23, line: 136, baseType: !60, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!10, !4, !63, !10}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !24, file: !23, line: 139, baseType: !35, size: 128, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !24, file: !23, line: 140, baseType: !67, size: 64, align: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !23, line: 94, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !24, file: !23, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !24, file: !23, line: 144, baseType: !71, size: 24, align: 8, offset: 928)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 24, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !24, file: !23, line: 145, baseType: !75, size: 8, align: 8, offset: 952)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !24, file: !23, line: 148, baseType: !35, size: 128, align: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !24, file: !23, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !24, file: !23, line: 152, baseType: !53, size: 64, align: 64, offset: 1152)
!81 = !{!82, !83, !84}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !18, file: !1, line: 17, type: !21)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 2, scope: !18, file: !1, line: 18, type: !12)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !85, file: !1, line: 21, type: !10)
!85 = distinct !DILexicalBlock(scope: !86, file: !1, line: 20, column: 33)
!86 = distinct !DILexicalBlock(scope: !18, file: !1, line: 20, column: 6)
!87 = !DISubprogram(name: "IP_fp80", scope: !1, file: !1, line: 48, type: !88, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct._IP*, i32)* @IP_fp80, variables: !90)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !21, !12, !10}
!90 = !{!91, !92, !93, !94, !97, !98}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !87, file: !1, line: 49, type: !21)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 2, scope: !87, file: !1, line: 50, type: !12)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "column", arg: 3, scope: !87, file: !1, line: 51, type: !10)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inum", scope: !95, file: !1, line: 54, type: !10)
!95 = distinct !DILexicalBlock(scope: !96, file: !1, line: 53, column: 33)
!96 = distinct !DILexicalBlock(scope: !87, file: !1, line: 53, column: 6)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nchar", scope: !95, file: !1, line: 54, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pow", scope: !95, file: !1, line: 54, type: !10)
!99 = !DISubprogram(name: "IP_init", scope: !1, file: !1, line: 90, type: !100, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IP* (i32, i32)* @IP_init, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!12, !10, !10}
!102 = !{!103, !104, !105, !106, !111, !112, !113}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !99, file: !1, line: 91, type: !10)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !99, file: !1, line: 92, type: !10)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !99, file: !1, line: 94, type: !12)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !107, file: !1, line: 105, type: !10)
!107 = distinct !DILexicalBlock(scope: !108, file: !1, line: 104, column: 11)
!108 = distinct !DILexicalBlock(scope: !109, file: !1, line: 96, column: 9)
!109 = distinct !DILexicalBlock(scope: !110, file: !1, line: 95, column: 14)
!110 = distinct !DILexicalBlock(scope: !99, file: !1, line: 95, column: 6)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "head", scope: !107, file: !1, line: 106, type: !12)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !107, file: !1, line: 106, type: !12)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !107, file: !1, line: 106, type: !12)
!114 = !DISubprogram(name: "IP_free", scope: !1, file: !1, line: 147, type: !115, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IP*)* @IP_free, variables: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !12}
!117 = !{!118}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 1, scope: !114, file: !1, line: 148, type: !12)
!119 = !DISubprogram(name: "IP_mergeUp", scope: !1, file: !1, line: 164, type: !120, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IP* (%struct._IP*, %struct._IP*)* @IP_mergeUp, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{!12, !12, !12}
!122 = !{!123, !124, !125, !126}
