; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/alignio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.aliinfo_s = type { i32, i32, i32, float*, i8*, i8*, %struct.seqinfo_s*, i8*, i8*, i8*, i8*, float, float, float, float, float, float }
%struct.seqinfo_s = type { i32, [64 x i8], [64 x i8], [64 x i8], [128 x i8], i32, i32, i32, i32, i32, i8*, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/alignio.c\00", align 1
@squid_errno = external global i32
@.str1 = private unnamed_addr constant [4 x i8] c" \09\0A\00", align 1
@.str2 = private unnamed_addr constant [24 x i8] c"%*s%-10.10s %5d %s %5d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !37, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/alignio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7, !9, !33, !34, !15, !8, !6, !35, !36}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "SQINFO", file: !11, line: 98, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "seqinfo_s", file: !11, line: 84, size: 2880, align: 64, elements: !13)
!13 = !{!14, !16, !20, !21, !22, !26, !27, !28, !29, !30, !31, !32}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !11, line: 85, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !11, line: 86, baseType: !17, size: 512, align: 8, offset: 32)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, align: 8, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 87, baseType: !17, size: 512, align: 8, offset: 544)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !12, file: !11, line: 88, baseType: !17, size: 512, align: 8, offset: 1056)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !12, file: !11, line: 89, baseType: !23, size: 1024, align: 8, offset: 1568)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, align: 8, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !11, line: 90, baseType: !15, size: 32, align: 32, offset: 2592)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !12, file: !11, line: 91, baseType: !15, size: 32, align: 32, offset: 2624)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !12, file: !11, line: 92, baseType: !15, size: 32, align: 32, offset: 2656)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "olen", scope: !12, file: !11, line: 93, baseType: !15, size: 32, align: 32, offset: 2688)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 94, baseType: !15, size: 32, align: 32, offset: 2720)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !12, file: !11, line: 95, baseType: !5, size: 64, align: 64, offset: 2752)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !12, file: !11, line: 96, baseType: !5, size: 64, align: 64, offset: 2816)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!37 = !{!38, !72, !77, !84, !97, !108, !119, !128, !134, !228, !237, !260, !270, !276, !284, !287, !290, !293}
!38 = !DISubprogram(name: "AllocAlignment", scope: !1, file: !1, line: 43, type: !39, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i8***, %struct.aliinfo_s*)* @AllocAlignment, variables: !65)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !15, !15, !41, !42}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "AINFO", file: !44, line: 83, baseType: !45)
!44 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "aliinfo_s", file: !44, line: 65, size: 832, align: 64, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !44, line: 66, baseType: !15, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !45, file: !44, line: 67, baseType: !15, size: 32, align: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !45, file: !44, line: 68, baseType: !15, size: 32, align: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !45, file: !44, line: 69, baseType: !7, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !45, file: !44, line: 70, baseType: !5, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !45, file: !44, line: 71, baseType: !5, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sqinfo", scope: !45, file: !44, line: 72, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !44, line: 75, baseType: !5, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !45, file: !44, line: 76, baseType: !5, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !45, file: !44, line: 77, baseType: !5, size: 64, align: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !45, file: !44, line: 78, baseType: !5, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !45, file: !44, line: 79, baseType: !8, size: 32, align: 32, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !45, file: !44, line: 79, baseType: !8, size: 32, align: 32, offset: 672)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !45, file: !44, line: 80, baseType: !8, size: 32, align: 32, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !45, file: !44, line: 80, baseType: !8, size: 32, align: 32, offset: 736)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !45, file: !44, line: 81, baseType: !8, size: 32, align: 32, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !45, file: !44, line: 81, baseType: !8, size: 32, align: 32, offset: 800)
!65 = !{!66, !67, !68, !69, !70, !71}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 1, scope: !38, file: !1, line: 43, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 2, scope: !38, file: !1, line: 43, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_aseq", arg: 3, scope: !38, file: !1, line: 43, type: !41)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ainfo", arg: 4, scope: !38, file: !1, line: 43, type: !42)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aseq", scope: !38, file: !1, line: 45, type: !4)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !38, file: !1, line: 46, type: !15)
!72 = !DISubprogram(name: "InitAinfo", scope: !1, file: !1, line: 80, type: !73, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.aliinfo_s*)* @InitAinfo, variables: !75)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !42}
!75 = !{!76}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ainfo", arg: 1, scope: !72, file: !1, line: 80, type: !42)
!77 = !DISubprogram(name: "FreeAlignment", scope: !1, file: !1, line: 105, type: !78, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, %struct.aliinfo_s*)* @FreeAlignment, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !4, !42}
!80 = !{!81, !82, !83}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseqs", arg: 1, scope: !77, file: !1, line: 105, type: !4)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ainfo", arg: 2, scope: !77, file: !1, line: 105, type: !42)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !77, file: !1, line: 107, type: !15)
!84 = !DISubprogram(name: "SAMizeAlignment", scope: !1, file: !1, line: 144, type: !85, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32)* @SAMizeAlignment, variables: !87)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !4, !15, !15}
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !84, file: !1, line: 144, type: !4)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !84, file: !1, line: 144, type: !15)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 3, scope: !84, file: !1, line: 144, type: !15)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !84, file: !1, line: 146, type: !15)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !84, file: !1, line: 147, type: !15)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sawlower", scope: !84, file: !1, line: 148, type: !15)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sawupper", scope: !84, file: !1, line: 148, type: !15)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sawgap", scope: !84, file: !1, line: 148, type: !15)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gapchar", scope: !84, file: !1, line: 149, type: !6)
!97 = !DISubprogram(name: "SAMizeAlignmentByGapFrac", scope: !1, file: !1, line: 190, type: !98, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32, float)* @SAMizeAlignmentByGapFrac, variables: !100)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !4, !15, !15, !8}
!100 = !{!101, !102, !103, !104, !105, !106, !107}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !97, file: !1, line: 190, type: !4)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !97, file: !1, line: 190, type: !15)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 3, scope: !97, file: !1, line: 190, type: !15)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxgap", arg: 4, scope: !97, file: !1, line: 190, type: !8)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !97, file: !1, line: 192, type: !15)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !97, file: !1, line: 193, type: !15)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngap", scope: !97, file: !1, line: 194, type: !15)
!108 = !DISubprogram(name: "MakeAlignedString", scope: !1, file: !1, line: 237, type: !109, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i8*, i8**)* @MakeAlignedString, variables: !111)
!109 = !DISubroutineType(types: !110)
!110 = !{!15, !5, !15, !5, !4}
!111 = !{!112, !113, !114, !115, !116, !117, !118}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !108, file: !1, line: 237, type: !5)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 2, scope: !108, file: !1, line: 237, type: !15)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ss", arg: 3, scope: !108, file: !1, line: 237, type: !5)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_s", arg: 4, scope: !108, file: !1, line: 237, type: !4)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !108, file: !1, line: 239, type: !5)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !108, file: !1, line: 240, type: !15)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rpos", scope: !108, file: !1, line: 240, type: !15)
!119 = !DISubprogram(name: "MakeDealignedString", scope: !1, file: !1, line: 275, type: !109, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i8*, i8**)* @MakeDealignedString, variables: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !119, file: !1, line: 275, type: !5)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 2, scope: !119, file: !1, line: 275, type: !15)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ss", arg: 3, scope: !119, file: !1, line: 275, type: !5)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_s", arg: 4, scope: !119, file: !1, line: 275, type: !4)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !119, file: !1, line: 277, type: !5)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !119, file: !1, line: 278, type: !15)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rpos", scope: !119, file: !1, line: 278, type: !15)
!128 = !DISubprogram(name: "DealignedLength", scope: !1, file: !1, line: 305, type: !129, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @DealignedLength, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!15, !5}
!131 = !{!132, !133}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !128, file: !1, line: 305, type: !5)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rlen", scope: !128, file: !1, line: 307, type: !15)
!134 = !DISubprogram(name: "WritePairwiseAlignment", scope: !1, file: !1, line: 333, type: !135, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i8*, i8*, i32, i8*, i8*, i32, i32**, i32)* @WritePairwiseAlignment, variables: !197)
!135 = !DISubroutineType(types: !136)
!136 = !{!15, !137, !5, !5, !15, !5, !5, !15, !36, !15}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !139, line: 153, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !139, line: 122, size: 1216, align: 64, elements: !141)
!141 = !{!142, !145, !146, !147, !149, !150, !155, !156, !157, !161, !165, !175, !181, !182, !185, !186, !190, !194, !195, !196}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !140, file: !139, line: 123, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !140, file: !139, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !140, file: !139, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !140, file: !139, line: 126, baseType: !148, size: 16, align: 16, offset: 128)
!148 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !140, file: !139, line: 127, baseType: !148, size: 16, align: 16, offset: 144)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !140, file: !139, line: 128, baseType: !151, size: 128, align: 64, offset: 192)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !139, line: 88, size: 128, align: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !151, file: !139, line: 89, baseType: !143, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !151, file: !139, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !140, file: !139, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !140, file: !139, line: 132, baseType: !33, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !140, file: !139, line: 133, baseType: !158, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!15, !33}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !140, file: !139, line: 134, baseType: !162, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!15, !33, !5, !15}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !140, file: !139, line: 135, baseType: !166, size: 64, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !33, !169, !15}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !139, line: 77, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !171, line: 71, baseType: !172)
!171 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !173, line: 46, baseType: !174)
!173 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!174 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !140, file: !139, line: 136, baseType: !176, size: 64, align: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!15, !33, !179, !15}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !140, file: !139, line: 139, baseType: !151, size: 128, align: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !140, file: !139, line: 140, baseType: !183, size: 64, align: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !139, line: 94, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !140, file: !139, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !140, file: !139, line: 144, baseType: !187, size: 24, align: 8, offset: 928)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 24, align: 8, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 3)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !140, file: !139, line: 145, baseType: !191, size: 8, align: 8, offset: 952)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8, align: 8, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 1)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !140, file: !139, line: 148, baseType: !151, size: 128, align: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !140, file: !139, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !140, file: !139, line: 152, baseType: !169, size: 64, align: 64, offset: 1152)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !211, !212, !213, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ofp", arg: 1, scope: !134, file: !1, line: 333, type: !137)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq1", arg: 2, scope: !134, file: !1, line: 334, type: !5)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name1", arg: 3, scope: !134, file: !1, line: 334, type: !5)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spos1", arg: 4, scope: !134, file: !1, line: 334, type: !15)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq2", arg: 5, scope: !134, file: !1, line: 335, type: !5)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name2", arg: 6, scope: !134, file: !1, line: 335, type: !5)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spos2", arg: 7, scope: !134, file: !1, line: 335, type: !15)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pam", arg: 8, scope: !134, file: !1, line: 336, type: !36)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indent", arg: 9, scope: !134, file: !1, line: 336, type: !15)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sname1", scope: !134, file: !1, line: 338, type: !208)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 88, align: 8, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 11)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sname2", scope: !134, file: !1, line: 339, type: !208)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "still_going", scope: !134, file: !1, line: 340, type: !15)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf1", scope: !134, file: !1, line: 341, type: !214)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 488, align: 8, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 61)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufmid", scope: !134, file: !1, line: 342, type: !214)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf2", scope: !134, file: !1, line: 343, type: !214)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !134, file: !1, line: 344, type: !5)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !134, file: !1, line: 344, type: !5)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count1", scope: !134, file: !1, line: 345, type: !15)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count2", scope: !134, file: !1, line: 345, type: !15)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rpos1", scope: !134, file: !1, line: 346, type: !15)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rpos2", scope: !134, file: !1, line: 346, type: !15)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rawcount1", scope: !134, file: !1, line: 347, type: !15)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rawcount2", scope: !134, file: !1, line: 347, type: !15)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !134, file: !1, line: 348, type: !15)
!228 = !DISubprogram(name: "MingapAlignment", scope: !1, file: !1, line: 431, type: !229, isLocal: false, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**, %struct.aliinfo_s*)* @MingapAlignment, variables: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{!15, !4, !42}
!231 = !{!232, !233, !234, !235, !236}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseqs", arg: 1, scope: !228, file: !1, line: 431, type: !4)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ainfo", arg: 2, scope: !228, file: !1, line: 431, type: !42)
