; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/alphabet.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.msa_struct = type { i8**, i8**, float*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8**, i8**, [6 x float], [6 x i32], i8**, i32, i32, i8**, i8**, i32, i32, i8**, i8***, %struct.GKI*, i32, i8**, i8**, %struct.GKI*, i32, i8**, i8***, %struct.GKI*, i32, %struct.GKI*, i32, i32, i32*, i32*, i32*, i32 }
%struct.GKI = type { %struct.gki_elem**, i32, i32, i32 }
%struct.gki_elem = type { i8*, i32, %struct.gki_elem* }

@.str = private unnamed_addr constant [22 x i8] c"No such alphabet type\00", align 1
@.str1 = private unnamed_addr constant [52 x i8] c"Looks like nucleic acid sequence, hope that's right\00", align 1
@.str2 = private unnamed_addr constant [50 x i8] c"Looks like amino acid sequence, hope that's right\00", align 1
@.str3 = private unnamed_addr constant [45 x i8] c"Sorry, I can't tell if that's protein or DNA\00", align 1
@Alphabet_type = external global i32
@.str4 = private unnamed_addr constant [107 x i8] c"An alphabet type conflict occurred.\0AYou probably mixed a DNA seq file with a protein model, or vice versa.\00", align 1
@Alphabet = external global [25 x i8]
@.str5 = private unnamed_addr constant [25 x i8] c"ACDEFGHIKLMNPQRSTVWYUBZX\00", align 1
@Alphabet_size = external global i32
@Alphabet_iupac = external global i32

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !10, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/alphabet.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7, !8, !9}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!9 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!10 = !{!11, !22, !28, !34, !42, !48, !132, !140, !146, !151, !157}
!11 = !DISubprogram(name: "DetermineAlphabet", scope: !1, file: !1, line: 44, type: !12, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32)* @DetermineAlphabet, variables: !14)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !7, !5}
!14 = !{!15, !16, !17, !18, !19, !20, !21}
!15 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rseqs", arg: 1, scope: !11, file: !1, line: 44, type: !7)
!16 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !11, file: !1, line: 44, type: !5)
!17 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !11, file: !1, line: 46, type: !5)
!18 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "other", scope: !11, file: !1, line: 47, type: !5)
!19 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nucleic", scope: !11, file: !1, line: 47, type: !5)
!20 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "amino", scope: !11, file: !1, line: 47, type: !5)
!21 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !11, file: !1, line: 48, type: !5)
!22 = !DISubprogram(name: "SetAlphabet", scope: !1, file: !1, line: 88, type: !23, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @SetAlphabet, variables: !25)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !5}
!25 = !{!26, !27}
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !22, file: !1, line: 88, type: !5)
!27 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !22, file: !1, line: 90, type: !5)
!28 = !DISubprogram(name: "SymbolIndex", scope: !1, file: !1, line: 184, type: !29, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8)* @SymbolIndex, variables: !31)
!29 = !DISubroutineType(types: !30)
!30 = !{!5, !4}
!31 = !{!32, !33}
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sym", arg: 1, scope: !28, file: !1, line: 184, type: !4)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !28, file: !1, line: 186, type: !8)
!34 = !DISubprogram(name: "DigitizeSequence", scope: !1, file: !1, line: 210, type: !35, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32)* @DigitizeSequence, variables: !37)
!35 = !DISubroutineType(types: !36)
!36 = !{!8, !8, !5}
!37 = !{!38, !39, !40, !41}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seq", arg: 1, scope: !34, file: !1, line: 210, type: !8)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !34, file: !1, line: 210, type: !5)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsq", scope: !34, file: !1, line: 212, type: !8)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !34, file: !1, line: 213, type: !5)
!42 = !DISubprogram(name: "DedigitizeSequence", scope: !1, file: !1, line: 230, type: !35, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32)* @DedigitizeSequence, variables: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !42, file: !1, line: 230, type: !8)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !42, file: !1, line: 230, type: !5)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !42, file: !1, line: 232, type: !8)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !42, file: !1, line: 233, type: !5)
!48 = !DISubprogram(name: "DigitizeAlignment", scope: !1, file: !1, line: 257, type: !49, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8***)* @DigitizeAlignment, variables: !125)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51, !90}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !53, line: 177, baseType: !54)
!53 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !53, line: 112, size: 2880, align: 64, elements: !55)
!55 = !{!56, !57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !79, !81, !82, !83, !84, !85, !86, !87, !88, !89, !91, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !122, !123, !124}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !54, file: !53, line: 115, baseType: !7, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !54, file: !53, line: 116, baseType: !7, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !54, file: !53, line: 117, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !54, file: !53, line: 118, baseType: !5, size: 32, align: 32, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !54, file: !53, line: 119, baseType: !5, size: 32, align: 32, offset: 224)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !53, line: 123, baseType: !5, size: 32, align: 32, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !53, line: 124, baseType: !5, size: 32, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !53, line: 125, baseType: !8, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !54, file: !53, line: 126, baseType: !8, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !54, file: !53, line: 127, baseType: !8, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !54, file: !53, line: 128, baseType: !8, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !54, file: !53, line: 129, baseType: !8, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !54, file: !53, line: 130, baseType: !8, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !54, file: !53, line: 131, baseType: !8, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !54, file: !53, line: 132, baseType: !7, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !54, file: !53, line: 133, baseType: !7, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !54, file: !53, line: 134, baseType: !7, size: 64, align: 64, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !54, file: !53, line: 135, baseType: !7, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !54, file: !53, line: 136, baseType: !76, size: 192, align: 32, offset: 1024)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 32, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 6)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !54, file: !53, line: 137, baseType: !80, size: 192, align: 32, offset: 1216)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, align: 32, elements: !77)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !54, file: !53, line: 144, baseType: !7, size: 64, align: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !54, file: !53, line: 145, baseType: !5, size: 32, align: 32, offset: 1472)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !54, file: !53, line: 146, baseType: !5, size: 32, align: 32, offset: 1504)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !54, file: !53, line: 148, baseType: !7, size: 64, align: 64, offset: 1536)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !54, file: !53, line: 149, baseType: !7, size: 64, align: 64, offset: 1600)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !54, file: !53, line: 150, baseType: !5, size: 32, align: 32, offset: 1664)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !54, file: !53, line: 151, baseType: !5, size: 32, align: 32, offset: 1696)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !54, file: !53, line: 153, baseType: !7, size: 64, align: 64, offset: 1728)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !54, file: !53, line: 154, baseType: !90, size: 64, align: 64, offset: 1792)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !54, file: !53, line: 155, baseType: !92, size: 64, align: 64, offset: 1856)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !94, line: 42, baseType: !95)
!94 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 36, size: 192, align: 64, elements: !96)
!96 = !{!97, !105, !106, !107}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !95, file: !94, line: 37, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !94, line: 26, size: 192, align: 64, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !100, file: !94, line: 27, baseType: !8, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !100, file: !94, line: 28, baseType: !5, size: 32, align: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !100, file: !94, line: 29, baseType: !99, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !95, file: !94, line: 39, baseType: !5, size: 32, align: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !95, file: !94, line: 40, baseType: !5, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !95, file: !94, line: 41, baseType: !5, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !54, file: !53, line: 156, baseType: !5, size: 32, align: 32, offset: 1920)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !54, file: !53, line: 158, baseType: !7, size: 64, align: 64, offset: 1984)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !54, file: !53, line: 159, baseType: !7, size: 64, align: 64, offset: 2048)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !54, file: !53, line: 160, baseType: !92, size: 64, align: 64, offset: 2112)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !54, file: !53, line: 161, baseType: !5, size: 32, align: 32, offset: 2176)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !54, file: !53, line: 163, baseType: !7, size: 64, align: 64, offset: 2240)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !54, file: !53, line: 164, baseType: !90, size: 64, align: 64, offset: 2304)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !54, file: !53, line: 165, baseType: !92, size: 64, align: 64, offset: 2368)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !54, file: !53, line: 166, baseType: !5, size: 32, align: 32, offset: 2432)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !54, file: !53, line: 170, baseType: !92, size: 64, align: 64, offset: 2496)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !54, file: !53, line: 171, baseType: !5, size: 32, align: 32, offset: 2560)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !54, file: !53, line: 172, baseType: !5, size: 32, align: 32, offset: 2592)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !54, file: !53, line: 173, baseType: !121, size: 64, align: 64, offset: 2624)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !54, file: !53, line: 174, baseType: !121, size: 64, align: 64, offset: 2688)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !54, file: !53, line: 175, baseType: !121, size: 64, align: 64, offset: 2752)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !54, file: !53, line: 176, baseType: !5, size: 32, align: 32, offset: 2816)
!125 = !{!126, !127, !128, !129, !130, !131}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !48, file: !1, line: 257, type: !51)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_dsqs", arg: 2, scope: !48, file: !1, line: 257, type: !90)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsq", scope: !48, file: !1, line: 259, type: !7)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !48, file: !1, line: 260, type: !5)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dpos", scope: !48, file: !1, line: 261, type: !5)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !48, file: !1, line: 262, type: !5)
!132 = !DISubprogram(name: "P7CountSymbol", scope: !1, file: !1, line: 293, type: !133, isLocal: false, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, i8, float)* @P7CountSymbol, variables: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !59, !4, !9}
!135 = !{!136, !137, !138, !139}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "counters", arg: 1, scope: !132, file: !1, line: 293, type: !59)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symidx", arg: 2, scope: !132, file: !1, line: 293, type: !4)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wt", arg: 3, scope: !132, file: !1, line: 293, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !132, file: !1, line: 295, type: !5)
!140 = !DISubprogram(name: "DefaultGeneticCode", scope: !1, file: !1, line: 320, type: !141, isLocal: false, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @DefaultGeneticCode, variables: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !121}
!143 = !{!144, !145}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aacode", arg: 1, scope: !140, file: !1, line: 320, type: !121)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !140, file: !1, line: 322, type: !5)
!146 = !DISubprogram(name: "DefaultCodonBias", scope: !1, file: !1, line: 343, type: !147, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: void (float*)* @DefaultCodonBias, variables: !149)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !59}
!149 = !{!150}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codebias", arg: 1, scope: !146, file: !1, line: 343, type: !59)
!151 = !DISubprogram(name: "toupper", scope: !152, file: !152, line: 298, type: !153, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, variables: !155)
!152 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!153 = !DISubroutineType(types: !154)
!154 = !{!5, !5}
!155 = !{!156}
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !151, file: !152, line: 298, type: !5)
!157 = !DISubprogram(name: "set_degenerate", scope: !1, file: !1, line: 419, type: !158, isLocal: true, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true, function: void (i8, i8*)* @set_degenerate, variables: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !4, !8}
!160 = !{!161, !162}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iupac", arg: 1, scope: !157, file: !1, line: 419, type: !4)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "syms", arg: 2, scope: !157, file: !1, line: 419, type: !8)
!163 = !{i32 2, !"Dwarf Version", i32 2}
!164 = !{i32 2, !"Debug Info Version", i32 700000003}
!165 = !{i32 1, !"PIC Level", i32 2}
!166 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!167 = !DIExpression()
!168 = !DILocation(line: 44, column: 26, scope: !11)
