; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/cluster.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.phylo_s = type { i32, i32, i32, float, float, float, i8*, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.aliinfo_s = type { i32, i32, i32, float*, i8*, i8*, %struct.seqinfo_s*, i8*, i8*, i8*, i8*, float, float, float, float, float, float }
%struct.seqinfo_s = type { i32, [64 x i8], [64 x i8], [64 x i8], [128 x i8], i32, i32, i32, i32, i32, i8*, i8* }
%struct.intstack_s = type { i32, %struct.intstack_s* }

@.str = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/cluster.c\00", align 1
@.str1 = private unnamed_addr constant [20 x i8] c"AllocPhylo() failed\00", align 1
@.str2 = private unnamed_addr constant [2 x i8] c",\00", align 1
@.str3 = private unnamed_addr constant [8 x i8] c"%s:%.5f\00", align 1
@.str4 = private unnamed_addr constant [3 x i8] c",\0A\00", align 1
@.str5 = private unnamed_addr constant [2 x i8] c"(\00", align 1
@.str6 = private unnamed_addr constant [4 x i8] c");\0A\00", align 1
@.str7 = private unnamed_addr constant [7 x i8] c"):%.5f\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !28, globals: !215, imports: !215)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/cluster.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clust_strategy", file: !4, line: 273, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "CLUSTER_MEAN", value: 0)
!7 = !DIEnumerator(name: "CLUSTER_MAX", value: 1)
!8 = !DIEnumerator(name: "CLUSTER_MIN", value: 2)
!9 = !{!10, !11, !12, !24, !27}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "phylo_s", file: !4, line: 258, size: 320, align: 64, elements: !14)
!14 = !{!15, !17, !18, !19, !21, !22, !23, !26}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !13, file: !4, line: 259, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !13, file: !4, line: 260, baseType: !16, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !13, file: !4, line: 261, baseType: !16, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "diff", scope: !13, file: !4, line: 262, baseType: !20, size: 32, align: 32, offset: 96)
!20 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "lblen", scope: !13, file: !4, line: 263, baseType: !20, size: 32, align: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rblen", scope: !13, file: !4, line: 264, baseType: !20, size: 32, align: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "is_in", scope: !13, file: !4, line: 265, baseType: !24, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "incnum", scope: !13, file: !4, line: 266, baseType: !16, size: 32, align: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!28 = !{!29, !54, !61, !68, !80, !88, !208}
!29 = !DISubprogram(name: "Cluster", scope: !1, file: !1, line: 148, type: !30, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float**, i32, i32, %struct.phylo_s**)* @Cluster, variables: !34)
!30 = !DISubroutineType(types: !31)
!31 = !{!16, !32, !16, !3, !33}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dmx", arg: 1, scope: !29, file: !1, line: 148, type: !32)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 2, scope: !29, file: !1, line: 148, type: !16)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !29, file: !1, line: 148, type: !3)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tree", arg: 4, scope: !29, file: !1, line: 148, type: !33)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !29, file: !1, line: 150, type: !12)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !29, file: !1, line: 151, type: !32)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord", scope: !29, file: !1, line: 152, type: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !29, file: !1, line: 153, type: !16)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !29, file: !1, line: 153, type: !16)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !29, file: !1, line: 154, type: !16)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Np", scope: !29, file: !1, line: 155, type: !16)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !29, file: !1, line: 156, type: !16)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !29, file: !1, line: 156, type: !16)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !29, file: !1, line: 157, type: !20)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trow", scope: !29, file: !1, line: 158, type: !27)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tcol", scope: !29, file: !1, line: 159, type: !20)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !29, file: !1, line: 160, type: !27)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "swapfoo", scope: !29, file: !1, line: 161, type: !16)
!54 = !DISubprogram(name: "AllocPhylo", scope: !1, file: !1, line: 329, type: !55, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: %struct.phylo_s* (i32)* @AllocPhylo, variables: !57)
!55 = !DISubroutineType(types: !56)
!56 = !{!12, !16}
!57 = !{!58, !59, !60}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 1, scope: !54, file: !1, line: 329, type: !16)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !54, file: !1, line: 331, type: !12)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !54, file: !1, line: 332, type: !16)
!61 = !DISubprogram(name: "FreePhylo", scope: !1, file: !1, line: 360, type: !62, isLocal: false, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.phylo_s*, i32)* @FreePhylo, variables: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !12, !16}
!64 = !{!65, !66, !67}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 1, scope: !61, file: !1, line: 360, type: !12)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 2, scope: !61, file: !1, line: 360, type: !16)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !61, file: !1, line: 362, type: !16)
!68 = !DISubprogram(name: "MakeDiffMx", scope: !1, file: !1, line: 384, type: !69, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, float***)* @MakeDiffMx, variables: !73)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !16, !72}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseqs", arg: 1, scope: !68, file: !1, line: 384, type: !71)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num", arg: 2, scope: !68, file: !1, line: 384, type: !16)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_dmx", arg: 3, scope: !68, file: !1, line: 384, type: !72)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !68, file: !1, line: 386, type: !32)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !68, file: !1, line: 387, type: !16)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !68, file: !1, line: 387, type: !16)
!80 = !DISubprogram(name: "MakeIdentityMx", scope: !1, file: !1, line: 420, type: !69, isLocal: false, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, float***)* @MakeIdentityMx, variables: !81)
!81 = !{!82, !83, !84, !85, !86, !87}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseqs", arg: 1, scope: !80, file: !1, line: 420, type: !71)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num", arg: 2, scope: !80, file: !1, line: 420, type: !16)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_imx", arg: 3, scope: !80, file: !1, line: 420, type: !72)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !80, file: !1, line: 422, type: !32)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !80, file: !1, line: 423, type: !16)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !80, file: !1, line: 423, type: !16)
!88 = !DISubprogram(name: "PrintNewHampshireTree", scope: !1, file: !1, line: 457, type: !89, isLocal: false, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.aliinfo_s*, %struct.phylo_s*, i32)* @PrintNewHampshireTree, variables: !194)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91, !151, !12, !16}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !93, line: 153, baseType: !94)
!93 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !93, line: 122, size: 1216, align: 64, elements: !95)
!95 = !{!96, !99, !100, !101, !103, !104, !109, !110, !111, !115, !119, !129, !135, !136, !139, !140, !144, !148, !149, !150}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !94, file: !93, line: 123, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !94, file: !93, line: 124, baseType: !16, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !94, file: !93, line: 125, baseType: !16, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !94, file: !93, line: 126, baseType: !102, size: 16, align: 16, offset: 128)
!102 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !94, file: !93, line: 127, baseType: !102, size: 16, align: 16, offset: 144)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !94, file: !93, line: 128, baseType: !105, size: 128, align: 64, offset: 192)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !93, line: 88, size: 128, align: 64, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !105, file: !93, line: 89, baseType: !97, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !105, file: !93, line: 90, baseType: !16, size: 32, align: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !94, file: !93, line: 129, baseType: !16, size: 32, align: 32, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !94, file: !93, line: 132, baseType: !10, size: 64, align: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !94, file: !93, line: 133, baseType: !112, size: 64, align: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!16, !10}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !94, file: !93, line: 134, baseType: !116, size: 64, align: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!16, !10, !24, !16}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !94, file: !93, line: 135, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !10, !123, !16}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !93, line: 77, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !125, line: 71, baseType: !126)
!125 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!128 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !94, file: !93, line: 136, baseType: !130, size: 64, align: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!16, !10, !133, !16}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !94, file: !93, line: 139, baseType: !105, size: 128, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !94, file: !93, line: 140, baseType: !137, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !93, line: 94, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !94, file: !93, line: 141, baseType: !16, size: 32, align: 32, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !94, file: !93, line: 144, baseType: !141, size: 24, align: 8, offset: 928)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 24, align: 8, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 3)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !94, file: !93, line: 145, baseType: !145, size: 8, align: 8, offset: 952)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8, align: 8, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 1)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !94, file: !93, line: 148, baseType: !105, size: 128, align: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !94, file: !93, line: 151, baseType: !16, size: 32, align: 32, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !94, file: !93, line: 152, baseType: !123, size: 64, align: 64, offset: 1152)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AINFO", file: !153, line: 83, baseType: !154)
!153 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "aliinfo_s", file: !153, line: 65, size: 832, align: 64, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !154, file: !153, line: 66, baseType: !16, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !154, file: !153, line: 67, baseType: !16, size: 32, align: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !154, file: !153, line: 68, baseType: !16, size: 32, align: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !154, file: !153, line: 69, baseType: !27, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !154, file: !153, line: 70, baseType: !24, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !154, file: !153, line: 71, baseType: !24, size: 64, align: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sqinfo", scope: !154, file: !153, line: 72, baseType: !163, size: 64, align: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "seqinfo_s", file: !4, line: 84, size: 2880, align: 64, elements: !165)
!165 = !{!166, !167, !171, !172, !173, !177, !178, !179, !180, !181, !182, !183}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !164, file: !4, line: 85, baseType: !16, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !4, line: 86, baseType: !168, size: 512, align: 8, offset: 32)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 8, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !4, line: 87, baseType: !168, size: 512, align: 8, offset: 544)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !164, file: !4, line: 88, baseType: !168, size: 512, align: 8, offset: 1056)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !164, file: !4, line: 89, baseType: !174, size: 1024, align: 8, offset: 1568)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 1024, align: 8, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !164, file: !4, line: 90, baseType: !16, size: 32, align: 32, offset: 2592)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !164, file: !4, line: 91, baseType: !16, size: 32, align: 32, offset: 2624)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !164, file: !4, line: 92, baseType: !16, size: 32, align: 32, offset: 2656)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "olen", scope: !164, file: !4, line: 93, baseType: !16, size: 32, align: 32, offset: 2688)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !4, line: 94, baseType: !16, size: 32, align: 32, offset: 2720)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !164, file: !4, line: 95, baseType: !24, size: 64, align: 64, offset: 2752)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !164, file: !4, line: 96, baseType: !24, size: 64, align: 64, offset: 2816)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !153, line: 75, baseType: !24, size: 64, align: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !154, file: !153, line: 76, baseType: !24, size: 64, align: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !154, file: !153, line: 77, baseType: !24, size: 64, align: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !154, file: !153, line: 78, baseType: !24, size: 64, align: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !154, file: !153, line: 79, baseType: !20, size: 32, align: 32, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !154, file: !153, line: 79, baseType: !20, size: 32, align: 32, offset: 672)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !154, file: !153, line: 80, baseType: !20, size: 32, align: 32, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !154, file: !153, line: 80, baseType: !20, size: 32, align: 32, offset: 736)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !154, file: !153, line: 81, baseType: !20, size: 32, align: 32, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !154, file: !153, line: 81, baseType: !20, size: 32, align: 32, offset: 800)
!194 = !{!195, !196, !197, !198, !199, !205, !206, !207}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !88, file: !1, line: 457, type: !91)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ainfo", arg: 2, scope: !88, file: !1, line: 457, type: !151)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 3, scope: !88, file: !1, line: 457, type: !12)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 4, scope: !88, file: !1, line: 457, type: !16)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stack", scope: !88, file: !1, line: 459, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "intstack_s", file: !4, line: 282, size: 128, align: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !4, line: 283, baseType: !16, size: 32, align: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !201, file: !4, line: 284, baseType: !200, size: 64, align: 64, offset: 64)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !88, file: !1, line: 460, type: !16)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blen", scope: !88, file: !1, line: 461, type: !27)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "docomma", scope: !88, file: !1, line: 462, type: !16)
!208 = !DISubprogram(name: "PrintPhylo", scope: !1, file: !1, line: 520, type: !89, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.aliinfo_s*, %struct.phylo_s*, i32)* @PrintPhylo, variables: !209)
!209 = !{!210, !211, !212, !213, !214}
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !208, file: !1, line: 520, type: !91)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ainfo", arg: 2, scope: !208, file: !1, line: 520, type: !151)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tree", arg: 3, scope: !208, file: !1, line: 520, type: !12)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 4, scope: !208, file: !1, line: 520, type: !16)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !208, file: !1, line: 522, type: !16)
!215 = !{}
!216 = !{i32 2, !"Dwarf Version", i32 2}
!217 = !{i32 2, !"Debug Info Version", i32 700000003}
!218 = !{i32 1, !"PIC Level", i32 2}
!219 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!220 = !DIExpression()
!221 = !DILocation(line: 148, column: 17, scope: !29)
!222 = !DILocation(line: 148, column: 26, scope: !29)
!223 = !DILocation(line: 148, column: 49, scope: !29)
!224 = !DILocation(line: 148, column: 72, scope: !29)
!225 = !DILocation(line: 168, column: 8, scope: !29)
!226 = !DILocation(line: 151, column: 14, scope: !29)
!227 = !DILocation(line: 153, column: 14, scope: !29)
!228 = !DILocation(line: 169, column: 17, scope: !229)
!229 = distinct !DILexicalBlock(scope: !230, file: !1, line: 169, column: 3)
!230 = distinct !DILexicalBlock(scope: !29, file: !1, line: 169, column: 3)
!231 = !DILocation(line: 171, column: 15, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !1, line: 170, column: 5)
!233 = !DILocation(line: 169, column: 3, scope: !230)
!234 = !DILocation(line: 171, column: 7, scope: !232)
!235 = !DILocation(line: 171, column: 13, scope: !232)
!236 = !{!237, !237, i64 0}
!237 = !{!"any pointer", !238, i64 0}
!238 = !{!"omnipotent char", !239, i64 0}
!239 = !{!"Simple C/C++ TBAA"}
!240 = !DILocation(line: 153, column: 17, scope: !29)
!241 = !DILocation(line: 173, column: 13, scope: !242)
!242 = distinct !DILexicalBlock(scope: !243, file: !1, line: 172, column: 7)
!243 = distinct !DILexicalBlock(scope: !232, file: !1, line: 172, column: 7)
!244 = !DILocation(line: 172, column: 7, scope: !243)
!245 = !{!246, !246, i64 0}
!246 = !{!"float", !238, i64 0}
!247 = !DILocation(line: 173, column: 2, scope: !242)
!248 = !DILocation(line: 173, column: 11, scope: !242)
!249 = !DILocation(line: 176, column: 11, scope: !29)
!250 = !DILocation(line: 152, column: 14, scope: !29)
!251 = !DILocation(line: 177, column: 11, scope: !29)
!252 = !DILocation(line: 160, column: 14, scope: !29)
!253 = !DILocation(line: 156, column: 19, scope: !29)
!254 = !DILocation(line: 179, column: 3, scope: !255)
!255 = distinct !DILexicalBlock(scope: !29, file: !1, line: 179, column: 3)
!256 = !DILocation(line: 180, column: 17, scope: !257)
!257 = distinct !DILexicalBlock(scope: !258, file: !1, line: 180, column: 3)
!258 = distinct !DILexicalBlock(scope: !29, file: !1, line: 180, column: 3)
!259 = !DILocation(line: 180, column: 3, scope: !258)
!260 = !DILocation(line: 180, column: 42, scope: !257)
!261 = !DILocation(line: 179, column: 34, scope: !262)
!262 = distinct !DILexicalBlock(scope: !255, file: !1, line: 179, column: 3)
!263 = !DILocation(line: 179, column: 45, scope: !262)
!264 = !{!265, !265, i64 0}
