; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/core_algorithms.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.dpmatrix_s = type { i32**, i32**, i32**, i32**, i8*, i8*, i8*, i8*, i32, i32, i32, i32 }
%struct.dpshadow_s = type { i8**, i8**, i8**, i8**, i32* }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }
%struct.msa_struct = type { i8**, i8**, float*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8**, i8**, [6 x float], [6 x i32], i8**, i32, i32, i8**, i8**, i32, i32, i8**, i8***, %struct.GKI*, i32, i8**, i8**, %struct.GKI*, i32, i8**, i8***, %struct.GKI*, i32, %struct.GKI*, i32, i32, i32*, i32*, i32*, i32 }
%struct.GKI = type { %struct.gki_elem**, i32, i32, i32 }
%struct.gki_elem = type { i8*, i32, %struct.gki_elem* }
%struct.tophit_s = type { %struct.hit_s**, %struct.hit_s*, i32, i32, i32 }
%struct.hit_s = type { double, float, double, float, double, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, %struct.fancyali_s* }
%struct.fancyali_s = type { i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !51, globals: !555, imports: !555)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/core_algorithms.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 524, size: 32, align: 32, elements: !16)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "threshold_s", file: !4, line: 518, size: 320, align: 64, elements: !6)
!6 = !{!7, !9, !11, !12, !13, !14}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "globT", scope: !5, file: !4, line: 519, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "globE", scope: !5, file: !4, line: 520, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "domT", scope: !5, file: !4, line: 521, baseType: !8, size: 32, align: 32, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "domE", scope: !5, file: !4, line: 522, baseType: !10, size: 64, align: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "autocut", scope: !5, file: !4, line: 524, baseType: !3, size: 32, align: 32, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !5, file: !4, line: 525, baseType: !15, size: 32, align: 32, offset: 288)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "CUT_NONE", value: 0)
!18 = !DIEnumerator(name: "CUT_GA", value: 1)
!19 = !DIEnumerator(name: "CUT_NC", value: 2)
!20 = !DIEnumerator(name: "CUT_TC", value: 3)
!21 = !{!22, !26, !32, !27, !40, !44, !45, !8, !15, !10}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpmatrix_s", file: !4, line: 289, size: 640, align: 64, elements: !24)
!24 = !{!25, !28, !29, !30, !31, !33, !34, !35, !36, !37, !38, !39}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !23, file: !4, line: 290, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "mmx", scope: !23, file: !4, line: 291, baseType: !26, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "imx", scope: !23, file: !4, line: 292, baseType: !26, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dmx", scope: !23, file: !4, line: 293, baseType: !26, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "xmx_mem", scope: !23, file: !4, line: 299, baseType: !32, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "mmx_mem", scope: !23, file: !4, line: 299, baseType: !32, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "imx_mem", scope: !23, file: !4, line: 299, baseType: !32, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "dmx_mem", scope: !23, file: !4, line: 299, baseType: !32, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "maxN", scope: !23, file: !4, line: 308, baseType: !15, size: 32, align: 32, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "maxM", scope: !23, file: !4, line: 309, baseType: !15, size: 32, align: 32, offset: 544)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "padN", scope: !23, file: !4, line: 311, baseType: !15, size: 32, align: 32, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "padM", scope: !23, file: !4, line: 312, baseType: !15, size: 32, align: 32, offset: 608)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpshadow_s", file: !4, line: 320, size: 320, align: 64, elements: !42)
!42 = !{!43, !47, !48, !49, !50}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "xtb", scope: !41, file: !4, line: 321, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mtb", scope: !41, file: !4, line: 322, baseType: !44, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "itb", scope: !41, file: !4, line: 323, baseType: !44, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dtb", scope: !41, file: !4, line: 324, baseType: !44, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "esrc", scope: !41, file: !4, line: 325, baseType: !27, size: 64, align: 64, offset: 256)
!51 = !{!52, !62, !75, !86, !91, !104, !109, !116, !120, !124, !202, !238, !259, !287, !314, !329, !427, !445, !522}
!52 = !DISubprogram(name: "CreatePlan7Matrix", scope: !1, file: !1, line: 61, type: !53, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: %struct.dpmatrix_s* (i32, i32, i32, i32)* @CreatePlan7Matrix, variables: !55)
!53 = !DISubroutineType(types: !54)
!54 = !{!22, !15, !15, !15, !15}
!55 = !{!56, !57, !58, !59, !60, !61}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 1, scope: !52, file: !1, line: 61, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !52, file: !1, line: 61, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "padN", arg: 3, scope: !52, file: !1, line: 61, type: !15)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "padM", arg: 4, scope: !52, file: !1, line: 61, type: !15)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !52, file: !1, line: 63, type: !22)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !52, file: !1, line: 64, type: !15)
!62 = !DISubprogram(name: "ResizePlan7Matrix", scope: !1, file: !1, line: 123, type: !63, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dpmatrix_s*, i32, i32, i32***, i32***, i32***, i32***)* @ResizePlan7Matrix, variables: !66)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !22, !15, !15, !65, !65, !65, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mx", arg: 1, scope: !62, file: !1, line: 123, type: !22)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 2, scope: !62, file: !1, line: 123, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 3, scope: !62, file: !1, line: 123, type: !15)
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xmx", arg: 4, scope: !62, file: !1, line: 124, type: !65)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mmx", arg: 5, scope: !62, file: !1, line: 124, type: !65)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imx", arg: 6, scope: !62, file: !1, line: 124, type: !65)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dmx", arg: 7, scope: !62, file: !1, line: 124, type: !65)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !62, file: !1, line: 126, type: !15)
!75 = !DISubprogram(name: "AllocPlan7Matrix", scope: !1, file: !1, line: 192, type: !76, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, function: %struct.dpmatrix_s* (i32, i32, i32***, i32***, i32***, i32***)* @AllocPlan7Matrix, variables: !78)
!76 = !DISubroutineType(types: !77)
!77 = !{!22, !15, !15, !65, !65, !65, !65}
!78 = !{!79, !80, !81, !82, !83, !84, !85}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rows", arg: 1, scope: !75, file: !1, line: 192, type: !15)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !75, file: !1, line: 192, type: !15)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xmx", arg: 3, scope: !75, file: !1, line: 192, type: !65)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mmx", arg: 4, scope: !75, file: !1, line: 192, type: !65)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imx", arg: 5, scope: !75, file: !1, line: 192, type: !65)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dmx", arg: 6, scope: !75, file: !1, line: 192, type: !65)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !75, file: !1, line: 194, type: !22)
!86 = !DISubprogram(name: "FreePlan7Matrix", scope: !1, file: !1, line: 211, type: !87, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dpmatrix_s*)* @FreePlan7Matrix, variables: !89)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !22}
!89 = !{!90}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mx", arg: 1, scope: !86, file: !1, line: 211, type: !22)
!91 = !DISubprogram(name: "AllocShadowMatrix", scope: !1, file: !1, line: 239, type: !92, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, function: %struct.dpshadow_s* (i32, i32, i8***, i8***, i8***, i8***)* @AllocShadowMatrix, variables: !95)
!92 = !DISubroutineType(types: !93)
!93 = !{!40, !15, !15, !94, !94, !94, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rows", arg: 1, scope: !91, file: !1, line: 239, type: !15)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !91, file: !1, line: 239, type: !15)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xtb", arg: 3, scope: !91, file: !1, line: 239, type: !94)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtb", arg: 4, scope: !91, file: !1, line: 239, type: !94)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itb", arg: 5, scope: !91, file: !1, line: 239, type: !94)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dtb", arg: 6, scope: !91, file: !1, line: 239, type: !94)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !91, file: !1, line: 241, type: !40)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !91, file: !1, line: 242, type: !15)
!104 = !DISubprogram(name: "FreeShadowMatrix", scope: !1, file: !1, line: 276, type: !105, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dpshadow_s*)* @FreeShadowMatrix, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !40}
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 1, scope: !104, file: !1, line: 276, type: !40)
!109 = !DISubprogram(name: "P7ViterbiSize", scope: !1, file: !1, line: 307, type: !110, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @P7ViterbiSize, variables: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{!15, !15, !15}
!112 = !{!113, !114, !115}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 1, scope: !109, file: !1, line: 307, type: !15)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !109, file: !1, line: 307, type: !15)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Mbytes", scope: !109, file: !1, line: 309, type: !8)
!116 = !DISubprogram(name: "P7SmallViterbiSize", scope: !1, file: !1, line: 347, type: !110, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @P7SmallViterbiSize, variables: !117)
!117 = !{!118, !119}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 1, scope: !116, file: !1, line: 347, type: !15)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !116, file: !1, line: 347, type: !15)
!120 = !DISubprogram(name: "P7WeeViterbiSize", scope: !1, file: !1, line: 370, type: !110, isLocal: false, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @P7WeeViterbiSize, variables: !121)
!121 = !{!122, !123}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 1, scope: !120, file: !1, line: 370, type: !15)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !120, file: !1, line: 370, type: !15)
!124 = !DISubprogram(name: "P7Forward", scope: !1, file: !1, line: 397, type: !125, isLocal: false, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.dpmatrix_s**)* @P7Forward, variables: !189)
!125 = !DISubroutineType(types: !126)
!126 = !{!8, !45, !15, !127, !188}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !4, line: 101, size: 3712, align: 64, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !154, !155, !156, !157, !162, !163, !164, !168, !169, !170, !171, !172, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !4, line: 113, baseType: !45, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !128, file: !4, line: 114, baseType: !45, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !128, file: !4, line: 115, baseType: !45, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !128, file: !4, line: 116, baseType: !45, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !128, file: !4, line: 117, baseType: !45, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !128, file: !4, line: 118, baseType: !45, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !128, file: !4, line: 119, baseType: !45, size: 64, align: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !128, file: !4, line: 120, baseType: !15, size: 32, align: 32, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !128, file: !4, line: 121, baseType: !45, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !128, file: !4, line: 122, baseType: !27, size: 64, align: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !128, file: !4, line: 123, baseType: !15, size: 32, align: 32, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !128, file: !4, line: 134, baseType: !27, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !128, file: !4, line: 135, baseType: !27, size: 64, align: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !128, file: !4, line: 136, baseType: !27, size: 64, align: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !128, file: !4, line: 144, baseType: !8, size: 32, align: 32, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !128, file: !4, line: 144, baseType: !8, size: 32, align: 32, offset: 928)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !128, file: !4, line: 145, baseType: !8, size: 32, align: 32, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !128, file: !4, line: 145, baseType: !8, size: 32, align: 32, offset: 992)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !128, file: !4, line: 146, baseType: !8, size: 32, align: 32, offset: 1024)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !128, file: !4, line: 146, baseType: !8, size: 32, align: 32, offset: 1056)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !128, file: !4, line: 155, baseType: !15, size: 32, align: 32, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !128, file: !4, line: 156, baseType: !152, size: 64, align: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !128, file: !4, line: 157, baseType: !152, size: 64, align: 64, offset: 1216)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !128, file: !4, line: 158, baseType: !152, size: 64, align: 64, offset: 1280)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !128, file: !4, line: 159, baseType: !8, size: 32, align: 32, offset: 1344)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !128, file: !4, line: 168, baseType: !158, size: 256, align: 32, offset: 1376)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, align: 32, elements: !159)
!159 = !{!160, !161}
!160 = !DISubrange(count: 4)
!161 = !DISubrange(count: 2)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !128, file: !4, line: 169, baseType: !153, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !128, file: !4, line: 170, baseType: !153, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !128, file: !4, line: 174, baseType: !165, size: 640, align: 32, offset: 1792)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 640, align: 32, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 20)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !128, file: !4, line: 175, baseType: !8, size: 32, align: 32, offset: 2432)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !128, file: !4, line: 197, baseType: !26, size: 64, align: 64, offset: 2496)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !128, file: !4, line: 198, baseType: !26, size: 64, align: 64, offset: 2560)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !128, file: !4, line: 199, baseType: !26, size: 64, align: 64, offset: 2624)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !128, file: !4, line: 200, baseType: !173, size: 256, align: 32, offset: 2688)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, align: 32, elements: !159)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !128, file: !4, line: 201, baseType: !27, size: 64, align: 64, offset: 2944)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !128, file: !4, line: 202, baseType: !27, size: 64, align: 64, offset: 3008)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !128, file: !4, line: 203, baseType: !27, size: 64, align: 64, offset: 3072)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !128, file: !4, line: 203, baseType: !27, size: 64, align: 64, offset: 3136)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !128, file: !4, line: 203, baseType: !27, size: 64, align: 64, offset: 3200)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !128, file: !4, line: 203, baseType: !27, size: 64, align: 64, offset: 3264)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !128, file: !4, line: 203, baseType: !27, size: 64, align: 64, offset: 3328)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !128, file: !4, line: 214, baseType: !26, size: 64, align: 64, offset: 3392)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !128, file: !4, line: 215, baseType: !26, size: 64, align: 64, offset: 3456)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !128, file: !4, line: 216, baseType: !15, size: 32, align: 32, offset: 3520)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !128, file: !4, line: 217, baseType: !15, size: 32, align: 32, offset: 3552)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !128, file: !4, line: 222, baseType: !8, size: 32, align: 32, offset: 3584)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !128, file: !4, line: 223, baseType: !8, size: 32, align: 32, offset: 3616)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !128, file: !4, line: 225, baseType: !15, size: 32, align: 32, offset: 3648)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !124, file: !1, line: 397, type: !45)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !124, file: !1, line: 397, type: !15)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !124, file: !1, line: 397, type: !127)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_mx", arg: 4, scope: !124, file: !1, line: 397, type: !188)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !124, file: !1, line: 399, type: !22)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmx", scope: !124, file: !1, line: 400, type: !26)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmx", scope: !124, file: !1, line: 401, type: !26)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !124, file: !1, line: 402, type: !26)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !124, file: !1, line: 403, type: !26)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !124, file: !1, line: 404, type: !15)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !124, file: !1, line: 404, type: !15)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !124, file: !1, line: 405, type: !15)
!202 = !DISubprogram(name: "P7ViterbiTrace", scope: !1, file: !1, line: 628, type: !203, isLocal: false, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i8*, i32, %struct.dpmatrix_s*, %struct.p7trace_s**)* @P7ViterbiTrace, variables: !213)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !127, !45, !15, !22, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !4, line: 374, size: 256, align: 64, elements: !208)
!208 = !{!209, !210, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !207, file: !4, line: 375, baseType: !15, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !207, file: !4, line: 376, baseType: !45, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !207, file: !4, line: 377, baseType: !27, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !207, file: !4, line: 378, baseType: !27, size: 64, align: 64, offset: 192)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !202, file: !1, line: 628, type: !127)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 2, scope: !202, file: !1, line: 628, type: !45)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 3, scope: !202, file: !1, line: 628, type: !15)
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mx", arg: 4, scope: !202, file: !1, line: 629, type: !22)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 5, scope: !202, file: !1, line: 629, type: !205)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !202, file: !1, line: 631, type: !206)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curralloc", scope: !202, file: !1, line: 632, type: !15)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !202, file: !1, line: 633, type: !15)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !202, file: !1, line: 634, type: !15)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !202, file: !1, line: 635, type: !15)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmx", scope: !202, file: !1, line: 636, type: !26)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmx", scope: !202, file: !1, line: 636, type: !26)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !202, file: !1, line: 636, type: !26)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !202, file: !1, line: 636, type: !26)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !202, file: !1, line: 637, type: !15)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dk", scope: !230, file: !1, line: 791, type: !15)
!230 = distinct !DILexicalBlock(scope: !231, file: !1, line: 790, column: 8)
!231 = distinct !DILexicalBlock(scope: !232, file: !1, line: 789, column: 10)
!232 = distinct !DILexicalBlock(scope: !233, file: !1, line: 787, column: 4)
!233 = distinct !DILexicalBlock(scope: !234, file: !1, line: 786, column: 6)
!234 = distinct !DILexicalBlock(scope: !235, file: !1, line: 785, column: 7)
!235 = distinct !DILexicalBlock(scope: !236, file: !1, line: 785, column: 7)
!236 = distinct !DILexicalBlock(scope: !237, file: !1, line: 666, column: 36)
!237 = distinct !DILexicalBlock(scope: !202, file: !1, line: 665, column: 40)
!238 = !DISubprogram(name: "P7SmallViterbi", scope: !1, file: !1, line: 896, type: !239, isLocal: false, isDefinition: true, scopeLine: 897, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.dpmatrix_s*, %struct.p7trace_s**)* @P7SmallViterbi, variables: !241)
!239 = !DISubroutineType(types: !240)
!240 = !{!8, !45, !15, !127, !22, !205}
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !238, file: !1, line: 896, type: !45)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !238, file: !1, line: 896, type: !15)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !238, file: !1, line: 896, type: !127)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mx", arg: 4, scope: !238, file: !1, line: 896, type: !22)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 5, scope: !238, file: !1, line: 896, type: !205)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctr", scope: !238, file: !1, line: 898, type: !206)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !238, file: !1, line: 899, type: !206)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tarr", scope: !238, file: !1, line: 900, type: !205)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !238, file: !1, line: 901, type: !15)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !238, file: !1, line: 902, type: !15)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !238, file: !1, line: 903, type: !15)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !238, file: !1, line: 904, type: !15)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tlen", scope: !238, file: !1, line: 905, type: !15)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqlen", scope: !238, file: !1, line: 906, type: !15)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totlen", scope: !238, file: !1, line: 907, type: !15)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !238, file: !1, line: 908, type: !8)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !238, file: !1, line: 909, type: !15)
!259 = !DISubprogram(name: "P7ParsingViterbi", scope: !1, file: !1, line: 1064, type: !260, isLocal: false, isDefinition: true, scopeLine: 1065, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.p7trace_s**)* @P7ParsingViterbi, variables: !262)
!260 = !DISubroutineType(types: !261)
!261 = !{!8, !45, !15, !127, !205}
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !259, file: !1, line: 1064, type: !45)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !259, file: !1, line: 1064, type: !15)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !259, file: !1, line: 1064, type: !127)
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 4, scope: !259, file: !1, line: 1064, type: !205)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !259, file: !1, line: 1066, type: !22)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmx", scope: !259, file: !1, line: 1067, type: !22)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !259, file: !1, line: 1068, type: !206)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmx", scope: !259, file: !1, line: 1069, type: !26)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmx", scope: !259, file: !1, line: 1069, type: !26)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !259, file: !1, line: 1069, type: !26)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !259, file: !1, line: 1069, type: !26)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xtr", scope: !259, file: !1, line: 1070, type: !26)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtr", scope: !259, file: !1, line: 1070, type: !26)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dtr", scope: !259, file: !1, line: 1070, type: !26)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itr", scope: !259, file: !1, line: 1070, type: !26)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "btr", scope: !259, file: !1, line: 1071, type: !27)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etr", scope: !259, file: !1, line: 1071, type: !27)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !259, file: !1, line: 1072, type: !15)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !259, file: !1, line: 1073, type: !15)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !259, file: !1, line: 1073, type: !15)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !259, file: !1, line: 1073, type: !15)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !259, file: !1, line: 1074, type: !15)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prv", scope: !259, file: !1, line: 1074, type: !15)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curralloc", scope: !259, file: !1, line: 1075, type: !15)
!287 = !DISubprogram(name: "P7WeeViterbi", scope: !1, file: !1, line: 1263, type: !260, isLocal: false, isDefinition: true, scopeLine: 1264, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.p7trace_s**)* @P7WeeViterbi, variables: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !287, file: !1, line: 1263, type: !45)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !287, file: !1, line: 1263, type: !15)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !287, file: !1, line: 1263, type: !127)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 4, scope: !287, file: !1, line: 1263, type: !205)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !287, file: !1, line: 1265, type: !206)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kassign", scope: !287, file: !1, line: 1266, type: !27)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tassign", scope: !287, file: !1, line: 1267, type: !45)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endlist", scope: !287, file: !1, line: 1268, type: !27)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startlist", scope: !287, file: !1, line: 1269, type: !27)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lpos", scope: !287, file: !1, line: 1270, type: !15)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k1", scope: !287, file: !1, line: 1271, type: !15)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k2", scope: !287, file: !1, line: 1271, type: !15)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k3", scope: !287, file: !1, line: 1271, type: !15)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !287, file: !1, line: 1272, type: !46)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !287, file: !1, line: 1272, type: !46)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t3", scope: !287, file: !1, line: 1272, type: !46)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !287, file: !1, line: 1273, type: !15)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !287, file: !1, line: 1273, type: !15)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s3", scope: !287, file: !1, line: 1273, type: !15)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !287, file: !1, line: 1274, type: !8)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret_sc", scope: !287, file: !1, line: 1275, type: !8)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tlen", scope: !287, file: !1, line: 1276, type: !15)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !287, file: !1, line: 1277, type: !15)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !287, file: !1, line: 1277, type: !15)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !287, file: !1, line: 1277, type: !15)
!314 = !DISubprogram(name: "Plan7ESTViterbi", scope: !1, file: !1, line: 1483, type: !125, isLocal: false, isDefinition: true, scopeLine: 1484, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.dpmatrix_s**)* @Plan7ESTViterbi, variables: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !314, file: !1, line: 1483, type: !45)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !314, file: !1, line: 1483, type: !15)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !314, file: !1, line: 1483, type: !127)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_mx", arg: 4, scope: !314, file: !1, line: 1483, type: !188)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !314, file: !1, line: 1485, type: !22)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmx", scope: !314, file: !1, line: 1486, type: !26)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmx", scope: !314, file: !1, line: 1487, type: !26)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !314, file: !1, line: 1488, type: !26)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !314, file: !1, line: 1489, type: !26)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !314, file: !1, line: 1490, type: !15)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !314, file: !1, line: 1490, type: !15)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !314, file: !1, line: 1491, type: !15)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codon", scope: !314, file: !1, line: 1492, type: !15)
!329 = !DISubprogram(name: "P7ViterbiAlignAlignment", scope: !1, file: !1, line: 2022, type: !330, isLocal: false, isDefinition: true, scopeLine: 2023, flags: DIFlagPrototyped, isOptimized: true, function: %struct.p7trace_s* (%struct.msa_struct*, %struct.plan7_s*)* @P7ViterbiAlignAlignment, variables: !403)
!330 = !DISubroutineType(types: !331)
!331 = !{!206, !332, !127}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !334, line: 177, baseType: !335)
!334 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !334, line: 112, size: 2880, align: 64, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !335, file: !334, line: 115, baseType: !44, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !335, file: !334, line: 116, baseType: !44, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !335, file: !334, line: 117, baseType: !153, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !335, file: !334, line: 118, baseType: !15, size: 32, align: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !335, file: !334, line: 119, baseType: !15, size: 32, align: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !335, file: !334, line: 123, baseType: !15, size: 32, align: 32, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !334, line: 124, baseType: !15, size: 32, align: 32, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !334, line: 125, baseType: !45, size: 64, align: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !335, file: !334, line: 126, baseType: !45, size: 64, align: 64, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !335, file: !334, line: 127, baseType: !45, size: 64, align: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !335, file: !334, line: 128, baseType: !45, size: 64, align: 64, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !335, file: !334, line: 129, baseType: !45, size: 64, align: 64, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !335, file: !334, line: 130, baseType: !45, size: 64, align: 64, offset: 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !335, file: !334, line: 131, baseType: !45, size: 64, align: 64, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !335, file: !334, line: 132, baseType: !44, size: 64, align: 64, offset: 768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !335, file: !334, line: 133, baseType: !44, size: 64, align: 64, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !335, file: !334, line: 134, baseType: !44, size: 64, align: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !335, file: !334, line: 135, baseType: !44, size: 64, align: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !335, file: !334, line: 136, baseType: !356, size: 192, align: 32, offset: 1024)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, align: 32, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 6)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !335, file: !334, line: 137, baseType: !360, size: 192, align: 32, offset: 1216)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, align: 32, elements: !357)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !335, file: !334, line: 144, baseType: !44, size: 64, align: 64, offset: 1408)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !335, file: !334, line: 145, baseType: !15, size: 32, align: 32, offset: 1472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !335, file: !334, line: 146, baseType: !15, size: 32, align: 32, offset: 1504)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !335, file: !334, line: 148, baseType: !44, size: 64, align: 64, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !335, file: !334, line: 149, baseType: !44, size: 64, align: 64, offset: 1600)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !335, file: !334, line: 150, baseType: !15, size: 32, align: 32, offset: 1664)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !335, file: !334, line: 151, baseType: !15, size: 32, align: 32, offset: 1696)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !335, file: !334, line: 153, baseType: !44, size: 64, align: 64, offset: 1728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !335, file: !334, line: 154, baseType: !94, size: 64, align: 64, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !335, file: !334, line: 155, baseType: !371, size: 64, align: 64, offset: 1856)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !373, line: 42, baseType: !374)
!373 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!374 = !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 36, size: 192, align: 64, elements: !375)
!375 = !{!376, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !374, file: !373, line: 37, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !373, line: 26, size: 192, align: 64, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !379, file: !373, line: 27, baseType: !45, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !379, file: !373, line: 28, baseType: !15, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !379, file: !373, line: 29, baseType: !378, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !374, file: !373, line: 39, baseType: !15, size: 32, align: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !374, file: !373, line: 40, baseType: !15, size: 32, align: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !374, file: !373, line: 41, baseType: !15, size: 32, align: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !335, file: !334, line: 156, baseType: !15, size: 32, align: 32, offset: 1920)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !335, file: !334, line: 158, baseType: !44, size: 64, align: 64, offset: 1984)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !335, file: !334, line: 159, baseType: !44, size: 64, align: 64, offset: 2048)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !335, file: !334, line: 160, baseType: !371, size: 64, align: 64, offset: 2112)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !335, file: !334, line: 161, baseType: !15, size: 32, align: 32, offset: 2176)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !335, file: !334, line: 163, baseType: !44, size: 64, align: 64, offset: 2240)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !335, file: !334, line: 164, baseType: !94, size: 64, align: 64, offset: 2304)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !335, file: !334, line: 165, baseType: !371, size: 64, align: 64, offset: 2368)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !335, file: !334, line: 166, baseType: !15, size: 32, align: 32, offset: 2432)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !335, file: !334, line: 170, baseType: !371, size: 64, align: 64, offset: 2496)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !335, file: !334, line: 171, baseType: !15, size: 32, align: 32, offset: 2560)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !335, file: !334, line: 172, baseType: !15, size: 32, align: 32, offset: 2592)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !335, file: !334, line: 173, baseType: !27, size: 64, align: 64, offset: 2624)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !335, file: !334, line: 174, baseType: !27, size: 64, align: 64, offset: 2688)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !335, file: !334, line: 175, baseType: !27, size: 64, align: 64, offset: 2752)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !335, file: !334, line: 176, baseType: !15, size: 32, align: 32, offset: 2816)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !329, file: !1, line: 2022, type: !332)
!405 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !329, file: !1, line: 2022, type: !127)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !329, file: !1, line: 2024, type: !22)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !329, file: !1, line: 2025, type: !40)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !329, file: !1, line: 2026, type: !206)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmx", scope: !329, file: !1, line: 2027, type: !26)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmx", scope: !329, file: !1, line: 2027, type: !26)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !329, file: !1, line: 2027, type: !26)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !329, file: !1, line: 2027, type: !26)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xtb", scope: !329, file: !1, line: 2028, type: !44)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtb", scope: !329, file: !1, line: 2028, type: !44)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itb", scope: !329, file: !1, line: 2028, type: !44)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dtb", scope: !329, file: !1, line: 2028, type: !44)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "con", scope: !329, file: !1, line: 2029, type: !152)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mocc", scope: !329, file: !1, line: 2030, type: !153)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !329, file: !1, line: 2031, type: !15)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !329, file: !1, line: 2032, type: !15)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !329, file: !1, line: 2033, type: !15)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !329, file: !1, line: 2034, type: !15)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !329, file: !1, line: 2035, type: !15)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denom", scope: !329, file: !1, line: 2036, type: !8)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !329, file: !1, line: 2037, type: !15)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prv", scope: !329, file: !1, line: 2037, type: !15)
!427 = !DISubprogram(name: "ShadowTrace", scope: !1, file: !1, line: 2213, type: !428, isLocal: false, isDefinition: true, scopeLine: 2214, flags: DIFlagPrototyped, isOptimized: true, function: %struct.p7trace_s* (%struct.dpshadow_s*, %struct.plan7_s*, i32)* @ShadowTrace, variables: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{!206, !40, !127, !15}
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 1, scope: !427, file: !1, line: 2213, type: !40)
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !427, file: !1, line: 2213, type: !127)
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 3, scope: !427, file: !1, line: 2213, type: !15)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !427, file: !1, line: 2215, type: !206)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curralloc", scope: !427, file: !1, line: 2216, type: !15)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !427, file: !1, line: 2217, type: !15)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !427, file: !1, line: 2218, type: !15)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !427, file: !1, line: 2219, type: !15)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nxtstate", scope: !427, file: !1, line: 2220, type: !46)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dk", scope: !441, file: !1, line: 2317, type: !15)
!441 = distinct !DILexicalBlock(scope: !442, file: !1, line: 2316, column: 2)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 2315, column: 11)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 2243, column: 23)
!444 = distinct !DILexicalBlock(scope: !427, file: !1, line: 2242, column: 27)
!445 = !DISubprogram(name: "PostprocessSignificantHit", scope: !1, file: !1, line: 2436, type: !446, isLocal: false, isDefinition: true, scopeLine: 2450, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.tophit_s*, %struct.tophit_s*, %struct.p7trace_s*, %struct.plan7_s*, i8*, i32, i8*, i8*, i8*, i32, float, i32, %struct.threshold_s*, i32)* @PostprocessSignificantHit, variables: !491)
!446 = !DISubroutineType(types: !447)
!447 = !{!8, !448, !448, !206, !127, !45, !15, !45, !45, !45, !15, !8, !15, !490, !15}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "tophit_s", file: !4, line: 497, size: 256, align: 64, elements: !450)
!450 = !{!451, !486, !487, !488, !489}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !449, file: !4, line: 498, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "hit_s", file: !4, line: 470, size: 832, align: 64, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sortkey", scope: !454, file: !4, line: 471, baseType: !10, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !454, file: !4, line: 472, baseType: !8, size: 32, align: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pvalue", scope: !454, file: !4, line: 473, baseType: !10, size: 64, align: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mothersc", scope: !454, file: !4, line: 474, baseType: !8, size: 32, align: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "motherp", scope: !454, file: !4, line: 475, baseType: !10, size: 64, align: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !4, line: 476, baseType: !45, size: 64, align: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !454, file: !4, line: 477, baseType: !45, size: 64, align: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !454, file: !4, line: 478, baseType: !45, size: 64, align: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sqfrom", scope: !454, file: !4, line: 479, baseType: !15, size: 32, align: 32, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sqto", scope: !454, file: !4, line: 480, baseType: !15, size: 32, align: 32, offset: 544)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !454, file: !4, line: 481, baseType: !15, size: 32, align: 32, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "hmmfrom", scope: !454, file: !4, line: 482, baseType: !15, size: 32, align: 32, offset: 608)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "hmmto", scope: !454, file: !4, line: 483, baseType: !15, size: 32, align: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "hmmlen", scope: !454, file: !4, line: 484, baseType: !15, size: 32, align: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "domidx", scope: !454, file: !4, line: 485, baseType: !15, size: 32, align: 32, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ndom", scope: !454, file: !4, line: 486, baseType: !15, size: 32, align: 32, offset: 736)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ali", scope: !454, file: !4, line: 487, baseType: !473, size: 64, align: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "fancyali_s", file: !4, line: 447, size: 576, align: 64, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rfline", scope: !474, file: !4, line: 448, baseType: !45, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "csline", scope: !474, file: !4, line: 449, baseType: !45, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !474, file: !4, line: 450, baseType: !45, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mline", scope: !474, file: !4, line: 451, baseType: !45, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !474, file: !4, line: 452, baseType: !45, size: 64, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !474, file: !4, line: 453, baseType: !15, size: 32, align: 32, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !474, file: !4, line: 454, baseType: !45, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !474, file: !4, line: 455, baseType: !45, size: 64, align: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sqfrom", scope: !474, file: !4, line: 456, baseType: !15, size: 32, align: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sqto", scope: !474, file: !4, line: 457, baseType: !15, size: 32, align: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "unsrt", scope: !449, file: !4, line: 499, baseType: !453, size: 64, align: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !449, file: !4, line: 500, baseType: !15, size: 32, align: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !449, file: !4, line: 501, baseType: !15, size: 32, align: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lump", scope: !449, file: !4, line: 502, baseType: !15, size: 32, align: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghit", arg: 1, scope: !445, file: !1, line: 2436, type: !448)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dhit", arg: 2, scope: !445, file: !1, line: 2437, type: !448)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 3, scope: !445, file: !1, line: 2438, type: !206)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 4, scope: !445, file: !1, line: 2439, type: !127)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 5, scope: !445, file: !1, line: 2440, type: !45)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 6, scope: !445, file: !1, line: 2441, type: !15)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seqname", arg: 7, scope: !445, file: !1, line: 2442, type: !45)
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seqacc", arg: 8, scope: !445, file: !1, line: 2443, type: !45)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seqdesc", arg: 9, scope: !445, file: !1, line: 2444, type: !45)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_forward", arg: 10, scope: !445, file: !1, line: 2445, type: !15)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sc_override", arg: 11, scope: !445, file: !1, line: 2446, type: !8)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_null2", arg: 12, scope: !445, file: !1, line: 2447, type: !15)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thresh", arg: 13, scope: !445, file: !1, line: 2448, type: !490)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmpfam_mode", arg: 14, scope: !445, file: !1, line: 2449, type: !15)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tarr", scope: !445, file: !1, line: 2451, type: !205)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ali", scope: !445, file: !1, line: 2452, type: !473)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntr", scope: !445, file: !1, line: 2453, type: !15)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tidx", scope: !445, file: !1, line: 2454, type: !15)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !445, file: !1, line: 2455, type: !15)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "didx", scope: !445, file: !1, line: 2456, type: !15)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k1", scope: !445, file: !1, line: 2457, type: !15)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k2", scope: !445, file: !1, line: 2457, type: !15)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !445, file: !1, line: 2458, type: !15)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2", scope: !445, file: !1, line: 2458, type: !15)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whole_sc", scope: !445, file: !1, line: 2459, type: !8)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !445, file: !1, line: 2460, type: !153)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "usedomain", scope: !445, file: !1, line: 2461, type: !27)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whole_pval", scope: !445, file: !1, line: 2462, type: !10)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pvalue", scope: !445, file: !1, line: 2463, type: !10)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sortkey", scope: !445, file: !1, line: 2464, type: !10)
