; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/dayhoff.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@squid_errno = external global i32
@.str = private unnamed_addr constant [32 x i8] c"BLOSUM Clustered Scoring Matrix\00", align 1
@.str1 = private unnamed_addr constant [21 x i8] c"substitution matrix,\00", align 1
@.str2 = private unnamed_addr constant [4 x i8] c" \09\0A\00", align 1
@.str3 = private unnamed_addr constant [14 x i8] c"calloc failed\00", align 1
@.str4 = private unnamed_addr constant [64 x i8] c"Failed to parse PAM matrix scale factor. Defaulting to ln(2)/2!\00", align 1
@_DefaultRuneLocale = external global %struct._RuneLocale

; Function Attrs: nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !9, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/dayhoff.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!9 = !{!10, !97, !103, !111, !114, !120}
!10 = !DISubprogram(name: "ParsePAMFile", scope: !1, file: !1, line: 64, type: !11, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32***, float*)* @ParsePAMFile, variables: !77)
!11 = !DISubroutineType(types: !12)
!12 = !{!5, !13, !75, !76}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !15, line: 153, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !15, line: 122, size: 1216, align: 64, elements: !17)
!17 = !{!18, !21, !22, !23, !25, !26, !31, !32, !33, !37, !43, !53, !59, !60, !63, !64, !68, !72, !73, !74}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !16, file: !15, line: 123, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !16, file: !15, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !16, file: !15, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !16, file: !15, line: 126, baseType: !24, size: 16, align: 16, offset: 128)
!24 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !16, file: !15, line: 127, baseType: !24, size: 16, align: 16, offset: 144)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !16, file: !15, line: 128, baseType: !27, size: 128, align: 64, offset: 192)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !15, line: 88, size: 128, align: 64, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !27, file: !15, line: 89, baseType: !19, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !27, file: !15, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !16, file: !15, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !16, file: !15, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !16, file: !15, line: 133, baseType: !34, size: 64, align: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!5, !4}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !16, file: !15, line: 134, baseType: !38, size: 64, align: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!5, !4, !41, !5}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !16, file: !15, line: 135, baseType: !44, size: 64, align: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !4, !47, !5}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !15, line: 77, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !49, line: 71, baseType: !50)
!49 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !16, file: !15, line: 136, baseType: !54, size: 64, align: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!5, !4, !57, !5}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !16, file: !15, line: 139, baseType: !27, size: 128, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !16, file: !15, line: 140, baseType: !61, size: 64, align: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !15, line: 94, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !16, file: !15, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !16, file: !15, line: 144, baseType: !65, size: 24, align: 8, offset: 928)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 24, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !16, file: !15, line: 145, baseType: !69, size: 8, align: 8, offset: 952)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !16, file: !15, line: 148, baseType: !27, size: 128, align: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !16, file: !15, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !16, file: !15, line: 152, baseType: !47, size: 64, align: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!77 = !{!78, !79, !80, !81, !82, !86, !90, !91, !92, !93, !94, !95, !96}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !10, file: !1, line: 64, type: !13)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_pam", arg: 2, scope: !10, file: !1, line: 64, type: !75)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_scale", arg: 3, scope: !10, file: !1, line: 64, type: !76)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pam", scope: !10, file: !1, line: 66, type: !7)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !10, file: !1, line: 67, type: !83)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 4096, align: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 512)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !10, file: !1, line: 68, type: !87)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 864, align: 32, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 27)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsymbols", scope: !10, file: !1, line: 69, type: !5)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sptr", scope: !10, file: !1, line: 70, type: !41)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !10, file: !1, line: 71, type: !5)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !10, file: !1, line: 72, type: !5)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !10, file: !1, line: 72, type: !5)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scale", scope: !10, file: !1, line: 73, type: !6)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gotscale", scope: !10, file: !1, line: 74, type: !5)
!97 = !DISubprogram(name: "isdigit", scope: !98, file: !98, line: 237, type: !99, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !101)
!98 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!99 = !DISubroutineType(types: !100)
!100 = !{!5, !5}
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !97, file: !98, line: 237, type: !5)
!103 = !DISubprogram(name: "__isctype", scope: !98, file: !98, line: 164, type: !104, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, variables: !108)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !106, !107}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !51, line: 70, baseType: !5)
!107 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !{!109, !110}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !103, file: !98, line: 164, type: !106)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !103, file: !98, line: 164, type: !107)
!111 = !DISubprogram(name: "isalpha", scope: !98, file: !98, line: 218, type: !99, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, variables: !112)
!112 = !{!113}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !111, file: !98, line: 218, type: !5)
!114 = !DISubprogram(name: "__istype", scope: !98, file: !98, line: 153, type: !115, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{!5, !106, !107}
!117 = !{!118, !119}
