; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/debug.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.p7prior_s = type { i32, i32, [200 x float], [200 x [7 x float]], i32, [200 x float], [200 x [20 x float]], i32, [200 x float], [200 x [20 x float]] }

@.str = private unnamed_addr constant [2 x i8] c"S\00", align 1
@.str1 = private unnamed_addr constant [2 x i8] c"N\00", align 1
@.str2 = private unnamed_addr constant [2 x i8] c"B\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"M\00", align 1
@.str4 = private unnamed_addr constant [2 x i8] c"D\00", align 1
@.str5 = private unnamed_addr constant [2 x i8] c"I\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/debug.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !{!8, !14, !19, !162, !191, !205, !212}
!8 = !DISubprogram(name: "Statetype", scope: !1, file: !1, line: 38, type: !9, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8)* @Statetype, variables: !12)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !6}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!12 = !{!13}
!13 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st", arg: 1, scope: !8, file: !1, line: 38, type: !6)
!14 = !DISubprogram(name: "AlphabetType2String", scope: !1, file: !1, line: 67, type: !15, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @AlphabetType2String, variables: !17)
!15 = !DISubroutineType(types: !16)
!16 = !{!11, !5}
!17 = !{!18}
!18 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !14, file: !1, line: 67, type: !5)
!19 = !DISubprogram(name: "P7PrintTrace", scope: !1, file: !1, line: 89, type: !20, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.p7trace_s*, %struct.plan7_s*, i8*)* @P7PrintTrace, variables: !154)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !82, !91, !11}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 153, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !24, line: 122, size: 1216, align: 64, elements: !26)
!26 = !{!27, !30, !31, !32, !34, !35, !40, !41, !42, !46, !50, !60, !66, !67, !70, !71, !75, !79, !80, !81}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !25, file: !24, line: 123, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !25, file: !24, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !25, file: !24, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !25, file: !24, line: 126, baseType: !33, size: 16, align: 16, offset: 128)
!33 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !25, file: !24, line: 127, baseType: !33, size: 16, align: 16, offset: 144)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !25, file: !24, line: 128, baseType: !36, size: 128, align: 64, offset: 192)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !24, line: 88, size: 128, align: 64, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !36, file: !24, line: 89, baseType: !28, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !36, file: !24, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !25, file: !24, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !25, file: !24, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !25, file: !24, line: 133, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!5, !4}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !25, file: !24, line: 134, baseType: !47, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!5, !4, !11, !5}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !25, file: !24, line: 135, baseType: !51, size: 64, align: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !4, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !24, line: 77, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !56, line: 71, baseType: !57)
!56 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !58, line: 46, baseType: !59)
!58 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !25, file: !24, line: 136, baseType: !61, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!5, !4, !64, !5}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !25, file: !24, line: 139, baseType: !36, size: 128, align: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !25, file: !24, line: 140, baseType: !68, size: 64, align: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !24, line: 94, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !25, file: !24, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !25, file: !24, line: 144, baseType: !72, size: 24, align: 8, offset: 928)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 24, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !25, file: !24, line: 145, baseType: !76, size: 8, align: 8, offset: 952)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !25, file: !24, line: 148, baseType: !36, size: 128, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !25, file: !24, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !25, file: !24, line: 152, baseType: !54, size: 64, align: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !84, line: 374, size: 256, align: 64, elements: !85)
!84 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !{!86, !87, !88, !90}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !83, file: !84, line: 375, baseType: !5, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !83, file: !84, line: 376, baseType: !11, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !83, file: !84, line: 377, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !83, file: !84, line: 378, baseType: !89, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !84, line: 101, size: 3712, align: 64, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !110, !111, !112, !113, !114, !115, !116, !119, !120, !121, !122, !127, !128, !129, !133, !134, !136, !137, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !84, line: 113, baseType: !11, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !92, file: !84, line: 114, baseType: !11, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !92, file: !84, line: 115, baseType: !11, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !92, file: !84, line: 116, baseType: !11, size: 64, align: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !92, file: !84, line: 117, baseType: !11, size: 64, align: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !92, file: !84, line: 118, baseType: !11, size: 64, align: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !92, file: !84, line: 119, baseType: !11, size: 64, align: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !92, file: !84, line: 120, baseType: !5, size: 32, align: 32, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !92, file: !84, line: 121, baseType: !11, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !92, file: !84, line: 122, baseType: !89, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !92, file: !84, line: 123, baseType: !5, size: 32, align: 32, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !92, file: !84, line: 134, baseType: !89, size: 64, align: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !92, file: !84, line: 135, baseType: !89, size: 64, align: 64, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !92, file: !84, line: 136, baseType: !89, size: 64, align: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !92, file: !84, line: 144, baseType: !109, size: 32, align: 32, offset: 896)
!109 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !92, file: !84, line: 144, baseType: !109, size: 32, align: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !92, file: !84, line: 145, baseType: !109, size: 32, align: 32, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !92, file: !84, line: 145, baseType: !109, size: 32, align: 32, offset: 992)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !92, file: !84, line: 146, baseType: !109, size: 32, align: 32, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !92, file: !84, line: 146, baseType: !109, size: 32, align: 32, offset: 1056)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !92, file: !84, line: 155, baseType: !5, size: 32, align: 32, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !92, file: !84, line: 156, baseType: !117, size: 64, align: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !92, file: !84, line: 157, baseType: !117, size: 64, align: 64, offset: 1216)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !92, file: !84, line: 158, baseType: !117, size: 64, align: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !92, file: !84, line: 159, baseType: !109, size: 32, align: 32, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !92, file: !84, line: 168, baseType: !123, size: 256, align: 32, offset: 1376)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 256, align: 32, elements: !124)
!124 = !{!125, !126}
!125 = !DISubrange(count: 4)
!126 = !DISubrange(count: 2)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !92, file: !84, line: 169, baseType: !118, size: 64, align: 64, offset: 1664)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !92, file: !84, line: 170, baseType: !118, size: 64, align: 64, offset: 1728)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !92, file: !84, line: 174, baseType: !130, size: 640, align: 32, offset: 1792)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 640, align: 32, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 20)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !92, file: !84, line: 175, baseType: !109, size: 32, align: 32, offset: 2432)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !92, file: !84, line: 197, baseType: !135, size: 64, align: 64, offset: 2496)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !92, file: !84, line: 198, baseType: !135, size: 64, align: 64, offset: 2560)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !92, file: !84, line: 199, baseType: !135, size: 64, align: 64, offset: 2624)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !92, file: !84, line: 200, baseType: !139, size: 256, align: 32, offset: 2688)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, align: 32, elements: !124)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !92, file: !84, line: 201, baseType: !89, size: 64, align: 64, offset: 2944)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !92, file: !84, line: 202, baseType: !89, size: 64, align: 64, offset: 3008)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !92, file: !84, line: 203, baseType: !89, size: 64, align: 64, offset: 3072)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !92, file: !84, line: 203, baseType: !89, size: 64, align: 64, offset: 3136)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !92, file: !84, line: 203, baseType: !89, size: 64, align: 64, offset: 3200)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !92, file: !84, line: 203, baseType: !89, size: 64, align: 64, offset: 3264)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !92, file: !84, line: 203, baseType: !89, size: 64, align: 64, offset: 3328)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !92, file: !84, line: 214, baseType: !135, size: 64, align: 64, offset: 3392)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !92, file: !84, line: 215, baseType: !135, size: 64, align: 64, offset: 3456)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !92, file: !84, line: 216, baseType: !5, size: 32, align: 32, offset: 3520)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !92, file: !84, line: 217, baseType: !5, size: 32, align: 32, offset: 3552)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !92, file: !84, line: 222, baseType: !109, size: 32, align: 32, offset: 3584)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !92, file: !84, line: 223, baseType: !109, size: 32, align: 32, offset: 3616)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !92, file: !84, line: 225, baseType: !5, size: 32, align: 32, offset: 3648)
!154 = !{!155, !156, !157, !158, !159, !160, !161}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !19, file: !1, line: 89, type: !22)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 2, scope: !19, file: !1, line: 89, type: !82)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !19, file: !1, line: 89, type: !91)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 4, scope: !19, file: !1, line: 89, type: !11)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !19, file: !1, line: 91, type: !5)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !19, file: !1, line: 92, type: !5)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !19, file: !1, line: 93, type: !5)
!162 = !DISubprogram(name: "P7PrintPrior", scope: !1, file: !1, line: 167, type: !163, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.p7prior_s*)* @P7PrintPrior, variables: !186)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !22, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7prior_s", file: !84, line: 385, size: 320128, align: 32, elements: !167)
!167 = !{!168, !169, !170, !174, !178, !179, !180, !183, !184, !185}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !166, file: !84, line: 386, baseType: !5, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tnum", scope: !166, file: !84, line: 388, baseType: !5, size: 32, align: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tq", scope: !166, file: !84, line: 389, baseType: !171, size: 6400, align: 32, offset: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 6400, align: 32, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 200)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !166, file: !84, line: 390, baseType: !175, size: 44800, align: 32, offset: 6464)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 44800, align: 32, elements: !176)
!176 = !{!173, !177}
!177 = !DISubrange(count: 7)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mnum", scope: !166, file: !84, line: 392, baseType: !5, size: 32, align: 32, offset: 51264)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mq", scope: !166, file: !84, line: 393, baseType: !171, size: 6400, align: 32, offset: 51296)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !166, file: !84, line: 394, baseType: !181, size: 128000, align: 32, offset: 57696)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 128000, align: 32, elements: !182)
!182 = !{!173, !132}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "inum", scope: !166, file: !84, line: 396, baseType: !5, size: 32, align: 32, offset: 185696)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !166, file: !84, line: 397, baseType: !171, size: 6400, align: 32, offset: 185728)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !166, file: !84, line: 398, baseType: !181, size: 128000, align: 32, offset: 192128)
!186 = !{!187, !188, !189, !190}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !162, file: !1, line: 167, type: !22)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pri", arg: 2, scope: !162, file: !1, line: 167, type: !165)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !162, file: !1, line: 169, type: !5)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !162, file: !1, line: 169, type: !5)
!191 = !DISubprogram(name: "TraceVerify", scope: !1, file: !1, line: 225, type: !192, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.p7trace_s*, i32, i32)* @TraceVerify, variables: !194)
!192 = !DISubroutineType(types: !193)
!193 = !{!5, !82, !5, !5}
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !191, file: !1, line: 225, type: !82)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !191, file: !1, line: 225, type: !5)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "N", arg: 3, scope: !191, file: !1, line: 225, type: !5)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !191, file: !1, line: 227, type: !5)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !191, file: !1, line: 228, type: !5)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !191, file: !1, line: 229, type: !5)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !191, file: !1, line: 230, type: !5)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nc", scope: !191, file: !1, line: 230, type: !5)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nj", scope: !191, file: !1, line: 230, type: !5)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nm", scope: !191, file: !1, line: 231, type: !5)
!205 = !DISubprogram(name: "TraceCompare", scope: !1, file: !1, line: 361, type: !206, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.p7trace_s*, %struct.p7trace_s*)* @TraceCompare, variables: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{!5, !82, !82}
!208 = !{!209, !210, !211}
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t1", arg: 1, scope: !205, file: !1, line: 361, type: !82)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t2", arg: 2, scope: !205, file: !1, line: 361, type: !82)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !205, file: !1, line: 363, type: !5)
!212 = !DISubprogram(name: "tolower", scope: !213, file: !213, line: 292, type: !214, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, variables: !216)
!213 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!214 = !DISubroutineType(types: !215)
!215 = !{!5, !5}
!216 = !{!217}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !212, file: !213, line: 292, type: !5)
!218 = !{i32 2, !"Dwarf Version", i32 2}
!219 = !{i32 2, !"Debug Info Version", i32 700000003}
!220 = !{i32 1, !"PIC Level", i32 2}
!221 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!222 = !DIExpression()
!223 = !DILocation(line: 38, column: 16, scope: !8)
!224 = !DILocation(line: 40, column: 11, scope: !8)
!225 = !DILocation(line: 40, column: 3, scope: !8)
!226 = !DILocation(line: 53, column: 1, scope: !8)
!227 = !DILocation(line: 67, column: 25, scope: !14)
!228 = !DILocation(line: 69, column: 3, scope: !14)
!229 = !DILocation(line: 75, column: 1, scope: !14)
!230 = !DILocation(line: 89, column: 20, scope: !19)
!231 = !DILocation(line: 89, column: 42, scope: !19)
