; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/display.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.dpmatrix_s = type { i32**, i32**, i32**, i32**, i8*, i8*, i8*, i8*, i32, i32, i32, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }

@.str = private unnamed_addr constant [14 x i8] c"unknown state\00", align 1
@.str1 = private unnamed_addr constant [17 x i8] c"         *      \00", align 1
@.str2 = private unnamed_addr constant [13 x i8] c"    %c      \00", align 1
@Alphabet = external global [25 x i8]
@.str3 = private unnamed_addr constant [7 x i8] c"\0AN    \00", align 1
@.str4 = private unnamed_addr constant [8 x i8] c"\0AM%-3d \00", align 1
@.str5 = private unnamed_addr constant [8 x i8] c"\0AI%-3d \00", align 1
@.str6 = private unnamed_addr constant [7 x i8] c"\0AE    \00", align 1
@.str7 = private unnamed_addr constant [7 x i8] c"\0AC    \00", align 1
@.str8 = private unnamed_addr constant [7 x i8] c"\0AJ    \00", align 1
@.str9 = private unnamed_addr constant [7 x i8] c"\0AB    \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/display.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!7 = !{!8, !110, !131, !141, !148}
!8 = !DISubprogram(name: "DisplayPlan7Posteriors", scope: !1, file: !1, line: 62, type: !9, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.plan7_s*, %struct.dpmatrix_s*, %struct.dpmatrix_s*, %struct.p7trace_s*, %struct.p7trace_s*)* @DisplayPlan7Posteriors, variables: !100)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !5, !11, !77, !77, !93, !93}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !13, line: 101, size: 3712, align: 64, elements: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !{!15, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !33, !34, !35, !36, !37, !38, !39, !42, !43, !44, !45, !50, !51, !52, !56, !57, !59, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 113, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !12, file: !13, line: 114, baseType: !16, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !12, file: !13, line: 115, baseType: !16, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !12, file: !13, line: 116, baseType: !16, size: 64, align: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !12, file: !13, line: 117, baseType: !16, size: 64, align: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !12, file: !13, line: 118, baseType: !16, size: 64, align: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !12, file: !13, line: 119, baseType: !16, size: 64, align: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !12, file: !13, line: 120, baseType: !5, size: 32, align: 32, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !12, file: !13, line: 121, baseType: !16, size: 64, align: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !12, file: !13, line: 122, baseType: !4, size: 64, align: 64, offset: 576)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !12, file: !13, line: 123, baseType: !5, size: 32, align: 32, offset: 640)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !12, file: !13, line: 134, baseType: !4, size: 64, align: 64, offset: 704)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !12, file: !13, line: 135, baseType: !4, size: 64, align: 64, offset: 768)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !12, file: !13, line: 136, baseType: !4, size: 64, align: 64, offset: 832)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !12, file: !13, line: 144, baseType: !32, size: 32, align: 32, offset: 896)
!32 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !12, file: !13, line: 144, baseType: !32, size: 32, align: 32, offset: 928)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !12, file: !13, line: 145, baseType: !32, size: 32, align: 32, offset: 960)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !12, file: !13, line: 145, baseType: !32, size: 32, align: 32, offset: 992)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !12, file: !13, line: 146, baseType: !32, size: 32, align: 32, offset: 1024)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !12, file: !13, line: 146, baseType: !32, size: 32, align: 32, offset: 1056)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !12, file: !13, line: 155, baseType: !5, size: 32, align: 32, offset: 1088)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !12, file: !13, line: 156, baseType: !40, size: 64, align: 64, offset: 1152)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !12, file: !13, line: 157, baseType: !40, size: 64, align: 64, offset: 1216)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !12, file: !13, line: 158, baseType: !40, size: 64, align: 64, offset: 1280)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !12, file: !13, line: 159, baseType: !32, size: 32, align: 32, offset: 1344)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !12, file: !13, line: 168, baseType: !46, size: 256, align: 32, offset: 1376)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, align: 32, elements: !47)
!47 = !{!48, !49}
!48 = !DISubrange(count: 4)
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !12, file: !13, line: 169, baseType: !41, size: 64, align: 64, offset: 1664)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !12, file: !13, line: 170, baseType: !41, size: 64, align: 64, offset: 1728)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !12, file: !13, line: 174, baseType: !53, size: 640, align: 32, offset: 1792)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 640, align: 32, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 20)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !12, file: !13, line: 175, baseType: !32, size: 32, align: 32, offset: 2432)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !12, file: !13, line: 197, baseType: !58, size: 64, align: 64, offset: 2496)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !12, file: !13, line: 198, baseType: !58, size: 64, align: 64, offset: 2560)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !12, file: !13, line: 199, baseType: !58, size: 64, align: 64, offset: 2624)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !12, file: !13, line: 200, baseType: !62, size: 256, align: 32, offset: 2688)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, align: 32, elements: !47)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !12, file: !13, line: 201, baseType: !4, size: 64, align: 64, offset: 2944)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !12, file: !13, line: 202, baseType: !4, size: 64, align: 64, offset: 3008)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !12, file: !13, line: 203, baseType: !4, size: 64, align: 64, offset: 3072)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !12, file: !13, line: 203, baseType: !4, size: 64, align: 64, offset: 3136)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !12, file: !13, line: 203, baseType: !4, size: 64, align: 64, offset: 3200)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !12, file: !13, line: 203, baseType: !4, size: 64, align: 64, offset: 3264)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !12, file: !13, line: 203, baseType: !4, size: 64, align: 64, offset: 3328)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !12, file: !13, line: 214, baseType: !58, size: 64, align: 64, offset: 3392)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !12, file: !13, line: 215, baseType: !58, size: 64, align: 64, offset: 3456)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !12, file: !13, line: 216, baseType: !5, size: 32, align: 32, offset: 3520)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !12, file: !13, line: 217, baseType: !5, size: 32, align: 32, offset: 3552)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !12, file: !13, line: 222, baseType: !32, size: 32, align: 32, offset: 3584)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !12, file: !13, line: 223, baseType: !32, size: 32, align: 32, offset: 3616)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !13, line: 225, baseType: !5, size: 32, align: 32, offset: 3648)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpmatrix_s", file: !13, line: 289, size: 640, align: 64, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !86, !87, !88, !89, !90, !91, !92}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !78, file: !13, line: 290, baseType: !58, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mmx", scope: !78, file: !13, line: 291, baseType: !58, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "imx", scope: !78, file: !13, line: 292, baseType: !58, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "dmx", scope: !78, file: !13, line: 293, baseType: !58, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "xmx_mem", scope: !78, file: !13, line: 299, baseType: !85, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mmx_mem", scope: !78, file: !13, line: 299, baseType: !85, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "imx_mem", scope: !78, file: !13, line: 299, baseType: !85, size: 64, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dmx_mem", scope: !78, file: !13, line: 299, baseType: !85, size: 64, align: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "maxN", scope: !78, file: !13, line: 308, baseType: !5, size: 32, align: 32, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "maxM", scope: !78, file: !13, line: 309, baseType: !5, size: 32, align: 32, offset: 544)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "padN", scope: !78, file: !13, line: 311, baseType: !5, size: 32, align: 32, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "padM", scope: !78, file: !13, line: 312, baseType: !5, size: 32, align: 32, offset: 608)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !13, line: 374, size: 256, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !94, file: !13, line: 375, baseType: !5, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !94, file: !13, line: 376, baseType: !16, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !94, file: !13, line: 377, baseType: !4, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !94, file: !13, line: 378, baseType: !4, size: 64, align: 64, offset: 192)
!100 = !{!101, !102, !103, !104, !105, !106, !107}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 1, scope: !8, file: !1, line: 62, type: !5)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !8, file: !1, line: 62, type: !11)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "forward", arg: 3, scope: !8, file: !1, line: 63, type: !77)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "backward", arg: 4, scope: !8, file: !1, line: 64, type: !77)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viterbi", arg: 5, scope: !8, file: !1, line: 65, type: !93)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "optacc", arg: 6, scope: !8, file: !1, line: 66, type: !93)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alignment", scope: !8, file: !1, line: 68, type: !108)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, align: 64, elements: !109)
!109 = !{!49}
!110 = !DISubprogram(name: "DisplayPlan7PostAlign", scope: !1, file: !1, line: 90, type: !111, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.plan7_s*, %struct.dpmatrix_s*, %struct.dpmatrix_s*, %struct.p7trace_s**, i32)* @DisplayPlan7PostAlign, variables: !114)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !5, !11, !77, !77, !113, !5}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 1, scope: !110, file: !1, line: 90, type: !5)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !110, file: !1, line: 90, type: !11)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "forward", arg: 3, scope: !110, file: !1, line: 91, type: !77)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "backward", arg: 4, scope: !110, file: !1, line: 92, type: !77)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alignment", arg: 5, scope: !110, file: !1, line: 93, type: !113)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "A", arg: 6, scope: !110, file: !1, line: 94, type: !5)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !110, file: !1, line: 96, type: !5)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !110, file: !1, line: 97, type: !5)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !110, file: !1, line: 98, type: !5)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !110, file: !1, line: 99, type: !5)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kmin", scope: !110, file: !1, line: 100, type: !5)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kmax", scope: !110, file: !1, line: 101, type: !5)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !110, file: !1, line: 102, type: !4)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !110, file: !1, line: 103, type: !4)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "on", scope: !110, file: !1, line: 104, type: !4)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !110, file: !1, line: 105, type: !17)
!131 = !DISubprogram(name: "DisplayPlan7Matrix", scope: !1, file: !1, line: 298, type: !132, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, %struct.plan7_s*, %struct.dpmatrix_s*)* @DisplayPlan7Matrix, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !16, !5, !11, !77}
!134 = !{!135, !136, !137, !138, !139, !140}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !131, file: !1, line: 298, type: !16)
