; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/emit.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }

@.str = private unnamed_addr constant [62 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/emit.c\00", align 1
@Alphabet_iupac = external global i32
@.str1 = private unnamed_addr constant [14 x i8] c"never happens\00", align 1
@.str2 = private unnamed_addr constant [14 x i8] c"can't happen.\00", align 1
@Alphabet_size = external global i32
@Alphabet_type = external global i32
@Alphabet = external global [25 x i8]

; Function Attrs: nounwind optsize ssp uwtable
define void @EmitSequence(%struct.plan7_s* %hmm, i8** %ret_dsq, i32* %ret_L, %struct.p7trace_s** %ret_tr) #0 {
  %tr = alloca %struct.p7trace_s*, align 8
  %t = alloca [4 x float], align 16
  tail call void @llvm.dbg.value(metadata %struct.plan7_s* %hmm, i64 0, metadata !87, metadata !148), !dbg !149
  tail call void @llvm.dbg.value(metadata i8** %ret_dsq, i64 0, metadata !88, metadata !148), !dbg !150

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/emit.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{!8, !103, !126, !138}
!8 = !DISubprogram(name: "EmitSequence", scope: !1, file: !1, line: 42, type: !9, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i8**, i32*, %struct.p7trace_s**)* @EmitSequence, variables: !86)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !77, !26, !78}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !13, line: 101, size: 3712, align: 64, elements: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !{!15, !17, !18, !19, !20, !21, !22, !23, !24, !25, !27, !28, !29, !30, !31, !33, !34, !35, !36, !37, !38, !39, !42, !43, !44, !45, !50, !51, !52, !56, !57, !59, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 113, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !12, file: !13, line: 114, baseType: !16, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !12, file: !13, line: 115, baseType: !16, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !12, file: !13, line: 116, baseType: !16, size: 64, align: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !12, file: !13, line: 117, baseType: !16, size: 64, align: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !12, file: !13, line: 118, baseType: !16, size: 64, align: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !12, file: !13, line: 119, baseType: !16, size: 64, align: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !12, file: !13, line: 120, baseType: !6, size: 32, align: 32, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !12, file: !13, line: 121, baseType: !16, size: 64, align: 64, offset: 512)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !12, file: !13, line: 122, baseType: !26, size: 64, align: 64, offset: 576)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !12, file: !13, line: 123, baseType: !6, size: 32, align: 32, offset: 640)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !12, file: !13, line: 134, baseType: !26, size: 64, align: 64, offset: 704)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !12, file: !13, line: 135, baseType: !26, size: 64, align: 64, offset: 768)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !12, file: !13, line: 136, baseType: !26, size: 64, align: 64, offset: 832)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !12, file: !13, line: 144, baseType: !32, size: 32, align: 32, offset: 896)
!32 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !12, file: !13, line: 144, baseType: !32, size: 32, align: 32, offset: 928)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !12, file: !13, line: 145, baseType: !32, size: 32, align: 32, offset: 960)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !12, file: !13, line: 145, baseType: !32, size: 32, align: 32, offset: 992)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !12, file: !13, line: 146, baseType: !32, size: 32, align: 32, offset: 1024)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !12, file: !13, line: 146, baseType: !32, size: 32, align: 32, offset: 1056)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !12, file: !13, line: 155, baseType: !6, size: 32, align: 32, offset: 1088)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !12, file: !13, line: 156, baseType: !40, size: 64, align: 64, offset: 1152)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !12, file: !13, line: 157, baseType: !40, size: 64, align: 64, offset: 1216)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !12, file: !13, line: 158, baseType: !40, size: 64, align: 64, offset: 1280)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !12, file: !13, line: 159, baseType: !32, size: 32, align: 32, offset: 1344)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !12, file: !13, line: 168, baseType: !46, size: 256, align: 32, offset: 1376)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, align: 32, elements: !47)
!47 = !{!48, !49}
!48 = !DISubrange(count: 4)
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !12, file: !13, line: 169, baseType: !41, size: 64, align: 64, offset: 1664)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !12, file: !13, line: 170, baseType: !41, size: 64, align: 64, offset: 1728)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !12, file: !13, line: 174, baseType: !53, size: 640, align: 32, offset: 1792)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 640, align: 32, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 20)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !12, file: !13, line: 175, baseType: !32, size: 32, align: 32, offset: 2432)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !12, file: !13, line: 197, baseType: !58, size: 64, align: 64, offset: 2496)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !12, file: !13, line: 198, baseType: !58, size: 64, align: 64, offset: 2560)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !12, file: !13, line: 199, baseType: !58, size: 64, align: 64, offset: 2624)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !12, file: !13, line: 200, baseType: !62, size: 256, align: 32, offset: 2688)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, align: 32, elements: !47)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !12, file: !13, line: 201, baseType: !26, size: 64, align: 64, offset: 2944)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !12, file: !13, line: 202, baseType: !26, size: 64, align: 64, offset: 3008)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !12, file: !13, line: 203, baseType: !26, size: 64, align: 64, offset: 3072)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !12, file: !13, line: 203, baseType: !26, size: 64, align: 64, offset: 3136)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !12, file: !13, line: 203, baseType: !26, size: 64, align: 64, offset: 3200)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !12, file: !13, line: 203, baseType: !26, size: 64, align: 64, offset: 3264)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !12, file: !13, line: 203, baseType: !26, size: 64, align: 64, offset: 3328)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !12, file: !13, line: 214, baseType: !58, size: 64, align: 64, offset: 3392)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !12, file: !13, line: 215, baseType: !58, size: 64, align: 64, offset: 3456)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !12, file: !13, line: 216, baseType: !6, size: 32, align: 32, offset: 3520)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !12, file: !13, line: 217, baseType: !6, size: 32, align: 32, offset: 3552)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !12, file: !13, line: 222, baseType: !32, size: 32, align: 32, offset: 3584)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !12, file: !13, line: 223, baseType: !32, size: 32, align: 32, offset: 3616)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !13, line: 225, baseType: !6, size: 32, align: 32, offset: 3648)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !13, line: 374, size: 256, align: 64, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !80, file: !13, line: 375, baseType: !6, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !80, file: !13, line: 376, baseType: !16, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !80, file: !13, line: 377, baseType: !26, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !80, file: !13, line: 378, baseType: !26, size: 64, align: 64, offset: 192)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !8, file: !1, line: 42, type: !11)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_dsq", arg: 2, scope: !8, file: !1, line: 42, type: !77)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_L", arg: 3, scope: !8, file: !1, line: 42, type: !26)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 4, scope: !8, file: !1, line: 42, type: !78)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !8, file: !1, line: 44, type: !79)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !8, file: !1, line: 45, type: !4)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !8, file: !1, line: 46, type: !6)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsq", scope: !8, file: !1, line: 47, type: !16)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !8, file: !1, line: 48, type: !6)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc_tlen", scope: !8, file: !1, line: 49, type: !6)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc_L", scope: !8, file: !1, line: 50, type: !6)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !8, file: !1, line: 51, type: !6)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !8, file: !1, line: 52, type: !6)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !8, file: !1, line: 53, type: !101)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, align: 32, elements: !102)
!102 = !{!48}
!103 = !DISubprogram(name: "EmitConsensusSequence", scope: !1, file: !1, line: 296, type: !104, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i8**, i8**, i32*, %struct.p7trace_s**)* @EmitConsensusSequence, variables: !106)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !11, !77, !77, !26, !78}
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !103, file: !1, line: 296, type: !11)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_seq", arg: 2, scope: !103, file: !1, line: 296, type: !77)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_dsq", arg: 3, scope: !103, file: !1, line: 296, type: !77)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_L", arg: 4, scope: !103, file: !1, line: 296, type: !26)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 5, scope: !103, file: !1, line: 296, type: !78)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !103, file: !1, line: 298, type: !79)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsq", scope: !103, file: !1, line: 299, type: !16)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !103, file: !1, line: 299, type: !16)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !103, file: !1, line: 300, type: !41)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !103, file: !1, line: 300, type: !41)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dp", scope: !103, file: !1, line: 300, type: !41)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmat", scope: !103, file: !1, line: 301, type: !6)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndel", scope: !103, file: !1, line: 301, type: !6)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nins", scope: !103, file: !1, line: 301, type: !6)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !103, file: !1, line: 302, type: !6)
