; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/emulation.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }

@.str = private unnamed_addr constant [81 x i8] c"Profile %s will have more than 1000 positions. GCG won't read it; Compugen will.\00", align 1
@Alphabet_type = external global i32
@.str1 = private unnamed_addr constant [18 x i8] c"!!AA_PROFILE 1.0\0A\00", align 1
@.str2 = private unnamed_addr constant [18 x i8] c"!!NA_PROFILE 1.0\0A\00", align 1
@.str3 = private unnamed_addr constant [54 x i8] c"No support for profiles with non-biological alphabets\00", align 1
@.str4 = private unnamed_addr constant [11 x i8] c"(Peptide) \00", align 1
@.str5 = private unnamed_addr constant [14 x i8] c"(Nucleotide) \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/emulation.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !{!6}
!6 = !DISubprogram(name: "WriteProfile", scope: !1, file: !1, line: 91, type: !7, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.plan7_s*, i32)* @WriteProfile, variables: !137)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !72, !4}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !11, line: 153, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !11, line: 122, size: 1216, align: 64, elements: !13)
!13 = !{!14, !17, !18, !19, !21, !22, !27, !28, !30, !34, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !12, file: !11, line: 123, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !12, file: !11, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !12, file: !11, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !12, file: !11, line: 126, baseType: !20, size: 16, align: 16, offset: 128)
!20 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !12, file: !11, line: 127, baseType: !20, size: 16, align: 16, offset: 144)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !12, file: !11, line: 128, baseType: !23, size: 128, align: 64, offset: 192)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !11, line: 88, size: 128, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !23, file: !11, line: 89, baseType: !15, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !23, file: !11, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !12, file: !11, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !12, file: !11, line: 132, baseType: !29, size: 64, align: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !12, file: !11, line: 133, baseType: !31, size: 64, align: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!4, !29}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !12, file: !11, line: 134, baseType: !35, size: 64, align: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!4, !29, !38, !4}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !12, file: !11, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !29, !44, !4}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !11, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !12, file: !11, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!4, !29, !54, !4}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !12, file: !11, line: 139, baseType: !23, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !12, file: !11, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !11, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !12, file: !11, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !12, file: !11, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !12, file: !11, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !12, file: !11, line: 148, baseType: !23, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !12, file: !11, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !12, file: !11, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !74, line: 101, size: 3712, align: 64, elements: !75)
!74 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !87, !88, !89, !90, !91, !93, !94, !95, !96, !97, !98, !99, !102, !103, !104, !105, !110, !111, !112, !116, !117, !119, !120, !121, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !74, line: 113, baseType: !38, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !73, file: !74, line: 114, baseType: !38, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !73, file: !74, line: 115, baseType: !38, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !73, file: !74, line: 116, baseType: !38, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !73, file: !74, line: 117, baseType: !38, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !73, file: !74, line: 118, baseType: !38, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !73, file: !74, line: 119, baseType: !38, size: 64, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !73, file: !74, line: 120, baseType: !4, size: 32, align: 32, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !73, file: !74, line: 121, baseType: !38, size: 64, align: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !73, file: !74, line: 122, baseType: !86, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !73, file: !74, line: 123, baseType: !4, size: 32, align: 32, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !73, file: !74, line: 134, baseType: !86, size: 64, align: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !73, file: !74, line: 135, baseType: !86, size: 64, align: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !73, file: !74, line: 136, baseType: !86, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !73, file: !74, line: 144, baseType: !92, size: 32, align: 32, offset: 896)
!92 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !73, file: !74, line: 144, baseType: !92, size: 32, align: 32, offset: 928)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !73, file: !74, line: 145, baseType: !92, size: 32, align: 32, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !73, file: !74, line: 145, baseType: !92, size: 32, align: 32, offset: 992)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !73, file: !74, line: 146, baseType: !92, size: 32, align: 32, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !73, file: !74, line: 146, baseType: !92, size: 32, align: 32, offset: 1056)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !73, file: !74, line: 155, baseType: !4, size: 32, align: 32, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !73, file: !74, line: 156, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !73, file: !74, line: 157, baseType: !100, size: 64, align: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !73, file: !74, line: 158, baseType: !100, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !73, file: !74, line: 159, baseType: !92, size: 32, align: 32, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !73, file: !74, line: 168, baseType: !106, size: 256, align: 32, offset: 1376)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 256, align: 32, elements: !107)
!107 = !{!108, !109}
!108 = !DISubrange(count: 4)
!109 = !DISubrange(count: 2)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !73, file: !74, line: 169, baseType: !101, size: 64, align: 64, offset: 1664)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !73, file: !74, line: 170, baseType: !101, size: 64, align: 64, offset: 1728)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !73, file: !74, line: 174, baseType: !113, size: 640, align: 32, offset: 1792)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 640, align: 32, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !73, file: !74, line: 175, baseType: !92, size: 32, align: 32, offset: 2432)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !73, file: !74, line: 197, baseType: !118, size: 64, align: 64, offset: 2496)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !73, file: !74, line: 198, baseType: !118, size: 64, align: 64, offset: 2560)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !73, file: !74, line: 199, baseType: !118, size: 64, align: 64, offset: 2624)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !73, file: !74, line: 200, baseType: !122, size: 256, align: 32, offset: 2688)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !107)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !73, file: !74, line: 201, baseType: !86, size: 64, align: 64, offset: 2944)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !73, file: !74, line: 202, baseType: !86, size: 64, align: 64, offset: 3008)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !73, file: !74, line: 203, baseType: !86, size: 64, align: 64, offset: 3072)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !73, file: !74, line: 203, baseType: !86, size: 64, align: 64, offset: 3136)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !73, file: !74, line: 203, baseType: !86, size: 64, align: 64, offset: 3200)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !73, file: !74, line: 203, baseType: !86, size: 64, align: 64, offset: 3264)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !73, file: !74, line: 203, baseType: !86, size: 64, align: 64, offset: 3328)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !73, file: !74, line: 214, baseType: !118, size: 64, align: 64, offset: 3392)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !73, file: !74, line: 215, baseType: !118, size: 64, align: 64, offset: 3456)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !73, file: !74, line: 216, baseType: !4, size: 32, align: 32, offset: 3520)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !73, file: !74, line: 217, baseType: !4, size: 32, align: 32, offset: 3552)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !73, file: !74, line: 222, baseType: !92, size: 32, align: 32, offset: 3584)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !73, file: !74, line: 223, baseType: !92, size: 32, align: 32, offset: 3616)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !74, line: 225, baseType: !4, size: 32, align: 32, offset: 3648)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !6, file: !1, line: 91, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !6, file: !1, line: 91, type: !72)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_xsw", arg: 3, scope: !6, file: !1, line: 91, type: !4)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !6, file: !1, line: 93, type: !4)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !6, file: !1, line: 94, type: !4)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !6, file: !1, line: 95, type: !4)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !6, file: !1, line: 96, type: !92)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gap", scope: !6, file: !1, line: 97, type: !4)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !6, file: !1, line: 97, type: !4)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qgap", scope: !6, file: !1, line: 97, type: !4)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qlen", scope: !6, file: !1, line: 97, type: !4)
!149 = !{i32 2, !"Dwarf Version", i32 2}
!150 = !{i32 2, !"Debug Info Version", i32 700000003}
!151 = !{i32 1, !"PIC Level", i32 2}
!152 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!153 = !DIExpression()
!154 = !DILocation(line: 91, column: 20, scope: !6)
!155 = !DILocation(line: 91, column: 40, scope: !6)
!156 = !DILocation(line: 91, column: 49, scope: !6)
!157 = !DILocation(line: 99, column: 3, scope: !6)
!158 = !DILocation(line: 105, column: 12, scope: !159)
!159 = distinct !DILexicalBlock(scope: !6, file: !1, line: 105, column: 7)
!160 = !{!161, !165, i64 136}
!161 = !{!"plan7_s", !162, i64 0, !162, i64 8, !162, i64 16, !162, i64 24, !162, i64 32, !162, i64 40, !162, i64 48, !165, i64 56, !162, i64 64, !162, i64 72, !165, i64 80, !162, i64 88, !162, i64 96, !162, i64 104, !166, i64 112, !166, i64 116, !166, i64 120, !166, i64 124, !166, i64 128, !166, i64 132, !165, i64 136, !162, i64 144, !162, i64 152, !162, i64 160, !166, i64 168, !163, i64 172, !162, i64 208, !162, i64 216, !163, i64 224, !166, i64 304, !162, i64 312, !162, i64 320, !162, i64 328, !163, i64 336, !162, i64 368, !162, i64 376, !162, i64 384, !162, i64 392, !162, i64 400, !162, i64 408, !162, i64 416, !162, i64 424, !162, i64 432, !165, i64 440, !165, i64 444, !166, i64 448, !166, i64 452, !165, i64 456}
!162 = !{!"any pointer", !163, i64 0}
!163 = !{!"omnipotent char", !164, i64 0}
!164 = !{!"Simple C/C++ TBAA"}
!165 = !{!"int", !163, i64 0}
!166 = !{!"float", !163, i64 0}
!167 = !DILocation(line: 105, column: 14, scope: !159)
!168 = !DILocation(line: 105, column: 25, scope: !159)
!169 = !DILocation(line: 105, column: 21, scope: !159)
!170 = !DILocation(line: 107, column: 8, scope: !159)
!171 = !{!161, !162, i64 0}
!172 = !DILocation(line: 106, column: 5, scope: !159)
!173 = !DILocation(line: 115, column: 7, scope: !174)
!174 = distinct !DILexicalBlock(scope: !6, file: !1, line: 115, column: 7)
!175 = !{!165, !165, i64 0}
!176 = !DILocation(line: 115, column: 7, scope: !6)
!177 = !DILocation(line: 115, column: 41, scope: !174)
!178 = !DILocation(line: 116, column: 41, scope: !179)
!179 = distinct !DILexicalBlock(scope: !174, file: !1, line: 116, column: 12)
!180 = !DILocation(line: 117, column: 8, scope: !179)
!181 = !DILocation(line: 119, column: 7, scope: !182)
!182 = distinct !DILexicalBlock(scope: !6, file: !1, line: 119, column: 7)
!183 = !DILocation(line: 119, column: 7, scope: !6)
!184 = !DILocation(line: 119, column: 41, scope: !182)
!185 = !DILocation(line: 120, column: 41, scope: !186)
!186 = distinct !DILexicalBlock(scope: !182, file: !1, line: 120, column: 12)
