; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/fast_algorithms.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.dpmatrix_s = type { i32**, i32**, i32**, i32**, i8*, i8*, i8*, i8*, i32, i32, i32, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }

; Function Attrs: nounwind optsize ssp uwtable
define float @P7Viterbi(i8* %dsq, i32 %L, %struct.plan7_s* %hmm, %struct.dpmatrix_s* %mx, %struct.p7trace_s** %ret_tr) #0 {
  %tr = alloca %struct.p7trace_s*, align 8
  %xmx = alloca i32**, align 8
  %mmx = alloca i32**, align 8
  %imx = alloca i32**, align 8
  %dmx = alloca i32**, align 8
  tail call void @llvm.dbg.value(metadata i8* %dsq, i64 0, metadata !101, metadata !139), !dbg !140
  tail call void @llvm.dbg.value(metadata i32 %L, i64 0, metadata !102, metadata !139), !dbg !141
  tail call void @llvm.dbg.value(metadata %struct.plan7_s* %hmm, i64 0, metadata !103, metadata !139), !dbg !142
  tail call void @llvm.dbg.value(metadata %struct.dpmatrix_s* %mx, i64 0, metadata !104, metadata !139), !dbg !143

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/fast_algorithms.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !{!7}
!7 = !DISubprogram(name: "P7Viterbi", scope: !1, file: !1, line: 69, type: !8, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.dpmatrix_s*, %struct.p7trace_s**)* @P7Viterbi, variables: !100)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !4, !13, !77, !92}
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !15, line: 101, size: 3712, align: 64, elements: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !42, !43, !44, !45, !50, !51, !52, !56, !57, !59, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !15, line: 113, baseType: !11, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !14, file: !15, line: 114, baseType: !11, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !14, file: !15, line: 115, baseType: !11, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !14, file: !15, line: 116, baseType: !11, size: 64, align: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !14, file: !15, line: 117, baseType: !11, size: 64, align: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !14, file: !15, line: 118, baseType: !11, size: 64, align: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !14, file: !15, line: 119, baseType: !11, size: 64, align: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !14, file: !15, line: 120, baseType: !4, size: 32, align: 32, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !14, file: !15, line: 121, baseType: !11, size: 64, align: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !15, line: 122, baseType: !27, size: 64, align: 64, offset: 576)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !14, file: !15, line: 123, baseType: !4, size: 32, align: 32, offset: 640)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !14, file: !15, line: 134, baseType: !27, size: 64, align: 64, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !14, file: !15, line: 135, baseType: !27, size: 64, align: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !14, file: !15, line: 136, baseType: !27, size: 64, align: 64, offset: 832)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !14, file: !15, line: 144, baseType: !10, size: 32, align: 32, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !14, file: !15, line: 144, baseType: !10, size: 32, align: 32, offset: 928)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !14, file: !15, line: 145, baseType: !10, size: 32, align: 32, offset: 960)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !14, file: !15, line: 145, baseType: !10, size: 32, align: 32, offset: 992)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !14, file: !15, line: 146, baseType: !10, size: 32, align: 32, offset: 1024)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !14, file: !15, line: 146, baseType: !10, size: 32, align: 32, offset: 1056)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !14, file: !15, line: 155, baseType: !4, size: 32, align: 32, offset: 1088)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !14, file: !15, line: 156, baseType: !40, size: 64, align: 64, offset: 1152)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !14, file: !15, line: 157, baseType: !40, size: 64, align: 64, offset: 1216)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !14, file: !15, line: 158, baseType: !40, size: 64, align: 64, offset: 1280)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !14, file: !15, line: 159, baseType: !10, size: 32, align: 32, offset: 1344)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !14, file: !15, line: 168, baseType: !46, size: 256, align: 32, offset: 1376)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, align: 32, elements: !47)
!47 = !{!48, !49}
!48 = !DISubrange(count: 4)
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !14, file: !15, line: 169, baseType: !41, size: 64, align: 64, offset: 1664)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !14, file: !15, line: 170, baseType: !41, size: 64, align: 64, offset: 1728)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !14, file: !15, line: 174, baseType: !53, size: 640, align: 32, offset: 1792)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 640, align: 32, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 20)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !14, file: !15, line: 175, baseType: !10, size: 32, align: 32, offset: 2432)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !14, file: !15, line: 197, baseType: !58, size: 64, align: 64, offset: 2496)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !14, file: !15, line: 198, baseType: !58, size: 64, align: 64, offset: 2560)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !14, file: !15, line: 199, baseType: !58, size: 64, align: 64, offset: 2624)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !14, file: !15, line: 200, baseType: !62, size: 256, align: 32, offset: 2688)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !47)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !14, file: !15, line: 201, baseType: !27, size: 64, align: 64, offset: 2944)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !14, file: !15, line: 202, baseType: !27, size: 64, align: 64, offset: 3008)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3072)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3136)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3200)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3264)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3328)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !14, file: !15, line: 214, baseType: !58, size: 64, align: 64, offset: 3392)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !14, file: !15, line: 215, baseType: !58, size: 64, align: 64, offset: 3456)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !14, file: !15, line: 216, baseType: !4, size: 32, align: 32, offset: 3520)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !14, file: !15, line: 217, baseType: !4, size: 32, align: 32, offset: 3552)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !14, file: !15, line: 222, baseType: !10, size: 32, align: 32, offset: 3584)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !14, file: !15, line: 223, baseType: !10, size: 32, align: 32, offset: 3616)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !14, file: !15, line: 225, baseType: !4, size: 32, align: 32, offset: 3648)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpmatrix_s", file: !15, line: 289, size: 640, align: 64, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !78, file: !15, line: 290, baseType: !58, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mmx", scope: !78, file: !15, line: 291, baseType: !58, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "imx", scope: !78, file: !15, line: 292, baseType: !58, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "dmx", scope: !78, file: !15, line: 293, baseType: !58, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "xmx_mem", scope: !78, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mmx_mem", scope: !78, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "imx_mem", scope: !78, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dmx_mem", scope: !78, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "maxN", scope: !78, file: !15, line: 308, baseType: !4, size: 32, align: 32, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "maxM", scope: !78, file: !15, line: 309, baseType: !4, size: 32, align: 32, offset: 544)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "padN", scope: !78, file: !15, line: 311, baseType: !4, size: 32, align: 32, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "padM", scope: !78, file: !15, line: 312, baseType: !4, size: 32, align: 32, offset: 608)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !15, line: 374, size: 256, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !94, file: !15, line: 375, baseType: !4, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !94, file: !15, line: 376, baseType: !11, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !94, file: !15, line: 377, baseType: !27, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !94, file: !15, line: 378, baseType: !27, size: 64, align: 64, offset: 192)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !7, file: !1, line: 69, type: !11)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !7, file: !1, line: 69, type: !4)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !7, file: !1, line: 69, type: !13)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mx", arg: 4, scope: !7, file: !1, line: 69, type: !77)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 5, scope: !7, file: !1, line: 69, type: !92)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !7, file: !1, line: 71, type: !93)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmx", scope: !7, file: !1, line: 72, type: !58)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmx", scope: !7, file: !1, line: 73, type: !58)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !7, file: !1, line: 74, type: !58)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !7, file: !1, line: 75, type: !58)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !7, file: !1, line: 76, type: !4)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !7, file: !1, line: 76, type: !4)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !7, file: !1, line: 77, type: !4)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mc", scope: !7, file: !1, line: 78, type: !27)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dc", scope: !7, file: !1, line: 78, type: !27)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ic", scope: !7, file: !1, line: 78, type: !27)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ms", scope: !7, file: !1, line: 79, type: !27)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is", scope: !7, file: !1, line: 79, type: !27)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mpp", scope: !7, file: !1, line: 80, type: !27)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mpc", scope: !7, file: !1, line: 80, type: !27)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !7, file: !1, line: 80, type: !27)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bp", scope: !7, file: !1, line: 81, type: !27)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep", scope: !7, file: !1, line: 82, type: !27)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmb", scope: !7, file: !1, line: 83, type: !4)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xme", scope: !7, file: !1, line: 84, type: !4)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dpp", scope: !7, file: !1, line: 85, type: !27)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpmm", scope: !7, file: !1, line: 86, type: !27)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpmi", scope: !7, file: !1, line: 86, type: !27)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpmd", scope: !7, file: !1, line: 86, type: !27)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpim", scope: !7, file: !1, line: 86, type: !27)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpii", scope: !7, file: !1, line: 86, type: !27)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpdm", scope: !7, file: !1, line: 86, type: !27)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpdd", scope: !7, file: !1, line: 86, type: !27)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M", scope: !7, file: !1, line: 87, type: !4)
!135 = !{i32 2, !"Dwarf Version", i32 2}
