; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/file.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [62 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/file.c\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"%s%c%s\00", align 1
@.str2 = private unnamed_addr constant [6 x i8] c"%s.%s\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c":\00", align 1
@.str4 = private unnamed_addr constant [2 x i8] c"r\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define i8* @FileDirname(i8* %file) #0 {
  tail call void @llvm.dbg.value(metadata i8* %file, i64 0, metadata !13, metadata !131), !dbg !132
  %1 = tail call i8* @strrchr(i8* %file, i32 47) #6, !dbg !133
  tail call void @llvm.dbg.value(metadata i8* %1, i64 0, metadata !15, metadata !131), !dbg !134
  %2 = icmp eq i8* %1, null, !dbg !135
  br i1 %2, label %8, label %3, !dbg !136

; <label>:3                                       ; preds = %0
  %4 = ptrtoint i8* %1 to i64, !dbg !137
  %5 = ptrtoint i8* %file to i64, !dbg !137
  %6 = sub i64 %4, %5, !dbg !137

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/file.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !{!9, !17, !26, !36, !41, !46, !121}
!9 = !DISubprogram(name: "FileDirname", scope: !1, file: !1, line: 65, type: !10, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @FileDirname, variables: !12)
!10 = !DISubroutineType(types: !11)
!11 = !{!6, !6}
!12 = !{!13, !14, !15, !16}
!13 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !9, file: !1, line: 65, type: !6)
!14 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirname", scope: !9, file: !1, line: 67, type: !6)
!15 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastslash", scope: !9, file: !1, line: 68, type: !6)
!16 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !9, file: !1, line: 69, type: !5)
!17 = !DISubprogram(name: "FileTail", scope: !1, file: !1, line: 98, type: !18, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32)* @FileTail, variables: !20)
!18 = !DISubroutineType(types: !19)
!19 = !{!6, !6, !5}
!20 = !{!21, !22, !23, !24, !25}
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !17, file: !1, line: 98, type: !6)
!22 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noextension", arg: 2, scope: !17, file: !1, line: 98, type: !5)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !17, file: !1, line: 100, type: !6)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastslash", scope: !17, file: !1, line: 101, type: !6)
!25 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastdot", scope: !17, file: !1, line: 102, type: !6)
!26 = !DISubprogram(name: "FileSameDirectory", scope: !1, file: !1, line: 139, type: !27, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*)* @FileSameDirectory, variables: !29)
!27 = !DISubroutineType(types: !28)
!28 = !{!6, !6, !6}
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file1", arg: 1, scope: !26, file: !1, line: 139, type: !6)
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file2", arg: 2, scope: !26, file: !1, line: 139, type: !6)
!32 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !26, file: !1, line: 141, type: !6)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !26, file: !1, line: 142, type: !6)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !26, file: !1, line: 143, type: !6)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seems_ok", scope: !26, file: !1, line: 144, type: !5)
!36 = !DISubprogram(name: "FileConcat", scope: !1, file: !1, line: 166, type: !27, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*)* @FileConcat, variables: !37)
!37 = !{!38, !39, !40}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !36, file: !1, line: 166, type: !6)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 2, scope: !36, file: !1, line: 166, type: !6)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "full", scope: !36, file: !1, line: 168, type: !6)
!41 = !DISubprogram(name: "FileAddSuffix", scope: !1, file: !1, line: 187, type: !27, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*)* @FileAddSuffix, variables: !42)
!42 = !{!43, !44, !45}
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !41, file: !1, line: 187, type: !6)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sfx", arg: 2, scope: !41, file: !1, line: 187, type: !6)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !41, file: !1, line: 189, type: !6)
!46 = !DISubprogram(name: "EnvFileOpen", scope: !1, file: !1, line: 230, type: !47, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: %struct.__sFILE* (i8*, i8*, i8**)* @EnvFileOpen, variables: !110)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !6, !6, !109}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !51, line: 153, baseType: !52)
!51 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !51, line: 122, size: 1216, align: 64, elements: !53)
!53 = !{!54, !57, !58, !59, !61, !62, !67, !68, !69, !73, !77, !87, !93, !94, !97, !98, !102, !106, !107, !108}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !52, file: !51, line: 123, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !52, file: !51, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !52, file: !51, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !51, line: 126, baseType: !60, size: 16, align: 16, offset: 128)
!60 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !52, file: !51, line: 127, baseType: !60, size: 16, align: 16, offset: 144)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !52, file: !51, line: 128, baseType: !63, size: 128, align: 64, offset: 192)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !51, line: 88, size: 128, align: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !63, file: !51, line: 89, baseType: !55, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !63, file: !51, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !52, file: !51, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !52, file: !51, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !52, file: !51, line: 133, baseType: !70, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!5, !4}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !52, file: !51, line: 134, baseType: !74, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!5, !4, !6, !5}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !52, file: !51, line: 135, baseType: !78, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !4, !81, !5}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !51, line: 77, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !83, line: 71, baseType: !84)
!83 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !52, file: !51, line: 136, baseType: !88, size: 64, align: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!5, !4, !91, !5}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !52, file: !51, line: 139, baseType: !63, size: 128, align: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !52, file: !51, line: 140, baseType: !95, size: 64, align: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !51, line: 94, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !52, file: !51, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !52, file: !51, line: 144, baseType: !99, size: 24, align: 8, offset: 928)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 24, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 3)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !52, file: !51, line: 145, baseType: !103, size: 8, align: 8, offset: 952)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, align: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !52, file: !51, line: 148, baseType: !63, size: 128, align: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !52, file: !51, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !51, line: 152, baseType: !81, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!110 = !{!111, !112, !113, !114, !115, !116, !117}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fname", arg: 1, scope: !46, file: !1, line: 230, type: !6)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "env", arg: 2, scope: !46, file: !1, line: 230, type: !6)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_dir", arg: 3, scope: !46, file: !1, line: 230, type: !109)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !46, file: !1, line: 232, type: !49)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !46, file: !1, line: 233, type: !6)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !46, file: !1, line: 234, type: !6)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "full", scope: !46, file: !1, line: 235, type: !118)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1024)
!121 = !DISubprogram(name: "FileExists", scope: !1, file: !1, line: 267, type: !122, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @FileExists, variables: !124)
!122 = !DISubroutineType(types: !123)
!123 = !{!5, !6}
!124 = !{!125, !126}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !121, file: !1, line: 267, type: !6)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !121, file: !1, line: 269, type: !49)
!127 = !{i32 2, !"Dwarf Version", i32 2}
!128 = !{i32 2, !"Debug Info Version", i32 700000003}
!129 = !{i32 1, !"PIC Level", i32 2}
!130 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!131 = !DIExpression()
!132 = !DILocation(line: 65, column: 19, scope: !9)
!133 = !DILocation(line: 71, column: 15, scope: !9)
!134 = !DILocation(line: 68, column: 9, scope: !9)
!135 = !DILocation(line: 72, column: 21, scope: !9)
!136 = !DILocation(line: 72, column: 10, scope: !9)
!137 = !DILocation(line: 72, column: 53, scope: !9)
!138 = !DILocation(line: 72, column: 36, scope: !9)
!139 = !DILocation(line: 69, column: 9, scope: !9)
!140 = !DILocation(line: 73, column: 22, scope: !9)
!141 = !DILocation(line: 67, column: 9, scope: !9)
!142 = !DILocation(line: 74, column: 11, scope: !143)
!143 = distinct !DILexicalBlock(scope: !9, file: !1, line: 74, column: 7)
!144 = !DILocation(line: 74, column: 7, scope: !9)
!145 = !DILocation(line: 74, column: 31, scope: !143)
!146 = !DILocation(line: 75, column: 12, scope: !147)
!147 = distinct !DILexicalBlock(scope: !143, file: !1, line: 75, column: 12)
!148 = !{!149, !149, i64 0}
!149 = !{!"omnipotent char", !150, i64 0}
!150 = !{!"Simple C/C++ TBAA"}
!151 = !DILocation(line: 75, column: 18, scope: !147)
!152 = !DILocation(line: 75, column: 12, scope: !143)
!153 = !DILocation(line: 75, column: 42, scope: !154)
!154 = distinct !DILexicalBlock(scope: !147, file: !1, line: 75, column: 31)
!155 = !DILocation(line: 75, column: 63, scope: !154)
!156 = !DILocation(line: 76, column: 42, scope: !157)
!157 = distinct !DILexicalBlock(scope: !147, file: !1, line: 76, column: 31)
!158 = !DILocation(line: 77, column: 3, scope: !9)
!159 = !DILocation(line: 77, column: 16, scope: !9)
!160 = !DILocation(line: 78, column: 3, scope: !9)
!161 = !DILocation(line: 98, column: 16, scope: !17)
!162 = !DILocation(line: 98, column: 26, scope: !17)
!163 = !DILocation(line: 104, column: 15, scope: !17)
!164 = !DILocation(line: 101, column: 9, scope: !17)
!165 = !DILocation(line: 105, column: 19, scope: !17)
!166 = !DILocation(line: 100, column: 9, scope: !17)
!167 = !DILocation(line: 106, column: 17, scope: !168)
!168 = distinct !DILexicalBlock(scope: !17, file: !1, line: 106, column: 7)
!169 = !DILocation(line: 106, column: 7, scope: !17)
