; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gsi.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.gsi_s = type { %struct.__sFILE*, i16, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.gsiindex_s = type { i8**, i32*, i16, %struct.gsikey_s*, i32 }
%struct.gsikey_s = type { [32 x i8], i16, i32 }

@.str = private unnamed_addr constant [61 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gsi.c\00", align 1
@.str1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@squid_errno = external global i32
@.str2 = private unnamed_addr constant [4 x i8] c"GSI\00", align 1
@.str3 = private unnamed_addr constant [34 x i8] c"File name too long to be indexed.\00", align 1
@.str4 = private unnamed_addr constant [26 x i8] c"key too long in GSI index\00", align 1
@.str5 = private unnamed_addr constant [28 x i8] c"too many files in GSI index\00", align 1
@.str6 = private unnamed_addr constant [28 x i8] c"offset too big in GSI index\00", align 1
@.str9 = private unnamed_addr constant [25 x i8] c"GSI: nfiles out of range\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !91, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gsi.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !31, !19, !81, !75, !79, !82}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSIFILE", file: !6, line: 51, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gsi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "gsi_s", file: !6, line: 46, size: 128, align: 64, elements: !8)
!8 = !{!9, !74, !78}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "gsifp", scope: !7, file: !6, line: 47, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !12, line: 153, baseType: !13)
!12 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !12, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !20, !21, !23, !24, !29, !30, !32, !36, !42, !52, !58, !59, !62, !63, !67, !71, !72, !73}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !12, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !12, line: 124, baseType: !19, size: 32, align: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !12, line: 125, baseType: !19, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !12, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !12, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !12, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !12, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !12, line: 89, baseType: !16, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !12, line: 90, baseType: !19, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !12, line: 129, baseType: !19, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !12, line: 132, baseType: !31, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !12, line: 133, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!19, !31}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !12, line: 134, baseType: !37, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!19, !31, !40, !19}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !12, line: 135, baseType: !43, size: 64, align: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !31, !46, !19}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !12, line: 77, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !48, line: 71, baseType: !49)
!48 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !50, line: 46, baseType: !51)
!50 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !12, line: 136, baseType: !53, size: 64, align: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!19, !31, !56, !19}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !12, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !12, line: 140, baseType: !60, size: 64, align: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !12, line: 94, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !12, line: 141, baseType: !19, size: 32, align: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !12, line: 144, baseType: !64, size: 24, align: 8, offset: 928)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !12, line: 145, baseType: !68, size: 8, align: 8, offset: 952)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !12, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !12, line: 151, baseType: !19, size: 32, align: 32, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !12, line: 152, baseType: !46, size: 64, align: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !7, file: !6, line: 48, baseType: !75, size: 16, align: 16, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !76, line: 40, baseType: !77)
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "recnum", scope: !7, file: !6, line: 49, baseType: !79, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !76, line: 41, baseType: !80)
!80 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!81 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "gsikey_s", file: !6, line: 53, size: 320, align: 32, elements: !84)
!84 = !{!85, !89, !90}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !83, file: !6, line: 54, baseType: !86, size: 256, align: 8)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "filenum", scope: !83, file: !6, line: 55, baseType: !75, size: 16, align: 16, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !83, file: !6, line: 56, baseType: !79, size: 32, align: 32, offset: 288)
!91 = !{!92, !99, !109, !131, !136, !150, !156, !164, !172, !175, !182, !192, !202, !212}
!92 = !DISubprogram(name: "GSIOpen", scope: !1, file: !1, line: 53, type: !93, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: %struct.gsi_s* (i8*)* @GSIOpen, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{!4, !40}
!95 = !{!96, !97, !98}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gsifile", arg: 1, scope: !92, file: !1, line: 53, type: !40)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gsi", scope: !92, file: !1, line: 55, type: !4)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic", scope: !92, file: !1, line: 56, type: !86)
!99 = !DISubprogram(name: "GSIGetRecord", scope: !1, file: !1, line: 93, type: !100, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.gsi_s*, i8*, i16*, i32*)* @GSIGetRecord, variables: !104)
!100 = !DISubroutineType(types: !101)
!101 = !{!19, !4, !40, !102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!104 = !{!105, !106, !107, !108}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gsi", arg: 1, scope: !99, file: !1, line: 93, type: !4)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f1", arg: 2, scope: !99, file: !1, line: 93, type: !40)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f2", arg: 3, scope: !99, file: !1, line: 93, type: !102)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f3", arg: 4, scope: !99, file: !1, line: 93, type: !103)
!109 = !DISubprogram(name: "GSIGetOffset", scope: !1, file: !1, line: 128, type: !110, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.gsi_s*, i8*, i8*, i32*, i64*)* @GSIGetOffset, variables: !114)
!110 = !DISubroutineType(types: !111)
!111 = !{!19, !4, !40, !40, !112, !113}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !128, !129, !130}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gsi", arg: 1, scope: !109, file: !1, line: 128, type: !4)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !109, file: !1, line: 128, type: !40)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_seqfile", arg: 3, scope: !109, file: !1, line: 128, type: !40)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_format", arg: 4, scope: !109, file: !1, line: 129, type: !112)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_offset", arg: 5, scope: !109, file: !1, line: 129, type: !113)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !109, file: !1, line: 131, type: !79)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !109, file: !1, line: 131, type: !79)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mid", scope: !109, file: !1, line: 131, type: !79)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !109, file: !1, line: 132, type: !19)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !109, file: !1, line: 133, type: !125)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 264, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 33)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !109, file: !1, line: 134, type: !79)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filenum", scope: !109, file: !1, line: 135, type: !75)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !109, file: !1, line: 136, type: !79)
!131 = !DISubprogram(name: "GSIClose", scope: !1, file: !1, line: 171, type: !132, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.gsi_s*)* @GSIClose, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !4}
!134 = !{!135}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gsi", arg: 1, scope: !131, file: !1, line: 171, type: !4)
!136 = !DISubprogram(name: "GSIAllocIndex", scope: !1, file: !1, line: 196, type: !137, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: %struct.gsiindex_s* ()* @GSIAllocIndex, variables: !148)
!137 = !DISubroutineType(types: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "gsiindex_s", file: !6, line: 58, size: 320, align: 64, elements: !141)
!141 = !{!142, !144, !145, !146, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "filenames", scope: !140, file: !6, line: 59, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !140, file: !6, line: 60, baseType: !112, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !140, file: !6, line: 61, baseType: !75, size: 16, align: 16, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !140, file: !6, line: 63, baseType: !82, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !140, file: !6, line: 64, baseType: !19, size: 32, align: 32, offset: 256)
!148 = !{!149}
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !136, file: !1, line: 198, type: !139)
!150 = !DISubprogram(name: "GSIFreeIndex", scope: !1, file: !1, line: 209, type: !151, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.gsiindex_s*)* @GSIFreeIndex, variables: !153)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !139}
!153 = !{!154, !155}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !150, file: !1, line: 209, type: !139)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !150, file: !1, line: 211, type: !19)
!156 = !DISubprogram(name: "GSIAddFileToIndex", scope: !1, file: !1, line: 219, type: !157, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.gsiindex_s*, i8*, i32)* @GSIAddFileToIndex, variables: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !139, !40, !19}
!159 = !{!160, !161, !162, !163}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !156, file: !1, line: 219, type: !139)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !156, file: !1, line: 219, type: !40)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 3, scope: !156, file: !1, line: 219, type: !19)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !156, file: !1, line: 221, type: !19)
!164 = !DISubprogram(name: "GSIAddKeyToIndex", scope: !1, file: !1, line: 234, type: !165, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.gsiindex_s*, i8*, i32, i64)* @GSIAddKeyToIndex, variables: !167)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !139, !40, !19, !81}
!167 = !{!168, !169, !170, !171}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !164, file: !1, line: 234, type: !139)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !164, file: !1, line: 234, type: !40)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filenum", arg: 3, scope: !164, file: !1, line: 234, type: !19)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 4, scope: !164, file: !1, line: 234, type: !81)
!172 = !DISubprogram(name: "GSISortIndex", scope: !1, file: !1, line: 259, type: !151, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.gsiindex_s*)* @GSISortIndex, variables: !173)
!173 = !{!174}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !172, file: !1, line: 259, type: !139)
!175 = !DISubprogram(name: "GSIWriteIndex", scope: !1, file: !1, line: 264, type: !176, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.gsiindex_s*)* @GSIWriteIndex, variables: !178)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !10, !139}
!178 = !{!179, !180, !181}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !175, file: !1, line: 264, type: !10)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !175, file: !1, line: 264, type: !139)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !175, file: !1, line: 266, type: !79)
!182 = !DISubprogram(name: "GSIWriteHeader", scope: !1, file: !1, line: 297, type: !183, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i64)* @GSIWriteHeader, variables: !185)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !10, !19, !81}
!185 = !{!186, !187, !188, !189, !190, !191}
