; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/histogram.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.histogram_s = type { i32*, i32, i32, i32, i32, i32, i32, float*, i32, [3 x float], float, float }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [67 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/histogram.c\00", align 1
@.str1 = private unnamed_addr constant [51 x i8] c"AddToHistogram(): Can't add to a fitted histogram\0A\00", align 1
@.str2 = private unnamed_addr constant [46 x i8] c"%5s %6s %6s  (one = represents %d sequences)\0A\00", align 1
@.str3 = private unnamed_addr constant [6 x i8] c"score\00", align 1
@.str4 = private unnamed_addr constant [4 x i8] c"obs\00", align 1
@.str5 = private unnamed_addr constant [4 x i8] c"exp\00", align 1
@.str6 = private unnamed_addr constant [13 x i8] c"%5s %6s %6s\0A\00", align 1
@.str7 = private unnamed_addr constant [6 x i8] c"-----\00", align 1
@.str8 = private unnamed_addr constant [4 x i8] c"---\00", align 1
@.str9 = private unnamed_addr constant [14 x i8] c"<%4d %6d %6s|\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !29, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/histogram.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !9, !27, !10, !19, !28, !18}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "histogram_s", file: !6, line: 419, size: 512, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !11, !12, !13, !14, !15, !16, !17, !20, !21, !25, !26}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "histogram", scope: !5, file: !6, line: 420, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !5, file: !6, line: 421, baseType: !10, size: 32, align: 32, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !5, file: !6, line: 422, baseType: !10, size: 32, align: 32, offset: 96)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "highscore", scope: !5, file: !6, line: 423, baseType: !10, size: 32, align: 32, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "lowscore", scope: !5, file: !6, line: 424, baseType: !10, size: 32, align: 32, offset: 160)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "lumpsize", scope: !5, file: !6, line: 425, baseType: !10, size: 32, align: 32, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !5, file: !6, line: 426, baseType: !10, size: 32, align: 32, offset: 224)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "expect", scope: !5, file: !6, line: 428, baseType: !18, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "fit_type", scope: !5, file: !6, line: 429, baseType: !10, size: 32, align: 32, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !5, file: !6, line: 430, baseType: !22, size: 96, align: 32, offset: 352)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, align: 32, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: 3)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "chisq", scope: !5, file: !6, line: 431, baseType: !19, size: 32, align: 32, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "chip", scope: !5, file: !6, line: 432, baseType: !19, size: 32, align: 32, offset: 480)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!29 = !{!30, !40, !45, !48, !59, !140, !146, !153, !160, !174, !204, !219, !232, !244, !251, !256, !262, !271, !277, !284, !301, !320, !343}
!30 = !DISubprogram(name: "AllocHistogram", scope: !1, file: !1, line: 60, type: !31, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: %struct.histogram_s* (i32, i32, i32)* @AllocHistogram, variables: !33)
!31 = !DISubroutineType(types: !32)
!32 = !{!4, !10, !10, !10}
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min", arg: 1, scope: !30, file: !1, line: 60, type: !10)
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max", arg: 2, scope: !30, file: !1, line: 60, type: !10)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lumpsize", arg: 3, scope: !30, file: !1, line: 60, type: !10)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !30, file: !1, line: 62, type: !4)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !30, file: !1, line: 63, type: !10)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !30, file: !1, line: 64, type: !10)
!40 = !DISubprogram(name: "FreeHistogram", scope: !1, file: !1, line: 90, type: !41, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.histogram_s*)* @FreeHistogram, variables: !43)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !4}
!43 = !{!44}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !40, file: !1, line: 90, type: !4)
!45 = !DISubprogram(name: "UnfitHistogram", scope: !1, file: !1, line: 102, type: !41, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.histogram_s*)* @UnfitHistogram, variables: !46)
!46 = !{!47}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !45, file: !1, line: 102, type: !4)
!48 = !DISubprogram(name: "AddToHistogram", scope: !1, file: !1, line: 118, type: !49, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.histogram_s*, float)* @AddToHistogram, variables: !51)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !4, !19}
!51 = !{!52, !53, !54, !55, !56, !57, !58}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !48, file: !1, line: 118, type: !4)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sc", arg: 2, scope: !48, file: !1, line: 118, type: !19)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !48, file: !1, line: 120, type: !10)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moveby", scope: !48, file: !1, line: 121, type: !10)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevsize", scope: !48, file: !1, line: 122, type: !10)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !48, file: !1, line: 123, type: !10)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !48, file: !1, line: 124, type: !10)
!59 = !DISubprogram(name: "PrintASCIIHistogram", scope: !1, file: !1, line: 189, type: !60, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.histogram_s*)* @PrintASCIIHistogram, variables: !122)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !4}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 153, baseType: !65)
!64 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !64, line: 122, size: 1216, align: 64, elements: !66)
!66 = !{!67, !70, !71, !72, !74, !75, !80, !81, !82, !86, !92, !102, !108, !109, !112, !113, !115, !119, !120, !121}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !65, file: !64, line: 123, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !65, file: !64, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !65, file: !64, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !64, line: 126, baseType: !73, size: 16, align: 16, offset: 128)
!73 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !65, file: !64, line: 127, baseType: !73, size: 16, align: 16, offset: 144)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !65, file: !64, line: 128, baseType: !76, size: 128, align: 64, offset: 192)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !64, line: 88, size: 128, align: 64, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !76, file: !64, line: 89, baseType: !68, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !76, file: !64, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !65, file: !64, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !65, file: !64, line: 132, baseType: !27, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !65, file: !64, line: 133, baseType: !83, size: 64, align: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!10, !27}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !65, file: !64, line: 134, baseType: !87, size: 64, align: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !27, !90, !10}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !65, file: !64, line: 135, baseType: !93, size: 64, align: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !27, !96, !10}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !64, line: 77, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !98, line: 71, baseType: !99)
!98 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!101 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !65, file: !64, line: 136, baseType: !103, size: 64, align: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!10, !27, !106, !10}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !65, file: !64, line: 139, baseType: !76, size: 128, align: 64, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !65, file: !64, line: 140, baseType: !110, size: 64, align: 64, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !64, line: 94, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !65, file: !64, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !65, file: !64, line: 144, baseType: !114, size: 24, align: 8, offset: 928)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 24, align: 8, elements: !23)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !65, file: !64, line: 145, baseType: !116, size: 8, align: 8, offset: 952)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !65, file: !64, line: 148, baseType: !76, size: 128, align: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !65, file: !64, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !64, line: 152, baseType: !96, size: 64, align: 64, offset: 1152)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !134, !135, !136, !137, !138, !139}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !59, file: !1, line: 189, type: !62)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !59, file: !1, line: 189, type: !4)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "units", scope: !59, file: !1, line: 191, type: !10)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxbar", scope: !59, file: !1, line: 192, type: !10)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !59, file: !1, line: 193, type: !10)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !59, file: !1, line: 194, type: !10)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !59, file: !1, line: 194, type: !10)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !59, file: !1, line: 195, type: !131)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 648, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 81)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !59, file: !1, line: 196, type: !10)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lowbound", scope: !59, file: !1, line: 197, type: !10)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lowcount", scope: !59, file: !1, line: 197, type: !10)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "highbound", scope: !59, file: !1, line: 198, type: !10)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "highcount", scope: !59, file: !1, line: 198, type: !10)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "emptybins", scope: !59, file: !1, line: 199, type: !10)
!140 = !DISubprogram(name: "PrintXMGRHistogram", scope: !1, file: !1, line: 348, type: !60, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.histogram_s*)* @PrintXMGRHistogram, variables: !141)
!141 = !{!142, !143, !144, !145}
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !140, file: !1, line: 348, type: !62)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !140, file: !1, line: 348, type: !4)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !140, file: !1, line: 350, type: !10)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !140, file: !1, line: 351, type: !28)
!146 = !DISubprogram(name: "PrintXMGRDistribution", scope: !1, file: !1, line: 384, type: !60, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.histogram_s*)* @PrintXMGRDistribution, variables: !147)
!147 = !{!148, !149, !150, !151, !152}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !146, file: !1, line: 384, type: !62)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !146, file: !1, line: 384, type: !4)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !146, file: !1, line: 386, type: !10)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cum", scope: !146, file: !1, line: 387, type: !10)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !146, file: !1, line: 388, type: !28)
!153 = !DISubprogram(name: "PrintXMGRRegressionLine", scope: !1, file: !1, line: 423, type: !60, isLocal: false, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.histogram_s*)* @PrintXMGRRegressionLine, variables: !154)
!154 = !{!155, !156, !157, !158, !159}
