; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hmmcalibrate.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.opt_s = type { i8*, i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.stopwatch_s = type { i64, %struct.tms, double, double, double }
%struct.tms = type { i64, i64, i64, i64 }
%struct.hmmfile_s = type { %struct.__sFILE*, %struct.ssifile_s*, i32 (%struct.hmmfile_s*, %struct.plan7_s**)*, i32, i32, i32, i32, %struct.ssioffset_s }
%struct.ssifile_s = type { %struct.__sFILE*, i32, i16, i32, i32, i32, i32, i32, i32, i32, i32, %struct.ssioffset_s, %struct.ssioffset_s, %struct.ssioffset_s, i8, i8, i8**, i32*, i32*, i32*, i32* }
%struct.ssioffset_s = type { i8, %union.anon }
%union.anon = type { i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !12, globals: !321, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hmmcalibrate.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !11}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !7, line: 30, baseType: !8)
!7 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !9, line: 120, baseType: !10)
!9 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !{!13, !277, !283}
!13 = !DISubprogram(name: "main", scope: !1, file: !1, line: 144, type: !14, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**)* @main, variables: !19)
!14 = !DISubroutineType(types: !15)
!15 = !{!4, !4, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !{!20, !21, !22, !23, !24, !209, !210, !211, !212, !213, !218, !219, !236, !237, !238, !239, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!20 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !13, file: !1, line: 144, type: !4)
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !13, file: !1, line: 144, type: !16)
!22 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmmfile", scope: !13, file: !1, line: 147, type: !17)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpfile", scope: !13, file: !1, line: 148, type: !17)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmmfp", scope: !13, file: !1, line: 149, type: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMMFILE", file: !27, line: 350, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "hmmfile_s", file: !27, line: 332, size: 448, align: 64, elements: !29)
!29 = !{!30, !90, !134, !204, !205, !206, !207, !208}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !28, file: !27, line: 333, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 153, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !33, line: 122, size: 1216, align: 64, elements: !35)
!35 = !{!36, !39, !40, !41, !43, !44, !49, !50, !51, !55, !59, !68, !74, !75, !78, !79, !83, !87, !88, !89}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !34, file: !33, line: 123, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !34, file: !33, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !34, file: !33, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !33, line: 126, baseType: !42, size: 16, align: 16, offset: 128)
!42 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !34, file: !33, line: 127, baseType: !42, size: 16, align: 16, offset: 144)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !34, file: !33, line: 128, baseType: !45, size: 128, align: 64, offset: 192)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !33, line: 88, size: 128, align: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !45, file: !33, line: 89, baseType: !37, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !45, file: !33, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !34, file: !33, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !34, file: !33, line: 132, baseType: !11, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !34, file: !33, line: 133, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!4, !11}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !34, file: !33, line: 134, baseType: !56, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!4, !11, !17, !4}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !34, file: !33, line: 135, baseType: !60, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !11, !63, !4}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !33, line: 77, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !65, line: 71, baseType: !66)
!65 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !9, line: 46, baseType: !67)
!67 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !34, file: !33, line: 136, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!4, !11, !72, !4}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !34, file: !33, line: 139, baseType: !45, size: 128, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !34, file: !33, line: 140, baseType: !76, size: 64, align: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !33, line: 94, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !34, file: !33, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !34, file: !33, line: 144, baseType: !80, size: 24, align: 8, offset: 928)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 24, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !34, file: !33, line: 145, baseType: !84, size: 8, align: 8, offset: 952)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !34, file: !33, line: 148, baseType: !45, size: 128, align: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !34, file: !33, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !33, line: 152, baseType: !63, size: 64, align: 64, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ssi", scope: !28, file: !27, line: 334, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIFILE", file: !93, line: 76, baseType: !94)
!93 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssifile_s", file: !93, line: 49, size: 1152, align: 64, elements: !95)
!95 = !{!96, !97, !101, !104, !105, !106, !107, !108, !109, !110, !111, !112, !124, !125, !126, !127, !128, !129, !131, !132, !133}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !94, file: !93, line: 50, baseType: !31, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !93, line: 51, baseType: !98, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !99, line: 41, baseType: !100)
!99 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!100 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !94, file: !93, line: 52, baseType: !102, size: 16, align: 16, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !99, line: 40, baseType: !103)
!103 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !94, file: !93, line: 53, baseType: !98, size: 32, align: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !94, file: !93, line: 54, baseType: !98, size: 32, align: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !94, file: !93, line: 55, baseType: !98, size: 32, align: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !94, file: !93, line: 56, baseType: !98, size: 32, align: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !94, file: !93, line: 57, baseType: !98, size: 32, align: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "frecsize", scope: !94, file: !93, line: 58, baseType: !98, size: 32, align: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "precsize", scope: !94, file: !93, line: 59, baseType: !98, size: 32, align: 32, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "srecsize", scope: !94, file: !93, line: 60, baseType: !98, size: 32, align: 32, offset: 352)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "foffset", scope: !94, file: !93, line: 61, baseType: !113, size: 128, align: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIOFFSET", file: !93, line: 42, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssioffset_s", file: !93, line: 35, size: 128, align: 64, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !114, file: !93, line: 36, baseType: !18, size: 8, align: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !114, file: !93, line: 40, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DICompositeType(tag: DW_TAG_union_type, scope: !114, file: !93, line: 37, size: 64, align: 64, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !118, file: !93, line: 38, baseType: !98, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !118, file: !93, line: 39, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint64", file: !99, line: 42, baseType: !123)
!123 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "poffset", scope: !94, file: !93, line: 62, baseType: !113, size: 128, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "soffset", scope: !94, file: !93, line: 63, baseType: !113, size: 128, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !94, file: !93, line: 65, baseType: !18, size: 8, align: 8, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !94, file: !93, line: 66, baseType: !18, size: 8, align: 8, offset: 776)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !94, file: !93, line: 70, baseType: !16, size: 64, align: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !94, file: !93, line: 71, baseType: !130, size: 64, align: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !94, file: !93, line: 72, baseType: !130, size: 64, align: 64, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !94, file: !93, line: 73, baseType: !130, size: 64, align: 64, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !94, file: !93, line: 74, baseType: !130, size: 64, align: 64, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !28, file: !27, line: 335, baseType: !135, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!4, !138, !139}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !27, line: 101, size: 3712, align: 64, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !154, !155, !156, !157, !158, !160, !161, !162, !163, !164, !165, !166, !169, !170, !171, !172, !177, !178, !179, !183, !184, !186, !187, !188, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !27, line: 113, baseType: !17, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !141, file: !27, line: 114, baseType: !17, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !141, file: !27, line: 115, baseType: !17, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !141, file: !27, line: 116, baseType: !17, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !141, file: !27, line: 117, baseType: !17, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !141, file: !27, line: 118, baseType: !17, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !141, file: !27, line: 119, baseType: !17, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !141, file: !27, line: 120, baseType: !4, size: 32, align: 32, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !141, file: !27, line: 121, baseType: !17, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !141, file: !27, line: 122, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !141, file: !27, line: 123, baseType: !4, size: 32, align: 32, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !141, file: !27, line: 134, baseType: !153, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !141, file: !27, line: 135, baseType: !153, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !141, file: !27, line: 136, baseType: !153, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !141, file: !27, line: 144, baseType: !159, size: 32, align: 32, offset: 896)
!159 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !141, file: !27, line: 144, baseType: !159, size: 32, align: 32, offset: 928)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !141, file: !27, line: 145, baseType: !159, size: 32, align: 32, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !141, file: !27, line: 145, baseType: !159, size: 32, align: 32, offset: 992)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !141, file: !27, line: 146, baseType: !159, size: 32, align: 32, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !141, file: !27, line: 146, baseType: !159, size: 32, align: 32, offset: 1056)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !141, file: !27, line: 155, baseType: !4, size: 32, align: 32, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !141, file: !27, line: 156, baseType: !167, size: 64, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !141, file: !27, line: 157, baseType: !167, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !141, file: !27, line: 158, baseType: !167, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !141, file: !27, line: 159, baseType: !159, size: 32, align: 32, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !141, file: !27, line: 168, baseType: !173, size: 256, align: 32, offset: 1376)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 256, align: 32, elements: !174)
!174 = !{!175, !176}
!175 = !DISubrange(count: 4)
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !141, file: !27, line: 169, baseType: !168, size: 64, align: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !141, file: !27, line: 170, baseType: !168, size: 64, align: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !141, file: !27, line: 174, baseType: !180, size: 640, align: 32, offset: 1792)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 640, align: 32, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 20)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !141, file: !27, line: 175, baseType: !159, size: 32, align: 32, offset: 2432)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !141, file: !27, line: 197, baseType: !185, size: 64, align: 64, offset: 2496)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !141, file: !27, line: 198, baseType: !185, size: 64, align: 64, offset: 2560)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !141, file: !27, line: 199, baseType: !185, size: 64, align: 64, offset: 2624)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !141, file: !27, line: 200, baseType: !189, size: 256, align: 32, offset: 2688)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !174)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !141, file: !27, line: 201, baseType: !153, size: 64, align: 64, offset: 2944)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !141, file: !27, line: 202, baseType: !153, size: 64, align: 64, offset: 3008)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !141, file: !27, line: 203, baseType: !153, size: 64, align: 64, offset: 3072)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !141, file: !27, line: 203, baseType: !153, size: 64, align: 64, offset: 3136)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !141, file: !27, line: 203, baseType: !153, size: 64, align: 64, offset: 3200)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !141, file: !27, line: 203, baseType: !153, size: 64, align: 64, offset: 3264)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !141, file: !27, line: 203, baseType: !153, size: 64, align: 64, offset: 3328)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !141, file: !27, line: 214, baseType: !185, size: 64, align: 64, offset: 3392)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !141, file: !27, line: 215, baseType: !185, size: 64, align: 64, offset: 3456)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !141, file: !27, line: 216, baseType: !4, size: 32, align: 32, offset: 3520)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !141, file: !27, line: 217, baseType: !4, size: 32, align: 32, offset: 3552)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !141, file: !27, line: 222, baseType: !159, size: 32, align: 32, offset: 3584)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !141, file: !27, line: 223, baseType: !159, size: 32, align: 32, offset: 3616)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !141, file: !27, line: 225, baseType: !4, size: 32, align: 32, offset: 3648)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "is_binary", scope: !28, file: !27, line: 336, baseType: !4, size: 32, align: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "byteswap", scope: !28, file: !27, line: 337, baseType: !4, size: 32, align: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !28, file: !27, line: 346, baseType: !4, size: 32, align: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !28, file: !27, line: 347, baseType: !4, size: 32, align: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !28, file: !27, line: 348, baseType: !113, size: 128, align: 64, offset: 320)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outfp", scope: !13, file: !1, line: 150, type: !31)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !13, file: !1, line: 151, type: !17)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !13, file: !1, line: 152, type: !140)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !13, file: !1, line: 153, type: !4)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksigs", scope: !13, file: !1, line: 155, type: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !215, line: 30, baseType: !216)
!215 = !DIFile(filename: "/usr/include/sys/_types/_sigset_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_sigset_t", file: !65, line: 73, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 45, baseType: !100)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nhmm", scope: !13, file: !1, line: 157, type: !4)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hist", scope: !13, file: !1, line: 159, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "histogram_s", file: !27, line: 419, size: 512, align: 64, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !234, !235}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "histogram", scope: !221, file: !27, line: 420, baseType: !153, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !221, file: !27, line: 421, baseType: !4, size: 32, align: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !221, file: !27, line: 422, baseType: !4, size: 32, align: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "highscore", scope: !221, file: !27, line: 423, baseType: !4, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "lowscore", scope: !221, file: !27, line: 424, baseType: !4, size: 32, align: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lumpsize", scope: !221, file: !27, line: 425, baseType: !4, size: 32, align: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !221, file: !27, line: 426, baseType: !4, size: 32, align: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "expect", scope: !221, file: !27, line: 428, baseType: !168, size: 64, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fit_type", scope: !221, file: !27, line: 429, baseType: !4, size: 32, align: 32, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !221, file: !27, line: 430, baseType: !233, size: 96, align: 32, offset: 352)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 96, align: 32, elements: !81)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "chisq", scope: !221, file: !27, line: 431, baseType: !159, size: 32, align: 32, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "chip", scope: !221, file: !27, line: 432, baseType: !159, size: 32, align: 32, offset: 480)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !13, file: !1, line: 160, type: !159)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "histfile", scope: !13, file: !1, line: 161, type: !17)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hfp", scope: !13, file: !1, line: 162, type: !31)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stopwatch", scope: !13, file: !1, line: 164, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "Stopwatch_t", file: !241, line: 46, baseType: !242)
!241 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/stopwatch.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "stopwatch_s", file: !241, line: 34, size: 512, align: 64, elements: !243)
!243 = !{!244, !245, !257, !259, !260}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "t0", scope: !242, file: !241, line: 35, baseType: !6, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cpu0", scope: !242, file: !241, line: 39, baseType: !246, size: 256, align: 64, offset: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "tms", file: !247, line: 82, size: 256, align: 64, elements: !248)
!247 = !DIFile(filename: "/usr/include/sys/times.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!248 = !{!249, !254, !255, !256}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !246, file: !247, line: 83, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !251, line: 30, baseType: !252)
!251 = !DIFile(filename: "/usr/include/sys/_types/_clock_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !9, line: 117, baseType: !253)
!253 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !246, file: !247, line: 84, baseType: !250, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !246, file: !247, line: 85, baseType: !250, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !246, file: !247, line: 86, baseType: !250, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !242, file: !241, line: 42, baseType: !258, size: 64, align: 64, offset: 320)
!258 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !242, file: !241, line: 43, baseType: !258, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !242, file: !241, line: 44, baseType: !258, size: 64, align: 64, offset: 448)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extrawatch", scope: !13, file: !1, line: 165, type: !240)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mu", scope: !13, file: !1, line: 167, type: !168)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda", scope: !13, file: !1, line: 168, type: !168)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mu_lumpsize", scope: !13, file: !1, line: 169, type: !4)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsample", scope: !13, file: !1, line: 171, type: !4)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seed", scope: !13, file: !1, line: 172, type: !4)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fixedlen", scope: !13, file: !1, line: 173, type: !4)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lenmean", scope: !13, file: !1, line: 174, type: !159)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lensd", scope: !13, file: !1, line: 175, type: !159)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_pvm", scope: !13, file: !1, line: 176, type: !4)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pvm_lumpsize", scope: !13, file: !1, line: 177, type: !4)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pvm_nslaves", scope: !13, file: !1, line: 178, type: !4)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "optname", scope: !13, file: !1, line: 181, type: !17)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "optarg", scope: !13, file: !1, line: 182, type: !17)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "optind", scope: !13, file: !1, line: 183, type: !4)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_threads", scope: !13, file: !1, line: 185, type: !4)
!277 = !DISubprogram(name: "__sigbits", scope: !278, file: !278, line: 114, type: !279, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, variables: !281)
!278 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!279 = !DISubroutineType(types: !280)
!280 = !{!4, !4}
!281 = !{!282}
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !277, file: !278, line: 114, type: !4)
!283 = !DISubprogram(name: "main_loop_serial", scope: !1, file: !1, line: 473, type: !284, isLocal: true, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, variables: !287)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !140, !4, !4, !159, !159, !4, !286, !168}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !313, !314, !315, !316, !317, !318, !319, !320}
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !283, file: !1, line: 473, type: !140)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 2, scope: !283, file: !1, line: 473, type: !4)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsample", arg: 3, scope: !283, file: !1, line: 473, type: !4)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lenmean", arg: 4, scope: !283, file: !1, line: 474, type: !159)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lensd", arg: 5, scope: !283, file: !1, line: 474, type: !159)
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fixedlen", arg: 6, scope: !283, file: !1, line: 474, type: !4)
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hist", arg: 7, scope: !283, file: !1, line: 475, type: !286)
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_max", arg: 8, scope: !283, file: !1, line: 475, type: !168)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hist", scope: !283, file: !1, line: 477, type: !220)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !283, file: !1, line: 478, type: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpmatrix_s", file: !27, line: 289, size: 640, align: 64, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !299, file: !27, line: 290, baseType: !185, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mmx", scope: !299, file: !27, line: 291, baseType: !185, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "imx", scope: !299, file: !27, line: 292, baseType: !185, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dmx", scope: !299, file: !27, line: 293, baseType: !185, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "xmx_mem", scope: !299, file: !27, line: 299, baseType: !11, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mmx_mem", scope: !299, file: !27, line: 299, baseType: !11, size: 64, align: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "imx_mem", scope: !299, file: !27, line: 299, baseType: !11, size: 64, align: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dmx_mem", scope: !299, file: !27, line: 299, baseType: !11, size: 64, align: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "maxN", scope: !299, file: !27, line: 308, baseType: !4, size: 32, align: 32, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "maxM", scope: !299, file: !27, line: 309, baseType: !4, size: 32, align: 32, offset: 544)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "padN", scope: !299, file: !27, line: 311, baseType: !4, size: 32, align: 32, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "padM", scope: !299, file: !27, line: 312, baseType: !4, size: 32, align: 32, offset: 608)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "randomseq", scope: !283, file: !1, line: 479, type: !180)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p1", scope: !283, file: !1, line: 480, type: !159)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !283, file: !1, line: 481, type: !159)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !283, file: !1, line: 482, type: !17)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsq", scope: !283, file: !1, line: 483, type: !17)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !283, file: !1, line: 484, type: !159)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqlen", scope: !283, file: !1, line: 485, type: !4)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !283, file: !1, line: 486, type: !4)
!321 = !{!322, !327, !328, !329, !330, !334, !337, !346, !350, !354}
!322 = !DIGlobalVariable(name: "Alphabet", scope: !0, file: !323, line: 19, type: !324, isLocal: false, isDefinition: true, variable: [25 x i8]* @Alphabet)
!323 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/globals.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 200, align: 8, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 25)
!327 = !DIGlobalVariable(name: "Alphabet_type", scope: !0, file: !323, line: 20, type: !4, isLocal: false, isDefinition: true, variable: i32* @Alphabet_type)
!328 = !DIGlobalVariable(name: "Alphabet_size", scope: !0, file: !323, line: 21, type: !4, isLocal: false, isDefinition: true, variable: i32* @Alphabet_size)
!329 = !DIGlobalVariable(name: "Alphabet_iupac", scope: !0, file: !323, line: 22, type: !4, isLocal: false, isDefinition: true, variable: i32* @Alphabet_iupac)
!330 = !DIGlobalVariable(name: "Degenerate", scope: !0, file: !323, line: 23, type: !331, isLocal: false, isDefinition: true, variable: [24 x [20 x i8]]* @Degenerate)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3840, align: 8, elements: !332)
!332 = !{!333, !182}
!333 = !DISubrange(count: 24)
!334 = !DIGlobalVariable(name: "DegenCount", scope: !0, file: !323, line: 24, type: !335, isLocal: false, isDefinition: true, variable: [24 x i32]* @DegenCount)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 768, align: 32, elements: !336)
!336 = !{!333}
!337 = !DIGlobalVariable(name: "OPTIONS", scope: !0, file: !1, line: 67, type: !338, isLocal: true, isDefinition: true, variable: [9 x %struct.opt_s]* @OPTIONS)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 1152, align: 64, elements: !344)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "opt_s", file: !99, line: 330, size: 128, align: 64, elements: !340)
!340 = !{!341, !342, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !99, line: 331, baseType: !17, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "single", scope: !339, file: !99, line: 332, baseType: !4, size: 32, align: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "argtype", scope: !339, file: !99, line: 333, baseType: !4, size: 32, align: 32, offset: 96)
!344 = !{!345}
!345 = !DISubrange(count: 9)
!346 = !DIGlobalVariable(name: "usage", scope: !0, file: !1, line: 50, type: !347, isLocal: true, isDefinition: true, variable: [130 x i8]* @usage)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1040, align: 8, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 130)
!350 = !DIGlobalVariable(name: "banner", scope: !0, file: !1, line: 48, type: !351, isLocal: true, isDefinition: true, variable: [48 x i8]* @banner)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 384, align: 8, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 48)
!354 = !DIGlobalVariable(name: "experts", scope: !0, file: !1, line: 56, type: !355, isLocal: true, isDefinition: true, variable: [456 x i8]* @experts)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3648, align: 8, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 456)
!358 = !{i32 2, !"Dwarf Version", i32 2}
!359 = !{i32 2, !"Debug Info Version", i32 700000003}
!360 = !{i32 1, !"PIC Level", i32 2}
!361 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!362 = !DIExpression()
!363 = !DILocation(line: 144, column: 10, scope: !13)
!364 = !DILocation(line: 144, column: 23, scope: !13)
!365 = !DILocation(line: 164, column: 3, scope: !13)
!366 = !DILocation(line: 165, column: 3, scope: !13)
!367 = !DILocation(line: 164, column: 15, scope: !13)
!368 = !DILocation(line: 192, column: 3, scope: !13)
!369 = !DILocation(line: 165, column: 15, scope: !13)
!370 = !DILocation(line: 193, column: 3, scope: !13)
!371 = !DILocation(line: 171, column: 11, scope: !13)
!372 = !DILocation(line: 173, column: 11, scope: !13)
!373 = !DILocation(line: 174, column: 11, scope: !13)
!374 = !DILocation(line: 175, column: 11, scope: !13)
!375 = !DILocation(line: 200, column: 24, scope: !13)
!376 = !DILocation(line: 200, column: 18, scope: !13)
!377 = !DILocation(line: 172, column: 11, scope: !13)
!378 = !DILocation(line: 161, column: 11, scope: !13)
!379 = !DILocation(line: 176, column: 11, scope: !13)
!380 = !DILocation(line: 177, column: 11, scope: !13)
!381 = !DILocation(line: 169, column: 11, scope: !13)
!382 = !DILocation(line: 185, column: 9, scope: !13)
!383 = !DILocation(line: 479, column: 10, scope: !283, inlinedAt: !384)
!384 = distinct !DILocation(line: 317, column: 2, scope: !385)
!385 = distinct !DILexicalBlock(scope: !386, file: !1, line: 316, column: 11)
!386 = distinct !DILexicalBlock(scope: !13, file: !1, line: 312, column: 5)
!387 = !DILocation(line: 181, column: 9, scope: !13)
!388 = !DILocation(line: 182, column: 9, scope: !13)
!389 = !DILocation(line: 183, column: 9, scope: !13)
!390 = !DILocation(line: 211, column: 10, scope: !13)
!391 = !DILocation(line: 211, column: 3, scope: !13)
!392 = !DILocation(line: 214, column: 23, scope: !393)
!393 = distinct !DILexicalBlock(scope: !394, file: !1, line: 214, column: 16)
!394 = distinct !DILexicalBlock(scope: !13, file: !1, line: 213, column: 5)
!395 = !{!396, !396, i64 0}
!396 = !{!"any pointer", !397, i64 0}
!397 = !{!"omnipotent char", !398, i64 0}
!398 = !{!"Simple C/C++ TBAA"}
!399 = !DILocation(line: 214, column: 16, scope: !393)
!400 = !DILocation(line: 214, column: 46, scope: !393)
!401 = !DILocation(line: 214, column: 16, scope: !394)
!402 = !DILocation(line: 214, column: 72, scope: !393)
!403 = !DILocation(line: 214, column: 67, scope: !393)
!404 = !DILocation(line: 214, column: 52, scope: !393)
!405 = !DILocation(line: 215, column: 16, scope: !406)
!406 = distinct !DILexicalBlock(scope: !393, file: !1, line: 215, column: 16)
!407 = !DILocation(line: 215, column: 46, scope: !406)
!408 = !DILocation(line: 215, column: 16, scope: !393)
!409 = !DILocation(line: 215, column: 68, scope: !406)
!410 = !DILocation(line: 215, column: 63, scope: !406)
!411 = !DILocation(line: 215, column: 52, scope: !406)
