; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hmmio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.hmmfile_s = type { %struct.__sFILE*, %struct.ssifile_s*, i32 (%struct.hmmfile_s*, %struct.plan7_s**)*, i32, i32, i32, i32, %struct.ssioffset_s }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.ssifile_s = type { %struct.__sFILE*, i32, i16, i32, i32, i32, i32, i32, i32, i32, i32, %struct.ssioffset_s, %struct.ssioffset_s, %struct.ssioffset_s, i8, i8, i8**, i32*, i32*, i32*, i32* }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.ssioffset_s = type { i8, %union.anon }
%union.anon = type { i64 }
%struct.plan9_s = type { i32, %struct.basic_state*, %struct.basic_state*, %struct.basic_state*, [20 x float], i8*, i8*, i8*, float*, i32 }
%struct.basic_state = type { [3 x float], [20 x float] }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !195, globals: !445, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hmmio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !31, !40, !144, !194, !19}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMMFILE", file: !6, line: 350, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "hmmfile_s", file: !6, line: 332, size: 448, align: 64, elements: !8)
!8 = !{!9, !74, !119, !189, !190, !191, !192, !193}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !7, file: !6, line: 333, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !12, line: 153, baseType: !13)
!12 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !12, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !20, !21, !23, !24, !29, !30, !32, !36, !42, !52, !58, !59, !62, !63, !67, !71, !72, !73}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !12, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !12, line: 124, baseType: !19, size: 32, align: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !12, line: 125, baseType: !19, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !12, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !12, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !12, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !12, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !12, line: 89, baseType: !16, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !12, line: 90, baseType: !19, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !12, line: 129, baseType: !19, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !12, line: 132, baseType: !31, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !12, line: 133, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!19, !31}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !12, line: 134, baseType: !37, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!19, !31, !40, !19}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !12, line: 135, baseType: !43, size: 64, align: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !31, !46, !19}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !12, line: 77, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !48, line: 71, baseType: !49)
!48 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !50, line: 46, baseType: !51)
!50 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!51 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !12, line: 136, baseType: !53, size: 64, align: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!19, !31, !56, !19}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !12, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !12, line: 140, baseType: !60, size: 64, align: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !12, line: 94, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !12, line: 141, baseType: !19, size: 32, align: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !12, line: 144, baseType: !64, size: 24, align: 8, offset: 928)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !12, line: 145, baseType: !68, size: 8, align: 8, offset: 952)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !12, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !12, line: 151, baseType: !19, size: 32, align: 32, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !12, line: 152, baseType: !46, size: 64, align: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ssi", scope: !7, file: !6, line: 334, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIFILE", file: !77, line: 76, baseType: !78)
!77 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssifile_s", file: !77, line: 49, size: 1152, align: 64, elements: !79)
!79 = !{!80, !81, !85, !88, !89, !90, !91, !92, !93, !94, !95, !96, !108, !109, !110, !111, !112, !114, !116, !117, !118}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !78, file: !77, line: 50, baseType: !10, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !78, file: !77, line: 51, baseType: !82, size: 32, align: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !83, line: 41, baseType: !84)
!83 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !78, file: !77, line: 52, baseType: !86, size: 16, align: 16, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !83, line: 40, baseType: !87)
!87 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !78, file: !77, line: 53, baseType: !82, size: 32, align: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !78, file: !77, line: 54, baseType: !82, size: 32, align: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !78, file: !77, line: 55, baseType: !82, size: 32, align: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !78, file: !77, line: 56, baseType: !82, size: 32, align: 32, offset: 224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !78, file: !77, line: 57, baseType: !82, size: 32, align: 32, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "frecsize", scope: !78, file: !77, line: 58, baseType: !82, size: 32, align: 32, offset: 288)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "precsize", scope: !78, file: !77, line: 59, baseType: !82, size: 32, align: 32, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "srecsize", scope: !78, file: !77, line: 60, baseType: !82, size: 32, align: 32, offset: 352)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "foffset", scope: !78, file: !77, line: 61, baseType: !97, size: 128, align: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIOFFSET", file: !77, line: 42, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssioffset_s", file: !77, line: 35, size: 128, align: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !98, file: !77, line: 36, baseType: !41, size: 8, align: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !98, file: !77, line: 40, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DICompositeType(tag: DW_TAG_union_type, scope: !98, file: !77, line: 37, size: 64, align: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !102, file: !77, line: 38, baseType: !82, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !102, file: !77, line: 39, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint64", file: !83, line: 42, baseType: !107)
!107 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "poffset", scope: !78, file: !77, line: 62, baseType: !97, size: 128, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "soffset", scope: !78, file: !77, line: 63, baseType: !97, size: 128, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !78, file: !77, line: 65, baseType: !41, size: 8, align: 8, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !78, file: !77, line: 66, baseType: !41, size: 8, align: 8, offset: 776)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !78, file: !77, line: 70, baseType: !113, size: 64, align: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !78, file: !77, line: 71, baseType: !115, size: 64, align: 64, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !78, file: !77, line: 72, baseType: !115, size: 64, align: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !78, file: !77, line: 73, baseType: !115, size: 64, align: 64, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !78, file: !77, line: 74, baseType: !115, size: 64, align: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !7, file: !6, line: 335, baseType: !120, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!19, !123, !124}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !6, line: 101, size: 3712, align: 64, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !139, !140, !141, !142, !143, !145, !146, !147, !148, !149, !150, !151, !154, !155, !156, !157, !162, !163, !164, !168, !169, !171, !172, !173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !6, line: 113, baseType: !40, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !126, file: !6, line: 114, baseType: !40, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !126, file: !6, line: 115, baseType: !40, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !126, file: !6, line: 116, baseType: !40, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !126, file: !6, line: 117, baseType: !40, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !126, file: !6, line: 118, baseType: !40, size: 64, align: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !126, file: !6, line: 119, baseType: !40, size: 64, align: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !126, file: !6, line: 120, baseType: !19, size: 32, align: 32, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !126, file: !6, line: 121, baseType: !40, size: 64, align: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !126, file: !6, line: 122, baseType: !138, size: 64, align: 64, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !126, file: !6, line: 123, baseType: !19, size: 32, align: 32, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !126, file: !6, line: 134, baseType: !138, size: 64, align: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !126, file: !6, line: 135, baseType: !138, size: 64, align: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !126, file: !6, line: 136, baseType: !138, size: 64, align: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !126, file: !6, line: 144, baseType: !144, size: 32, align: 32, offset: 896)
!144 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !126, file: !6, line: 144, baseType: !144, size: 32, align: 32, offset: 928)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !126, file: !6, line: 145, baseType: !144, size: 32, align: 32, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !126, file: !6, line: 145, baseType: !144, size: 32, align: 32, offset: 992)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !126, file: !6, line: 146, baseType: !144, size: 32, align: 32, offset: 1024)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !126, file: !6, line: 146, baseType: !144, size: 32, align: 32, offset: 1056)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !126, file: !6, line: 155, baseType: !19, size: 32, align: 32, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !126, file: !6, line: 156, baseType: !152, size: 64, align: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !126, file: !6, line: 157, baseType: !152, size: 64, align: 64, offset: 1216)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !126, file: !6, line: 158, baseType: !152, size: 64, align: 64, offset: 1280)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !126, file: !6, line: 159, baseType: !144, size: 32, align: 32, offset: 1344)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !126, file: !6, line: 168, baseType: !158, size: 256, align: 32, offset: 1376)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 256, align: 32, elements: !159)
!159 = !{!160, !161}
!160 = !DISubrange(count: 4)
!161 = !DISubrange(count: 2)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !126, file: !6, line: 169, baseType: !153, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !126, file: !6, line: 170, baseType: !153, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !126, file: !6, line: 174, baseType: !165, size: 640, align: 32, offset: 1792)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 640, align: 32, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 20)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !126, file: !6, line: 175, baseType: !144, size: 32, align: 32, offset: 2432)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !126, file: !6, line: 197, baseType: !170, size: 64, align: 64, offset: 2496)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !126, file: !6, line: 198, baseType: !170, size: 64, align: 64, offset: 2560)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !126, file: !6, line: 199, baseType: !170, size: 64, align: 64, offset: 2624)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !126, file: !6, line: 200, baseType: !174, size: 256, align: 32, offset: 2688)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, align: 32, elements: !159)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !126, file: !6, line: 201, baseType: !138, size: 64, align: 64, offset: 2944)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !126, file: !6, line: 202, baseType: !138, size: 64, align: 64, offset: 3008)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !126, file: !6, line: 203, baseType: !138, size: 64, align: 64, offset: 3072)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !126, file: !6, line: 203, baseType: !138, size: 64, align: 64, offset: 3136)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !126, file: !6, line: 203, baseType: !138, size: 64, align: 64, offset: 3200)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !126, file: !6, line: 203, baseType: !138, size: 64, align: 64, offset: 3264)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !126, file: !6, line: 203, baseType: !138, size: 64, align: 64, offset: 3328)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !126, file: !6, line: 214, baseType: !170, size: 64, align: 64, offset: 3392)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !126, file: !6, line: 215, baseType: !170, size: 64, align: 64, offset: 3456)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !126, file: !6, line: 216, baseType: !19, size: 32, align: 32, offset: 3520)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !126, file: !6, line: 217, baseType: !19, size: 32, align: 32, offset: 3552)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !126, file: !6, line: 222, baseType: !144, size: 32, align: 32, offset: 3584)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !126, file: !6, line: 223, baseType: !144, size: 32, align: 32, offset: 3616)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !6, line: 225, baseType: !19, size: 32, align: 32, offset: 3648)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "is_binary", scope: !7, file: !6, line: 336, baseType: !19, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "byteswap", scope: !7, file: !6, line: 337, baseType: !19, size: 32, align: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !7, file: !6, line: 346, baseType: !19, size: 32, align: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !7, file: !6, line: 347, baseType: !19, size: 32, align: 32, offset: 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !7, file: !6, line: 348, baseType: !97, size: 128, align: 64, offset: 320)
!194 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!195 = !{!196, !215, !222, !227, !230, !238, !246, !255, !260, !272, !278, !287, !295, !304, !316, !342, !358, !365, !380, !386, !394, !401, !405, !412, !416, !423, !429, !436}
!196 = !DISubprogram(name: "HMMFileOpen", scope: !1, file: !1, line: 155, type: !197, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: %struct.hmmfile_s* (i8*, i8*)* @HMMFileOpen, variables: !199)
!197 = !DISubroutineType(types: !198)
!198 = !{!4, !40, !40}
!199 = !{!200, !201, !202, !203, !204, !208, !209, !210, !211}
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfile", arg: 1, scope: !196, file: !1, line: 155, type: !40)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "env", arg: 2, scope: !196, file: !1, line: 155, type: !40)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmmfp", scope: !196, file: !1, line: 157, type: !4)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic", scope: !196, file: !1, line: 158, type: !84)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !196, file: !1, line: 159, type: !205)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 4096, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 512)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssifile", scope: !196, file: !1, line: 160, type: !40)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !196, file: !1, line: 161, type: !40)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !196, file: !1, line: 162, type: !19)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "full", scope: !212, file: !1, line: 189, type: !40)
!212 = distinct !DILexicalBlock(scope: !213, file: !1, line: 188, column: 5)
!213 = distinct !DILexicalBlock(scope: !214, file: !1, line: 187, column: 12)
!214 = distinct !DILexicalBlock(scope: !196, file: !1, line: 179, column: 7)
!215 = !DISubprogram(name: "HMMFileRead", scope: !1, file: !1, line: 324, type: !216, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, %struct.plan7_s**)* @HMMFileRead, variables: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{!19, !4, !124}
!218 = !{!219, !220, !221}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !215, file: !1, line: 324, type: !4)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 2, scope: !215, file: !1, line: 324, type: !124)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !215, file: !1, line: 326, type: !19)
!222 = !DISubprogram(name: "HMMFileClose", scope: !1, file: !1, line: 336, type: !223, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.hmmfile_s*)* @HMMFileClose, variables: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !4}
!225 = !{!226}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !222, file: !1, line: 336, type: !4)
!227 = !DISubprogram(name: "HMMFileRewind", scope: !1, file: !1, line: 343, type: !223, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.hmmfile_s*)* @HMMFileRewind, variables: !228)
!228 = !{!229}
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !227, file: !1, line: 343, type: !4)
!230 = !DISubprogram(name: "HMMFilePositionByName", scope: !1, file: !1, line: 348, type: !231, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, i8*)* @HMMFilePositionByName, variables: !233)
!231 = !DISubroutineType(types: !232)
!232 = !{!19, !4, !40}
!233 = !{!234, !235, !236, !237}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !230, file: !1, line: 348, type: !4)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !230, file: !1, line: 348, type: !40)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !230, file: !1, line: 350, type: !97)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fh", scope: !230, file: !1, line: 351, type: !19)
!238 = !DISubprogram(name: "HMMFilePositionByIndex", scope: !1, file: !1, line: 359, type: !239, isLocal: false, isDefinition: true, scopeLine: 360, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, i32)* @HMMFilePositionByIndex, variables: !241)
!239 = !DISubroutineType(types: !240)
!240 = !{!19, !4, !19}
!241 = !{!242, !243, !244, !245}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !238, file: !1, line: 359, type: !4)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 2, scope: !238, file: !1, line: 359, type: !19)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fh", scope: !238, file: !1, line: 361, type: !19)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !238, file: !1, line: 362, type: !97)
!246 = !DISubprogram(name: "WriteAscHMM", scope: !1, file: !1, line: 385, type: !247, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.plan7_s*)* @WriteAscHMM, variables: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !10, !125}
!249 = !{!250, !251, !252, !253, !254}
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !246, file: !1, line: 385, type: !10)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !246, file: !1, line: 385, type: !125)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !246, file: !1, line: 387, type: !19)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !246, file: !1, line: 388, type: !19)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ts", scope: !246, file: !1, line: 389, type: !19)
!255 = !DISubprogram(name: "WriteBinHMM", scope: !1, file: !1, line: 484, type: !247, isLocal: false, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.plan7_s*)* @WriteBinHMM, variables: !256)
!256 = !{!257, !258, !259}
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !255, file: !1, line: 484, type: !10)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !255, file: !1, line: 484, type: !125)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !255, file: !1, line: 486, type: !19)
!260 = !DISubprogram(name: "read_asc20hmm", scope: !1, file: !1, line: 567, type: !216, isLocal: true, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, %struct.plan7_s**)* @read_asc20hmm, variables: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !260, file: !1, line: 567, type: !4)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 2, scope: !260, file: !1, line: 567, type: !124)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !260, file: !1, line: 569, type: !125)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !260, file: !1, line: 570, type: !205)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !260, file: !1, line: 571, type: !40)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M", scope: !260, file: !1, line: 572, type: !19)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !260, file: !1, line: 573, type: !144)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !260, file: !1, line: 574, type: !19)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !260, file: !1, line: 574, type: !19)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atype", scope: !260, file: !1, line: 575, type: !19)
!272 = !DISubprogram(name: "ascii2prob", scope: !1, file: !1, line: 1286, type: !273, isLocal: true, isDefinition: true, scopeLine: 1287, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, float)* @ascii2prob, variables: !275)
!273 = !DISubroutineType(types: !274)
!274 = !{!144, !40, !144}
!275 = !{!276, !277}
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !272, file: !1, line: 1286, type: !40)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 2, scope: !272, file: !1, line: 1286, type: !144)
!278 = !DISubprogram(name: "read_bin20hmm", scope: !1, file: !1, line: 782, type: !216, isLocal: true, isDefinition: true, scopeLine: 783, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, %struct.plan7_s**)* @read_bin20hmm, variables: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !278, file: !1, line: 782, type: !4)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 2, scope: !278, file: !1, line: 782, type: !124)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !278, file: !1, line: 784, type: !125)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !278, file: !1, line: 785, type: !19)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !278, file: !1, line: 785, type: !19)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !278, file: !1, line: 786, type: !19)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic", scope: !278, file: !1, line: 787, type: !84)
!287 = !DISubprogram(name: "byteswap", scope: !1, file: !1, line: 1313, type: !288, isLocal: true, isDefinition: true, scopeLine: 1314, flags: DIFlagPrototyped, isOptimized: true, variables: !290)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !40, !19}
!290 = !{!291, !292, !293, !294}
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "swap", arg: 1, scope: !287, file: !1, line: 1313, type: !40)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nbytes", arg: 2, scope: !287, file: !1, line: 1313, type: !19)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !287, file: !1, line: 1315, type: !19)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byte", scope: !287, file: !1, line: 1316, type: !41)
!295 = !DISubprogram(name: "read_bin_string", scope: !1, file: !1, line: 1363, type: !296, isLocal: true, isDefinition: true, scopeLine: 1364, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, i8**)* @read_bin_string, variables: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{!19, !10, !19, !113}
!298 = !{!299, !300, !301, !302, !303}
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !295, file: !1, line: 1363, type: !10)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "doswap", arg: 2, scope: !295, file: !1, line: 1363, type: !19)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_s", arg: 3, scope: !295, file: !1, line: 1363, type: !113)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !295, file: !1, line: 1365, type: !40)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !295, file: !1, line: 1366, type: !19)
!304 = !DISubprogram(name: "read_asc19hmm", scope: !1, file: !1, line: 968, type: !216, isLocal: true, isDefinition: true, scopeLine: 969, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, %struct.plan7_s**)* @read_asc19hmm, variables: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !304, file: !1, line: 968, type: !4)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 2, scope: !304, file: !1, line: 968, type: !124)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !304, file: !1, line: 970, type: !125)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !304, file: !1, line: 971, type: !10)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !304, file: !1, line: 972, type: !205)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !304, file: !1, line: 973, type: !40)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M", scope: !304, file: !1, line: 974, type: !19)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !304, file: !1, line: 975, type: !19)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !304, file: !1, line: 976, type: !19)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atype", scope: !304, file: !1, line: 977, type: !19)
!316 = !DISubprogram(name: "read_bin19hmm", scope: !1, file: !1, line: 1119, type: !216, isLocal: true, isDefinition: true, scopeLine: 1120, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, %struct.plan7_s**)* @read_bin19hmm, variables: !317)
!317 = !{!318, !319, !320, !321, !322}
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !316, file: !1, line: 1119, type: !4)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 2, scope: !316, file: !1, line: 1119, type: !124)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic", scope: !316, file: !1, line: 1121, type: !84)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !316, file: !1, line: 1122, type: !125)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p9hmm", scope: !316, file: !1, line: 1123, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan9_s", file: !6, line: 567, size: 1216, align: 64, elements: !325)
!325 = !{!326, !327, !334, !335, !336, !337, !338, !339, !340, !341}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !324, file: !6, line: 568, baseType: !19, size: 32, align: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !324, file: !6, line: 569, baseType: !328, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_state", file: !6, line: 560, size: 736, align: 32, elements: !330)
!330 = !{!331, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !329, file: !6, line: 561, baseType: !332, size: 96, align: 32)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, align: 32, elements: !65)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !329, file: !6, line: 562, baseType: !165, size: 640, align: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !324, file: !6, line: 570, baseType: !328, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !324, file: !6, line: 571, baseType: !328, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !324, file: !6, line: 573, baseType: !165, size: 640, align: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !6, line: 577, baseType: !40, size: 64, align: 64, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !324, file: !6, line: 578, baseType: !40, size: 64, align: 64, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !324, file: !6, line: 579, baseType: !40, size: 64, align: 64, offset: 1024)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "xray", scope: !324, file: !6, line: 580, baseType: !153, size: 64, align: 64, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !324, file: !6, line: 582, baseType: !19, size: 32, align: 32, offset: 1152)
!342 = !DISubprogram(name: "read_plan9_binhmm", scope: !1, file: !1, line: 1439, type: !343, isLocal: true, isDefinition: true, scopeLine: 1440, flags: DIFlagPrototyped, isOptimized: true, function: %struct.plan9_s* (%struct.__sFILE*, i32, i32)* @read_plan9_binhmm, variables: !345)
!343 = !DISubroutineType(types: !344)
!344 = !{!323, !10, !19, !19}
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !342, file: !1, line: 1439, type: !10)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 2, scope: !342, file: !1, line: 1439, type: !19)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "swapped", arg: 3, scope: !342, file: !1, line: 1439, type: !19)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !342, file: !1, line: 1441, type: !323)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M", scope: !342, file: !1, line: 1442, type: !19)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !342, file: !1, line: 1443, type: !19)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !342, file: !1, line: 1444, type: !19)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !342, file: !1, line: 1445, type: !19)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "asize", scope: !342, file: !1, line: 1446, type: !19)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atype", scope: !342, file: !1, line: 1447, type: !19)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abet", scope: !342, file: !1, line: 1448, type: !357)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, align: 8, elements: !166)
!358 = !DISubprogram(name: "read_asc17hmm", scope: !1, file: !1, line: 1144, type: !216, isLocal: true, isDefinition: true, scopeLine: 1145, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.hmmfile_s*, %struct.plan7_s**)* @read_asc17hmm, variables: !359)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmmfp", arg: 1, scope: !358, file: !1, line: 1144, type: !4)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 2, scope: !358, file: !1, line: 1144, type: !124)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !358, file: !1, line: 1146, type: !125)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p9hmm", scope: !358, file: !1, line: 1147, type: !323)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !358, file: !1, line: 1148, type: !205)
!365 = !DISubprogram(name: "read_plan9_aschmm", scope: !1, file: !1, line: 1585, type: !366, isLocal: true, isDefinition: true, scopeLine: 1586, flags: DIFlagPrototyped, isOptimized: true, variables: !368)
!366 = !DISubroutineType(types: !367)
!367 = !{!323, !10, !19}
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!369 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !365, file: !1, line: 1585, type: !10)
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 2, scope: !365, file: !1, line: 1585, type: !19)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !365, file: !1, line: 1587, type: !323)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M", scope: !365, file: !1, line: 1588, type: !19)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !365, file: !1, line: 1589, type: !205)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statetype", scope: !365, file: !1, line: 1590, type: !40)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !365, file: !1, line: 1591, type: !40)
