; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hmmsearch.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.opt_s = type { i8*, i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }
%struct.seqinfo_s = type { i32, [64 x i8], [64 x i8], [64 x i8], [128 x i8], i32, i32, i32, i32, i32, i8*, i8* }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.fancyali_s = type { i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i32, i32 }
%struct.threshold_s = type { float, double, float, double, i32, i32 }
%struct.ReadSeqVars = type { %struct.__sFILE*, i8*, i32, i8*, i32, i32, %struct.ssioffset_s, %struct.ssioffset_s, %struct.ssioffset_s, i32, i32, i32, i32, i32, i32, i8*, %struct.seqinfo_s*, i8*, i32, i32, i32, i32, i32, %struct.msa_struct*, %struct.msafile_struct* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !23, globals: !530, imports: !567)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hmmsearch.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 524, size: 32, align: 32, elements: !16)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "threshold_s", file: !4, line: 518, size: 320, align: 64, elements: !6)
!6 = !{!7, !9, !11, !12, !13, !14}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "globT", scope: !5, file: !4, line: 519, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "globE", scope: !5, file: !4, line: 520, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "domT", scope: !5, file: !4, line: 521, baseType: !8, size: 32, align: 32, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "domE", scope: !5, file: !4, line: 522, baseType: !10, size: 64, align: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "autocut", scope: !5, file: !4, line: 524, baseType: !3, size: 32, align: 32, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !5, file: !4, line: 525, baseType: !15, size: 32, align: 32, offset: 288)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "CUT_NONE", value: 0)
!18 = !DIEnumerator(name: "CUT_GA", value: 1)
!19 = !DIEnumerator(name: "CUT_NC", value: 2)
!20 = !DIEnumerator(name: "CUT_TC", value: 3)
!21 = !{!22, !10}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !{!24, !457, !503, !515}
!24 = !DISubprogram(name: "main", scope: !1, file: !1, line: 154, type: !25, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**)* @main, variables: !30)
!25 = !DISubroutineType(types: !26)
!26 = !{!15, !15, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !{!31, !32, !33, !34, !218, !219, !356, !357, !358, !359, !376, !390, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !24, file: !1, line: 154, type: !15)
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !24, file: !1, line: 154, type: !27)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmmfile", scope: !24, file: !1, line: 156, type: !28)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmmfp", scope: !24, file: !1, line: 157, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMMFILE", file: !4, line: 350, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "hmmfile_s", file: !4, line: 332, size: 448, align: 64, elements: !38)
!38 = !{!39, !100, !144, !213, !214, !215, !216, !217}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !37, file: !4, line: 333, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !42, line: 153, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !42, line: 122, size: 1216, align: 64, elements: !44)
!44 = !{!45, !48, !49, !50, !52, !53, !58, !59, !60, !64, !68, !78, !84, !85, !88, !89, !93, !97, !98, !99}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !43, file: !42, line: 123, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !43, file: !42, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !43, file: !42, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !43, file: !42, line: 126, baseType: !51, size: 16, align: 16, offset: 128)
!51 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !43, file: !42, line: 127, baseType: !51, size: 16, align: 16, offset: 144)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !43, file: !42, line: 128, baseType: !54, size: 128, align: 64, offset: 192)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !42, line: 88, size: 128, align: 64, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !54, file: !42, line: 89, baseType: !46, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !54, file: !42, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !43, file: !42, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !43, file: !42, line: 132, baseType: !22, size: 64, align: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !43, file: !42, line: 133, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!15, !22}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !43, file: !42, line: 134, baseType: !65, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!15, !22, !28, !15}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !43, file: !42, line: 135, baseType: !69, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !22, !72, !15}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !42, line: 77, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !74, line: 71, baseType: !75)
!74 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !43, file: !42, line: 136, baseType: !79, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!15, !22, !82, !15}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !43, file: !42, line: 139, baseType: !54, size: 128, align: 64, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !43, file: !42, line: 140, baseType: !86, size: 64, align: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !42, line: 94, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !43, file: !42, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !43, file: !42, line: 144, baseType: !90, size: 24, align: 8, offset: 928)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 24, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 3)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !43, file: !42, line: 145, baseType: !94, size: 8, align: 8, offset: 952)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !43, file: !42, line: 148, baseType: !54, size: 128, align: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !43, file: !42, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !43, file: !42, line: 152, baseType: !72, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ssi", scope: !37, file: !4, line: 334, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIFILE", file: !103, line: 76, baseType: !104)
!103 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssifile_s", file: !103, line: 49, size: 1152, align: 64, elements: !105)
!105 = !{!106, !107, !111, !114, !115, !116, !117, !118, !119, !120, !121, !122, !134, !135, !136, !137, !138, !139, !141, !142, !143}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !104, file: !103, line: 50, baseType: !40, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !103, line: 51, baseType: !108, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !109, line: 41, baseType: !110)
!109 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !104, file: !103, line: 52, baseType: !112, size: 16, align: 16, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !109, line: 40, baseType: !113)
!113 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !104, file: !103, line: 53, baseType: !108, size: 32, align: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !104, file: !103, line: 54, baseType: !108, size: 32, align: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !104, file: !103, line: 55, baseType: !108, size: 32, align: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !104, file: !103, line: 56, baseType: !108, size: 32, align: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !104, file: !103, line: 57, baseType: !108, size: 32, align: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "frecsize", scope: !104, file: !103, line: 58, baseType: !108, size: 32, align: 32, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "precsize", scope: !104, file: !103, line: 59, baseType: !108, size: 32, align: 32, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "srecsize", scope: !104, file: !103, line: 60, baseType: !108, size: 32, align: 32, offset: 352)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "foffset", scope: !104, file: !103, line: 61, baseType: !123, size: 128, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIOFFSET", file: !103, line: 42, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssioffset_s", file: !103, line: 35, size: 128, align: 64, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !124, file: !103, line: 36, baseType: !29, size: 8, align: 8)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !124, file: !103, line: 40, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !103, line: 37, size: 64, align: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !128, file: !103, line: 38, baseType: !108, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !128, file: !103, line: 39, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint64", file: !109, line: 42, baseType: !133)
!133 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "poffset", scope: !104, file: !103, line: 62, baseType: !123, size: 128, align: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "soffset", scope: !104, file: !103, line: 63, baseType: !123, size: 128, align: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !104, file: !103, line: 65, baseType: !29, size: 8, align: 8, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !104, file: !103, line: 66, baseType: !29, size: 8, align: 8, offset: 776)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !104, file: !103, line: 70, baseType: !27, size: 64, align: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !104, file: !103, line: 71, baseType: !140, size: 64, align: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !104, file: !103, line: 72, baseType: !140, size: 64, align: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !104, file: !103, line: 73, baseType: !140, size: 64, align: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !104, file: !103, line: 74, baseType: !140, size: 64, align: 64, offset: 1088)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !37, file: !4, line: 335, baseType: !145, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!15, !148, !149}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !4, line: 101, size: 3712, align: 64, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !178, !179, !180, !181, !186, !187, !188, !192, !193, !195, !196, !197, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !4, line: 113, baseType: !28, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !151, file: !4, line: 114, baseType: !28, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !151, file: !4, line: 115, baseType: !28, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !151, file: !4, line: 116, baseType: !28, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !151, file: !4, line: 117, baseType: !28, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !151, file: !4, line: 118, baseType: !28, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !151, file: !4, line: 119, baseType: !28, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !151, file: !4, line: 120, baseType: !15, size: 32, align: 32, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !151, file: !4, line: 121, baseType: !28, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !151, file: !4, line: 122, baseType: !163, size: 64, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !151, file: !4, line: 123, baseType: !15, size: 32, align: 32, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !151, file: !4, line: 134, baseType: !163, size: 64, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !151, file: !4, line: 135, baseType: !163, size: 64, align: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !151, file: !4, line: 136, baseType: !163, size: 64, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !151, file: !4, line: 144, baseType: !8, size: 32, align: 32, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !151, file: !4, line: 144, baseType: !8, size: 32, align: 32, offset: 928)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !151, file: !4, line: 145, baseType: !8, size: 32, align: 32, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !151, file: !4, line: 145, baseType: !8, size: 32, align: 32, offset: 992)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !151, file: !4, line: 146, baseType: !8, size: 32, align: 32, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !151, file: !4, line: 146, baseType: !8, size: 32, align: 32, offset: 1056)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !151, file: !4, line: 155, baseType: !15, size: 32, align: 32, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !151, file: !4, line: 156, baseType: !176, size: 64, align: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !151, file: !4, line: 157, baseType: !176, size: 64, align: 64, offset: 1216)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !151, file: !4, line: 158, baseType: !176, size: 64, align: 64, offset: 1280)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !151, file: !4, line: 159, baseType: !8, size: 32, align: 32, offset: 1344)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !151, file: !4, line: 168, baseType: !182, size: 256, align: 32, offset: 1376)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, align: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DISubrange(count: 4)
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !151, file: !4, line: 169, baseType: !177, size: 64, align: 64, offset: 1664)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !151, file: !4, line: 170, baseType: !177, size: 64, align: 64, offset: 1728)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !151, file: !4, line: 174, baseType: !189, size: 640, align: 32, offset: 1792)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 640, align: 32, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 20)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !151, file: !4, line: 175, baseType: !8, size: 32, align: 32, offset: 2432)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !151, file: !4, line: 197, baseType: !194, size: 64, align: 64, offset: 2496)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !151, file: !4, line: 198, baseType: !194, size: 64, align: 64, offset: 2560)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !151, file: !4, line: 199, baseType: !194, size: 64, align: 64, offset: 2624)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !151, file: !4, line: 200, baseType: !198, size: 256, align: 32, offset: 2688)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, align: 32, elements: !183)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !151, file: !4, line: 201, baseType: !163, size: 64, align: 64, offset: 2944)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !151, file: !4, line: 202, baseType: !163, size: 64, align: 64, offset: 3008)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !151, file: !4, line: 203, baseType: !163, size: 64, align: 64, offset: 3072)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !151, file: !4, line: 203, baseType: !163, size: 64, align: 64, offset: 3136)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !151, file: !4, line: 203, baseType: !163, size: 64, align: 64, offset: 3200)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !151, file: !4, line: 203, baseType: !163, size: 64, align: 64, offset: 3264)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !151, file: !4, line: 203, baseType: !163, size: 64, align: 64, offset: 3328)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !151, file: !4, line: 214, baseType: !194, size: 64, align: 64, offset: 3392)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !151, file: !4, line: 215, baseType: !194, size: 64, align: 64, offset: 3456)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !151, file: !4, line: 216, baseType: !15, size: 32, align: 32, offset: 3520)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !151, file: !4, line: 217, baseType: !15, size: 32, align: 32, offset: 3552)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !151, file: !4, line: 222, baseType: !8, size: 32, align: 32, offset: 3584)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !151, file: !4, line: 223, baseType: !8, size: 32, align: 32, offset: 3616)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !151, file: !4, line: 225, baseType: !15, size: 32, align: 32, offset: 3648)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_binary", scope: !37, file: !4, line: 336, baseType: !15, size: 32, align: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "byteswap", scope: !37, file: !4, line: 337, baseType: !15, size: 32, align: 32, offset: 224)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !37, file: !4, line: 346, baseType: !15, size: 32, align: 32, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !37, file: !4, line: 347, baseType: !15, size: 32, align: 32, offset: 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !37, file: !4, line: 348, baseType: !123, size: 128, align: 64, offset: 320)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seqfile", scope: !24, file: !1, line: 158, type: !28)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqfp", scope: !24, file: !1, line: 159, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "SQFILE", file: !109, line: 240, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadSeqVars", file: !109, line: 197, size: 1408, align: 64, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !263, !264, !265, !266, !267, !268, !269, !342}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !222, file: !109, line: 198, baseType: !40, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !222, file: !109, line: 199, baseType: !28, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "linenumber", scope: !222, file: !109, line: 200, baseType: !15, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !222, file: !109, line: 202, baseType: !28, size: 64, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !222, file: !109, line: 203, baseType: !15, size: 32, align: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ssimode", scope: !222, file: !109, line: 205, baseType: !15, size: 32, align: 32, offset: 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ssioffset", scope: !222, file: !109, line: 206, baseType: !123, size: 128, align: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "r_off", scope: !222, file: !109, line: 207, baseType: !123, size: 128, align: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !222, file: !109, line: 208, baseType: !123, size: 128, align: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !222, file: !109, line: 210, baseType: !15, size: 32, align: 32, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lastrpl", scope: !222, file: !109, line: 211, baseType: !15, size: 32, align: 32, offset: 736)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "maxrpl", scope: !222, file: !109, line: 212, baseType: !15, size: 32, align: 32, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !222, file: !109, line: 213, baseType: !15, size: 32, align: 32, offset: 800)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lastbpl", scope: !222, file: !109, line: 214, baseType: !15, size: 32, align: 32, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "maxbpl", scope: !222, file: !109, line: 215, baseType: !15, size: 32, align: 32, offset: 864)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !222, file: !109, line: 217, baseType: !28, size: 64, align: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sqinfo", scope: !222, file: !109, line: 218, baseType: !241, size: 64, align: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "SQINFO", file: !109, line: 98, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "seqinfo_s", file: !109, line: 84, size: 2880, align: 64, elements: !244)
!244 = !{!245, !246, !250, !251, !252, !256, !257, !258, !259, !260, !261, !262}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !109, line: 85, baseType: !15, size: 32, align: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !109, line: 86, baseType: !247, size: 512, align: 8, offset: 32)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 8, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !243, file: !109, line: 87, baseType: !247, size: 512, align: 8, offset: 544)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !243, file: !109, line: 88, baseType: !247, size: 512, align: 8, offset: 1056)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !243, file: !109, line: 89, baseType: !253, size: 1024, align: 8, offset: 1568)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, align: 8, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !109, line: 90, baseType: !15, size: 32, align: 32, offset: 2592)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !243, file: !109, line: 91, baseType: !15, size: 32, align: 32, offset: 2624)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !243, file: !109, line: 92, baseType: !15, size: 32, align: 32, offset: 2656)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "olen", scope: !243, file: !109, line: 93, baseType: !15, size: 32, align: 32, offset: 2688)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !109, line: 94, baseType: !15, size: 32, align: 32, offset: 2720)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !243, file: !109, line: 95, baseType: !28, size: 64, align: 64, offset: 2752)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !243, file: !109, line: 96, baseType: !28, size: 64, align: 64, offset: 2816)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !222, file: !109, line: 219, baseType: !28, size: 64, align: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "seqlen", scope: !222, file: !109, line: 220, baseType: !15, size: 32, align: 32, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "maxseq", scope: !222, file: !109, line: 221, baseType: !15, size: 32, align: 32, offset: 1120)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !222, file: !109, line: 223, baseType: !15, size: 32, align: 32, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "do_gzip", scope: !222, file: !109, line: 224, baseType: !15, size: 32, align: 32, offset: 1184)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "do_stdin", scope: !222, file: !109, line: 225, baseType: !15, size: 32, align: 32, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "msa", scope: !222, file: !109, line: 237, baseType: !270, size: 64, align: 64, offset: 1280)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !272, line: 177, baseType: !273)
!272 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !272, line: 112, size: 2880, align: 64, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !297, !299, !300, !301, !302, !303, !304, !305, !306, !307, !309, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !273, file: !272, line: 115, baseType: !27, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !273, file: !272, line: 116, baseType: !27, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !273, file: !272, line: 117, baseType: !177, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !273, file: !272, line: 118, baseType: !15, size: 32, align: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !273, file: !272, line: 119, baseType: !15, size: 32, align: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !272, line: 123, baseType: !15, size: 32, align: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !273, file: !272, line: 124, baseType: !15, size: 32, align: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !272, line: 125, baseType: !28, size: 64, align: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !273, file: !272, line: 126, baseType: !28, size: 64, align: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !273, file: !272, line: 127, baseType: !28, size: 64, align: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !273, file: !272, line: 128, baseType: !28, size: 64, align: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !273, file: !272, line: 129, baseType: !28, size: 64, align: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !273, file: !272, line: 130, baseType: !28, size: 64, align: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !273, file: !272, line: 131, baseType: !28, size: 64, align: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !273, file: !272, line: 132, baseType: !27, size: 64, align: 64, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !273, file: !272, line: 133, baseType: !27, size: 64, align: 64, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !273, file: !272, line: 134, baseType: !27, size: 64, align: 64, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !273, file: !272, line: 135, baseType: !27, size: 64, align: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !273, file: !272, line: 136, baseType: !294, size: 192, align: 32, offset: 1024)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 192, align: 32, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 6)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !273, file: !272, line: 137, baseType: !298, size: 192, align: 32, offset: 1216)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, align: 32, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !273, file: !272, line: 144, baseType: !27, size: 64, align: 64, offset: 1408)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !273, file: !272, line: 145, baseType: !15, size: 32, align: 32, offset: 1472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !273, file: !272, line: 146, baseType: !15, size: 32, align: 32, offset: 1504)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !273, file: !272, line: 148, baseType: !27, size: 64, align: 64, offset: 1536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !273, file: !272, line: 149, baseType: !27, size: 64, align: 64, offset: 1600)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !273, file: !272, line: 150, baseType: !15, size: 32, align: 32, offset: 1664)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !273, file: !272, line: 151, baseType: !15, size: 32, align: 32, offset: 1696)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !273, file: !272, line: 153, baseType: !27, size: 64, align: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !273, file: !272, line: 154, baseType: !308, size: 64, align: 64, offset: 1792)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !273, file: !272, line: 155, baseType: !310, size: 64, align: 64, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !312, line: 42, baseType: !313)
!312 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!313 = !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 36, size: 192, align: 64, elements: !314)
!314 = !{!315, !323, !324, !325}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !313, file: !312, line: 37, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !312, line: 26, size: 192, align: 64, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !318, file: !312, line: 27, baseType: !28, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !318, file: !312, line: 28, baseType: !15, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !318, file: !312, line: 29, baseType: !317, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !313, file: !312, line: 39, baseType: !15, size: 32, align: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !313, file: !312, line: 40, baseType: !15, size: 32, align: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !313, file: !312, line: 41, baseType: !15, size: 32, align: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !273, file: !272, line: 156, baseType: !15, size: 32, align: 32, offset: 1920)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !273, file: !272, line: 158, baseType: !27, size: 64, align: 64, offset: 1984)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !273, file: !272, line: 159, baseType: !27, size: 64, align: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !273, file: !272, line: 160, baseType: !310, size: 64, align: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !273, file: !272, line: 161, baseType: !15, size: 32, align: 32, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !273, file: !272, line: 163, baseType: !27, size: 64, align: 64, offset: 2240)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !273, file: !272, line: 164, baseType: !308, size: 64, align: 64, offset: 2304)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !273, file: !272, line: 165, baseType: !310, size: 64, align: 64, offset: 2368)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !273, file: !272, line: 166, baseType: !15, size: 32, align: 32, offset: 2432)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !273, file: !272, line: 170, baseType: !310, size: 64, align: 64, offset: 2496)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !273, file: !272, line: 171, baseType: !15, size: 32, align: 32, offset: 2560)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !273, file: !272, line: 172, baseType: !15, size: 32, align: 32, offset: 2592)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !273, file: !272, line: 173, baseType: !163, size: 64, align: 64, offset: 2624)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !273, file: !272, line: 174, baseType: !163, size: 64, align: 64, offset: 2688)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !273, file: !272, line: 175, baseType: !163, size: 64, align: 64, offset: 2752)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !273, file: !272, line: 176, baseType: !15, size: 32, align: 32, offset: 2816)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "afp", scope: !222, file: !109, line: 238, baseType: !343, size: 64, align: 64, offset: 1344)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSAFILE", file: !272, line: 199, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "msafile_struct", file: !272, line: 186, size: 512, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !345, file: !272, line: 187, baseType: !40, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !345, file: !272, line: 188, baseType: !28, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "linenumber", scope: !345, file: !272, line: 189, baseType: !15, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !272, line: 191, baseType: !28, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !345, file: !272, line: 192, baseType: !15, size: 32, align: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ssi", scope: !345, file: !272, line: 194, baseType: !101, size: 64, align: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "do_gzip", scope: !345, file: !272, line: 196, baseType: !15, size: 32, align: 32, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "do_stdin", scope: !345, file: !272, line: 197, baseType: !15, size: 32, align: 32, offset: 416)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !345, file: !272, line: 198, baseType: !15, size: 32, align: 32, offset: 448)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !24, file: !1, line: 160, type: !15)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !24, file: !1, line: 161, type: !15)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !24, file: !1, line: 162, type: !150)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "histogram", scope: !24, file: !1, line: 163, type: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "histogram_s", file: !4, line: 419, size: 512, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !374, !375}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "histogram", scope: !361, file: !4, line: 420, baseType: !163, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !361, file: !4, line: 421, baseType: !15, size: 32, align: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !361, file: !4, line: 422, baseType: !15, size: 32, align: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "highscore", scope: !361, file: !4, line: 423, baseType: !15, size: 32, align: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "lowscore", scope: !361, file: !4, line: 424, baseType: !15, size: 32, align: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lumpsize", scope: !361, file: !4, line: 425, baseType: !15, size: 32, align: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !361, file: !4, line: 426, baseType: !15, size: 32, align: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "expect", scope: !361, file: !4, line: 428, baseType: !177, size: 64, align: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fit_type", scope: !361, file: !4, line: 429, baseType: !15, size: 32, align: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !361, file: !4, line: 430, baseType: !373, size: 96, align: 32, offset: 352)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, align: 32, elements: !91)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "chisq", scope: !361, file: !4, line: 431, baseType: !8, size: 32, align: 32, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "chip", scope: !361, file: !4, line: 432, baseType: !8, size: 32, align: 32, offset: 480)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ali", scope: !24, file: !1, line: 164, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "fancyali_s", file: !4, line: 447, size: 576, align: 64, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rfline", scope: !378, file: !4, line: 448, baseType: !28, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "csline", scope: !378, file: !4, line: 449, baseType: !28, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !378, file: !4, line: 450, baseType: !28, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mline", scope: !378, file: !4, line: 451, baseType: !28, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !378, file: !4, line: 452, baseType: !28, size: 64, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !378, file: !4, line: 453, baseType: !15, size: 32, align: 32, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !378, file: !4, line: 454, baseType: !28, size: 64, align: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !378, file: !4, line: 455, baseType: !28, size: 64, align: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sqfrom", scope: !378, file: !4, line: 456, baseType: !15, size: 32, align: 32, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sqto", scope: !378, file: !4, line: 457, baseType: !15, size: 32, align: 32, offset: 544)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghit", scope: !24, file: !1, line: 165, type: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "tophit_s", file: !4, line: 497, size: 256, align: 64, elements: !393)
!393 = !{!394, !416, !417, !418, !419}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !392, file: !4, line: 498, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "hit_s", file: !4, line: 470, size: 832, align: 64, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sortkey", scope: !397, file: !4, line: 471, baseType: !10, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !397, file: !4, line: 472, baseType: !8, size: 32, align: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pvalue", scope: !397, file: !4, line: 473, baseType: !10, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mothersc", scope: !397, file: !4, line: 474, baseType: !8, size: 32, align: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "motherp", scope: !397, file: !4, line: 475, baseType: !10, size: 64, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !4, line: 476, baseType: !28, size: 64, align: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !397, file: !4, line: 477, baseType: !28, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !397, file: !4, line: 478, baseType: !28, size: 64, align: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sqfrom", scope: !397, file: !4, line: 479, baseType: !15, size: 32, align: 32, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sqto", scope: !397, file: !4, line: 480, baseType: !15, size: 32, align: 32, offset: 544)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !397, file: !4, line: 481, baseType: !15, size: 32, align: 32, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hmmfrom", scope: !397, file: !4, line: 482, baseType: !15, size: 32, align: 32, offset: 608)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hmmto", scope: !397, file: !4, line: 483, baseType: !15, size: 32, align: 32, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "hmmlen", scope: !397, file: !4, line: 484, baseType: !15, size: 32, align: 32, offset: 672)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "domidx", scope: !397, file: !4, line: 485, baseType: !15, size: 32, align: 32, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ndom", scope: !397, file: !4, line: 486, baseType: !15, size: 32, align: 32, offset: 736)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ali", scope: !397, file: !4, line: 487, baseType: !377, size: 64, align: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "unsrt", scope: !392, file: !4, line: 499, baseType: !396, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !392, file: !4, line: 500, baseType: !15, size: 32, align: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !392, file: !4, line: 501, baseType: !15, size: 32, align: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lump", scope: !392, file: !4, line: 502, baseType: !15, size: 32, align: 32, offset: 192)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dhit", scope: !24, file: !1, line: 166, type: !391)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !24, file: !1, line: 168, type: !8)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pvalue", scope: !24, file: !1, line: 169, type: !10)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "evalue", scope: !24, file: !1, line: 170, type: !10)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "motherp", scope: !24, file: !1, line: 171, type: !10)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mothersc", scope: !24, file: !1, line: 172, type: !8)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqfrom", scope: !24, file: !1, line: 173, type: !15)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqto", scope: !24, file: !1, line: 173, type: !15)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmmfrom", scope: !24, file: !1, line: 174, type: !15)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmmto", scope: !24, file: !1, line: 174, type: !15)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !24, file: !1, line: 175, type: !28)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "desc", scope: !24, file: !1, line: 175, type: !28)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqlen", scope: !24, file: !1, line: 176, type: !15)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nseq", scope: !24, file: !1, line: 177, type: !15)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Z", scope: !24, file: !1, line: 178, type: !15)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domidx", scope: !24, file: !1, line: 179, type: !15)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !24, file: !1, line: 180, type: !15)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namewidth", scope: !24, file: !1, line: 181, type: !15)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descwidth", scope: !24, file: !1, line: 182, type: !15)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nreported", scope: !24, file: !1, line: 183, type: !15)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Alimit", scope: !24, file: !1, line: 185, type: !15)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thresh", scope: !24, file: !1, line: 186, type: !5)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "optname", scope: !24, file: !1, line: 188, type: !28)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "optarg", scope: !24, file: !1, line: 189, type: !28)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "optind", scope: !24, file: !1, line: 190, type: !15)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_null2", scope: !24, file: !1, line: 191, type: !15)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_forward", scope: !24, file: !1, line: 192, type: !15)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_xnu", scope: !24, file: !1, line: 193, type: !15)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_pvm", scope: !24, file: !1, line: 194, type: !15)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "be_backwards", scope: !24, file: !1, line: 195, type: !15)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_threads", scope: !24, file: !1, line: 196, type: !15)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threads_support", scope: !24, file: !1, line: 197, type: !15)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pvm_support", scope: !24, file: !1, line: 198, type: !15)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "safedesc", scope: !454, file: !1, line: 418, type: !28)
!454 = distinct !DILexicalBlock(scope: !455, file: !1, line: 417, column: 5)
!455 = distinct !DILexicalBlock(scope: !456, file: !1, line: 416, column: 3)
!456 = distinct !DILexicalBlock(scope: !24, file: !1, line: 416, column: 3)
!457 = !DISubprogram(name: "main_loop_serial", scope: !1, file: !1, line: 598, type: !458, isLocal: true, isDefinition: true, scopeLine: 602, flags: DIFlagPrototyped, isOptimized: true, variables: !461)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !150, !220, !460, !15, !15, !15, !360, !391, !391, !163}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !488, !496, !497, !498, !499, !500, !501, !502}
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !457, file: !1, line: 598, type: !150)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqfp", arg: 2, scope: !457, file: !1, line: 598, type: !220)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thresh", arg: 3, scope: !457, file: !1, line: 598, type: !460)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_forward", arg: 4, scope: !457, file: !1, line: 598, type: !15)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_null2", arg: 5, scope: !457, file: !1, line: 599, type: !15)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_xnu", arg: 6, scope: !457, file: !1, line: 599, type: !15)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "histogram", arg: 7, scope: !457, file: !1, line: 600, type: !360)
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghit", arg: 8, scope: !457, file: !1, line: 601, type: !391)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dhit", arg: 9, scope: !457, file: !1, line: 601, type: !391)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_nseq", arg: 10, scope: !457, file: !1, line: 601, type: !163)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !457, file: !1, line: 603, type: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpmatrix_s", file: !4, line: 289, size: 640, align: 64, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !474, file: !4, line: 290, baseType: !194, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mmx", scope: !474, file: !4, line: 291, baseType: !194, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "imx", scope: !474, file: !4, line: 292, baseType: !194, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dmx", scope: !474, file: !4, line: 293, baseType: !194, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "xmx_mem", scope: !474, file: !4, line: 299, baseType: !22, size: 64, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mmx_mem", scope: !474, file: !4, line: 299, baseType: !22, size: 64, align: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "imx_mem", scope: !474, file: !4, line: 299, baseType: !22, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dmx_mem", scope: !474, file: !4, line: 299, baseType: !22, size: 64, align: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "maxN", scope: !474, file: !4, line: 308, baseType: !15, size: 32, align: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "maxM", scope: !474, file: !4, line: 309, baseType: !15, size: 32, align: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "padN", scope: !474, file: !4, line: 311, baseType: !15, size: 32, align: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "padM", scope: !474, file: !4, line: 312, baseType: !15, size: 32, align: 32, offset: 608)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !457, file: !1, line: 604, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !4, line: 374, size: 256, align: 64, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !490, file: !4, line: 375, baseType: !15, size: 32, align: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !490, file: !4, line: 376, baseType: !28, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !490, file: !4, line: 377, baseType: !163, size: 64, align: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !490, file: !4, line: 378, baseType: !163, size: 64, align: 64, offset: 192)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !457, file: !1, line: 605, type: !28)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsq", scope: !457, file: !1, line: 606, type: !28)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqinfo", scope: !457, file: !1, line: 607, type: !242)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !457, file: !1, line: 608, type: !8)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pvalue", scope: !457, file: !1, line: 609, type: !10)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "evalue", scope: !457, file: !1, line: 610, type: !10)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nseq", scope: !457, file: !1, line: 611, type: !15)
!503 = !DISubprogram(name: "main_loop_pvm", scope: !1, file: !1, line: 932, type: !458, isLocal: true, isDefinition: true, scopeLine: 935, flags: DIFlagPrototyped, isOptimized: true, variables: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !503, file: !1, line: 932, type: !150)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqfp", arg: 2, scope: !503, file: !1, line: 932, type: !220)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thresh", arg: 3, scope: !503, file: !1, line: 932, type: !460)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_forward", arg: 4, scope: !503, file: !1, line: 932, type: !15)
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_null2", arg: 5, scope: !503, file: !1, line: 933, type: !15)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_xnu", arg: 6, scope: !503, file: !1, line: 933, type: !15)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "histogram", arg: 7, scope: !503, file: !1, line: 933, type: !360)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghit", arg: 8, scope: !503, file: !1, line: 934, type: !391)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dhit", arg: 9, scope: !503, file: !1, line: 934, type: !391)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_nseq", arg: 10, scope: !503, file: !1, line: 934, type: !163)
!515 = !DISubprogram(name: "main_loop_threaded", scope: !1, file: !1, line: 1211, type: !516, isLocal: true, isDefinition: true, scopeLine: 1215, flags: DIFlagPrototyped, isOptimized: true, variables: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !150, !220, !460, !15, !15, !15, !15, !360, !391, !391, !163}
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !515, file: !1, line: 1211, type: !150)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqfp", arg: 2, scope: !515, file: !1, line: 1211, type: !220)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thresh", arg: 3, scope: !515, file: !1, line: 1211, type: !460)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_forward", arg: 4, scope: !515, file: !1, line: 1211, type: !15)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_null2", arg: 5, scope: !515, file: !1, line: 1212, type: !15)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_xnu", arg: 6, scope: !515, file: !1, line: 1212, type: !15)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_threads", arg: 7, scope: !515, file: !1, line: 1212, type: !15)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "histogram", arg: 8, scope: !515, file: !1, line: 1213, type: !360)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghit", arg: 9, scope: !515, file: !1, line: 1214, type: !391)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dhit", arg: 10, scope: !515, file: !1, line: 1214, type: !391)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_nseq", arg: 11, scope: !515, file: !1, line: 1214, type: !163)
!530 = !{!531, !536, !537, !538, !539, !543, !546, !555, !559, !563}
!531 = !DIGlobalVariable(name: "Alphabet", scope: !0, file: !532, line: 19, type: !533, isLocal: false, isDefinition: true, variable: [25 x i8]* @Alphabet)
!532 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/globals.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 200, align: 8, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 25)
!536 = !DIGlobalVariable(name: "Alphabet_type", scope: !0, file: !532, line: 20, type: !15, isLocal: false, isDefinition: true, variable: i32* @Alphabet_type)
!537 = !DIGlobalVariable(name: "Alphabet_size", scope: !0, file: !532, line: 21, type: !15, isLocal: false, isDefinition: true, variable: i32* @Alphabet_size)
!538 = !DIGlobalVariable(name: "Alphabet_iupac", scope: !0, file: !532, line: 22, type: !15, isLocal: false, isDefinition: true, variable: i32* @Alphabet_iupac)
!539 = !DIGlobalVariable(name: "Degenerate", scope: !0, file: !532, line: 23, type: !540, isLocal: false, isDefinition: true, variable: [24 x [20 x i8]]* @Degenerate)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 3840, align: 8, elements: !541)
!541 = !{!542, !191}
!542 = !DISubrange(count: 24)
!543 = !DIGlobalVariable(name: "DegenCount", scope: !0, file: !532, line: 24, type: !544, isLocal: false, isDefinition: true, variable: [24 x i32]* @DegenCount)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 768, align: 32, elements: !545)
!545 = !{!542}
!546 = !DIGlobalVariable(name: "OPTIONS", scope: !0, file: !1, line: 72, type: !547, isLocal: true, isDefinition: true, variable: [17 x %struct.opt_s]* @OPTIONS)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 2176, align: 64, elements: !553)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "opt_s", file: !109, line: 330, size: 128, align: 64, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !548, file: !109, line: 331, baseType: !28, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "single", scope: !548, file: !109, line: 332, baseType: !15, size: 32, align: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "argtype", scope: !548, file: !109, line: 333, baseType: !15, size: 32, align: 32, offset: 96)
!553 = !{!554}
!554 = !DISubrange(count: 17)
!555 = !DIGlobalVariable(name: "usage", scope: !0, file: !1, line: 47, type: !556, isLocal: true, isDefinition: true, variable: [382 x i8]* @usage)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 3056, align: 8, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 382)
!559 = !DIGlobalVariable(name: "banner", scope: !0, file: !1, line: 45, type: !560, isLocal: true, isDefinition: true, variable: [58 x i8]* @banner)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 464, align: 8, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 58)
!563 = !DIGlobalVariable(name: "experts", scope: !0, file: !1, line: 57, type: !564, isLocal: true, isDefinition: true, variable: [759 x i8]* @experts)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 6072, align: 8, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 759)
!567 = !{}
!568 = !{i32 2, !"Dwarf Version", i32 2}
!569 = !{i32 2, !"Debug Info Version", i32 700000003}
!570 = !{i32 1, !"PIC Level", i32 2}
!571 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!572 = !DIExpression()
!573 = !DILocation(line: 154, column: 10, scope: !24)
!574 = !DILocation(line: 154, column: 23, scope: !24)
!575 = !DILocation(line: 186, column: 3, scope: !24)
!576 = !DILocation(line: 160, column: 13, scope: !24)
!577 = !DILocation(line: 192, column: 9, scope: !24)
!578 = !DILocation(line: 191, column: 9, scope: !24)
!579 = !DILocation(line: 193, column: 9, scope: !24)
!580 = !DILocation(line: 194, column: 9, scope: !24)
!581 = !DILocation(line: 178, column: 11, scope: !24)
!582 = !DILocation(line: 195, column: 9, scope: !24)
!583 = !DILocation(line: 198, column: 9, scope: !24)
!584 = !DILocation(line: 197, column: 9, scope: !24)
!585 = !DILocation(line: 196, column: 9, scope: !24)
!586 = !DILocation(line: 185, column: 10, scope: !24)
!587 = !DILocation(line: 230, column: 10, scope: !24)
!588 = !DILocation(line: 230, column: 18, scope: !24)
!589 = !{!590, !594, i64 8}
!590 = !{!"threshold_s", !591, i64 0, !594, i64 8, !591, i64 16, !594, i64 24, !592, i64 32, !595, i64 36}
!591 = !{!"float", !592, i64 0}
!592 = !{!"omnipotent char", !593, i64 0}
!593 = !{!"Simple C/C++ TBAA"}
!594 = !{!"double", !592, i64 0}
!595 = !{!"int", !592, i64 0}
!596 = !DILocation(line: 231, column: 10, scope: !24)
!597 = !DILocation(line: 231, column: 18, scope: !24)
!598 = !{!590, !591, i64 0}
!599 = !DILocation(line: 232, column: 10, scope: !24)
!600 = !DILocation(line: 232, column: 18, scope: !24)
!601 = !{!590, !591, i64 16}
!602 = !DILocation(line: 233, column: 10, scope: !24)
!603 = !DILocation(line: 233, column: 18, scope: !24)
!604 = !{!590, !594, i64 24}
!605 = !DILocation(line: 234, column: 10, scope: !24)
!606 = !DILocation(line: 234, column: 18, scope: !24)
!607 = !{!590, !592, i64 32}
!608 = !DILocation(line: 235, column: 10, scope: !24)
!609 = !DILocation(line: 235, column: 18, scope: !24)
!610 = !{!590, !595, i64 36}
!611 = !DILocation(line: 188, column: 9, scope: !24)
!612 = !DILocation(line: 189, column: 9, scope: !24)
!613 = !DILocation(line: 190, column: 9, scope: !24)
!614 = !DILocation(line: 237, column: 10, scope: !24)
!615 = !DILocation(line: 237, column: 3, scope: !24)
!616 = !DILocation(line: 239, column: 21, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !1, line: 239, column: 14)
!618 = distinct !DILexicalBlock(scope: !24, file: !1, line: 238, column: 47)
!619 = !{!620, !620, i64 0}
!620 = !{!"any pointer", !592, i64 0}
!621 = !DILocation(line: 239, column: 14, scope: !617)
!622 = !DILocation(line: 239, column: 36, scope: !617)
!623 = !DILocation(line: 239, column: 14, scope: !618)
!624 = !DILocation(line: 239, column: 71, scope: !617)
!625 = !DILocation(line: 239, column: 66, scope: !617)
!626 = !DILocation(line: 239, column: 49, scope: !617)
