; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hsregex.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.sqd_regexp = type { [10 x i8*], [10 x i8*], i8, i8, i8*, i32, [1 x i8] }
%struct.comp = type { i8*, i32, i8*, [3 x i8], i64 }
%struct.exec = type { i8*, i8*, i8**, i8** }

@.str = private unnamed_addr constant [31 x i8] c"Strparse(): ntok must be <= %d\00", align 1
@sqd_parse = common global [10 x i8*] zeroinitializer, align 16
@.str1 = private unnamed_addr constant [27 x i8] c"regexp compilation failed.\00", align 1
@.str2 = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hsregex.c\00", align 1
@.str3 = private unnamed_addr constant [29 x i8] c"NULL argument to sqd_regcomp\00", align 1
@.str4 = private unnamed_addr constant [15 x i8] c"regexp too big\00", align 1
@.str5 = private unnamed_addr constant [13 x i8] c"out of space\00", align 1
@.str6 = private unnamed_addr constant [29 x i8] c"NULL argument to sqd_regexec\00", align 1
@.str7 = private unnamed_addr constant [17 x i8] c"corrupted regexp\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !268, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/hsregex.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7, !26, !21, !31}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_regexp", file: !9, line: 357, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqd_regexp", file: !9, line: 349, size: 1472, align: 64, elements: !11)
!11 = !{!12, !16, !17, !18, !19, !20, !22}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !10, file: !9, line: 350, baseType: !13, size: 640, align: 64)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 640, align: 64, elements: !14)
!14 = !{!15}
!15 = !DISubrange(count: 10)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !10, file: !9, line: 351, baseType: !13, size: 640, align: 64, offset: 640)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "regstart", scope: !10, file: !9, line: 352, baseType: !6, size: 8, align: 8, offset: 1280)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "reganch", scope: !10, file: !9, line: 353, baseType: !6, size: 8, align: 8, offset: 1288)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "regmust", scope: !10, file: !9, line: 354, baseType: !5, size: 64, align: 64, offset: 1344)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "regmlen", scope: !10, file: !9, line: 355, baseType: !21, size: 32, align: 32, offset: 1408)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !10, file: !9, line: 356, baseType: !23, size: 8, align: 8, offset: 1440)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 1)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !27, line: 30, baseType: !28)
!27 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !29, line: 92, baseType: !30)
!29 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!31 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33, !44, !49, !77, !93, !109, !114, !128, !137, !148, !156, !170, !178, !188, !193, !199, !210, !240, !249, !255, !261}
!33 = !DISubprogram(name: "Strparse", scope: !1, file: !1, line: 92, type: !34, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i32)* @Strparse, variables: !36)
!34 = !DISubroutineType(types: !35)
!35 = !{!21, !5, !5, !21}
!36 = !{!37, !38, !39, !40, !41, !42, !43}
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rexp", arg: 1, scope: !33, file: !1, line: 92, type: !5)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !33, file: !1, line: 92, type: !5)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ntok", arg: 3, scope: !33, file: !1, line: 92, type: !21)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pat", scope: !33, file: !1, line: 94, type: !7)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !33, file: !1, line: 95, type: !21)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !33, file: !1, line: 96, type: !21)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !33, file: !1, line: 97, type: !21)
!44 = !DISubprogram(name: "SqdClean", scope: !1, file: !1, line: 141, type: !45, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @SqdClean, variables: !47)
!45 = !DISubroutineType(types: !46)
!46 = !{null}
!47 = !{!48}
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !44, file: !1, line: 143, type: !21)
!49 = !DISubprogram(name: "sqd_regcomp", scope: !1, file: !1, line: 334, type: !50, isLocal: false, isDefinition: true, scopeLine: 336, isOptimized: true, function: %struct.sqd_regexp* (i8*)* @sqd_regcomp, variables: !54)
!50 = !DISubroutineType(types: !51)
!51 = !{!7, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!54 = !{!55, !56, !57, !58, !59, !71, !76}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exp", arg: 1, scope: !49, file: !1, line: 335, type: !52)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !49, file: !1, line: 337, type: !7)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan", scope: !49, file: !1, line: 338, type: !5)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !49, file: !1, line: 339, type: !21)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !49, file: !1, line: 340, type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "comp", file: !1, line: 295, size: 320, align: 64, elements: !61)
!61 = !{!62, !63, !64, !65, !69}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "regparse", scope: !60, file: !1, line: 296, baseType: !5, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "regnpar", scope: !60, file: !1, line: 297, baseType: !21, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "regcode", scope: !60, file: !1, line: 298, baseType: !5, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "regdummy", scope: !60, file: !1, line: 299, baseType: !66, size: 24, align: 8, offset: 192)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 24, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "regsize", scope: !60, file: !1, line: 300, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "longest", scope: !72, file: !1, line: 397, type: !5)
!72 = distinct !DILexicalBlock(scope: !73, file: !1, line: 396, column: 22)
!73 = distinct !DILexicalBlock(scope: !74, file: !1, line: 396, column: 7)
!74 = distinct !DILexicalBlock(scope: !75, file: !1, line: 379, column: 32)
!75 = distinct !DILexicalBlock(scope: !49, file: !1, line: 379, column: 6)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !72, file: !1, line: 398, type: !26)
!77 = !DISubprogram(name: "sqd_regexec", scope: !1, file: !1, line: 845, type: !78, isLocal: false, isDefinition: true, scopeLine: 848, isOptimized: true, function: i32 (%struct.sqd_regexp*, i8*)* @sqd_regexec, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{!21, !7, !52}
!80 = !{!81, !82, !83, !84, !85}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prog", arg: 1, scope: !77, file: !1, line: 846, type: !7)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 2, scope: !77, file: !1, line: 847, type: !52)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !77, file: !1, line: 849, type: !5)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !77, file: !1, line: 850, type: !5)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ex", scope: !77, file: !1, line: 851, type: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "exec", file: !1, line: 821, size: 256, align: 64, elements: !87)
!87 = !{!88, !89, !90, !92}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reginput", scope: !86, file: !1, line: 822, baseType: !5, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "regbol", scope: !86, file: !1, line: 823, baseType: !5, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "regstartp", scope: !86, file: !1, line: 824, baseType: !91, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "regendp", scope: !86, file: !1, line: 825, baseType: !91, size: 64, align: 64, offset: 192)
!93 = !DISubprogram(name: "sqd_regsub", scope: !1, file: !1, line: 1273, type: !94, isLocal: false, isDefinition: true, scopeLine: 1277, isOptimized: true, function: void (%struct.sqd_regexp*, i8*, i8*)* @sqd_regsub, variables: !98)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96, !52, !5}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!98 = !{!99, !100, !101, !102, !104, !105, !106, !107, !108}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rp", arg: 1, scope: !93, file: !1, line: 1274, type: !96)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !93, file: !1, line: 1275, type: !52)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 3, scope: !93, file: !1, line: 1276, type: !5)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prog", scope: !93, file: !1, line: 1278, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !93, file: !1, line: 1279, type: !5)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dst", scope: !93, file: !1, line: 1280, type: !5)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !93, file: !1, line: 1281, type: !6)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no", scope: !93, file: !1, line: 1282, type: !21)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !93, file: !1, line: 1283, type: !26)
!109 = !DISubprogram(name: "sqd_regerror", scope: !1, file: !1, line: 1322, type: !110, isLocal: false, isDefinition: true, scopeLine: 1324, isOptimized: true, function: void (i8*)* @sqd_regerror, variables: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !5}
!112 = !{!113}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !109, file: !1, line: 1323, type: !5)
!114 = !DISubprogram(name: "reg", scope: !1, file: !1, line: 423, type: !115, isLocal: true, isDefinition: true, scopeLine: 427, isOptimized: true, function: i8* (%struct.comp*, i32, i32*)* @reg, variables: !119)
!115 = !DISubroutineType(types: !116)
!116 = !{!5, !117, !21, !118}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cp", arg: 1, scope: !114, file: !1, line: 424, type: !117)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "paren", arg: 2, scope: !114, file: !1, line: 425, type: !21)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flagp", arg: 3, scope: !114, file: !1, line: 426, type: !118)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !114, file: !1, line: 428, type: !5)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "br", scope: !114, file: !1, line: 429, type: !5)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ender", scope: !114, file: !1, line: 430, type: !5)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parno", scope: !114, file: !1, line: 431, type: !21)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !114, file: !1, line: 432, type: !21)
!128 = !DISubprogram(name: "regnode", scope: !1, file: !1, line: 712, type: !129, isLocal: true, isDefinition: true, scopeLine: 715, isOptimized: true, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!5, !117, !6}
!131 = !{!132, !133, !134, !136}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cp", arg: 1, scope: !128, file: !1, line: 713, type: !117)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 2, scope: !128, file: !1, line: 714, type: !6)
