; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/masks.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }

@.str = private unnamed_addr constant [63 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/masks.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !126, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/masks.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !{!7, !35, !121}
!7 = !DISubprogram(name: "XNU", scope: !1, file: !1, line: 84, type: !8, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @XNU, variables: !12)
!8 = !DISubroutineType(types: !9)
!9 = !{!4, !10, !4}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !26, !27, !28, !29, !31, !32, !33, !34}
!13 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !7, file: !1, line: 84, type: !10)
!14 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !7, file: !1, line: 84, type: !4)
!15 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !7, file: !1, line: 86, type: !4)
!16 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !7, file: !1, line: 86, type: !4)
!17 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "off", scope: !7, file: !1, line: 86, type: !4)
!18 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !7, file: !1, line: 86, type: !4)
!19 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "beg", scope: !7, file: !1, line: 86, type: !4)
!20 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !7, file: !1, line: 86, type: !4)
!21 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top", scope: !7, file: !1, line: 86, type: !4)
!22 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "topcut", scope: !7, file: !1, line: 87, type: !4)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fallcut", scope: !7, file: !1, line: 87, type: !4)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !7, file: !1, line: 88, type: !25)
!25 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "noff", scope: !7, file: !1, line: 89, type: !4)
!27 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcut", scope: !7, file: !1, line: 90, type: !4)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pcut", scope: !7, file: !1, line: 91, type: !25)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hit", scope: !7, file: !1, line: 92, type: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda", scope: !7, file: !1, line: 93, type: !25)
!32 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "K", scope: !7, file: !1, line: 94, type: !25)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "H", scope: !7, file: !1, line: 95, type: !25)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xnum", scope: !7, file: !1, line: 96, type: !4)
!35 = !DISubprogram(name: "TraceScoreCorrection", scope: !1, file: !1, line: 168, type: !36, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.plan7_s*, %struct.p7trace_s*, i8*)* @TraceScoreCorrection, variables: !109)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !39, !102, !10}
!38 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !41, line: 101, size: 3712, align: 64, elements: !42)
!41 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !67, !68, !69, !70, !75, !76, !77, !81, !82, !84, !85, !86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 113, baseType: !10, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !40, file: !41, line: 114, baseType: !10, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !40, file: !41, line: 115, baseType: !10, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !40, file: !41, line: 116, baseType: !10, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !40, file: !41, line: 117, baseType: !10, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !40, file: !41, line: 118, baseType: !10, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !40, file: !41, line: 119, baseType: !10, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !40, file: !41, line: 120, baseType: !4, size: 32, align: 32, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !40, file: !41, line: 121, baseType: !10, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !40, file: !41, line: 122, baseType: !30, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !40, file: !41, line: 123, baseType: !4, size: 32, align: 32, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !40, file: !41, line: 134, baseType: !30, size: 64, align: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !40, file: !41, line: 135, baseType: !30, size: 64, align: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !40, file: !41, line: 136, baseType: !30, size: 64, align: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !40, file: !41, line: 144, baseType: !38, size: 32, align: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !40, file: !41, line: 144, baseType: !38, size: 32, align: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !40, file: !41, line: 145, baseType: !38, size: 32, align: 32, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !40, file: !41, line: 145, baseType: !38, size: 32, align: 32, offset: 992)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !40, file: !41, line: 146, baseType: !38, size: 32, align: 32, offset: 1024)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !40, file: !41, line: 146, baseType: !38, size: 32, align: 32, offset: 1056)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !40, file: !41, line: 155, baseType: !4, size: 32, align: 32, offset: 1088)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !40, file: !41, line: 156, baseType: !65, size: 64, align: 64, offset: 1152)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !40, file: !41, line: 157, baseType: !65, size: 64, align: 64, offset: 1216)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !40, file: !41, line: 158, baseType: !65, size: 64, align: 64, offset: 1280)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !40, file: !41, line: 159, baseType: !38, size: 32, align: 32, offset: 1344)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !40, file: !41, line: 168, baseType: !71, size: 256, align: 32, offset: 1376)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 256, align: 32, elements: !72)
!72 = !{!73, !74}
!73 = !DISubrange(count: 4)
!74 = !DISubrange(count: 2)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !40, file: !41, line: 169, baseType: !66, size: 64, align: 64, offset: 1664)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !40, file: !41, line: 170, baseType: !66, size: 64, align: 64, offset: 1728)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !40, file: !41, line: 174, baseType: !78, size: 640, align: 32, offset: 1792)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 640, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 20)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !40, file: !41, line: 175, baseType: !38, size: 32, align: 32, offset: 2432)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !40, file: !41, line: 197, baseType: !83, size: 64, align: 64, offset: 2496)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !40, file: !41, line: 198, baseType: !83, size: 64, align: 64, offset: 2560)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !40, file: !41, line: 199, baseType: !83, size: 64, align: 64, offset: 2624)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !40, file: !41, line: 200, baseType: !87, size: 256, align: 32, offset: 2688)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !72)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !40, file: !41, line: 201, baseType: !30, size: 64, align: 64, offset: 2944)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !40, file: !41, line: 202, baseType: !30, size: 64, align: 64, offset: 3008)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !40, file: !41, line: 203, baseType: !30, size: 64, align: 64, offset: 3072)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !40, file: !41, line: 203, baseType: !30, size: 64, align: 64, offset: 3136)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !40, file: !41, line: 203, baseType: !30, size: 64, align: 64, offset: 3200)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !40, file: !41, line: 203, baseType: !30, size: 64, align: 64, offset: 3264)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !40, file: !41, line: 203, baseType: !30, size: 64, align: 64, offset: 3328)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !40, file: !41, line: 214, baseType: !83, size: 64, align: 64, offset: 3392)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !40, file: !41, line: 215, baseType: !83, size: 64, align: 64, offset: 3456)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !40, file: !41, line: 216, baseType: !4, size: 32, align: 32, offset: 3520)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !40, file: !41, line: 217, baseType: !4, size: 32, align: 32, offset: 3552)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !40, file: !41, line: 222, baseType: !38, size: 32, align: 32, offset: 3584)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !40, file: !41, line: 223, baseType: !38, size: 32, align: 32, offset: 3616)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !41, line: 225, baseType: !4, size: 32, align: 32, offset: 3648)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !41, line: 374, size: 256, align: 64, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !103, file: !41, line: 375, baseType: !4, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !103, file: !41, line: 376, baseType: !10, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !103, file: !41, line: 377, baseType: !30, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !103, file: !41, line: 378, baseType: !30, size: 64, align: 64, offset: 192)
!109 = !{!110, !111, !112, !113, !114, !118, !119, !120}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !35, file: !1, line: 168, type: !39)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 2, scope: !35, file: !1, line: 168, type: !102)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 3, scope: !35, file: !1, line: 168, type: !10)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !35, file: !1, line: 170, type: !78)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !35, file: !1, line: 171, type: !115)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 768, align: 32, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 24)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !35, file: !1, line: 172, type: !4)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !35, file: !1, line: 173, type: !4)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !35, file: !1, line: 174, type: !4)
!121 = !DISubprogram(name: "SantaCruzCorrection", scope: !1, file: !1, line: 366, type: !36, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.plan7_s*, %struct.p7trace_s*, i8*)* @SantaCruzCorrection, variables: !122)
!122 = !{!123, !124, !125}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !121, file: !1, line: 366, type: !39)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 2, scope: !121, file: !1, line: 366, type: !102)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 3, scope: !121, file: !1, line: 366, type: !10)
!126 = !{!127}
!127 = !DIGlobalVariable(name: "xpam120", scope: !0, file: !1, line: 43, type: !128, isLocal: true, isDefinition: true, variable: [23 x [23 x i32]]* @xpam120)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16928, align: 32, elements: !129)
!129 = !{!130, !130}
!130 = !DISubrange(count: 23)
!131 = !{i32 2, !"Dwarf Version", i32 2}
!132 = !{i32 2, !"Debug Info Version", i32 700000003}
!133 = !{i32 1, !"PIC Level", i32 2}
!134 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!135 = !DIExpression()
!136 = !DILocation(line: 84, column: 11, scope: !7)
!137 = !DILocation(line: 84, column: 20, scope: !7)
!138 = !DILocation(line: 89, column: 10, scope: !7)
!139 = !DILocation(line: 90, column: 10, scope: !7)
!140 = !DILocation(line: 91, column: 10, scope: !7)
!141 = !DILocation(line: 93, column: 10, scope: !7)
!142 = !DILocation(line: 94, column: 10, scope: !7)
!143 = !DILocation(line: 95, column: 10, scope: !7)
!144 = !DILocation(line: 96, column: 10, scope: !7)
!145 = !DILocation(line: 98, column: 11, scope: !146)
!146 = distinct !DILexicalBlock(scope: !7, file: !1, line: 98, column: 7)
!147 = !DILocation(line: 98, column: 7, scope: !7)
!148 = !DILocation(line: 100, column: 9, scope: !7)
!149 = !DILocation(line: 92, column: 10, scope: !7)
!150 = !DILocation(line: 86, column: 10, scope: !7)
!151 = !DILocation(line: 101, column: 14, scope: !152)
!152 = distinct !DILexicalBlock(scope: !153, file: !1, line: 101, column: 3)
!153 = distinct !DILexicalBlock(scope: !7, file: !1, line: 101, column: 3)
!154 = !DILocation(line: 101, column: 3, scope: !153)
!155 = !DILocation(line: 101, column: 32, scope: !152)
!156 = !DILocation(line: 113, column: 3, scope: !157)
!157 = distinct !DILexicalBlock(scope: !7, file: !1, line: 113, column: 3)
!158 = !DILocation(line: 146, column: 3, scope: !159)
!159 = distinct !DILexicalBlock(scope: !7, file: !1, line: 146, column: 3)
!160 = !DILocation(line: 86, column: 30, scope: !7)
!161 = !DILocation(line: 86, column: 18, scope: !7)
!162 = !DILocation(line: 86, column: 26, scope: !7)
!163 = !DILocation(line: 118, column: 20, scope: !164)
