; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/mathsupport.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }

@ILogsum.firsttime = internal unnamed_addr global i1 false
@ilogsum_lookup = internal unnamed_addr global [20000 x i32] zeroinitializer, align 16
@.str = private unnamed_addr constant [46 x i8] c"Invalid argument alpha < 0.0 to SampleGamma()\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i32 @Prob2Score(float %p, float %null) #0 {
  tail call void @llvm.dbg.value(metadata float %p, i64 0, metadata !12, metadata !184), !dbg !185
  tail call void @llvm.dbg.value(metadata float %null, i64 0, metadata !13, metadata !184), !dbg !186
  %1 = fcmp oeq float %p, 0.000000e+00, !dbg !187
  br i1 %1, label %13, label %2, !dbg !189

; <label>:2                                       ; preds = %0
  %3 = fdiv float %p, %null, !dbg !190
  %4 = fcmp ogt float %3, 0.000000e+00, !dbg !190
  br i1 %4, label %5, label %9, !dbg !190

; <label>:5                                       ; preds = %2

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !174, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/mathsupport.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !{!8, !14, !20, !25, !100, !106, !113, !122, !134, !142, !152, !161, !169}
!8 = !DISubprogram(name: "Prob2Score", scope: !1, file: !1, line: 44, type: !9, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float, float)* @Prob2Score, variables: !11)
!9 = !DISubroutineType(types: !10)
!10 = !{!4, !5, !5}
!11 = !{!12, !13}
!12 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !8, file: !1, line: 44, type: !5)
!13 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 2, scope: !8, file: !1, line: 44, type: !5)
!14 = !DISubprogram(name: "Score2Prob", scope: !1, file: !1, line: 56, type: !15, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: float (i32, float)* @Score2Prob, variables: !17)
!15 = !DISubroutineType(types: !16)
!16 = !{!5, !4, !5}
!17 = !{!18, !19}
!18 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sc", arg: 1, scope: !14, file: !1, line: 56, type: !4)
!19 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 2, scope: !14, file: !1, line: 56, type: !5)
!20 = !DISubprogram(name: "Scorify", scope: !1, file: !1, line: 69, type: !21, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: float (i32)* @Scorify, variables: !23)
!21 = !DISubroutineType(types: !22)
!22 = !{!5, !4}
!23 = !{!24}
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sc", arg: 1, scope: !20, file: !1, line: 69, type: !4)
!25 = !DISubprogram(name: "PValue", scope: !1, file: !1, line: 89, type: !26, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct.plan7_s*, float)* @PValue, variables: !95)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !29, !5}
!28 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !31, line: 101, size: 3712, align: 64, elements: !32)
!31 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!32 = !{!33, !36, !37, !38, !39, !40, !41, !42, !43, !44, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !60, !61, !62, !63, !68, !69, !70, !74, !75, !77, !78, !79, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !31, line: 113, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !30, file: !31, line: 114, baseType: !34, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !30, file: !31, line: 115, baseType: !34, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !30, file: !31, line: 116, baseType: !34, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !30, file: !31, line: 117, baseType: !34, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !30, file: !31, line: 118, baseType: !34, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !30, file: !31, line: 119, baseType: !34, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !30, file: !31, line: 120, baseType: !4, size: 32, align: 32, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !30, file: !31, line: 121, baseType: !34, size: 64, align: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !30, file: !31, line: 122, baseType: !45, size: 64, align: 64, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !30, file: !31, line: 123, baseType: !4, size: 32, align: 32, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !30, file: !31, line: 134, baseType: !45, size: 64, align: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !30, file: !31, line: 135, baseType: !45, size: 64, align: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !30, file: !31, line: 136, baseType: !45, size: 64, align: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !30, file: !31, line: 144, baseType: !5, size: 32, align: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !30, file: !31, line: 144, baseType: !5, size: 32, align: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !30, file: !31, line: 145, baseType: !5, size: 32, align: 32, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !30, file: !31, line: 145, baseType: !5, size: 32, align: 32, offset: 992)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !30, file: !31, line: 146, baseType: !5, size: 32, align: 32, offset: 1024)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !30, file: !31, line: 146, baseType: !5, size: 32, align: 32, offset: 1056)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !30, file: !31, line: 155, baseType: !4, size: 32, align: 32, offset: 1088)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !30, file: !31, line: 156, baseType: !58, size: 64, align: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !30, file: !31, line: 157, baseType: !58, size: 64, align: 64, offset: 1216)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !30, file: !31, line: 158, baseType: !58, size: 64, align: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !30, file: !31, line: 159, baseType: !5, size: 32, align: 32, offset: 1344)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !30, file: !31, line: 168, baseType: !64, size: 256, align: 32, offset: 1376)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, align: 32, elements: !65)
!65 = !{!66, !67}
!66 = !DISubrange(count: 4)
!67 = !DISubrange(count: 2)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !30, file: !31, line: 169, baseType: !59, size: 64, align: 64, offset: 1664)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !30, file: !31, line: 170, baseType: !59, size: 64, align: 64, offset: 1728)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !30, file: !31, line: 174, baseType: !71, size: 640, align: 32, offset: 1792)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 640, align: 32, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 20)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !30, file: !31, line: 175, baseType: !5, size: 32, align: 32, offset: 2432)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !30, file: !31, line: 197, baseType: !76, size: 64, align: 64, offset: 2496)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !30, file: !31, line: 198, baseType: !76, size: 64, align: 64, offset: 2560)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !30, file: !31, line: 199, baseType: !76, size: 64, align: 64, offset: 2624)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !30, file: !31, line: 200, baseType: !80, size: 256, align: 32, offset: 2688)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !65)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !30, file: !31, line: 201, baseType: !45, size: 64, align: 64, offset: 2944)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !30, file: !31, line: 202, baseType: !45, size: 64, align: 64, offset: 3008)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !30, file: !31, line: 203, baseType: !45, size: 64, align: 64, offset: 3072)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !30, file: !31, line: 203, baseType: !45, size: 64, align: 64, offset: 3136)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !30, file: !31, line: 203, baseType: !45, size: 64, align: 64, offset: 3200)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !30, file: !31, line: 203, baseType: !45, size: 64, align: 64, offset: 3264)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !30, file: !31, line: 203, baseType: !45, size: 64, align: 64, offset: 3328)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !30, file: !31, line: 214, baseType: !76, size: 64, align: 64, offset: 3392)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !30, file: !31, line: 215, baseType: !76, size: 64, align: 64, offset: 3456)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !30, file: !31, line: 216, baseType: !4, size: 32, align: 32, offset: 3520)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !30, file: !31, line: 217, baseType: !4, size: 32, align: 32, offset: 3552)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !30, file: !31, line: 222, baseType: !5, size: 32, align: 32, offset: 3584)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !30, file: !31, line: 223, baseType: !5, size: 32, align: 32, offset: 3616)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !31, line: 225, baseType: !4, size: 32, align: 32, offset: 3648)
!95 = !{!96, !97, !98, !99}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !25, file: !1, line: 89, type: !29)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sc", arg: 2, scope: !25, file: !1, line: 89, type: !5)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pval", scope: !25, file: !1, line: 91, type: !28)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pval2", scope: !25, file: !1, line: 92, type: !28)
!100 = !DISubprogram(name: "LogSum", scope: !1, file: !1, line: 115, type: !101, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float)* @LogSum, variables: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!5, !5, !5}
!103 = !{!104, !105}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p1", arg: 1, scope: !100, file: !1, line: 115, type: !5)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p2", arg: 2, scope: !100, file: !1, line: 115, type: !5)
!106 = !DISubprogram(name: "ILogsum", scope: !1, file: !1, line: 157, type: !107, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @ILogsum, variables: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{!4, !4, !4}
!109 = !{!110, !111, !112}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p1", arg: 1, scope: !106, file: !1, line: 157, type: !4)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p2", arg: 2, scope: !106, file: !1, line: 157, type: !4)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !106, file: !1, line: 159, type: !4)
!113 = !DISubprogram(name: "LogNorm", scope: !1, file: !1, line: 185, type: !114, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, i32)* @LogNorm, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !59, !4}
!116 = !{!117, !118, !119, !120, !121}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 1, scope: !113, file: !1, line: 185, type: !59)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !113, file: !1, line: 185, type: !4)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !113, file: !1, line: 187, type: !4)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !113, file: !1, line: 188, type: !5)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denom", scope: !113, file: !1, line: 189, type: !5)
!122 = !DISubprogram(name: "Logp_cvec", scope: !1, file: !1, line: 217, type: !123, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, function: float (float*, i32, float*)* @Logp_cvec, variables: !125)
!123 = !DISubroutineType(types: !124)
!124 = !{!5, !59, !4, !59}
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cvec", arg: 1, scope: !122, file: !1, line: 217, type: !59)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !122, file: !1, line: 217, type: !4)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 3, scope: !122, file: !1, line: 217, type: !59)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lnp", scope: !122, file: !1, line: 219, type: !5)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum1", scope: !122, file: !1, line: 220, type: !5)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum2", scope: !122, file: !1, line: 220, type: !5)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum3", scope: !122, file: !1, line: 220, type: !5)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !122, file: !1, line: 221, type: !4)
