; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/misc.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.threshold_s = type { float, double, float, double, i32, i32 }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }

@.str = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str1 = private unnamed_addr constant [12 x i8] c"%s %s (%s)\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !23, globals: !193, imports: !199)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/misc.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 524, size: 32, align: 32, elements: !16)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "threshold_s", file: !4, line: 518, size: 320, align: 64, elements: !6)
!6 = !{!7, !9, !11, !12, !13, !14}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "globT", scope: !5, file: !4, line: 519, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "globE", scope: !5, file: !4, line: 520, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "domT", scope: !5, file: !4, line: 521, baseType: !8, size: 32, align: 32, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "domE", scope: !5, file: !4, line: 522, baseType: !10, size: 64, align: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "autocut", scope: !5, file: !4, line: 524, baseType: !3, size: 32, align: 32, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !5, file: !4, line: 525, baseType: !15, size: 32, align: 32, offset: 288)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "CUT_NONE", value: 0)
!18 = !DIEnumerator(name: "CUT_GA", value: 1)
!19 = !DIEnumerator(name: "CUT_NC", value: 2)
!20 = !DIEnumerator(name: "CUT_TC", value: 3)
!21 = !{!22, !15}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !{!24, !92, !98, !106, !176, !182, !190}
!24 = !DISubprogram(name: "HMMERBanner", scope: !1, file: !1, line: 55, type: !25, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*)* @HMMERBanner, variables: !89)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27, !55}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 153, baseType: !30)
!29 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !29, line: 122, size: 1216, align: 64, elements: !31)
!31 = !{!32, !35, !36, !37, !39, !40, !45, !46, !47, !51, !57, !67, !73, !74, !77, !78, !82, !86, !87, !88}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !30, file: !29, line: 123, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !30, file: !29, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !30, file: !29, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !30, file: !29, line: 126, baseType: !38, size: 16, align: 16, offset: 128)
!38 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !30, file: !29, line: 127, baseType: !38, size: 16, align: 16, offset: 144)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !30, file: !29, line: 128, baseType: !41, size: 128, align: 64, offset: 192)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !29, line: 88, size: 128, align: 64, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !41, file: !29, line: 89, baseType: !33, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !41, file: !29, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !30, file: !29, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !30, file: !29, line: 132, baseType: !22, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !30, file: !29, line: 133, baseType: !48, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!15, !22}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !30, file: !29, line: 134, baseType: !52, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!15, !22, !55, !15}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !30, file: !29, line: 135, baseType: !58, size: 64, align: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !22, !61, !15}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !29, line: 77, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !63, line: 71, baseType: !64)
!63 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !65, line: 46, baseType: !66)
!65 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!66 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !30, file: !29, line: 136, baseType: !68, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!15, !22, !71, !15}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !30, file: !29, line: 139, baseType: !41, size: 128, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !30, file: !29, line: 140, baseType: !75, size: 64, align: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !29, line: 94, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !30, file: !29, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !30, file: !29, line: 144, baseType: !79, size: 24, align: 8, offset: 928)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 24, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 3)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !30, file: !29, line: 145, baseType: !83, size: 8, align: 8, offset: 952)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, align: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !30, file: !29, line: 148, baseType: !41, size: 128, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !30, file: !29, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !30, file: !29, line: 152, baseType: !61, size: 64, align: 64, offset: 1152)
!89 = !{!90, !91}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !24, file: !1, line: 55, type: !27)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "banner", arg: 2, scope: !24, file: !1, line: 55, type: !55)
!92 = !DISubprogram(name: "Getword", scope: !1, file: !1, line: 76, type: !93, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.__sFILE*, i32)* @Getword, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{!55, !27, !15}
!95 = !{!96, !97}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !92, file: !1, line: 76, type: !27)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !92, file: !1, line: 76, type: !15)
!98 = !DISubprogram(name: "Getline", scope: !1, file: !1, line: 129, type: !99, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, %struct.__sFILE*)* @Getline, variables: !101)
!99 = !DISubroutineType(types: !100)
!100 = !{!55, !55, !15, !27}
!101 = !{!102, !103, !104, !105}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !98, file: !1, line: 129, type: !55)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !98, file: !1, line: 129, type: !15)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 3, scope: !98, file: !1, line: 129, type: !27)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !98, file: !1, line: 131, type: !55)
!106 = !DISubprogram(name: "SetAutocuts", scope: !1, file: !1, line: 158, type: !107, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.threshold_s*, %struct.plan7_s*)* @SetAutocuts, variables: !173)
!107 = !DISubroutineType(types: !108)
!108 = !{!15, !109, !110}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !4, line: 101, size: 3712, align: 64, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !138, !139, !140, !141, !146, !147, !148, !152, !153, !155, !156, !157, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !4, line: 113, baseType: !55, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !111, file: !4, line: 114, baseType: !55, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !111, file: !4, line: 115, baseType: !55, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !111, file: !4, line: 116, baseType: !55, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !111, file: !4, line: 117, baseType: !55, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !111, file: !4, line: 118, baseType: !55, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !111, file: !4, line: 119, baseType: !55, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !111, file: !4, line: 120, baseType: !15, size: 32, align: 32, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !111, file: !4, line: 121, baseType: !55, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !111, file: !4, line: 122, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !111, file: !4, line: 123, baseType: !15, size: 32, align: 32, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !111, file: !4, line: 134, baseType: !123, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !111, file: !4, line: 135, baseType: !123, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !111, file: !4, line: 136, baseType: !123, size: 64, align: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !111, file: !4, line: 144, baseType: !8, size: 32, align: 32, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !111, file: !4, line: 144, baseType: !8, size: 32, align: 32, offset: 928)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !111, file: !4, line: 145, baseType: !8, size: 32, align: 32, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !111, file: !4, line: 145, baseType: !8, size: 32, align: 32, offset: 992)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !111, file: !4, line: 146, baseType: !8, size: 32, align: 32, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !111, file: !4, line: 146, baseType: !8, size: 32, align: 32, offset: 1056)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !111, file: !4, line: 155, baseType: !15, size: 32, align: 32, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !111, file: !4, line: 156, baseType: !136, size: 64, align: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !111, file: !4, line: 157, baseType: !136, size: 64, align: 64, offset: 1216)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !111, file: !4, line: 158, baseType: !136, size: 64, align: 64, offset: 1280)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !111, file: !4, line: 159, baseType: !8, size: 32, align: 32, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !111, file: !4, line: 168, baseType: !142, size: 256, align: 32, offset: 1376)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, align: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DISubrange(count: 4)
!145 = !DISubrange(count: 2)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !111, file: !4, line: 169, baseType: !137, size: 64, align: 64, offset: 1664)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !111, file: !4, line: 170, baseType: !137, size: 64, align: 64, offset: 1728)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !111, file: !4, line: 174, baseType: !149, size: 640, align: 32, offset: 1792)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 640, align: 32, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 20)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !111, file: !4, line: 175, baseType: !8, size: 32, align: 32, offset: 2432)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !111, file: !4, line: 197, baseType: !154, size: 64, align: 64, offset: 2496)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !111, file: !4, line: 198, baseType: !154, size: 64, align: 64, offset: 2560)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !111, file: !4, line: 199, baseType: !154, size: 64, align: 64, offset: 2624)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !111, file: !4, line: 200, baseType: !158, size: 256, align: 32, offset: 2688)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, align: 32, elements: !143)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !111, file: !4, line: 201, baseType: !123, size: 64, align: 64, offset: 2944)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !111, file: !4, line: 202, baseType: !123, size: 64, align: 64, offset: 3008)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !111, file: !4, line: 203, baseType: !123, size: 64, align: 64, offset: 3072)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !111, file: !4, line: 203, baseType: !123, size: 64, align: 64, offset: 3136)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !111, file: !4, line: 203, baseType: !123, size: 64, align: 64, offset: 3200)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !111, file: !4, line: 203, baseType: !123, size: 64, align: 64, offset: 3264)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !111, file: !4, line: 203, baseType: !123, size: 64, align: 64, offset: 3328)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !111, file: !4, line: 214, baseType: !154, size: 64, align: 64, offset: 3392)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !111, file: !4, line: 215, baseType: !154, size: 64, align: 64, offset: 3456)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !111, file: !4, line: 216, baseType: !15, size: 32, align: 32, offset: 3520)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !111, file: !4, line: 217, baseType: !15, size: 32, align: 32, offset: 3552)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !111, file: !4, line: 222, baseType: !8, size: 32, align: 32, offset: 3584)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !111, file: !4, line: 223, baseType: !8, size: 32, align: 32, offset: 3616)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !4, line: 225, baseType: !15, size: 32, align: 32, offset: 3648)
!173 = !{!174, !175}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thresh", arg: 1, scope: !106, file: !1, line: 158, type: !109)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !106, file: !1, line: 158, type: !110)
!176 = !DISubprogram(name: "isspace", scope: !177, file: !177, line: 267, type: !178, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, variables: !180)
!177 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!178 = !DISubroutineType(types: !179)
!179 = !{!15, !15}
!180 = !{!181}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !176, file: !177, line: 267, type: !15)
!182 = !DISubprogram(name: "__istype", scope: !177, file: !177, line: 153, type: !183, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !187)
!183 = !DISubroutineType(types: !184)
!184 = !{!15, !185, !186}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !65, line: 70, baseType: !15)
!186 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!187 = !{!188, !189}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !182, file: !177, line: 153, type: !185)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !182, file: !177, line: 153, type: !186)
!190 = !DISubprogram(name: "isascii", scope: !177, file: !177, line: 135, type: !178, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, variables: !191)
!191 = !{!192}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !190, file: !177, line: 135, type: !15)
!193 = !{!194, !198}
!194 = !DIGlobalVariable(name: "buffer", scope: !92, file: !1, line: 78, type: !195, isLocal: true, isDefinition: true, variable: [512 x i8]* @Getword.buffer)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 4096, align: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 512)
!198 = !DIGlobalVariable(name: "sptr", scope: !92, file: !1, line: 79, type: !55, isLocal: true, isDefinition: true, variable: i8** @Getword.sptr)
!199 = !{}
!200 = !{i32 2, !"Dwarf Version", i32 2}
!201 = !{i32 2, !"Debug Info Version", i32 700000003}
!202 = !{i32 1, !"PIC Level", i32 2}
!203 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!204 = !DIExpression()
!205 = !DILocation(line: 55, column: 19, scope: !24)
!206 = !DILocation(line: 55, column: 29, scope: !24)
!207 = !DILocation(line: 57, column: 3, scope: !24)
!208 = !DILocation(line: 58, column: 3, scope: !24)
!209 = !DILocation(line: 59, column: 3, scope: !24)
!210 = !DILocation(line: 60, column: 3, scope: !24)
!211 = !DILocation(line: 61, column: 3, scope: !24)
!212 = !DILocation(line: 62, column: 1, scope: !24)
!213 = !DILocation(line: 76, column: 15, scope: !92)
!214 = !DILocation(line: 76, column: 23, scope: !92)
!215 = !DILocation(line: 81, column: 7, scope: !216)
!216 = distinct !DILexicalBlock(scope: !92, file: !1, line: 81, column: 7)
!217 = !{!218, !218, i64 0}
!218 = !{!"any pointer", !219, i64 0}
!219 = !{!"omnipotent char", !220, i64 0}
!220 = !{!"Simple C/C++ TBAA"}
!221 = !DILocation(line: 81, column: 12, scope: !216)
!222 = !DILocation(line: 81, column: 7, scope: !92)
!223 = !DILocation(line: 81, column: 28, scope: !216)
!224 = !DILocation(line: 81, column: 26, scope: !216)
!225 = !DILocation(line: 83, column: 15, scope: !92)
!226 = !DILocation(line: 83, column: 3, scope: !92)
!227 = !DILocation(line: 85, column: 19, scope: !228)
!228 = distinct !DILexicalBlock(scope: !229, file: !1, line: 85, column: 11)
!229 = distinct !DILexicalBlock(scope: !92, file: !1, line: 84, column: 5)
