; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/modelmakers.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.msa_struct = type { i8**, i8**, float*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8**, i8**, [6 x float], [6 x i32], i8**, i32, i32, i8**, i8**, i32, i32, i8**, i8***, %struct.GKI*, i32, i8**, i8**, %struct.GKI*, i32, i8**, i8***, %struct.GKI*, i32, %struct.GKI*, i32, i32, i32*, i32*, i32*, i32 }
%struct.GKI = type { %struct.gki_elem**, i32, i32, i32 }
%struct.gki_elem = type { i8*, i32, %struct.gki_elem* }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !21, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/modelmakers.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7, !8, !9, !6, !10, !12}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !15, line: 374, size: 256, align: 64, elements: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !14, file: !15, line: 375, baseType: !6, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !14, file: !15, line: 376, baseType: !10, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !14, file: !15, line: 377, baseType: !5, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !14, file: !15, line: 378, baseType: !5, size: 64, align: 64, offset: 192)
!21 = !{!22, !167, !180, !242, !254, !262, !276, !291, !303, !313, !319, !328, !331, !337, !340}
!22 = !DISubprogram(name: "P7Handmodelmaker", scope: !1, file: !1, line: 100, type: !23, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8**, %struct.plan7_s**, %struct.p7trace_s***)* @P7Handmodelmaker, variables: !160)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25, !31, !98, !159}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !27, line: 177, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !27, line: 112, size: 2880, align: 64, elements: !29)
!29 = !{!30, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !53, !55, !56, !57, !58, !59, !60, !61, !62, !63, !65, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !28, file: !27, line: 115, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !28, file: !27, line: 116, baseType: !31, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !28, file: !27, line: 117, baseType: !9, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !28, file: !27, line: 118, baseType: !6, size: 32, align: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !28, file: !27, line: 119, baseType: !6, size: 32, align: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !28, file: !27, line: 123, baseType: !6, size: 32, align: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !27, line: 124, baseType: !6, size: 32, align: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !27, line: 125, baseType: !10, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !28, file: !27, line: 126, baseType: !10, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !28, file: !27, line: 127, baseType: !10, size: 64, align: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !28, file: !27, line: 128, baseType: !10, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !28, file: !27, line: 129, baseType: !10, size: 64, align: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !28, file: !27, line: 130, baseType: !10, size: 64, align: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !28, file: !27, line: 131, baseType: !10, size: 64, align: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !28, file: !27, line: 132, baseType: !31, size: 64, align: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !28, file: !27, line: 133, baseType: !31, size: 64, align: 64, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !28, file: !27, line: 134, baseType: !31, size: 64, align: 64, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !28, file: !27, line: 135, baseType: !31, size: 64, align: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !28, file: !27, line: 136, baseType: !50, size: 192, align: 32, offset: 1024)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, align: 32, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 6)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !28, file: !27, line: 137, baseType: !54, size: 192, align: 32, offset: 1216)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, align: 32, elements: !51)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !28, file: !27, line: 144, baseType: !31, size: 64, align: 64, offset: 1408)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !28, file: !27, line: 145, baseType: !6, size: 32, align: 32, offset: 1472)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !28, file: !27, line: 146, baseType: !6, size: 32, align: 32, offset: 1504)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !28, file: !27, line: 148, baseType: !31, size: 64, align: 64, offset: 1536)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !28, file: !27, line: 149, baseType: !31, size: 64, align: 64, offset: 1600)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !28, file: !27, line: 150, baseType: !6, size: 32, align: 32, offset: 1664)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !28, file: !27, line: 151, baseType: !6, size: 32, align: 32, offset: 1696)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !28, file: !27, line: 153, baseType: !31, size: 64, align: 64, offset: 1728)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !28, file: !27, line: 154, baseType: !64, size: 64, align: 64, offset: 1792)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !28, file: !27, line: 155, baseType: !66, size: 64, align: 64, offset: 1856)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !68, line: 42, baseType: !69)
!68 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!69 = !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 36, size: 192, align: 64, elements: !70)
!70 = !{!71, !79, !80, !81}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !69, file: !68, line: 37, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !68, line: 26, size: 192, align: 64, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !74, file: !68, line: 27, baseType: !10, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !74, file: !68, line: 28, baseType: !6, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !74, file: !68, line: 29, baseType: !73, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !69, file: !68, line: 39, baseType: !6, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !69, file: !68, line: 40, baseType: !6, size: 32, align: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !69, file: !68, line: 41, baseType: !6, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !28, file: !27, line: 156, baseType: !6, size: 32, align: 32, offset: 1920)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !28, file: !27, line: 158, baseType: !31, size: 64, align: 64, offset: 1984)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !28, file: !27, line: 159, baseType: !31, size: 64, align: 64, offset: 2048)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !28, file: !27, line: 160, baseType: !66, size: 64, align: 64, offset: 2112)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !28, file: !27, line: 161, baseType: !6, size: 32, align: 32, offset: 2176)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !28, file: !27, line: 163, baseType: !31, size: 64, align: 64, offset: 2240)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !28, file: !27, line: 164, baseType: !64, size: 64, align: 64, offset: 2304)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !28, file: !27, line: 165, baseType: !66, size: 64, align: 64, offset: 2368)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !28, file: !27, line: 166, baseType: !6, size: 32, align: 32, offset: 2432)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !28, file: !27, line: 170, baseType: !66, size: 64, align: 64, offset: 2496)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !28, file: !27, line: 171, baseType: !6, size: 32, align: 32, offset: 2560)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !28, file: !27, line: 172, baseType: !6, size: 32, align: 32, offset: 2592)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !28, file: !27, line: 173, baseType: !5, size: 64, align: 64, offset: 2624)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !28, file: !27, line: 174, baseType: !5, size: 64, align: 64, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !28, file: !27, line: 175, baseType: !5, size: 64, align: 64, offset: 2752)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !28, file: !27, line: 176, baseType: !6, size: 32, align: 32, offset: 2816)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !15, line: 101, size: 3712, align: 64, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !132, !133, !134, !138, !139, !141, !142, !143, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !15, line: 113, baseType: !10, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !100, file: !15, line: 114, baseType: !10, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !100, file: !15, line: 115, baseType: !10, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !100, file: !15, line: 116, baseType: !10, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !100, file: !15, line: 117, baseType: !10, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !100, file: !15, line: 118, baseType: !10, size: 64, align: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !100, file: !15, line: 119, baseType: !10, size: 64, align: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !100, file: !15, line: 120, baseType: !6, size: 32, align: 32, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !100, file: !15, line: 121, baseType: !10, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !100, file: !15, line: 122, baseType: !5, size: 64, align: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !100, file: !15, line: 123, baseType: !6, size: 32, align: 32, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !100, file: !15, line: 134, baseType: !5, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !100, file: !15, line: 135, baseType: !5, size: 64, align: 64, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !100, file: !15, line: 136, baseType: !5, size: 64, align: 64, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !100, file: !15, line: 144, baseType: !7, size: 32, align: 32, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !100, file: !15, line: 144, baseType: !7, size: 32, align: 32, offset: 928)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !100, file: !15, line: 145, baseType: !7, size: 32, align: 32, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !100, file: !15, line: 145, baseType: !7, size: 32, align: 32, offset: 992)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !100, file: !15, line: 146, baseType: !7, size: 32, align: 32, offset: 1024)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !100, file: !15, line: 146, baseType: !7, size: 32, align: 32, offset: 1056)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !100, file: !15, line: 155, baseType: !6, size: 32, align: 32, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !100, file: !15, line: 156, baseType: !8, size: 64, align: 64, offset: 1152)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !100, file: !15, line: 157, baseType: !8, size: 64, align: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !100, file: !15, line: 158, baseType: !8, size: 64, align: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !100, file: !15, line: 159, baseType: !7, size: 32, align: 32, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !100, file: !15, line: 168, baseType: !128, size: 256, align: 32, offset: 1376)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, align: 32, elements: !129)
!129 = !{!130, !131}
!130 = !DISubrange(count: 4)
!131 = !DISubrange(count: 2)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !100, file: !15, line: 169, baseType: !9, size: 64, align: 64, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !100, file: !15, line: 170, baseType: !9, size: 64, align: 64, offset: 1728)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !100, file: !15, line: 174, baseType: !135, size: 640, align: 32, offset: 1792)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, align: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 20)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !100, file: !15, line: 175, baseType: !7, size: 32, align: 32, offset: 2432)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !100, file: !15, line: 197, baseType: !140, size: 64, align: 64, offset: 2496)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !100, file: !15, line: 198, baseType: !140, size: 64, align: 64, offset: 2560)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !100, file: !15, line: 199, baseType: !140, size: 64, align: 64, offset: 2624)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !100, file: !15, line: 200, baseType: !144, size: 256, align: 32, offset: 2688)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, align: 32, elements: !129)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !100, file: !15, line: 201, baseType: !5, size: 64, align: 64, offset: 2944)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !100, file: !15, line: 202, baseType: !5, size: 64, align: 64, offset: 3008)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !100, file: !15, line: 203, baseType: !5, size: 64, align: 64, offset: 3072)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !100, file: !15, line: 203, baseType: !5, size: 64, align: 64, offset: 3136)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !100, file: !15, line: 203, baseType: !5, size: 64, align: 64, offset: 3200)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !100, file: !15, line: 203, baseType: !5, size: 64, align: 64, offset: 3264)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !100, file: !15, line: 203, baseType: !5, size: 64, align: 64, offset: 3328)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !100, file: !15, line: 214, baseType: !140, size: 64, align: 64, offset: 3392)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !100, file: !15, line: 215, baseType: !140, size: 64, align: 64, offset: 3456)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !100, file: !15, line: 216, baseType: !6, size: 32, align: 32, offset: 3520)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !100, file: !15, line: 217, baseType: !6, size: 32, align: 32, offset: 3552)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !100, file: !15, line: 222, baseType: !7, size: 32, align: 32, offset: 3584)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !100, file: !15, line: 223, baseType: !7, size: 32, align: 32, offset: 3616)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !15, line: 225, baseType: !6, size: 32, align: 32, offset: 3648)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!160 = !{!161, !162, !163, !164, !165, !166}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !22, file: !1, line: 100, type: !25)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 2, scope: !22, file: !1, line: 100, type: !31)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 3, scope: !22, file: !1, line: 101, type: !98)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 4, scope: !22, file: !1, line: 101, type: !159)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "matassign", scope: !22, file: !1, line: 103, type: !5)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !22, file: !1, line: 104, type: !6)
!167 = !DISubprogram(name: "P7Fastmodelmaker", scope: !1, file: !1, line: 162, type: !168, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8**, float, %struct.plan7_s**, %struct.p7trace_s***)* @P7Fastmodelmaker, variables: !170)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !25, !31, !7, !98, !159}
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !167, file: !1, line: 162, type: !25)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 2, scope: !167, file: !1, line: 162, type: !31)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxgap", arg: 3, scope: !167, file: !1, line: 162, type: !7)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 4, scope: !167, file: !1, line: 163, type: !98)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 5, scope: !167, file: !1, line: 163, type: !159)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "matassign", scope: !167, file: !1, line: 165, type: !5)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !167, file: !1, line: 166, type: !6)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !167, file: !1, line: 167, type: !6)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngap", scope: !167, file: !1, line: 168, type: !6)
!180 = !DISubprogram(name: "P7Maxmodelmaker", scope: !1, file: !1, line: 227, type: !181, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8**, float, %struct.p7prior_s*, float*, float, float, %struct.plan7_s**, %struct.p7trace_s***)* @P7Maxmodelmaker, variables: !204)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !25, !31, !7, !183, !9, !7, !7, !98, !159}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7prior_s", file: !15, line: 385, size: 320128, align: 32, elements: !185)
!185 = !{!186, !187, !188, !192, !196, !197, !198, !201, !202, !203}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !184, file: !15, line: 386, baseType: !6, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tnum", scope: !184, file: !15, line: 388, baseType: !6, size: 32, align: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tq", scope: !184, file: !15, line: 389, baseType: !189, size: 6400, align: 32, offset: 64)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 6400, align: 32, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 200)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !184, file: !15, line: 390, baseType: !193, size: 44800, align: 32, offset: 6464)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 44800, align: 32, elements: !194)
!194 = !{!191, !195}
!195 = !DISubrange(count: 7)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mnum", scope: !184, file: !15, line: 392, baseType: !6, size: 32, align: 32, offset: 51264)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mq", scope: !184, file: !15, line: 393, baseType: !189, size: 6400, align: 32, offset: 51296)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !184, file: !15, line: 394, baseType: !199, size: 128000, align: 32, offset: 57696)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128000, align: 32, elements: !200)
!200 = !{!191, !137}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "inum", scope: !184, file: !15, line: 396, baseType: !6, size: 32, align: 32, offset: 185696)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !184, file: !15, line: 397, baseType: !189, size: 6400, align: 32, offset: 185728)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !184, file: !15, line: 398, baseType: !199, size: 128000, align: 32, offset: 192128)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !180, file: !1, line: 227, type: !25)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 2, scope: !180, file: !1, line: 227, type: !31)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxgap", arg: 3, scope: !180, file: !1, line: 227, type: !7)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prior", arg: 4, scope: !180, file: !1, line: 228, type: !183)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 5, scope: !180, file: !1, line: 229, type: !9)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null_p1", arg: 6, scope: !180, file: !1, line: 229, type: !7)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mpri", arg: 7, scope: !180, file: !1, line: 229, type: !7)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_hmm", arg: 8, scope: !180, file: !1, line: 230, type: !98)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 9, scope: !180, file: !1, line: 230, type: !159)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !180, file: !1, line: 232, type: !6)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !180, file: !1, line: 233, type: !6)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !180, file: !1, line: 233, type: !6)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !180, file: !1, line: 234, type: !6)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "matc", scope: !180, file: !1, line: 235, type: !8)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cij", scope: !180, file: !1, line: 236, type: !220)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, align: 32, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 8)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tij", scope: !180, file: !1, line: 236, type: !220)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "matp", scope: !180, file: !1, line: 237, type: !135)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insp", scope: !180, file: !1, line: 238, type: !135)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insc", scope: !180, file: !1, line: 239, type: !135)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !180, file: !1, line: 240, type: !9)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tbck", scope: !180, file: !1, line: 241, type: !5)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "matassign", scope: !180, file: !1, line: 242, type: !5)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insopt", scope: !180, file: !1, line: 243, type: !5)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !180, file: !1, line: 244, type: !6)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !180, file: !1, line: 244, type: !6)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bm1", scope: !180, file: !1, line: 245, type: !7)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bm2", scope: !180, file: !1, line: 245, type: !7)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "est_M", scope: !180, file: !1, line: 246, type: !6)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t_me", scope: !180, file: !1, line: 247, type: !7)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !180, file: !1, line: 248, type: !7)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bestsc", scope: !180, file: !1, line: 248, type: !7)
