; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.msa_struct = type { i8**, i8**, float*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8**, i8**, [6 x float], [6 x i32], i8**, i32, i32, i8**, i8**, i32, i32, i8**, i8***, %struct.GKI*, i32, i8**, i8**, %struct.GKI*, i32, i8**, i8***, %struct.GKI*, i32, %struct.GKI*, i32, i32, i32*, i32*, i32*, i32 }
%struct.GKI = type { %struct.gki_elem**, i32, i32, i32 }
%struct.gki_elem = type { i8*, i32, %struct.gki_elem* }
%struct.msafile_struct = type { %struct.__sFILE*, i8*, i32, i8*, i32, %struct.ssifile_s*, i32, i32, i32 }
%struct.ssifile_s = type { %struct.__sFILE*, i32, i16, i32, i32, i32, i32, i32, i32, i32, i32, %struct.ssioffset_s, %struct.ssioffset_s, %struct.ssioffset_s, i8, i8, i8**, i32*, i32*, i32*, i32* }
%struct.ssioffset_s = type { i8, %union.anon }
%union.anon = type { i64 }
%struct.aliinfo_s = type { i32, i32, i32, float*, i8*, i8*, %struct.seqinfo_s*, i8*, i8*, i8*, i8*, float, float, float, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!7 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!8 = !{!9, !95, !102, !105, !113, !119, !125, !132, !145, !151, !158, !166, !170, !308, !313, !321, !329, !335, !340, !346, !354, !362, !413, !417, !423, !429, !439, !452, !458, !462, !466, !470}
!9 = !DISubprogram(name: "MSAAlloc", scope: !1, file: !1, line: 63, type: !10, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: %struct.msa_struct* (i32, i32)* @MSAAlloc, variables: !90)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !25, !25}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !14, line: 177, baseType: !15)
!14 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !14, line: 112, size: 2880, align: 64, elements: !16)
!16 = !{!17, !21, !22, !24, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !44, !46, !47, !48, !49, !50, !51, !52, !53, !54, !56, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !87, !88, !89}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !15, file: !14, line: 115, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !15, file: !14, line: 116, baseType: !18, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !15, file: !14, line: 117, baseType: !23, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !15, file: !14, line: 118, baseType: !25, size: 32, align: 32, offset: 192)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !15, file: !14, line: 119, baseType: !25, size: 32, align: 32, offset: 224)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !14, line: 123, baseType: !25, size: 32, align: 32, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !14, line: 124, baseType: !25, size: 32, align: 32, offset: 288)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !15, file: !14, line: 125, baseType: !19, size: 64, align: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !15, file: !14, line: 126, baseType: !19, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !15, file: !14, line: 127, baseType: !19, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !15, file: !14, line: 128, baseType: !19, size: 64, align: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !15, file: !14, line: 129, baseType: !19, size: 64, align: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !15, file: !14, line: 130, baseType: !19, size: 64, align: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !15, file: !14, line: 131, baseType: !19, size: 64, align: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !15, file: !14, line: 132, baseType: !18, size: 64, align: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !15, file: !14, line: 133, baseType: !18, size: 64, align: 64, offset: 832)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !15, file: !14, line: 134, baseType: !18, size: 64, align: 64, offset: 896)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !15, file: !14, line: 135, baseType: !18, size: 64, align: 64, offset: 960)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !15, file: !14, line: 136, baseType: !41, size: 192, align: 32, offset: 1024)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, align: 32, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 6)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !15, file: !14, line: 137, baseType: !45, size: 192, align: 32, offset: 1216)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, align: 32, elements: !42)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !15, file: !14, line: 144, baseType: !18, size: 64, align: 64, offset: 1408)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !15, file: !14, line: 145, baseType: !25, size: 32, align: 32, offset: 1472)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !15, file: !14, line: 146, baseType: !25, size: 32, align: 32, offset: 1504)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !15, file: !14, line: 148, baseType: !18, size: 64, align: 64, offset: 1536)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !15, file: !14, line: 149, baseType: !18, size: 64, align: 64, offset: 1600)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !15, file: !14, line: 150, baseType: !25, size: 32, align: 32, offset: 1664)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !15, file: !14, line: 151, baseType: !25, size: 32, align: 32, offset: 1696)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !15, file: !14, line: 153, baseType: !18, size: 64, align: 64, offset: 1728)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !15, file: !14, line: 154, baseType: !55, size: 64, align: 64, offset: 1792)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !15, file: !14, line: 155, baseType: !57, size: 64, align: 64, offset: 1856)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !59, line: 42, baseType: !60)
!59 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 36, size: 192, align: 64, elements: !61)
!61 = !{!62, !70, !71, !72}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !60, file: !59, line: 37, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !59, line: 26, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !65, file: !59, line: 27, baseType: !19, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !65, file: !59, line: 28, baseType: !25, size: 32, align: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !65, file: !59, line: 29, baseType: !64, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !60, file: !59, line: 39, baseType: !25, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !60, file: !59, line: 40, baseType: !25, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !60, file: !59, line: 41, baseType: !25, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !15, file: !14, line: 156, baseType: !25, size: 32, align: 32, offset: 1920)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !15, file: !14, line: 158, baseType: !18, size: 64, align: 64, offset: 1984)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !15, file: !14, line: 159, baseType: !18, size: 64, align: 64, offset: 2048)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !15, file: !14, line: 160, baseType: !57, size: 64, align: 64, offset: 2112)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !15, file: !14, line: 161, baseType: !25, size: 32, align: 32, offset: 2176)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !15, file: !14, line: 163, baseType: !18, size: 64, align: 64, offset: 2240)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !15, file: !14, line: 164, baseType: !55, size: 64, align: 64, offset: 2304)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !15, file: !14, line: 165, baseType: !57, size: 64, align: 64, offset: 2368)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !15, file: !14, line: 166, baseType: !25, size: 32, align: 32, offset: 2432)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !15, file: !14, line: 170, baseType: !57, size: 64, align: 64, offset: 2496)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !15, file: !14, line: 171, baseType: !25, size: 32, align: 32, offset: 2560)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !15, file: !14, line: 172, baseType: !25, size: 32, align: 32, offset: 2592)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !15, file: !14, line: 173, baseType: !86, size: 64, align: 64, offset: 2624)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !15, file: !14, line: 174, baseType: !86, size: 64, align: 64, offset: 2688)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !15, file: !14, line: 175, baseType: !86, size: 64, align: 64, offset: 2752)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !15, file: !14, line: 176, baseType: !25, size: 32, align: 32, offset: 2816)
!90 = !{!91, !92, !93, !94}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 1, scope: !9, file: !1, line: 63, type: !25)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 2, scope: !9, file: !1, line: 63, type: !25)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msa", scope: !9, file: !1, line: 65, type: !12)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !9, file: !1, line: 66, type: !25)
!95 = !DISubprogram(name: "MSAExpand", scope: !1, file: !1, line: 156, type: !96, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*)* @MSAExpand, variables: !98)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !12}
!98 = !{!99, !100, !101}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !95, file: !1, line: 156, type: !12)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !95, file: !1, line: 158, type: !25)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !95, file: !1, line: 158, type: !25)
!102 = !DISubprogram(name: "MSAFree", scope: !1, file: !1, line: 251, type: !96, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*)* @MSAFree, variables: !103)
!103 = !{!104}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !102, file: !1, line: 251, type: !12)
!105 = !DISubprogram(name: "MSASetSeqAccession", scope: !1, file: !1, line: 305, type: !106, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i32, i8*)* @MSASetSeqAccession, variables: !108)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !12, !25, !19}
!108 = !{!109, !110, !111, !112}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !105, file: !1, line: 305, type: !12)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seqidx", arg: 2, scope: !105, file: !1, line: 305, type: !25)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "acc", arg: 3, scope: !105, file: !1, line: 305, type: !19)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !105, file: !1, line: 307, type: !25)
!113 = !DISubprogram(name: "MSASetSeqDescription", scope: !1, file: !1, line: 330, type: !106, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i32, i8*)* @MSASetSeqDescription, variables: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !113, file: !1, line: 330, type: !12)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seqidx", arg: 2, scope: !113, file: !1, line: 330, type: !25)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 3, scope: !113, file: !1, line: 330, type: !19)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !113, file: !1, line: 332, type: !25)
!119 = !DISubprogram(name: "MSAAddComment", scope: !1, file: !1, line: 355, type: !120, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8*)* @MSAAddComment, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !12, !19}
!122 = !{!123, !124}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !119, file: !1, line: 355, type: !12)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !119, file: !1, line: 355, type: !19)
!125 = !DISubprogram(name: "MSAAddGF", scope: !1, file: !1, line: 388, type: !126, isLocal: false, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8*, i8*)* @MSAAddGF, variables: !128)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !12, !19, !19}
!128 = !{!129, !130, !131}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !125, file: !1, line: 388, type: !12)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 2, scope: !125, file: !1, line: 388, type: !19)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !125, file: !1, line: 388, type: !19)
!132 = !DISubprogram(name: "MSAAddGS", scope: !1, file: !1, line: 433, type: !133, isLocal: false, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8*, i32, i8*)* @MSAAddGS, variables: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !12, !19, !25, !19}
!135 = !{!136, !137, !138, !139, !140, !141, !142}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !132, file: !1, line: 433, type: !12)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 2, scope: !132, file: !1, line: 433, type: !19)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqidx", arg: 3, scope: !132, file: !1, line: 433, type: !25)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 4, scope: !132, file: !1, line: 433, type: !19)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tagidx", scope: !132, file: !1, line: 435, type: !25)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !132, file: !1, line: 436, type: !25)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !143, file: !1, line: 480, type: !25)
!143 = distinct !DILexicalBlock(scope: !144, file: !1, line: 478, column: 8)
!144 = distinct !DILexicalBlock(scope: !132, file: !1, line: 476, column: 7)
!145 = !DISubprogram(name: "MSAAppendGC", scope: !1, file: !1, line: 507, type: !126, isLocal: false, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8*, i8*)* @MSAAppendGC, variables: !146)
!146 = !{!147, !148, !149, !150}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !145, file: !1, line: 507, type: !12)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 2, scope: !145, file: !1, line: 507, type: !19)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !145, file: !1, line: 507, type: !19)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tagidx", scope: !145, file: !1, line: 509, type: !25)
!151 = !DISubprogram(name: "MSAGetGC", scope: !1, file: !1, line: 561, type: !152, isLocal: false, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.msa_struct*, i8*)* @MSAGetGC, variables: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{!19, !12, !19}
!154 = !{!155, !156, !157}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !151, file: !1, line: 561, type: !12)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 2, scope: !151, file: !1, line: 561, type: !19)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tagidx", scope: !151, file: !1, line: 563, type: !25)
!158 = !DISubprogram(name: "MSAAppendGR", scope: !1, file: !1, line: 590, type: !133, isLocal: false, isDefinition: true, scopeLine: 591, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i8*, i32, i8*)* @MSAAppendGR, variables: !159)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !158, file: !1, line: 590, type: !12)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 2, scope: !158, file: !1, line: 590, type: !19)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqidx", arg: 3, scope: !158, file: !1, line: 590, type: !25)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 4, scope: !158, file: !1, line: 590, type: !19)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tagidx", scope: !158, file: !1, line: 592, type: !25)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !158, file: !1, line: 593, type: !25)
!166 = !DISubprogram(name: "MSAVerifyParse", scope: !1, file: !1, line: 662, type: !96, isLocal: false, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*)* @MSAVerifyParse, variables: !167)
!167 = !{!168, !169}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !166, file: !1, line: 662, type: !12)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !166, file: !1, line: 664, type: !25)
!170 = !DISubprogram(name: "MSAFileOpen", scope: !1, file: !1, line: 756, type: !171, isLocal: false, isDefinition: true, scopeLine: 757, flags: DIFlagPrototyped, isOptimized: true, function: %struct.msafile_struct* (i8*, i32, i8*)* @MSAFileOpen, variables: !289)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !19, !25, !19}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSAFILE", file: !14, line: 199, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "msafile_struct", file: !14, line: 186, size: 512, align: 64, elements: !176)
!176 = !{!177, !238, !239, !240, !241, !242, !286, !287, !288}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !175, file: !14, line: 187, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !180, line: 153, baseType: !181)
!180 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !180, line: 122, size: 1216, align: 64, elements: !182)
!182 = !{!183, !186, !187, !188, !190, !191, !196, !197, !198, !202, !206, !216, !222, !223, !226, !227, !231, !235, !236, !237}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !181, file: !180, line: 123, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !181, file: !180, line: 124, baseType: !25, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !181, file: !180, line: 125, baseType: !25, size: 32, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !181, file: !180, line: 126, baseType: !189, size: 16, align: 16, offset: 128)
!189 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !181, file: !180, line: 127, baseType: !189, size: 16, align: 16, offset: 144)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !181, file: !180, line: 128, baseType: !192, size: 128, align: 64, offset: 192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !180, line: 88, size: 128, align: 64, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !192, file: !180, line: 89, baseType: !184, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !192, file: !180, line: 90, baseType: !25, size: 32, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !181, file: !180, line: 129, baseType: !25, size: 32, align: 32, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !181, file: !180, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !181, file: !180, line: 133, baseType: !199, size: 64, align: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!25, !4}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !181, file: !180, line: 134, baseType: !203, size: 64, align: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!25, !4, !19, !25}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !181, file: !180, line: 135, baseType: !207, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !4, !210, !25}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !180, line: 77, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !212, line: 71, baseType: !213)
!212 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !214, line: 46, baseType: !215)
!214 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!215 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !181, file: !180, line: 136, baseType: !217, size: 64, align: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!25, !4, !220, !25}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !181, file: !180, line: 139, baseType: !192, size: 128, align: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !181, file: !180, line: 140, baseType: !224, size: 64, align: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !180, line: 94, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !181, file: !180, line: 141, baseType: !25, size: 32, align: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !181, file: !180, line: 144, baseType: !228, size: 24, align: 8, offset: 928)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 24, align: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 3)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !181, file: !180, line: 145, baseType: !232, size: 8, align: 8, offset: 952)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 8, align: 8, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 1)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !181, file: !180, line: 148, baseType: !192, size: 128, align: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !181, file: !180, line: 151, baseType: !25, size: 32, align: 32, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !181, file: !180, line: 152, baseType: !210, size: 64, align: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !175, file: !14, line: 188, baseType: !19, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "linenumber", scope: !175, file: !14, line: 189, baseType: !25, size: 32, align: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !175, file: !14, line: 191, baseType: !19, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !175, file: !14, line: 192, baseType: !25, size: 32, align: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ssi", scope: !175, file: !14, line: 194, baseType: !243, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIFILE", file: !245, line: 76, baseType: !246)
!245 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssifile_s", file: !245, line: 49, size: 1152, align: 64, elements: !247)
!247 = !{!248, !249, !253, !256, !257, !258, !259, !260, !261, !262, !263, !264, !276, !277, !278, !279, !280, !281, !283, !284, !285}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !246, file: !245, line: 50, baseType: !178, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !246, file: !245, line: 51, baseType: !250, size: 32, align: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !251, line: 41, baseType: !252)
!251 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!252 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !246, file: !245, line: 52, baseType: !254, size: 16, align: 16, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !251, line: 40, baseType: !255)
!255 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !246, file: !245, line: 53, baseType: !250, size: 32, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !246, file: !245, line: 54, baseType: !250, size: 32, align: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !246, file: !245, line: 55, baseType: !250, size: 32, align: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !246, file: !245, line: 56, baseType: !250, size: 32, align: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !246, file: !245, line: 57, baseType: !250, size: 32, align: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "frecsize", scope: !246, file: !245, line: 58, baseType: !250, size: 32, align: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "precsize", scope: !246, file: !245, line: 59, baseType: !250, size: 32, align: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "srecsize", scope: !246, file: !245, line: 60, baseType: !250, size: 32, align: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "foffset", scope: !246, file: !245, line: 61, baseType: !265, size: 128, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIOFFSET", file: !245, line: 42, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssioffset_s", file: !245, line: 35, size: 128, align: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !266, file: !245, line: 36, baseType: !20, size: 8, align: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !266, file: !245, line: 40, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !245, line: 37, size: 64, align: 64, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !270, file: !245, line: 38, baseType: !250, size: 32, align: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !270, file: !245, line: 39, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint64", file: !251, line: 42, baseType: !275)
!275 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "poffset", scope: !246, file: !245, line: 62, baseType: !265, size: 128, align: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "soffset", scope: !246, file: !245, line: 63, baseType: !265, size: 128, align: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !246, file: !245, line: 65, baseType: !20, size: 8, align: 8, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !246, file: !245, line: 66, baseType: !20, size: 8, align: 8, offset: 776)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !246, file: !245, line: 70, baseType: !18, size: 64, align: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !246, file: !245, line: 71, baseType: !282, size: 64, align: 64, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !246, file: !245, line: 72, baseType: !282, size: 64, align: 64, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !246, file: !245, line: 73, baseType: !282, size: 64, align: 64, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !246, file: !245, line: 74, baseType: !282, size: 64, align: 64, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "do_gzip", scope: !175, file: !14, line: 196, baseType: !25, size: 32, align: 32, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "do_stdin", scope: !175, file: !14, line: 197, baseType: !25, size: 32, align: 32, offset: 416)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !175, file: !14, line: 198, baseType: !25, size: 32, align: 32, offset: 448)
!289 = !{!290, !291, !292, !293, !294, !301, !303, !304}
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !170, file: !1, line: 756, type: !19)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !170, file: !1, line: 756, type: !25)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "env", arg: 3, scope: !170, file: !1, line: 756, type: !19)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "afp", scope: !170, file: !1, line: 758, type: !173)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmd", scope: !295, file: !1, line: 773, type: !298)
!295 = distinct !DILexicalBlock(scope: !296, file: !1, line: 772, column: 5)
!296 = distinct !DILexicalBlock(scope: !297, file: !1, line: 771, column: 12)
!297 = distinct !DILexicalBlock(scope: !170, file: !1, line: 761, column: 7)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, align: 8, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 256)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssifile", scope: !302, file: !1, line: 797, type: !19)
!302 = distinct !DILexicalBlock(scope: !296, file: !1, line: 796, column: 5)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !302, file: !1, line: 798, type: !19)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "full", scope: !305, file: !1, line: 811, type: !19)
!305 = distinct !DILexicalBlock(scope: !306, file: !1, line: 810, column: 2)
!306 = distinct !DILexicalBlock(scope: !307, file: !1, line: 809, column: 16)
!307 = distinct !DILexicalBlock(scope: !302, file: !1, line: 804, column: 11)
!308 = !DISubprogram(name: "MSAFileRewind", scope: !1, file: !1, line: 873, type: !309, isLocal: false, isDefinition: true, scopeLine: 874, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.msafile_struct*)* @MSAFileRewind, variables: !311)
!309 = !DISubroutineType(types: !310)
!310 = !{!25, !173}
!311 = !{!312}
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !308, file: !1, line: 873, type: !173)
!313 = !DISubprogram(name: "MSAFilePositionByKey", scope: !1, file: !1, line: 880, type: !314, isLocal: false, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.msafile_struct*, i8*)* @MSAFilePositionByKey, variables: !316)
!314 = !DISubroutineType(types: !315)
!315 = !{!25, !173, !19}
!316 = !{!317, !318, !319, !320}
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !313, file: !1, line: 880, type: !173)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !313, file: !1, line: 880, type: !19)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fh", scope: !313, file: !1, line: 882, type: !25)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !313, file: !1, line: 883, type: !265)
!321 = !DISubprogram(name: "MSAFilePositionByIndex", scope: !1, file: !1, line: 891, type: !322, isLocal: false, isDefinition: true, scopeLine: 892, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.msafile_struct*, i32)* @MSAFilePositionByIndex, variables: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!25, !173, !25}
!324 = !{!325, !326, !327, !328}
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !321, file: !1, line: 891, type: !173)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 2, scope: !321, file: !1, line: 891, type: !25)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fh", scope: !321, file: !1, line: 893, type: !25)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !321, file: !1, line: 894, type: !265)
!329 = !DISubprogram(name: "MSAFileRead", scope: !1, file: !1, line: 914, type: !330, isLocal: false, isDefinition: true, scopeLine: 915, flags: DIFlagPrototyped, isOptimized: true, function: %struct.msa_struct* (%struct.msafile_struct*)* @MSAFileRead, variables: !332)
!330 = !DISubroutineType(types: !331)
!331 = !{!12, !173}
!332 = !{!333, !334}
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !329, file: !1, line: 914, type: !173)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msa", scope: !329, file: !1, line: 916, type: !12)
!335 = !DISubprogram(name: "MSAFileClose", scope: !1, file: !1, line: 941, type: !336, isLocal: false, isDefinition: true, scopeLine: 942, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msafile_struct*)* @MSAFileClose, variables: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !173}
!338 = !{!339}
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !335, file: !1, line: 941, type: !173)
!340 = !DISubprogram(name: "MSAFileGetLine", scope: !1, file: !1, line: 955, type: !341, isLocal: false, isDefinition: true, scopeLine: 956, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.msafile_struct*)* @MSAFileGetLine, variables: !343)
!341 = !DISubroutineType(types: !342)
!342 = !{!19, !173}
!343 = !{!344, !345}
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !340, file: !1, line: 955, type: !173)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !340, file: !1, line: 957, type: !19)
!346 = !DISubprogram(name: "MSAFileWrite", scope: !1, file: !1, line: 965, type: !347, isLocal: false, isDefinition: true, scopeLine: 966, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.msa_struct*, i32, i32)* @MSAFileWrite, variables: !349)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !178, !12, !25, !25}
!349 = !{!350, !351, !352, !353}
!350 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !346, file: !1, line: 965, type: !178)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 2, scope: !346, file: !1, line: 965, type: !12)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outfmt", arg: 3, scope: !346, file: !1, line: 965, type: !25)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_oneline", arg: 4, scope: !346, file: !1, line: 965, type: !25)
!354 = !DISubprogram(name: "MSAGetSeqidx", scope: !1, file: !1, line: 1001, type: !355, isLocal: false, isDefinition: true, scopeLine: 1002, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.msa_struct*, i8*, i32)* @MSAGetSeqidx, variables: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!25, !12, !19, !25}
!357 = !{!358, !359, !360, !361}
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !354, file: !1, line: 1001, type: !12)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !354, file: !1, line: 1001, type: !19)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "guess", arg: 3, scope: !354, file: !1, line: 1001, type: !25)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seqidx", scope: !354, file: !1, line: 1003, type: !25)
!362 = !DISubprogram(name: "MSAFromAINFO", scope: !1, file: !1, line: 1033, type: !363, isLocal: false, isDefinition: true, scopeLine: 1034, flags: DIFlagPrototyped, isOptimized: true, function: %struct.msa_struct* (i8**, %struct.aliinfo_s*)* @MSAFromAINFO, variables: !407)
!363 = !DISubroutineType(types: !364)
!364 = !{!12, !18, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AINFO", file: !14, line: 83, baseType: !367)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "aliinfo_s", file: !14, line: 65, size: 832, align: 64, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !367, file: !14, line: 66, baseType: !25, size: 32, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !367, file: !14, line: 67, baseType: !25, size: 32, align: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !367, file: !14, line: 68, baseType: !25, size: 32, align: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !367, file: !14, line: 69, baseType: !23, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !367, file: !14, line: 70, baseType: !19, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !367, file: !14, line: 71, baseType: !19, size: 64, align: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sqinfo", scope: !367, file: !14, line: 72, baseType: !376, size: 64, align: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "seqinfo_s", file: !251, line: 84, size: 2880, align: 64, elements: !378)
!378 = !{!379, !380, !384, !385, !386, !390, !391, !392, !393, !394, !395, !396}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !251, line: 85, baseType: !25, size: 32, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !251, line: 86, baseType: !381, size: 512, align: 8, offset: 32)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, align: 8, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !377, file: !251, line: 87, baseType: !381, size: 512, align: 8, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !377, file: !251, line: 88, baseType: !381, size: 512, align: 8, offset: 1056)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !377, file: !251, line: 89, baseType: !387, size: 1024, align: 8, offset: 1568)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, align: 8, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !377, file: !251, line: 90, baseType: !25, size: 32, align: 32, offset: 2592)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !377, file: !251, line: 91, baseType: !25, size: 32, align: 32, offset: 2624)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !377, file: !251, line: 92, baseType: !25, size: 32, align: 32, offset: 2656)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "olen", scope: !377, file: !251, line: 93, baseType: !25, size: 32, align: 32, offset: 2688)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !251, line: 94, baseType: !25, size: 32, align: 32, offset: 2720)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !377, file: !251, line: 95, baseType: !19, size: 64, align: 64, offset: 2752)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !377, file: !251, line: 96, baseType: !19, size: 64, align: 64, offset: 2816)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !14, line: 75, baseType: !19, size: 64, align: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !367, file: !14, line: 76, baseType: !19, size: 64, align: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !367, file: !14, line: 77, baseType: !19, size: 64, align: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !367, file: !14, line: 78, baseType: !19, size: 64, align: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !367, file: !14, line: 79, baseType: !7, size: 32, align: 32, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !367, file: !14, line: 79, baseType: !7, size: 32, align: 32, offset: 672)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !367, file: !14, line: 80, baseType: !7, size: 32, align: 32, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !367, file: !14, line: 80, baseType: !7, size: 32, align: 32, offset: 736)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !367, file: !14, line: 81, baseType: !7, size: 32, align: 32, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !367, file: !14, line: 81, baseType: !7, size: 32, align: 32, offset: 800)
!407 = !{!408, !409, !410, !411, !412}
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !362, file: !1, line: 1033, type: !18)
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ainfo", arg: 2, scope: !362, file: !1, line: 1033, type: !365)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msa", scope: !362, file: !1, line: 1035, type: !12)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !362, file: !1, line: 1036, type: !25)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !362, file: !1, line: 1036, type: !25)
!413 = !DISubprogram(name: "MSAFileFormat", scope: !1, file: !1, line: 1122, type: !309, isLocal: false, isDefinition: true, scopeLine: 1123, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.msafile_struct*)* @MSAFileFormat, variables: !414)
!414 = !{!415, !416}
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !413, file: !1, line: 1122, type: !173)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !413, file: !1, line: 1124, type: !25)
!417 = !DISubprogram(name: "MSAMingap", scope: !1, file: !1, line: 1151, type: !96, isLocal: false, isDefinition: true, scopeLine: 1152, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*)* @MSAMingap, variables: !418)
!418 = !{!419, !420, !421, !422}
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !417, file: !1, line: 1151, type: !12)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "useme", scope: !417, file: !1, line: 1153, type: !86)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !417, file: !1, line: 1154, type: !25)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !417, file: !1, line: 1155, type: !25)
!423 = !DISubprogram(name: "MSANogap", scope: !1, file: !1, line: 1183, type: !96, isLocal: false, isDefinition: true, scopeLine: 1184, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*)* @MSANogap, variables: !424)
!424 = !{!425, !426, !427, !428}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !423, file: !1, line: 1183, type: !12)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "useme", scope: !423, file: !1, line: 1185, type: !86)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !423, file: !1, line: 1186, type: !25)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !423, file: !1, line: 1187, type: !25)
!429 = !DISubprogram(name: "MSAShorterAlignment", scope: !1, file: !1, line: 1219, type: !430, isLocal: false, isDefinition: true, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i32*)* @MSAShorterAlignment, variables: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !12, !86}
!432 = !{!433, !434, !435, !436, !437, !438}
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !429, file: !1, line: 1219, type: !12)
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "useme", arg: 2, scope: !429, file: !1, line: 1219, type: !86)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !429, file: !1, line: 1221, type: !25)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mpos", scope: !429, file: !1, line: 1222, type: !25)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !429, file: !1, line: 1223, type: !25)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !429, file: !1, line: 1224, type: !25)
