; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msf.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.msa_struct = type { i8**, i8**, float*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8**, i8**, [6 x float], [6 x i32], i8**, i32, i32, i8**, i8**, i32, i32, i8**, i8***, %struct.GKI*, i32, i8**, i8**, %struct.GKI*, i32, i8**, i8***, %struct.GKI*, i32, %struct.GKI*, i32, i32, i32*, i32*, i32*, i32 }
%struct.GKI = type { %struct.gki_elem**, i32, i32, i32 }
%struct.gki_elem = type { i8*, i32, %struct.gki_elem* }
%struct.msafile_struct = type { %struct.__sFILE*, i8*, i32, i8*, i32, %struct.ssifile_s*, i32, i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msf.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!7 = !{!8, !218, !245, !251, !259, !262, !268}
!8 = !DISubprogram(name: "ReadMSF", scope: !1, file: !1, line: 82, type: !9, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: %struct.msa_struct* (%struct.msafile_struct*)* @ReadMSF, variables: !205)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !89}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !13, line: 177, baseType: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !13, line: 112, size: 2880, align: 64, elements: !15)
!15 = !{!16, !20, !21, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !43, !45, !46, !47, !48, !49, !50, !51, !52, !53, !55, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !86, !87, !88}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !14, file: !13, line: 115, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !14, file: !13, line: 116, baseType: !17, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !14, file: !13, line: 117, baseType: !22, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !14, file: !13, line: 118, baseType: !5, size: 32, align: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !14, file: !13, line: 119, baseType: !5, size: 32, align: 32, offset: 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !14, file: !13, line: 123, baseType: !5, size: 32, align: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !14, file: !13, line: 124, baseType: !5, size: 32, align: 32, offset: 288)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 125, baseType: !18, size: 64, align: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !14, file: !13, line: 126, baseType: !18, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !14, file: !13, line: 127, baseType: !18, size: 64, align: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !14, file: !13, line: 128, baseType: !18, size: 64, align: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !14, file: !13, line: 129, baseType: !18, size: 64, align: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !14, file: !13, line: 130, baseType: !18, size: 64, align: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !14, file: !13, line: 131, baseType: !18, size: 64, align: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !14, file: !13, line: 132, baseType: !17, size: 64, align: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !14, file: !13, line: 133, baseType: !17, size: 64, align: 64, offset: 832)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !14, file: !13, line: 134, baseType: !17, size: 64, align: 64, offset: 896)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !14, file: !13, line: 135, baseType: !17, size: 64, align: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !14, file: !13, line: 136, baseType: !40, size: 192, align: 32, offset: 1024)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 192, align: 32, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 6)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !14, file: !13, line: 137, baseType: !44, size: 192, align: 32, offset: 1216)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, align: 32, elements: !41)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !14, file: !13, line: 144, baseType: !17, size: 64, align: 64, offset: 1408)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !14, file: !13, line: 145, baseType: !5, size: 32, align: 32, offset: 1472)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !14, file: !13, line: 146, baseType: !5, size: 32, align: 32, offset: 1504)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !14, file: !13, line: 148, baseType: !17, size: 64, align: 64, offset: 1536)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !14, file: !13, line: 149, baseType: !17, size: 64, align: 64, offset: 1600)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !14, file: !13, line: 150, baseType: !5, size: 32, align: 32, offset: 1664)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !14, file: !13, line: 151, baseType: !5, size: 32, align: 32, offset: 1696)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !14, file: !13, line: 153, baseType: !17, size: 64, align: 64, offset: 1728)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !14, file: !13, line: 154, baseType: !54, size: 64, align: 64, offset: 1792)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !14, file: !13, line: 155, baseType: !56, size: 64, align: 64, offset: 1856)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !58, line: 42, baseType: !59)
!58 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 36, size: 192, align: 64, elements: !60)
!60 = !{!61, !69, !70, !71}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !59, file: !58, line: 37, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !58, line: 26, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !64, file: !58, line: 27, baseType: !18, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !64, file: !58, line: 28, baseType: !5, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !64, file: !58, line: 29, baseType: !63, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !59, file: !58, line: 39, baseType: !5, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !59, file: !58, line: 40, baseType: !5, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !59, file: !58, line: 41, baseType: !5, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !14, file: !13, line: 156, baseType: !5, size: 32, align: 32, offset: 1920)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !14, file: !13, line: 158, baseType: !17, size: 64, align: 64, offset: 1984)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !14, file: !13, line: 159, baseType: !17, size: 64, align: 64, offset: 2048)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !14, file: !13, line: 160, baseType: !56, size: 64, align: 64, offset: 2112)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !14, file: !13, line: 161, baseType: !5, size: 32, align: 32, offset: 2176)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !14, file: !13, line: 163, baseType: !17, size: 64, align: 64, offset: 2240)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !14, file: !13, line: 164, baseType: !54, size: 64, align: 64, offset: 2304)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !14, file: !13, line: 165, baseType: !56, size: 64, align: 64, offset: 2368)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !14, file: !13, line: 166, baseType: !5, size: 32, align: 32, offset: 2432)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !14, file: !13, line: 170, baseType: !56, size: 64, align: 64, offset: 2496)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !14, file: !13, line: 171, baseType: !5, size: 32, align: 32, offset: 2560)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !14, file: !13, line: 172, baseType: !5, size: 32, align: 32, offset: 2592)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !14, file: !13, line: 173, baseType: !85, size: 64, align: 64, offset: 2624)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !14, file: !13, line: 174, baseType: !85, size: 64, align: 64, offset: 2688)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !14, file: !13, line: 175, baseType: !85, size: 64, align: 64, offset: 2752)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !14, file: !13, line: 176, baseType: !5, size: 32, align: 32, offset: 2816)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSAFILE", file: !13, line: 199, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "msafile_struct", file: !13, line: 186, size: 512, align: 64, elements: !92)
!92 = !{!93, !154, !155, !156, !157, !158, !202, !203, !204}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !91, file: !13, line: 187, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !96, line: 153, baseType: !97)
!96 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !96, line: 122, size: 1216, align: 64, elements: !98)
!98 = !{!99, !102, !103, !104, !106, !107, !112, !113, !114, !118, !122, !132, !138, !139, !142, !143, !147, !151, !152, !153}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !97, file: !96, line: 123, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !97, file: !96, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !97, file: !96, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !97, file: !96, line: 126, baseType: !105, size: 16, align: 16, offset: 128)
!105 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !97, file: !96, line: 127, baseType: !105, size: 16, align: 16, offset: 144)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !97, file: !96, line: 128, baseType: !108, size: 128, align: 64, offset: 192)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !96, line: 88, size: 128, align: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !108, file: !96, line: 89, baseType: !100, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !108, file: !96, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !97, file: !96, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !97, file: !96, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !97, file: !96, line: 133, baseType: !115, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !97, file: !96, line: 134, baseType: !119, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!5, !4, !18, !5}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !97, file: !96, line: 135, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !4, !126, !5}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !96, line: 77, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !128, line: 71, baseType: !129)
!128 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !130, line: 46, baseType: !131)
!130 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!131 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !97, file: !96, line: 136, baseType: !133, size: 64, align: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!5, !4, !136, !5}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !97, file: !96, line: 139, baseType: !108, size: 128, align: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !97, file: !96, line: 140, baseType: !140, size: 64, align: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !96, line: 94, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !97, file: !96, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !97, file: !96, line: 144, baseType: !144, size: 24, align: 8, offset: 928)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 24, align: 8, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 3)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !97, file: !96, line: 145, baseType: !148, size: 8, align: 8, offset: 952)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 8, align: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !97, file: !96, line: 148, baseType: !108, size: 128, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !97, file: !96, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !97, file: !96, line: 152, baseType: !126, size: 64, align: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !91, file: !13, line: 188, baseType: !18, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "linenumber", scope: !91, file: !13, line: 189, baseType: !5, size: 32, align: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !91, file: !13, line: 191, baseType: !18, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !91, file: !13, line: 192, baseType: !5, size: 32, align: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ssi", scope: !91, file: !13, line: 194, baseType: !159, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIFILE", file: !161, line: 76, baseType: !162)
!161 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssifile_s", file: !161, line: 49, size: 1152, align: 64, elements: !163)
!163 = !{!164, !165, !169, !172, !173, !174, !175, !176, !177, !178, !179, !180, !192, !193, !194, !195, !196, !197, !199, !200, !201}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !162, file: !161, line: 50, baseType: !94, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !162, file: !161, line: 51, baseType: !166, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !167, line: 41, baseType: !168)
!167 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!168 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !162, file: !161, line: 52, baseType: !170, size: 16, align: 16, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !167, line: 40, baseType: !171)
!171 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !162, file: !161, line: 53, baseType: !166, size: 32, align: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !162, file: !161, line: 54, baseType: !166, size: 32, align: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !162, file: !161, line: 55, baseType: !166, size: 32, align: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !162, file: !161, line: 56, baseType: !166, size: 32, align: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !162, file: !161, line: 57, baseType: !166, size: 32, align: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "frecsize", scope: !162, file: !161, line: 58, baseType: !166, size: 32, align: 32, offset: 288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "precsize", scope: !162, file: !161, line: 59, baseType: !166, size: 32, align: 32, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "srecsize", scope: !162, file: !161, line: 60, baseType: !166, size: 32, align: 32, offset: 352)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "foffset", scope: !162, file: !161, line: 61, baseType: !181, size: 128, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIOFFSET", file: !161, line: 42, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssioffset_s", file: !161, line: 35, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !182, file: !161, line: 36, baseType: !19, size: 8, align: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !182, file: !161, line: 40, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !161, line: 37, size: 64, align: 64, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !186, file: !161, line: 38, baseType: !166, size: 32, align: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !186, file: !161, line: 39, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint64", file: !167, line: 42, baseType: !191)
!191 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "poffset", scope: !162, file: !161, line: 62, baseType: !181, size: 128, align: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "soffset", scope: !162, file: !161, line: 63, baseType: !181, size: 128, align: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !162, file: !161, line: 65, baseType: !19, size: 8, align: 8, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !162, file: !161, line: 66, baseType: !19, size: 8, align: 8, offset: 776)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !162, file: !161, line: 70, baseType: !17, size: 64, align: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !162, file: !161, line: 71, baseType: !198, size: 64, align: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !162, file: !161, line: 72, baseType: !198, size: 64, align: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !162, file: !161, line: 73, baseType: !198, size: 64, align: 64, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !162, file: !161, line: 74, baseType: !198, size: 64, align: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "do_gzip", scope: !91, file: !13, line: 196, baseType: !5, size: 32, align: 32, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "do_stdin", scope: !91, file: !13, line: 197, baseType: !5, size: 32, align: 32, offset: 416)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !91, file: !13, line: 198, baseType: !5, size: 32, align: 32, offset: 448)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "afp", arg: 1, scope: !8, file: !1, line: 82, type: !89)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msa", scope: !8, file: !1, line: 84, type: !11)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !8, file: !1, line: 85, type: !18)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alleged_alen", scope: !8, file: !1, line: 86, type: !5)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alleged_type", scope: !8, file: !1, line: 87, type: !5)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alleged_checksum", scope: !8, file: !1, line: 88, type: !5)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !8, file: !1, line: 89, type: !18)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sp", scope: !8, file: !1, line: 90, type: !18)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slen", scope: !8, file: !1, line: 91, type: !5)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqidx", scope: !8, file: !1, line: 92, type: !5)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !8, file: !1, line: 93, type: !18)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !8, file: !1, line: 94, type: !18)
!218 = !DISubprogram(name: "WriteMSF", scope: !1, file: !1, line: 245, type: !219, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.msa_struct*)* @WriteMSF, variables: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !94, !11}
!221 = !{!222, !223, !224, !229, !233, !234, !235, !236, !237, !238, !239, !240, !244}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !218, file: !1, line: 245, type: !94)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 2, scope: !218, file: !1, line: 245, type: !11)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !218, file: !1, line: 247, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !226, line: 30, baseType: !227)
!226 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !130, line: 120, baseType: !228)
!228 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "date", scope: !218, file: !1, line: 248, type: !230)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, align: 8, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 64)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gcg_aseq", scope: !218, file: !1, line: 249, type: !17)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gcg_sqname", scope: !218, file: !1, line: 250, type: !17)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !218, file: !1, line: 251, type: !5)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !218, file: !1, line: 252, type: !18)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !218, file: !1, line: 253, type: !5)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namelen", scope: !218, file: !1, line: 254, type: !5)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !218, file: !1, line: 255, type: !5)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !218, file: !1, line: 256, type: !241)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 408, align: 8, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 51)
