; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/plan7.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }
%struct.plan9_s = type { i32, %struct.basic_state*, %struct.basic_state*, %struct.basic_state*, [20 x float], i8*, i8*, i8*, float*, i32 }
%struct.basic_state = type { [3 x float], [20 x float] }

@.str = private unnamed_addr constant [63 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/plan7.c\00", align 1
@Alphabet_size = external global i32
@.str1 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str2 = private unnamed_addr constant [2 x i8] c" \00", align 1
@Alphabet_iupac = external global i32

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !73, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/plan7.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !72, !18, !27}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !6, line: 101, size: 3712, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !11, !12, !13, !14, !15, !16, !17, !19, !20, !22, !23, !24, !25, !26, !28, !29, !30, !31, !32, !33, !34, !37, !38, !39, !40, !45, !46, !47, !51, !52, !54, !55, !56, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !5, file: !6, line: 113, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !5, file: !6, line: 114, baseType: !9, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !5, file: !6, line: 115, baseType: !9, size: 64, align: 64, offset: 128)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !5, file: !6, line: 116, baseType: !9, size: 64, align: 64, offset: 192)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !5, file: !6, line: 117, baseType: !9, size: 64, align: 64, offset: 256)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !5, file: !6, line: 118, baseType: !9, size: 64, align: 64, offset: 320)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !5, file: !6, line: 119, baseType: !9, size: 64, align: 64, offset: 384)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !5, file: !6, line: 120, baseType: !18, size: 32, align: 32, offset: 448)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !5, file: !6, line: 121, baseType: !9, size: 64, align: 64, offset: 512)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !5, file: !6, line: 122, baseType: !21, size: 64, align: 64, offset: 576)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !5, file: !6, line: 123, baseType: !18, size: 32, align: 32, offset: 640)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !5, file: !6, line: 134, baseType: !21, size: 64, align: 64, offset: 704)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !5, file: !6, line: 135, baseType: !21, size: 64, align: 64, offset: 768)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !5, file: !6, line: 136, baseType: !21, size: 64, align: 64, offset: 832)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !5, file: !6, line: 144, baseType: !27, size: 32, align: 32, offset: 896)
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !5, file: !6, line: 144, baseType: !27, size: 32, align: 32, offset: 928)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !5, file: !6, line: 145, baseType: !27, size: 32, align: 32, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !5, file: !6, line: 145, baseType: !27, size: 32, align: 32, offset: 992)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !5, file: !6, line: 146, baseType: !27, size: 32, align: 32, offset: 1024)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !5, file: !6, line: 146, baseType: !27, size: 32, align: 32, offset: 1056)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !5, file: !6, line: 155, baseType: !18, size: 32, align: 32, offset: 1088)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !5, file: !6, line: 156, baseType: !35, size: 64, align: 64, offset: 1152)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !5, file: !6, line: 157, baseType: !35, size: 64, align: 64, offset: 1216)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !5, file: !6, line: 158, baseType: !35, size: 64, align: 64, offset: 1280)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !5, file: !6, line: 159, baseType: !27, size: 32, align: 32, offset: 1344)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !5, file: !6, line: 168, baseType: !41, size: 256, align: 32, offset: 1376)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, align: 32, elements: !42)
!42 = !{!43, !44}
!43 = !DISubrange(count: 4)
!44 = !DISubrange(count: 2)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !5, file: !6, line: 169, baseType: !36, size: 64, align: 64, offset: 1664)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !5, file: !6, line: 170, baseType: !36, size: 64, align: 64, offset: 1728)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !5, file: !6, line: 174, baseType: !48, size: 640, align: 32, offset: 1792)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 640, align: 32, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 20)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !5, file: !6, line: 175, baseType: !27, size: 32, align: 32, offset: 2432)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !5, file: !6, line: 197, baseType: !53, size: 64, align: 64, offset: 2496)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !5, file: !6, line: 198, baseType: !53, size: 64, align: 64, offset: 2560)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !5, file: !6, line: 199, baseType: !53, size: 64, align: 64, offset: 2624)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !5, file: !6, line: 200, baseType: !57, size: 256, align: 32, offset: 2688)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, align: 32, elements: !42)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !5, file: !6, line: 201, baseType: !21, size: 64, align: 64, offset: 2944)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !5, file: !6, line: 202, baseType: !21, size: 64, align: 64, offset: 3008)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !5, file: !6, line: 203, baseType: !21, size: 64, align: 64, offset: 3072)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !5, file: !6, line: 203, baseType: !21, size: 64, align: 64, offset: 3136)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !5, file: !6, line: 203, baseType: !21, size: 64, align: 64, offset: 3200)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !5, file: !6, line: 203, baseType: !21, size: 64, align: 64, offset: 3264)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !5, file: !6, line: 203, baseType: !21, size: 64, align: 64, offset: 3328)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !5, file: !6, line: 214, baseType: !53, size: 64, align: 64, offset: 3392)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !5, file: !6, line: 215, baseType: !53, size: 64, align: 64, offset: 3456)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !5, file: !6, line: 216, baseType: !18, size: 32, align: 32, offset: 3520)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !5, file: !6, line: 217, baseType: !18, size: 32, align: 32, offset: 3552)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !5, file: !6, line: 222, baseType: !27, size: 32, align: 32, offset: 3584)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !5, file: !6, line: 223, baseType: !27, size: 32, align: 32, offset: 3616)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !6, line: 225, baseType: !18, size: 32, align: 32, offset: 3648)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!73 = !{!74, !80, !85, !93, !98, !102, !108, !112, !116, !126, !135, !143, !152, !158, !163, !166, !169, !172, !181, !188, !201, !284, !294}
!74 = !DISubprogram(name: "AllocPlan7", scope: !1, file: !1, line: 41, type: !75, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, function: %struct.plan7_s* (i32)* @AllocPlan7, variables: !77)
!75 = !DISubroutineType(types: !76)
!76 = !{!4, !18}
!77 = !{!78, !79}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 1, scope: !74, file: !1, line: 41, type: !18)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !74, file: !1, line: 43, type: !4)
!80 = !DISubprogram(name: "AllocPlan7Shell", scope: !1, file: !1, line: 50, type: !81, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: %struct.plan7_s* ()* @AllocPlan7Shell, variables: !83)
!81 = !DISubroutineType(types: !82)
!82 = !{!4}
!83 = !{!84}
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !80, file: !1, line: 52, type: !4)
!85 = !DISubprogram(name: "AllocPlan7Body", scope: !1, file: !1, line: 105, type: !86, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i32)* @AllocPlan7Body, variables: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !4, !18}
!88 = !{!89, !90, !91, !92}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !85, file: !1, line: 105, type: !4)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 2, scope: !85, file: !1, line: 105, type: !18)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !85, file: !1, line: 107, type: !18)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !85, file: !1, line: 107, type: !18)
!93 = !DISubprogram(name: "FreePlan7", scope: !1, file: !1, line: 171, type: !94, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @FreePlan7, variables: !96)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !4}
!96 = !{!97}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !93, file: !1, line: 171, type: !4)
!98 = !DISubprogram(name: "ZeroPlan7", scope: !1, file: !1, line: 212, type: !94, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @ZeroPlan7, variables: !99)
!99 = !{!100, !101}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !98, file: !1, line: 212, type: !4)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !98, file: !1, line: 214, type: !18)
!102 = !DISubprogram(name: "Plan7SetName", scope: !1, file: !1, line: 239, type: !103, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i8*)* @Plan7SetName, variables: !105)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !4, !9}
!105 = !{!106, !107}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !102, file: !1, line: 239, type: !4)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !102, file: !1, line: 239, type: !9)
!108 = !DISubprogram(name: "Plan7SetAccession", scope: !1, file: !1, line: 252, type: !103, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i8*)* @Plan7SetAccession, variables: !109)
!109 = !{!110, !111}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !108, file: !1, line: 252, type: !4)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "acc", arg: 2, scope: !108, file: !1, line: 252, type: !9)
!112 = !DISubprogram(name: "Plan7SetDescription", scope: !1, file: !1, line: 267, type: !103, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i8*)* @Plan7SetDescription, variables: !113)
!113 = !{!114, !115}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !112, file: !1, line: 267, type: !4)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 2, scope: !112, file: !1, line: 267, type: !9)
!116 = !DISubprogram(name: "Plan7ComlogAppend", scope: !1, file: !1, line: 282, type: !117, isLocal: false, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i32, i8**)* @Plan7ComlogAppend, variables: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !4, !18, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !116, file: !1, line: 282, type: !4)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 2, scope: !116, file: !1, line: 282, type: !18)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 3, scope: !116, file: !1, line: 282, type: !119)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !116, file: !1, line: 284, type: !18)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !116, file: !1, line: 285, type: !18)
!126 = !DISubprogram(name: "Plan7SetCtime", scope: !1, file: !1, line: 319, type: !94, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @Plan7SetCtime, variables: !127)
!127 = !{!128, !129}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !126, file: !1, line: 319, type: !4)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "date", scope: !126, file: !1, line: 321, type: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !131, line: 30, baseType: !132)
!131 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !133, line: 120, baseType: !134)
!133 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!134 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!135 = !DISubprogram(name: "Plan7SetNullModel", scope: !1, file: !1, line: 334, type: !136, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, float*, float)* @Plan7SetNullModel, variables: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !4, !36, !27}
!138 = !{!139, !140, !141, !142}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !135, file: !1, line: 334, type: !4)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 2, scope: !135, file: !1, line: 334, type: !36)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p1", arg: 3, scope: !135, file: !1, line: 334, type: !27)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !135, file: !1, line: 336, type: !18)
!143 = !DISubprogram(name: "P7Logoddsify", scope: !1, file: !1, line: 388, type: !86, isLocal: false, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i32)* @P7Logoddsify, variables: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !143, file: !1, line: 388, type: !4)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viterbi_mode", arg: 2, scope: !143, file: !1, line: 388, type: !18)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !143, file: !1, line: 390, type: !18)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !143, file: !1, line: 391, type: !18)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accum", scope: !143, file: !1, line: 392, type: !27)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tbm", scope: !143, file: !1, line: 393, type: !27)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tme", scope: !143, file: !1, line: 393, type: !27)
!152 = !DISubprogram(name: "Plan7Renormalize", scope: !1, file: !1, line: 529, type: !94, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @Plan7Renormalize, variables: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !152, file: !1, line: 529, type: !4)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !152, file: !1, line: 531, type: !18)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !152, file: !1, line: 532, type: !18)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !152, file: !1, line: 533, type: !27)
!158 = !DISubprogram(name: "Plan7RenormalizeExits", scope: !1, file: !1, line: 581, type: !94, isLocal: false, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @Plan7RenormalizeExits, variables: !159)
!159 = !{!160, !161, !162}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !158, file: !1, line: 581, type: !4)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !158, file: !1, line: 583, type: !18)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !158, file: !1, line: 584, type: !27)
!163 = !DISubprogram(name: "Plan7NakedConfig", scope: !1, file: !1, line: 633, type: !94, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @Plan7NakedConfig, variables: !164)
!164 = !{!165}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !163, file: !1, line: 633, type: !4)
!166 = !DISubprogram(name: "Plan7GlobalConfig", scope: !1, file: !1, line: 666, type: !94, isLocal: false, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @Plan7GlobalConfig, variables: !167)
!167 = !{!168}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !166, file: !1, line: 666, type: !4)
!169 = !DISubprogram(name: "Plan7LSConfig", scope: !1, file: !1, line: 695, type: !94, isLocal: false, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*)* @Plan7LSConfig, variables: !170)
!170 = !{!171}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !169, file: !1, line: 695, type: !4)
!172 = !DISubprogram(name: "Plan7SWConfig", scope: !1, file: !1, line: 740, type: !173, isLocal: false, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, float, float)* @Plan7SWConfig, variables: !175)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !4, !27, !27}
!175 = !{!176, !177, !178, !179, !180}
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !172, file: !1, line: 740, type: !4)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pentry", arg: 2, scope: !172, file: !1, line: 740, type: !27)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pexit", arg: 3, scope: !172, file: !1, line: 740, type: !27)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "basep", scope: !172, file: !1, line: 742, type: !27)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !172, file: !1, line: 743, type: !18)
!181 = !DISubprogram(name: "Plan7FSConfig", scope: !1, file: !1, line: 790, type: !173, isLocal: false, isDefinition: true, scopeLine: 791, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, float, float)* @Plan7FSConfig, variables: !182)
!182 = !{!183, !184, !185, !186, !187}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !181, file: !1, line: 790, type: !4)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pentry", arg: 2, scope: !181, file: !1, line: 790, type: !27)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pexit", arg: 3, scope: !181, file: !1, line: 790, type: !27)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "basep", scope: !181, file: !1, line: 792, type: !27)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !181, file: !1, line: 793, type: !18)
!188 = !DISubprogram(name: "Plan7ESTConfig", scope: !1, file: !1, line: 838, type: !189, isLocal: false, isDefinition: true, scopeLine: 840, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i32*, float**, float, float)* @Plan7ESTConfig, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !4, !21, !35, !27, !27}
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !188, file: !1, line: 838, type: !4)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aacode", arg: 2, scope: !188, file: !1, line: 838, type: !21)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "estmodel", arg: 3, scope: !188, file: !1, line: 838, type: !35)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dna2", arg: 4, scope: !188, file: !1, line: 839, type: !27)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dna4", arg: 5, scope: !188, file: !1, line: 839, type: !27)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !188, file: !1, line: 841, type: !18)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !188, file: !1, line: 842, type: !18)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !188, file: !1, line: 843, type: !27)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tripnull", scope: !188, file: !1, line: 846, type: !36)
!201 = !DISubprogram(name: "PrintPlan7Stats", scope: !1, file: !1, line: 897, type: !202, isLocal: false, isDefinition: true, scopeLine: 899, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.plan7_s*, i8**, i32, %struct.p7trace_s**)* @PrintPlan7Stats, variables: !271)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !204, !4, !119, !18, !263}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !206, line: 153, baseType: !207)
!206 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !206, line: 122, size: 1216, align: 64, elements: !208)
!208 = !{!209, !212, !213, !214, !216, !217, !222, !223, !224, !228, !232, !241, !247, !248, !251, !252, !256, !260, !261, !262}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !207, file: !206, line: 123, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !207, file: !206, line: 124, baseType: !18, size: 32, align: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !207, file: !206, line: 125, baseType: !18, size: 32, align: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !207, file: !206, line: 126, baseType: !215, size: 16, align: 16, offset: 128)
!215 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !207, file: !206, line: 127, baseType: !215, size: 16, align: 16, offset: 144)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !207, file: !206, line: 128, baseType: !218, size: 128, align: 64, offset: 192)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !206, line: 88, size: 128, align: 64, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !218, file: !206, line: 89, baseType: !210, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !218, file: !206, line: 90, baseType: !18, size: 32, align: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !207, file: !206, line: 129, baseType: !18, size: 32, align: 32, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !207, file: !206, line: 132, baseType: !72, size: 64, align: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !207, file: !206, line: 133, baseType: !225, size: 64, align: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!18, !72}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !207, file: !206, line: 134, baseType: !229, size: 64, align: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!18, !72, !9, !18}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !207, file: !206, line: 135, baseType: !233, size: 64, align: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !72, !236, !18}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !206, line: 77, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !238, line: 71, baseType: !239)
!238 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !133, line: 46, baseType: !240)
!240 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !207, file: !206, line: 136, baseType: !242, size: 64, align: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!18, !72, !245, !18}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !207, file: !206, line: 139, baseType: !218, size: 128, align: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !207, file: !206, line: 140, baseType: !249, size: 64, align: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !206, line: 94, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !207, file: !206, line: 141, baseType: !18, size: 32, align: 32, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !207, file: !206, line: 144, baseType: !253, size: 24, align: 8, offset: 928)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 24, align: 8, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 3)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !207, file: !206, line: 145, baseType: !257, size: 8, align: 8, offset: 952)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 8, align: 8, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 1)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !207, file: !206, line: 148, baseType: !218, size: 128, align: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !207, file: !206, line: 151, baseType: !18, size: 32, align: 32, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !207, file: !206, line: 152, baseType: !236, size: 64, align: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !6, line: 374, size: 256, align: 64, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !265, file: !6, line: 375, baseType: !18, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !265, file: !6, line: 376, baseType: !9, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !265, file: !6, line: 377, baseType: !21, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !265, file: !6, line: 378, baseType: !21, size: 64, align: 64, offset: 192)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !201, file: !1, line: 897, type: !204)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !201, file: !1, line: 897, type: !4)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 3, scope: !201, file: !1, line: 897, type: !119)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 4, scope: !201, file: !1, line: 897, type: !18)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 5, scope: !201, file: !1, line: 898, type: !263)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !201, file: !1, line: 900, type: !18)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !201, file: !1, line: 901, type: !27)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total", scope: !201, file: !1, line: 902, type: !27)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best", scope: !201, file: !1, line: 902, type: !27)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worst", scope: !201, file: !1, line: 902, type: !27)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqsum", scope: !201, file: !1, line: 903, type: !27)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stddev", scope: !201, file: !1, line: 903, type: !27)
!284 = !DISubprogram(name: "DegenerateSymbolScore", scope: !1, file: !1, line: 971, type: !285, isLocal: false, isDefinition: true, scopeLine: 972, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float*, float*, i32)* @DegenerateSymbolScore, variables: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!18, !36, !36, !18}
!287 = !{!288, !289, !290, !291, !292, !293}
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !284, file: !1, line: 971, type: !36)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 2, scope: !284, file: !1, line: 971, type: !36)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ambig", arg: 3, scope: !284, file: !1, line: 971, type: !18)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !284, file: !1, line: 973, type: !18)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numer", scope: !284, file: !1, line: 974, type: !27)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denom", scope: !284, file: !1, line: 975, type: !27)
!294 = !DISubprogram(name: "Plan9toPlan7", scope: !1, file: !1, line: 1006, type: !295, isLocal: false, isDefinition: true, scopeLine: 1007, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan9_s*, %struct.plan7_s**)* @Plan9toPlan7, variables: !317)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297, !316}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan9_s", file: !6, line: 567, size: 1216, align: 64, elements: !299)
!299 = !{!300, !301, !308, !309, !310, !311, !312, !313, !314, !315}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !298, file: !6, line: 568, baseType: !18, size: 32, align: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !298, file: !6, line: 569, baseType: !302, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_state", file: !6, line: 560, size: 736, align: 32, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !303, file: !6, line: 561, baseType: !306, size: 96, align: 32)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, align: 32, elements: !254)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !303, file: !6, line: 562, baseType: !48, size: 640, align: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !298, file: !6, line: 570, baseType: !302, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !298, file: !6, line: 571, baseType: !302, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !298, file: !6, line: 573, baseType: !48, size: 640, align: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !6, line: 577, baseType: !9, size: 64, align: 64, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !298, file: !6, line: 578, baseType: !9, size: 64, align: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !298, file: !6, line: 579, baseType: !9, size: 64, align: 64, offset: 1024)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "xray", scope: !298, file: !6, line: 580, baseType: !36, size: 64, align: 64, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !6, line: 582, baseType: !18, size: 32, align: 32, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!317 = !{!318, !319, !320, !321, !322}
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !294, file: !1, line: 1006, type: !297)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_plan7", arg: 2, scope: !294, file: !1, line: 1006, type: !316)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "plan7", scope: !294, file: !1, line: 1008, type: !4)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !294, file: !1, line: 1009, type: !18)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !294, file: !1, line: 1009, type: !18)
!323 = !{i32 2, !"Dwarf Version", i32 2}
!324 = !{i32 2, !"Debug Info Version", i32 700000003}
!325 = !{i32 1, !"PIC Level", i32 2}
!326 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!327 = !DIExpression()
!328 = !DILocation(line: 41, column: 16, scope: !74)
!329 = !DILocation(line: 54, column: 31, scope: !80, inlinedAt: !330)
!330 = distinct !DILocation(line: 45, column: 9, scope: !74)
!331 = !DILocation(line: 54, column: 12, scope: !80, inlinedAt: !330)
!332 = !DILocation(line: 52, column: 19, scope: !80, inlinedAt: !330)
!333 = !DILocation(line: 65, column: 8, scope: !80, inlinedAt: !330)
!334 = !DILocation(line: 69, column: 8, scope: !80, inlinedAt: !330)
!335 = !DILocation(line: 77, column: 8, scope: !80, inlinedAt: !330)
!336 = !DILocation(line: 81, column: 8, scope: !80, inlinedAt: !330)
!337 = !DILocation(line: 84, column: 8, scope: !80, inlinedAt: !330)
!338 = !DILocation(line: 87, column: 19, scope: !80, inlinedAt: !330)
!339 = !DILocation(line: 87, column: 8, scope: !80, inlinedAt: !330)
!340 = !DILocation(line: 93, column: 8, scope: !80, inlinedAt: !330)
!341 = !DILocation(line: 57, column: 17, scope: !80, inlinedAt: !330)
!342 = !DILocation(line: 65, column: 17, scope: !80, inlinedAt: !330)
!343 = !DILocation(line: 69, column: 13, scope: !80, inlinedAt: !330)
!344 = !DILocation(line: 77, column: 15, scope: !80, inlinedAt: !330)
!345 = !DILocation(line: 84, column: 15, scope: !80, inlinedAt: !330)
!346 = !DILocation(line: 81, column: 46, scope: !80, inlinedAt: !330)
!347 = !DILocation(line: 87, column: 12, scope: !80, inlinedAt: !330)
!348 = !DILocation(line: 87, column: 27, scope: !80, inlinedAt: !330)
!349 = !DILocation(line: 93, column: 15, scope: !80, inlinedAt: !330)
!350 = !{!351, !355, i64 440}
!351 = !{!"plan7_s", !352, i64 0, !352, i64 8, !352, i64 16, !352, i64 24, !352, i64 32, !352, i64 40, !352, i64 48, !355, i64 56, !352, i64 64, !352, i64 72, !355, i64 80, !352, i64 88, !352, i64 96, !352, i64 104, !356, i64 112, !356, i64 116, !356, i64 120, !356, i64 124, !356, i64 128, !356, i64 132, !355, i64 136, !352, i64 144, !352, i64 152, !352, i64 160, !356, i64 168, !353, i64 172, !352, i64 208, !352, i64 216, !353, i64 224, !356, i64 304, !352, i64 312, !352, i64 320, !352, i64 328, !353, i64 336, !352, i64 368, !352, i64 376, !352, i64 384, !352, i64 392, !352, i64 400, !352, i64 408, !352, i64 416, !352, i64 424, !352, i64 432, !355, i64 440, !355, i64 444, !356, i64 448, !356, i64 452, !355, i64 456}
!352 = !{!"any pointer", !353, i64 0}
!353 = !{!"omnipotent char", !354, i64 0}
!354 = !{!"Simple C/C++ TBAA"}
!355 = !{!"int", !353, i64 0}
!356 = !{!"float", !353, i64 0}
!357 = !DILocation(line: 94, column: 8, scope: !80, inlinedAt: !330)
!358 = !DILocation(line: 94, column: 15, scope: !80, inlinedAt: !330)
!359 = !{!351, !355, i64 444}
!360 = !DILocation(line: 96, column: 8, scope: !80, inlinedAt: !330)
!361 = !DILocation(line: 96, column: 15, scope: !80, inlinedAt: !330)
!362 = !{!351, !356, i64 448}
!363 = !DILocation(line: 97, column: 8, scope: !80, inlinedAt: !330)
!364 = !DILocation(line: 97, column: 15, scope: !80, inlinedAt: !330)
!365 = !{!351, !356, i64 452}
