; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/plan9.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan9_s = type { i32, %struct.basic_state*, %struct.basic_state*, %struct.basic_state*, [20 x float], i8*, i8*, i8*, float*, i32 }
%struct.basic_state = type { [3 x float], [20 x float] }

@.str = private unnamed_addr constant [63 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/plan9.c\00", align 1
@.str1 = private unnamed_addr constant [8 x i8] c"unnamed\00", align 1
@Alphabet_size = external global i32
@Alphabet_type = external global i32
@aafq = external global [0 x float]
@.str2 = private unnamed_addr constant [56 x i8] c"No support for non-protein, non-nucleic acid alphabets.\00", align 1
@.memset_pattern = internal unnamed_addr constant [4 x float] [float 2.500000e-01, float 2.500000e-01, float 2.500000e-01, float 2.500000e-01], align 16

; Function Attrs: nounwind optsize ssp uwtable
define %struct.plan9_s* @P9AllocHMM(i32 %M) #0 {
  tail call void @llvm.dbg.value(metadata i32 %M, i64 0, metadata !40, metadata !69), !dbg !70
  %1 = tail call i8* @sre_malloc(i8* getelementptr inbounds ([63 x i8]* @.str, i64 0, i64 0), i32 35, i64 152) #4, !dbg !71
  %2 = bitcast i8* %1 to %struct.plan9_s*, !dbg !72
  tail call void @llvm.dbg.value(metadata %struct.plan9_s* %2, i64 0, metadata !41, metadata !69), !dbg !73
  %3 = add nsw i32 %M, 2, !dbg !74

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !35, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/plan9.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !11, !27, !32, !34}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan9_s", file: !6, line: 567, size: 1216, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !23, !24, !25, !26, !29, !30, !31, !33}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !5, file: !6, line: 568, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !5, file: !6, line: 569, baseType: !11, size: 64, align: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_state", file: !6, line: 560, size: 736, align: 32, elements: !13)
!13 = !{!14, !19}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !12, file: !6, line: 561, baseType: !15, size: 96, align: 32)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 96, align: 32, elements: !17)
!16 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!17 = !{!18}
!18 = !DISubrange(count: 3)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !12, file: !6, line: 562, baseType: !20, size: 640, align: 32, offset: 96)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 640, align: 32, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 20)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !5, file: !6, line: 570, baseType: !11, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !5, file: !6, line: 571, baseType: !11, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !5, file: !6, line: 573, baseType: !20, size: 640, align: 32, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !5, file: !6, line: 577, baseType: !27, size: 64, align: 64, offset: 896)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !5, file: !6, line: 578, baseType: !27, size: 64, align: 64, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !5, file: !6, line: 579, baseType: !27, size: 64, align: 64, offset: 1024)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "xray", scope: !5, file: !6, line: 580, baseType: !32, size: 64, align: 64, offset: 1088)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !6, line: 582, baseType: !9, size: 32, align: 32, offset: 1152)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !{!36, !42, !47, !55, !59}
!36 = !DISubprogram(name: "P9AllocHMM", scope: !1, file: !1, line: 31, type: !37, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: %struct.plan9_s* (i32)* @P9AllocHMM, variables: !39)
!37 = !DISubroutineType(types: !38)
!38 = !{!4, !9}
!39 = !{!40, !41}
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 1, scope: !36, file: !1, line: 31, type: !9)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hmm", scope: !36, file: !1, line: 33, type: !4)
!42 = !DISubprogram(name: "P9FreeHMM", scope: !1, file: !1, line: 50, type: !43, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.plan9_s*)* @P9FreeHMM, variables: !45)
!43 = !DISubroutineType(types: !44)
!44 = !{!9, !4}
!45 = !{!46}
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !42, file: !1, line: 50, type: !4)
!47 = !DISubprogram(name: "P9ZeroHMM", scope: !1, file: !1, line: 70, type: !48, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan9_s*)* @P9ZeroHMM, variables: !50)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !4}
!50 = !{!51, !52, !53, !54}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !47, file: !1, line: 70, type: !4)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !47, file: !1, line: 72, type: !9)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ts", scope: !47, file: !1, line: 72, type: !9)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !47, file: !1, line: 72, type: !9)
!55 = !DISubprogram(name: "P9Renormalize", scope: !1, file: !1, line: 104, type: !48, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan9_s*)* @P9Renormalize, variables: !56)
!56 = !{!57, !58}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !55, file: !1, line: 104, type: !4)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !55, file: !1, line: 106, type: !9)
!59 = !DISubprogram(name: "P9DefaultNullModel", scope: !1, file: !1, line: 128, type: !60, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: void (float*)* @P9DefaultNullModel, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !32}
!62 = !{!63, !64}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 1, scope: !59, file: !1, line: 128, type: !32)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !59, file: !1, line: 130, type: !9)
!65 = !{i32 2, !"Dwarf Version", i32 2}
!66 = !{i32 2, !"Debug Info Version", i32 700000003}
!67 = !{i32 1, !"PIC Level", i32 2}
!68 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!69 = !DIExpression()
!70 = !DILocation(line: 31, column: 16, scope: !36)
!71 = !DILocation(line: 35, column: 39, scope: !36)
!72 = !DILocation(line: 35, column: 16, scope: !36)
!73 = !DILocation(line: 33, column: 19, scope: !36)
!74 = !DILocation(line: 36, column: 39, scope: !36)
!75 = !DILocation(line: 36, column: 8, scope: !36)
!76 = !DILocation(line: 36, column: 14, scope: !36)
!77 = !{!78, !82, i64 8}
!78 = !{!"plan9_s", !79, i64 0, !82, i64 8, !82, i64 16, !82, i64 24, !80, i64 32, !82, i64 112, !82, i64 120, !82, i64 128, !82, i64 136, !79, i64 144}
!79 = !{!"int", !80, i64 0}
!80 = !{!"omnipotent char", !81, i64 0}
!81 = !{!"Simple C/C++ TBAA"}
!82 = !{!"any pointer", !80, i64 0}
!83 = !DILocation(line: 37, column: 39, scope: !36)
!84 = !DILocation(line: 37, column: 8, scope: !36)
!85 = !DILocation(line: 37, column: 14, scope: !36)
!86 = !{!78, !82, i64 24}
