; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/postprob.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }
%struct.dpmatrix_s = type { i32**, i32**, i32**, i32**, i8*, i8*, i8*, i8*, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [17 x i8] c"traceback failed\00", align 1
@.str1 = private unnamed_addr constant [18 x i8] c"Traceback failed.\00", align 1
@.str2 = private unnamed_addr constant [66 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/postprob.c\00", align 1

; Function Attrs: nounwind optsize ssp uwtable
define float @P7OptimalAccuracy(i8* %dsq, i32 %L, %struct.plan7_s* %hmm, %struct.p7trace_s** %ret_tr) #0 {
  %forward = alloca %struct.dpmatrix_s*, align 8
  %backward = alloca %struct.dpmatrix_s*, align 8
  tail call void @llvm.dbg.value(metadata i8* %dsq, i64 0, metadata !86, metadata !195), !dbg !196
  tail call void @llvm.dbg.value(metadata i32 %L, i64 0, metadata !87, metadata !195), !dbg !197

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/postprob.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !{!8, !109, !126, !138, !155, !174, !185}
!8 = !DISubprogram(name: "P7OptimalAccuracy", scope: !1, file: !1, line: 97, type: !9, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.p7trace_s**)* @P7OptimalAccuracy, variables: !85)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !12, !4, !13, !77}
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !15, line: 101, size: 3712, align: 64, elements: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !42, !43, !44, !45, !50, !51, !52, !56, !57, !59, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !15, line: 113, baseType: !12, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !14, file: !15, line: 114, baseType: !12, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !14, file: !15, line: 115, baseType: !12, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !14, file: !15, line: 116, baseType: !12, size: 64, align: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !14, file: !15, line: 117, baseType: !12, size: 64, align: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !14, file: !15, line: 118, baseType: !12, size: 64, align: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !14, file: !15, line: 119, baseType: !12, size: 64, align: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !14, file: !15, line: 120, baseType: !4, size: 32, align: 32, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !14, file: !15, line: 121, baseType: !12, size: 64, align: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !15, line: 122, baseType: !27, size: 64, align: 64, offset: 576)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !14, file: !15, line: 123, baseType: !4, size: 32, align: 32, offset: 640)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !14, file: !15, line: 134, baseType: !27, size: 64, align: 64, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !14, file: !15, line: 135, baseType: !27, size: 64, align: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !14, file: !15, line: 136, baseType: !27, size: 64, align: 64, offset: 832)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !14, file: !15, line: 144, baseType: !11, size: 32, align: 32, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !14, file: !15, line: 144, baseType: !11, size: 32, align: 32, offset: 928)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !14, file: !15, line: 145, baseType: !11, size: 32, align: 32, offset: 960)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !14, file: !15, line: 145, baseType: !11, size: 32, align: 32, offset: 992)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !14, file: !15, line: 146, baseType: !11, size: 32, align: 32, offset: 1024)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !14, file: !15, line: 146, baseType: !11, size: 32, align: 32, offset: 1056)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !14, file: !15, line: 155, baseType: !4, size: 32, align: 32, offset: 1088)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !14, file: !15, line: 156, baseType: !40, size: 64, align: 64, offset: 1152)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !14, file: !15, line: 157, baseType: !40, size: 64, align: 64, offset: 1216)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !14, file: !15, line: 158, baseType: !40, size: 64, align: 64, offset: 1280)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !14, file: !15, line: 159, baseType: !11, size: 32, align: 32, offset: 1344)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !14, file: !15, line: 168, baseType: !46, size: 256, align: 32, offset: 1376)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, align: 32, elements: !47)
!47 = !{!48, !49}
!48 = !DISubrange(count: 4)
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !14, file: !15, line: 169, baseType: !41, size: 64, align: 64, offset: 1664)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !14, file: !15, line: 170, baseType: !41, size: 64, align: 64, offset: 1728)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !14, file: !15, line: 174, baseType: !53, size: 640, align: 32, offset: 1792)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 640, align: 32, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 20)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !14, file: !15, line: 175, baseType: !11, size: 32, align: 32, offset: 2432)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !14, file: !15, line: 197, baseType: !58, size: 64, align: 64, offset: 2496)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !14, file: !15, line: 198, baseType: !58, size: 64, align: 64, offset: 2560)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !14, file: !15, line: 199, baseType: !58, size: 64, align: 64, offset: 2624)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !14, file: !15, line: 200, baseType: !62, size: 256, align: 32, offset: 2688)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !47)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !14, file: !15, line: 201, baseType: !27, size: 64, align: 64, offset: 2944)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !14, file: !15, line: 202, baseType: !27, size: 64, align: 64, offset: 3008)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3072)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3136)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3200)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3264)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !14, file: !15, line: 203, baseType: !27, size: 64, align: 64, offset: 3328)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !14, file: !15, line: 214, baseType: !58, size: 64, align: 64, offset: 3392)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !14, file: !15, line: 215, baseType: !58, size: 64, align: 64, offset: 3456)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !14, file: !15, line: 216, baseType: !4, size: 32, align: 32, offset: 3520)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !14, file: !15, line: 217, baseType: !4, size: 32, align: 32, offset: 3552)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !14, file: !15, line: 222, baseType: !11, size: 32, align: 32, offset: 3584)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !14, file: !15, line: 223, baseType: !11, size: 32, align: 32, offset: 3616)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !14, file: !15, line: 225, baseType: !4, size: 32, align: 32, offset: 3648)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !15, line: 374, size: 256, align: 64, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !79, file: !15, line: 375, baseType: !4, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !79, file: !15, line: 376, baseType: !12, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !79, file: !15, line: 377, baseType: !27, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !79, file: !15, line: 378, baseType: !27, size: 64, align: 64, offset: 192)
!85 = !{!86, !87, !88, !89, !90, !92, !108}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !8, file: !1, line: 97, type: !12)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !8, file: !1, line: 97, type: !4)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !8, file: !1, line: 97, type: !13)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 4, scope: !8, file: !1, line: 97, type: !77)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !8, file: !1, line: 99, type: !91)
!91 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !8, file: !1, line: 100, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "dpmatrix_s", file: !15, line: 289, size: 640, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !94, file: !15, line: 290, baseType: !58, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mmx", scope: !94, file: !15, line: 291, baseType: !58, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "imx", scope: !94, file: !15, line: 292, baseType: !58, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dmx", scope: !94, file: !15, line: 293, baseType: !58, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "xmx_mem", scope: !94, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mmx_mem", scope: !94, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "imx_mem", scope: !94, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dmx_mem", scope: !94, file: !15, line: 299, baseType: !5, size: 64, align: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "maxN", scope: !94, file: !15, line: 308, baseType: !4, size: 32, align: 32, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "maxM", scope: !94, file: !15, line: 309, baseType: !4, size: 32, align: 32, offset: 544)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "padN", scope: !94, file: !15, line: 311, baseType: !4, size: 32, align: 32, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "padM", scope: !94, file: !15, line: 312, baseType: !4, size: 32, align: 32, offset: 608)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "backward", scope: !8, file: !1, line: 101, type: !93)
!109 = !DISubprogram(name: "P7Backward", scope: !1, file: !1, line: 132, type: !110, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i32, %struct.plan7_s*, %struct.dpmatrix_s**)* @P7Backward, variables: !113)
!110 = !DISubroutineType(types: !111)
!111 = !{!11, !12, !4, !13, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !109, file: !1, line: 132, type: !12)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 2, scope: !109, file: !1, line: 132, type: !4)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 3, scope: !109, file: !1, line: 132, type: !13)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_mx", arg: 4, scope: !109, file: !1, line: 132, type: !112)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !109, file: !1, line: 134, type: !93)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmx", scope: !109, file: !1, line: 135, type: !58)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmx", scope: !109, file: !1, line: 136, type: !58)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imx", scope: !109, file: !1, line: 137, type: !58)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !109, file: !1, line: 138, type: !58)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !109, file: !1, line: 139, type: !4)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !109, file: !1, line: 139, type: !4)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !109, file: !1, line: 140, type: !4)
!126 = !DISubprogram(name: "P7EmitterPosterior", scope: !1, file: !1, line: 250, type: !127, isLocal: false, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.plan7_s*, %struct.dpmatrix_s*, %struct.dpmatrix_s*, %struct.dpmatrix_s*)* @P7EmitterPosterior, variables: !129)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !4, !13, !93, !93, !93}
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "L", arg: 1, scope: !126, file: !1, line: 250, type: !4)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !126, file: !1, line: 251, type: !13)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "forward", arg: 3, scope: !126, file: !1, line: 252, type: !93)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "backward", arg: 4, scope: !126, file: !1, line: 253, type: !93)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mx", arg: 5, scope: !126, file: !1, line: 254, type: !93)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !126, file: !1, line: 256, type: !4)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !126, file: !1, line: 257, type: !4)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sc", scope: !126, file: !1, line: 258, type: !4)
!138 = !DISubprogram(name: "P7FillOptimalAccuracy", scope: !1, file: !1, line: 319, type: !139, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: float (i32, i32, %struct.dpmatrix_s*, %struct.dpmatrix_s*, %struct.p7trace_s**)* @P7FillOptimalAccuracy, variables: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{!11, !4, !4, !93, !93, !77}
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
