; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/prior.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.p7prior_s = type { i32, i32, [200 x float], [200 x [7 x float]], i32, [200 x float], [200 x [20 x float]], i32, [200 x float], [200 x [20 x float]] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }

@.str = private unnamed_addr constant [63 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/prior.c\00", align 1
@Alphabet_size = external global i32
@Alphabet_type = external global i32
@.str1 = private unnamed_addr constant [43 x i8] c"Can't set prior; alphabet type not set yet\00", align 1
@.str2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str3 = private unnamed_addr constant [36 x i8] c"Failed to open HMMER prior file %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !261, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/prior.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !29, !13, !30}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7prior_s", file: !6, line: 385, size: 320128, align: 32, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !10, !11, !16, !20, !21, !22, !26, !27, !28}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !5, file: !6, line: 386, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "tnum", scope: !5, file: !6, line: 388, baseType: !9, size: 32, align: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "tq", scope: !5, file: !6, line: 389, baseType: !12, size: 6400, align: 32, offset: 64)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 6400, align: 32, elements: !14)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !{!15}
!15 = !DISubrange(count: 200)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !5, file: !6, line: 390, baseType: !17, size: 44800, align: 32, offset: 6464)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 44800, align: 32, elements: !18)
!18 = !{!15, !19}
!19 = !DISubrange(count: 7)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "mnum", scope: !5, file: !6, line: 392, baseType: !9, size: 32, align: 32, offset: 51264)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "mq", scope: !5, file: !6, line: 393, baseType: !12, size: 6400, align: 32, offset: 51296)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !5, file: !6, line: 394, baseType: !23, size: 128000, align: 32, offset: 57696)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128000, align: 32, elements: !24)
!24 = !{!15, !25}
!25 = !DISubrange(count: 20)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "inum", scope: !5, file: !6, line: 396, baseType: !9, size: 32, align: 32, offset: 185696)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !5, file: !6, line: 397, baseType: !12, size: 6400, align: 32, offset: 185728)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !5, file: !6, line: 398, baseType: !23, size: 128000, align: 32, offset: 192128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!31 = !{!32, !35, !40, !43, !44, !116, !133, !141, !152, !222, !239, !253, !258}
!32 = !DISubprogram(name: "P7AllocPrior", scope: !1, file: !1, line: 36, type: !33, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: %struct.p7prior_s* ()* @P7AllocPrior, variables: !2)
!33 = !DISubroutineType(types: !34)
!34 = !{!4}
!35 = !DISubprogram(name: "P7FreePrior", scope: !1, file: !1, line: 39, type: !36, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.p7prior_s*)* @P7FreePrior, variables: !38)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !{!39}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pri", arg: 1, scope: !35, file: !1, line: 39, type: !4)
!40 = !DISubprogram(name: "P7LaplacePrior", scope: !1, file: !1, line: 53, type: !33, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: %struct.p7prior_s* ()* @P7LaplacePrior, variables: !41)
!41 = !{!42}
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pri", scope: !40, file: !1, line: 55, type: !4)
!43 = !DISubprogram(name: "P7DefaultPrior", scope: !1, file: !1, line: 81, type: !33, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: %struct.p7prior_s* ()* @P7DefaultPrior, variables: !2)
!44 = !DISubprogram(name: "P7ReadPrior", scope: !1, file: !1, line: 97, type: !45, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: %struct.p7prior_s* (i8*)* @P7ReadPrior, variables: !49)
!45 = !DISubroutineType(types: !46)
!46 = !{!4, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !{!50, !51, !112, !113, !114, !115}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prifile", arg: 1, scope: !44, file: !1, line: 97, type: !47)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !44, file: !1, line: 99, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !54, line: 153, baseType: !55)
!54 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !54, line: 122, size: 1216, align: 64, elements: !56)
!56 = !{!57, !60, !61, !62, !64, !65, !70, !71, !72, !76, !80, !90, !96, !97, !100, !101, !105, !109, !110, !111}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !55, file: !54, line: 123, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !55, file: !54, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !55, file: !54, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !54, line: 126, baseType: !63, size: 16, align: 16, offset: 128)
!63 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !55, file: !54, line: 127, baseType: !63, size: 16, align: 16, offset: 144)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !55, file: !54, line: 128, baseType: !66, size: 128, align: 64, offset: 192)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !54, line: 88, size: 128, align: 64, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !66, file: !54, line: 89, baseType: !58, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !66, file: !54, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !55, file: !54, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !55, file: !54, line: 132, baseType: !29, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !55, file: !54, line: 133, baseType: !73, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!9, !29}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !55, file: !54, line: 134, baseType: !77, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!9, !29, !47, !9}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !55, file: !54, line: 135, baseType: !81, size: 64, align: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !29, !84, !9}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !54, line: 77, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !86, line: 71, baseType: !87)
!86 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !55, file: !54, line: 136, baseType: !91, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!9, !29, !94, !9}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !55, file: !54, line: 139, baseType: !66, size: 128, align: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !55, file: !54, line: 140, baseType: !98, size: 64, align: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !54, line: 94, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !55, file: !54, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !55, file: !54, line: 144, baseType: !102, size: 24, align: 8, offset: 928)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 24, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 3)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !55, file: !54, line: 145, baseType: !106, size: 8, align: 8, offset: 952)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 8, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !55, file: !54, line: 148, baseType: !66, size: 128, align: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !55, file: !54, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !54, line: 152, baseType: !84, size: 64, align: 64, offset: 1152)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pri", scope: !44, file: !1, line: 100, type: !4)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sptr", scope: !44, file: !1, line: 101, type: !47)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !44, file: !1, line: 102, type: !9)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !44, file: !1, line: 102, type: !9)
!116 = !DISubprogram(name: "PAMPrior", scope: !1, file: !1, line: 214, type: !117, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.p7prior_s*, float)* @PAMPrior, variables: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !47, !4, !13}
!119 = !{!120, !121, !122, !123, !124, !125, !128, !129, !130, !131, !132}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pamfile", arg: 1, scope: !116, file: !1, line: 214, type: !47)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pri", arg: 2, scope: !116, file: !1, line: 214, type: !4)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wt", arg: 3, scope: !116, file: !1, line: 214, type: !13)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !116, file: !1, line: 216, type: !52)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blastpamfile", scope: !116, file: !1, line: 217, type: !47)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pam", scope: !116, file: !1, line: 218, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scale", scope: !116, file: !1, line: 219, type: !13)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xi", scope: !116, file: !1, line: 220, type: !9)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xj", scope: !116, file: !1, line: 220, type: !9)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx1", scope: !116, file: !1, line: 221, type: !9)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx2", scope: !116, file: !1, line: 221, type: !9)
!133 = !DISubprogram(name: "P7DefaultNullModel", scope: !1, file: !1, line: 279, type: !134, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, float*)* @P7DefaultNullModel, variables: !137)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !136, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!137 = !{!138, !139, !140}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 1, scope: !133, file: !1, line: 279, type: !136)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_p1", arg: 2, scope: !133, file: !1, line: 279, type: !136)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !133, file: !1, line: 281, type: !9)
!141 = !DISubprogram(name: "P7ReadNullModel", scope: !1, file: !1, line: 294, type: !142, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, float*, float*)* @P7ReadNullModel, variables: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !47, !136, !136}
!144 = !{!145, !146, !147, !148, !149, !150, !151}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rndfile", arg: 1, scope: !141, file: !1, line: 294, type: !47)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "null", arg: 2, scope: !141, file: !1, line: 294, type: !136)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_p1", arg: 3, scope: !141, file: !1, line: 294, type: !136)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !141, file: !1, line: 296, type: !52)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !141, file: !1, line: 297, type: !47)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !141, file: !1, line: 298, type: !9)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !141, file: !1, line: 299, type: !9)
!152 = !DISubprogram(name: "P7PriorifyHMM", scope: !1, file: !1, line: 342, type: !153, isLocal: false, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, %struct.p7prior_s*)* @P7PriorifyHMM, variables: !214)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155, !4}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !6, line: 101, size: 3712, align: 64, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !184, !189, !190, !191, !194, !195, !196, !197, !198, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !6, line: 113, baseType: !47, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !156, file: !6, line: 114, baseType: !47, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !156, file: !6, line: 115, baseType: !47, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !156, file: !6, line: 116, baseType: !47, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !156, file: !6, line: 117, baseType: !47, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !156, file: !6, line: 118, baseType: !47, size: 64, align: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !156, file: !6, line: 119, baseType: !47, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !156, file: !6, line: 120, baseType: !9, size: 32, align: 32, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !156, file: !6, line: 121, baseType: !47, size: 64, align: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !156, file: !6, line: 122, baseType: !127, size: 64, align: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !156, file: !6, line: 123, baseType: !9, size: 32, align: 32, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !156, file: !6, line: 134, baseType: !127, size: 64, align: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !156, file: !6, line: 135, baseType: !127, size: 64, align: 64, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !156, file: !6, line: 136, baseType: !127, size: 64, align: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !156, file: !6, line: 144, baseType: !13, size: 32, align: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !156, file: !6, line: 144, baseType: !13, size: 32, align: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !156, file: !6, line: 145, baseType: !13, size: 32, align: 32, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !156, file: !6, line: 145, baseType: !13, size: 32, align: 32, offset: 992)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !156, file: !6, line: 146, baseType: !13, size: 32, align: 32, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !156, file: !6, line: 146, baseType: !13, size: 32, align: 32, offset: 1056)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !156, file: !6, line: 155, baseType: !9, size: 32, align: 32, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !156, file: !6, line: 156, baseType: !180, size: 64, align: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !156, file: !6, line: 157, baseType: !180, size: 64, align: 64, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !156, file: !6, line: 158, baseType: !180, size: 64, align: 64, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !156, file: !6, line: 159, baseType: !13, size: 32, align: 32, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !156, file: !6, line: 168, baseType: !185, size: 256, align: 32, offset: 1376)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, align: 32, elements: !186)
!186 = !{!187, !188}
!187 = !DISubrange(count: 4)
!188 = !DISubrange(count: 2)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !156, file: !6, line: 169, baseType: !136, size: 64, align: 64, offset: 1664)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !156, file: !6, line: 170, baseType: !136, size: 64, align: 64, offset: 1728)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !156, file: !6, line: 174, baseType: !192, size: 640, align: 32, offset: 1792)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 640, align: 32, elements: !193)
!193 = !{!25}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !156, file: !6, line: 175, baseType: !13, size: 32, align: 32, offset: 2432)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !156, file: !6, line: 197, baseType: !126, size: 64, align: 64, offset: 2496)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !156, file: !6, line: 198, baseType: !126, size: 64, align: 64, offset: 2560)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !156, file: !6, line: 199, baseType: !126, size: 64, align: 64, offset: 2624)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !156, file: !6, line: 200, baseType: !199, size: 256, align: 32, offset: 2688)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 32, elements: !186)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !156, file: !6, line: 201, baseType: !127, size: 64, align: 64, offset: 2944)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !156, file: !6, line: 202, baseType: !127, size: 64, align: 64, offset: 3008)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !156, file: !6, line: 203, baseType: !127, size: 64, align: 64, offset: 3072)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !156, file: !6, line: 203, baseType: !127, size: 64, align: 64, offset: 3136)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !156, file: !6, line: 203, baseType: !127, size: 64, align: 64, offset: 3200)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !156, file: !6, line: 203, baseType: !127, size: 64, align: 64, offset: 3264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !156, file: !6, line: 203, baseType: !127, size: 64, align: 64, offset: 3328)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !156, file: !6, line: 214, baseType: !126, size: 64, align: 64, offset: 3392)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !156, file: !6, line: 215, baseType: !126, size: 64, align: 64, offset: 3456)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !156, file: !6, line: 216, baseType: !9, size: 32, align: 32, offset: 3520)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !156, file: !6, line: 217, baseType: !9, size: 32, align: 32, offset: 3552)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !156, file: !6, line: 222, baseType: !13, size: 32, align: 32, offset: 3584)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !156, file: !6, line: 223, baseType: !13, size: 32, align: 32, offset: 3616)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !6, line: 225, baseType: !9, size: 32, align: 32, offset: 3648)
!214 = !{!215, !216, !217, !218, !219, !220, !221}
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !152, file: !1, line: 342, type: !155)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pri", arg: 2, scope: !152, file: !1, line: 342, type: !4)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !152, file: !1, line: 344, type: !9)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !152, file: !1, line: 345, type: !13)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tq", scope: !152, file: !1, line: 346, type: !12)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mq", scope: !152, file: !1, line: 347, type: !12)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iq", scope: !152, file: !1, line: 348, type: !12)
!222 = !DISubprogram(name: "P7PriorifyEmissionVector", scope: !1, file: !1, line: 443, type: !223, isLocal: false, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, %struct.p7prior_s*, i32, float*, [20 x float]*, float*)* @P7PriorifyEmissionVector, variables: !226)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !136, !4, !9, !136, !225, !136}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 1, scope: !222, file: !1, line: 443, type: !136)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pri", arg: 2, scope: !222, file: !1, line: 443, type: !4)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num", arg: 3, scope: !222, file: !1, line: 444, type: !9)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eq", arg: 4, scope: !222, file: !1, line: 444, type: !136)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e", arg: 5, scope: !222, file: !1, line: 444, type: !225)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_mix", arg: 6, scope: !222, file: !1, line: 445, type: !136)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !222, file: !1, line: 447, type: !9)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !222, file: !1, line: 448, type: !9)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mix", scope: !222, file: !1, line: 449, type: !12)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totc", scope: !222, file: !1, line: 450, type: !13)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tota", scope: !222, file: !1, line: 451, type: !13)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xi", scope: !222, file: !1, line: 452, type: !13)
!239 = !DISubprogram(name: "P7PriorifyTransitionVector", scope: !1, file: !1, line: 520, type: !240, isLocal: false, isDefinition: true, scopeLine: 522, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, %struct.p7prior_s*, float*)* @P7PriorifyTransitionVector, variables: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !136, !4, !136}
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 1, scope: !239, file: !1, line: 520, type: !136)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prior", arg: 2, scope: !239, file: !1, line: 520, type: !4)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tq", arg: 3, scope: !239, file: !1, line: 521, type: !136)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ts", scope: !239, file: !1, line: 523, type: !9)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !239, file: !1, line: 524, type: !9)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mix", scope: !239, file: !1, line: 525, type: !12)
