; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/sqio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.ReadSeqVars = type { %struct.__sFILE*, i8*, i32, i8*, i32, i32, %struct.ssioffset_s, %struct.ssioffset_s, %struct.ssioffset_s, i32, i32, i32, i32, i32, i32, i8*, %struct.seqinfo_s*, i8*, i32, i32, i32, i32, i32, %struct.msa_struct*, %struct.msafile_struct* }
%struct.ssioffset_s = type { i8, %union.anon }
%union.anon = type { i64 }
%struct.seqinfo_s = type { i32, [64 x i8], [64 x i8], [64 x i8], [128 x i8], i32, i32, i32, i32, i32, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !255, globals: !616, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/sqio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !8, !9, !32, !251}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "SQINFO", file: !11, line: 98, baseType: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "seqinfo_s", file: !11, line: 84, size: 2880, align: 64, elements: !13)
!13 = !{!14, !15, !19, !20, !21, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !11, line: 85, baseType: !5, size: 32, align: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !11, line: 86, baseType: !16, size: 512, align: 8, offset: 32)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, align: 8, elements: !17)
!17 = !{!18}
!18 = !DISubrange(count: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !11, line: 87, baseType: !16, size: 512, align: 8, offset: 544)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !12, file: !11, line: 88, baseType: !16, size: 512, align: 8, offset: 1056)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !12, file: !11, line: 89, baseType: !22, size: 1024, align: 8, offset: 1568)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, align: 8, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !11, line: 90, baseType: !5, size: 32, align: 32, offset: 2592)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !12, file: !11, line: 91, baseType: !5, size: 32, align: 32, offset: 2624)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !12, file: !11, line: 92, baseType: !5, size: 32, align: 32, offset: 2656)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "olen", scope: !12, file: !11, line: 93, baseType: !5, size: 32, align: 32, offset: 2688)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !11, line: 94, baseType: !5, size: 32, align: 32, offset: 2720)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !12, file: !11, line: 95, baseType: !6, size: 64, align: 64, offset: 2752)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !12, file: !11, line: 96, baseType: !6, size: 64, align: 64, offset: 2816)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "SQFILE", file: !11, line: 240, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadSeqVars", file: !11, line: 197, size: 1408, align: 64, elements: !35)
!35 = !{!36, !97, !98, !99, !100, !101, !102, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !209}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !34, file: !11, line: 198, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !39, line: 153, baseType: !40)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !39, line: 122, size: 1216, align: 64, elements: !41)
!41 = !{!42, !45, !46, !47, !49, !50, !55, !56, !57, !61, !65, !75, !81, !82, !85, !86, !90, !94, !95, !96}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !40, file: !39, line: 123, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !40, file: !39, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !40, file: !39, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !40, file: !39, line: 126, baseType: !48, size: 16, align: 16, offset: 128)
!48 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !40, file: !39, line: 127, baseType: !48, size: 16, align: 16, offset: 144)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !40, file: !39, line: 128, baseType: !51, size: 128, align: 64, offset: 192)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !39, line: 88, size: 128, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !51, file: !39, line: 89, baseType: !43, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !51, file: !39, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !40, file: !39, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !40, file: !39, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !40, file: !39, line: 133, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!5, !4}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !40, file: !39, line: 134, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!5, !4, !6, !5}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !40, file: !39, line: 135, baseType: !66, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !4, !69, !5}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !39, line: 77, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !71, line: 71, baseType: !72)
!71 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !73, line: 46, baseType: !74)
!73 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!74 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !40, file: !39, line: 136, baseType: !76, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!5, !4, !79, !5}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !40, file: !39, line: 139, baseType: !51, size: 128, align: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !40, file: !39, line: 140, baseType: !83, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !39, line: 94, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !40, file: !39, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !40, file: !39, line: 144, baseType: !87, size: 24, align: 8, offset: 928)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 3)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !40, file: !39, line: 145, baseType: !91, size: 8, align: 8, offset: 952)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !40, file: !39, line: 148, baseType: !51, size: 128, align: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !40, file: !39, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !40, file: !39, line: 152, baseType: !69, size: 64, align: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !34, file: !11, line: 199, baseType: !6, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "linenumber", scope: !34, file: !11, line: 200, baseType: !5, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !34, file: !11, line: 202, baseType: !6, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !34, file: !11, line: 203, baseType: !5, size: 32, align: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ssimode", scope: !34, file: !11, line: 205, baseType: !5, size: 32, align: 32, offset: 288)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ssioffset", scope: !34, file: !11, line: 206, baseType: !103, size: 128, align: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIOFFSET", file: !104, line: 42, baseType: !105)
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssioffset_s", file: !104, line: 35, size: 128, align: 64, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !105, file: !104, line: 36, baseType: !7, size: 8, align: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !105, file: !104, line: 40, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !104, line: 37, size: 64, align: 64, elements: !110)
!110 = !{!111, !114}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !109, file: !104, line: 38, baseType: !112, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !11, line: 41, baseType: !113)
!113 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !109, file: !104, line: 39, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint64", file: !11, line: 42, baseType: !116)
!116 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "r_off", scope: !34, file: !11, line: 207, baseType: !103, size: 128, align: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !34, file: !11, line: 208, baseType: !103, size: 128, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !34, file: !11, line: 210, baseType: !5, size: 32, align: 32, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lastrpl", scope: !34, file: !11, line: 211, baseType: !5, size: 32, align: 32, offset: 736)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "maxrpl", scope: !34, file: !11, line: 212, baseType: !5, size: 32, align: 32, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !34, file: !11, line: 213, baseType: !5, size: 32, align: 32, offset: 800)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "lastbpl", scope: !34, file: !11, line: 214, baseType: !5, size: 32, align: 32, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "maxbpl", scope: !34, file: !11, line: 215, baseType: !5, size: 32, align: 32, offset: 864)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !34, file: !11, line: 217, baseType: !6, size: 64, align: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sqinfo", scope: !34, file: !11, line: 218, baseType: !9, size: 64, align: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !34, file: !11, line: 219, baseType: !6, size: 64, align: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "seqlen", scope: !34, file: !11, line: 220, baseType: !5, size: 32, align: 32, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "maxseq", scope: !34, file: !11, line: 221, baseType: !5, size: 32, align: 32, offset: 1120)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !34, file: !11, line: 223, baseType: !5, size: 32, align: 32, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "do_gzip", scope: !34, file: !11, line: 224, baseType: !5, size: 32, align: 32, offset: 1184)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "do_stdin", scope: !34, file: !11, line: 225, baseType: !5, size: 32, align: 32, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "msa", scope: !34, file: !11, line: 237, baseType: !134, size: 64, align: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !136, line: 177, baseType: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !136, line: 112, size: 2880, align: 64, elements: !138)
!138 = !{!139, !140, !141, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !163, !165, !166, !167, !168, !169, !170, !171, !172, !173, !175, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !206, !207, !208}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !137, file: !136, line: 115, baseType: !8, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !137, file: !136, line: 116, baseType: !8, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !137, file: !136, line: 117, baseType: !142, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !137, file: !136, line: 118, baseType: !5, size: 32, align: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !137, file: !136, line: 119, baseType: !5, size: 32, align: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !136, line: 123, baseType: !5, size: 32, align: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !136, line: 124, baseType: !5, size: 32, align: 32, offset: 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !136, line: 125, baseType: !6, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !137, file: !136, line: 126, baseType: !6, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !137, file: !136, line: 127, baseType: !6, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !137, file: !136, line: 128, baseType: !6, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !137, file: !136, line: 129, baseType: !6, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !137, file: !136, line: 130, baseType: !6, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !137, file: !136, line: 131, baseType: !6, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !137, file: !136, line: 132, baseType: !8, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !137, file: !136, line: 133, baseType: !8, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !137, file: !136, line: 134, baseType: !8, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !137, file: !136, line: 135, baseType: !8, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !137, file: !136, line: 136, baseType: !160, size: 192, align: 32, offset: 1024)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 192, align: 32, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 6)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !137, file: !136, line: 137, baseType: !164, size: 192, align: 32, offset: 1216)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, align: 32, elements: !161)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !137, file: !136, line: 144, baseType: !8, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !137, file: !136, line: 145, baseType: !5, size: 32, align: 32, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !137, file: !136, line: 146, baseType: !5, size: 32, align: 32, offset: 1504)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !137, file: !136, line: 148, baseType: !8, size: 64, align: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !137, file: !136, line: 149, baseType: !8, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !137, file: !136, line: 150, baseType: !5, size: 32, align: 32, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !137, file: !136, line: 151, baseType: !5, size: 32, align: 32, offset: 1696)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !137, file: !136, line: 153, baseType: !8, size: 64, align: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !137, file: !136, line: 154, baseType: !174, size: 64, align: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !137, file: !136, line: 155, baseType: !176, size: 64, align: 64, offset: 1856)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !178, line: 42, baseType: !179)
!178 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 36, size: 192, align: 64, elements: !180)
!180 = !{!181, !189, !190, !191}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !179, file: !178, line: 37, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !178, line: 26, size: 192, align: 64, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !184, file: !178, line: 27, baseType: !6, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !184, file: !178, line: 28, baseType: !5, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !184, file: !178, line: 29, baseType: !183, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !179, file: !178, line: 39, baseType: !5, size: 32, align: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !179, file: !178, line: 40, baseType: !5, size: 32, align: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !179, file: !178, line: 41, baseType: !5, size: 32, align: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !137, file: !136, line: 156, baseType: !5, size: 32, align: 32, offset: 1920)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !137, file: !136, line: 158, baseType: !8, size: 64, align: 64, offset: 1984)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !137, file: !136, line: 159, baseType: !8, size: 64, align: 64, offset: 2048)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !137, file: !136, line: 160, baseType: !176, size: 64, align: 64, offset: 2112)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !137, file: !136, line: 161, baseType: !5, size: 32, align: 32, offset: 2176)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !137, file: !136, line: 163, baseType: !8, size: 64, align: 64, offset: 2240)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !137, file: !136, line: 164, baseType: !174, size: 64, align: 64, offset: 2304)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !137, file: !136, line: 165, baseType: !176, size: 64, align: 64, offset: 2368)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !137, file: !136, line: 166, baseType: !5, size: 32, align: 32, offset: 2432)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !137, file: !136, line: 170, baseType: !176, size: 64, align: 64, offset: 2496)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !137, file: !136, line: 171, baseType: !5, size: 32, align: 32, offset: 2560)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !137, file: !136, line: 172, baseType: !5, size: 32, align: 32, offset: 2592)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !137, file: !136, line: 173, baseType: !205, size: 64, align: 64, offset: 2624)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !137, file: !136, line: 174, baseType: !205, size: 64, align: 64, offset: 2688)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !137, file: !136, line: 175, baseType: !205, size: 64, align: 64, offset: 2752)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !137, file: !136, line: 176, baseType: !5, size: 32, align: 32, offset: 2816)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "afp", scope: !34, file: !11, line: 238, baseType: !210, size: 64, align: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSAFILE", file: !136, line: 199, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "msafile_struct", file: !136, line: 186, size: 512, align: 64, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !248, !249, !250}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !212, file: !136, line: 187, baseType: !37, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !212, file: !136, line: 188, baseType: !6, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "linenumber", scope: !212, file: !136, line: 189, baseType: !5, size: 32, align: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !212, file: !136, line: 191, baseType: !6, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !212, file: !136, line: 192, baseType: !5, size: 32, align: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ssi", scope: !212, file: !136, line: 194, baseType: !220, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIFILE", file: !104, line: 76, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssifile_s", file: !104, line: 49, size: 1152, align: 64, elements: !223)
!223 = !{!224, !225, !226, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !245, !246, !247}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !222, file: !104, line: 50, baseType: !37, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !222, file: !104, line: 51, baseType: !112, size: 32, align: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !222, file: !104, line: 52, baseType: !227, size: 16, align: 16, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !11, line: 40, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !222, file: !104, line: 53, baseType: !112, size: 32, align: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !222, file: !104, line: 54, baseType: !112, size: 32, align: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !222, file: !104, line: 55, baseType: !112, size: 32, align: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !222, file: !104, line: 56, baseType: !112, size: 32, align: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !222, file: !104, line: 57, baseType: !112, size: 32, align: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "frecsize", scope: !222, file: !104, line: 58, baseType: !112, size: 32, align: 32, offset: 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "precsize", scope: !222, file: !104, line: 59, baseType: !112, size: 32, align: 32, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "srecsize", scope: !222, file: !104, line: 60, baseType: !112, size: 32, align: 32, offset: 352)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "foffset", scope: !222, file: !104, line: 61, baseType: !103, size: 128, align: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "poffset", scope: !222, file: !104, line: 62, baseType: !103, size: 128, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "soffset", scope: !222, file: !104, line: 63, baseType: !103, size: 128, align: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !222, file: !104, line: 65, baseType: !7, size: 8, align: 8, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !222, file: !104, line: 66, baseType: !7, size: 8, align: 8, offset: 776)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !222, file: !104, line: 70, baseType: !8, size: 64, align: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !222, file: !104, line: 71, baseType: !244, size: 64, align: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !222, file: !104, line: 72, baseType: !244, size: 64, align: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !222, file: !104, line: 73, baseType: !244, size: 64, align: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !222, file: !104, line: 74, baseType: !244, size: 64, align: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "do_gzip", scope: !212, file: !136, line: 196, baseType: !5, size: 32, align: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "do_stdin", scope: !212, file: !136, line: 197, baseType: !5, size: 32, align: 32, offset: 416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !212, file: !136, line: 198, baseType: !5, size: 32, align: 32, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !252, line: 30, baseType: !253)
!252 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !73, line: 92, baseType: !254)
!254 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!255 = !{!256, !263, !271, !278, !283, !290, !293, !299, !308, !314, !319, !322, !328, !337, !351, !361, !367, !375, !388, !397, !411, !442, !457, !462, !467, !474, !488, !491, !497, !504, !507, !514, !526, !536, !539, !545, !549, !553, !557, !562, !566, !570, !574, !578, !582, !586, !590, !594, !598, !603, !607, !613}
!256 = !DISubprogram(name: "SeqfileOpen", scope: !1, file: !1, line: 87, type: !257, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: %struct.ReadSeqVars* (i8*, i32, i8*)* @SeqfileOpen, variables: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{!32, !6, !5, !6}
!259 = !{!260, !261, !262}
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !256, file: !1, line: 87, type: !6)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !256, file: !1, line: 87, type: !5)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "env", arg: 3, scope: !256, file: !1, line: 87, type: !6)
!263 = !DISubprogram(name: "SeqfileOpenForIndexing", scope: !1, file: !1, line: 92, type: !264, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct.ReadSeqVars* (i8*, i32, i8*, i32)* @SeqfileOpenForIndexing, variables: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!32, !6, !5, !6, !5}
!266 = !{!267, !268, !269, !270}
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !263, file: !1, line: 92, type: !6)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !263, file: !1, line: 92, type: !5)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "env", arg: 3, scope: !263, file: !1, line: 92, type: !6)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssimode", arg: 4, scope: !263, file: !1, line: 92, type: !5)
!271 = !DISubprogram(name: "SeqfilePosition", scope: !1, file: !1, line: 221, type: !272, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ReadSeqVars*, %struct.ssioffset_s*)* @SeqfilePosition, variables: !275)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !32, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!275 = !{!276, !277}
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqfp", arg: 1, scope: !271, file: !1, line: 221, type: !32)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 2, scope: !271, file: !1, line: 221, type: !274)
!278 = !DISubprogram(name: "SeqfileRewind", scope: !1, file: !1, line: 242, type: !279, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ReadSeqVars*)* @SeqfileRewind, variables: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !32}
!281 = !{!282}
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqfp", arg: 1, scope: !278, file: !1, line: 242, type: !32)
!283 = !DISubprogram(name: "SeqfileLineParameters", scope: !1, file: !1, line: 270, type: !284, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ReadSeqVars*, i32*, i32*)* @SeqfileLineParameters, variables: !286)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !32, !205, !205}
!286 = !{!287, !288, !289}
