; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/sre_string.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [44 x i8] c"malloc of %ld bytes failed: file %s line %d\00", align 1
@.str1 = private unnamed_addr constant [45 x i8] c"realloc of %ld bytes failed: file %s line %d\00", align 1
@.str2 = private unnamed_addr constant [68 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/sre_string.c\00", align 1
@_DefaultRuneLocale = external global %struct._RuneLocale

; Function Attrs: nounwind optsize ssp uwtable
define i8* @Strdup(i8* %s) #0 {
  tail call void @llvm.dbg.value(metadata i8* %s, i64 0, metadata !13, metadata !225), !dbg !226

!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !49, line: 92, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = !{!52, !53, !54, !55}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !43, file: !1, line: 109, type: !5)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !43, file: !1, line: 109, type: !7)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !43, file: !1, line: 109, type: !46)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !43, file: !1, line: 111, type: !4)
!56 = !DISubprogram(name: "sre_realloc", scope: !1, file: !1, line: 120, type: !57, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, i8*, i64)* @sre_realloc, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{!4, !5, !7, !4, !46}
!59 = !{!60, !61, !62, !63, !64}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !56, file: !1, line: 120, type: !5)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !56, file: !1, line: 120, type: !7)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !56, file: !1, line: 120, type: !4)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 4, scope: !56, file: !1, line: 120, type: !46)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !56, file: !1, line: 122, type: !4)
!65 = !DISubprogram(name: "Free2DArray", scope: !1, file: !1, line: 152, type: !66, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32)* @Free2DArray, variables: !69)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !7}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!69 = !{!70, !71, !72}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !65, file: !1, line: 152, type: !68)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim1", arg: 2, scope: !65, file: !1, line: 152, type: !7)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !65, file: !1, line: 154, type: !7)
!73 = !DISubprogram(name: "Free3DArray", scope: !1, file: !1, line: 163, type: !74, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: void (i8***, i32, i32)* @Free3DArray, variables: !77)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76, !7, !7}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !73, file: !1, line: 163, type: !76)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim1", arg: 2, scope: !73, file: !1, line: 163, type: !7)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim2", arg: 3, scope: !73, file: !1, line: 163, type: !7)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !73, file: !1, line: 165, type: !7)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !73, file: !1, line: 165, type: !7)
!83 = !DISubprogram(name: "RandomSequence", scope: !1, file: !1, line: 194, type: !84, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, float*, i32, i32)* @RandomSequence, variables: !88)
!84 = !DISubroutineType(types: !85)
!85 = !{!5, !5, !86, !7, !7}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!88 = !{!89, !90, !91, !92, !93, !94}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alphabet", arg: 1, scope: !83, file: !1, line: 194, type: !5)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !83, file: !1, line: 194, type: !86)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 3, scope: !83, file: !1, line: 194, type: !7)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 4, scope: !83, file: !1, line: 194, type: !7)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !83, file: !1, line: 196, type: !5)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !83, file: !1, line: 197, type: !7)
!95 = !DISubprogram(name: "sre_fgets", scope: !1, file: !1, line: 245, type: !96, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8**, i32*, %struct.__sFILE*)* @sre_fgets, variables: !159)
!96 = !DISubroutineType(types: !97)
!97 = !{!5, !98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !102, line: 153, baseType: !103)
!102 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !102, line: 122, size: 1216, align: 64, elements: !104)
!104 = !{!105, !108, !109, !110, !112, !113, !118, !119, !120, !124, !128, !137, !143, !144, !147, !148, !152, !156, !157, !158}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !103, file: !102, line: 123, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !103, file: !102, line: 124, baseType: !7, size: 32, align: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !103, file: !102, line: 125, baseType: !7, size: 32, align: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !103, file: !102, line: 126, baseType: !111, size: 16, align: 16, offset: 128)
!111 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !103, file: !102, line: 127, baseType: !111, size: 16, align: 16, offset: 144)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !103, file: !102, line: 128, baseType: !114, size: 128, align: 64, offset: 192)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !102, line: 88, size: 128, align: 64, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !114, file: !102, line: 89, baseType: !106, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !114, file: !102, line: 90, baseType: !7, size: 32, align: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !103, file: !102, line: 129, baseType: !7, size: 32, align: 32, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !103, file: !102, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !103, file: !102, line: 133, baseType: !121, size: 64, align: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!7, !4}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !103, file: !102, line: 134, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!7, !4, !5, !7}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !103, file: !102, line: 135, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !4, !132, !7}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !102, line: 77, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !134, line: 71, baseType: !135)
!134 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !136)
!136 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !103, file: !102, line: 136, baseType: !138, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!7, !4, !141, !7}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !103, file: !102, line: 139, baseType: !114, size: 128, align: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !103, file: !102, line: 140, baseType: !145, size: 64, align: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !102, line: 94, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !103, file: !102, line: 141, baseType: !7, size: 32, align: 32, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !103, file: !102, line: 144, baseType: !149, size: 24, align: 8, offset: 928)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 24, align: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 3)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !103, file: !102, line: 145, baseType: !153, size: 8, align: 8, offset: 952)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 8, align: 8, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !103, file: !102, line: 148, baseType: !114, size: 128, align: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !103, file: !102, line: 151, baseType: !7, size: 32, align: 32, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !103, file: !102, line: 152, baseType: !132, size: 64, align: 64, offset: 1152)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !95, file: !1, line: 245, type: !98)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !95, file: !1, line: 245, type: !99)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 3, scope: !95, file: !1, line: 245, type: !100)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !95, file: !1, line: 247, type: !5)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !95, file: !1, line: 248, type: !7)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !95, file: !1, line: 249, type: !7)
!166 = !DISubprogram(name: "sre_strcat", scope: !1, file: !1, line: 332, type: !167, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**, i32, i8*, i32)* @sre_strcat, variables: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!7, !98, !7, !5, !7}
!169 = !{!170, !171, !172, !173, !174, !175}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !166, file: !1, line: 332, type: !98)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ldest", arg: 2, scope: !166, file: !1, line: 332, type: !7)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 3, scope: !166, file: !1, line: 332, type: !5)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lsrc", arg: 4, scope: !166, file: !1, line: 332, type: !7)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len1", scope: !166, file: !1, line: 334, type: !7)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len2", scope: !166, file: !1, line: 334, type: !7)
!176 = !DISubprogram(name: "sre_strtok", scope: !1, file: !1, line: 399, type: !177, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8**, i8*, i32*)* @sre_strtok, variables: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{!5, !98, !5, !99}
!179 = !{!180, !181, !182, !183, !184, !185}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !176, file: !1, line: 399, type: !98)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delim", arg: 2, scope: !176, file: !1, line: 399, type: !5)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !176, file: !1, line: 399, type: !99)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "begin", scope: !176, file: !1, line: 401, type: !5)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !176, file: !1, line: 401, type: !5)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !176, file: !1, line: 402, type: !7)
!186 = !DISubprogram(name: "sre_strdup", scope: !1, file: !1, line: 436, type: !187, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32)* @sre_strdup, variables: !189)
!187 = !DISubroutineType(types: !188)
!188 = !{!5, !5, !7}
!189 = !{!190, !191, !192}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !186, file: !1, line: 436, type: !5)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !186, file: !1, line: 436, type: !7)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !186, file: !1, line: 438, type: !5)
!193 = !DISubprogram(name: "sre_strncpy", scope: !1, file: !1, line: 462, type: !194, isLocal: false, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*, i32)* @sre_strncpy, variables: !196)
!194 = !DISubroutineType(types: !195)
!195 = !{!5, !5, !5, !7}
!196 = !{!197, !198, !199}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s1", arg: 1, scope: !193, file: !1, line: 462, type: !5)
