; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ssifile_s = type { %struct.__sFILE*, i32, i16, i32, i32, i32, i32, i32, i32, i32, i32, %struct.ssioffset_s, %struct.ssioffset_s, %struct.ssioffset_s, i8, i8, i8**, i32*, i32*, i32*, i32* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.ssioffset_s = type { i8, %union.anon }
%union.anon = type { i64 }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }
%struct.ssiindex_s = type { i32, i32, i32, i32, i8**, i32*, i32*, i32*, i32, i16, %struct.ssipkey_s*, i32, i32, i8*, %struct.__sFILE*, %struct.ssiskey_s*, i32, i32, i8*, %struct.__sFILE* }
%struct.ssipkey_s = type { i8*, i16, %struct.ssioffset_s, %struct.ssioffset_s, i32 }
%struct.ssiskey_s = type { i8*, i8* }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !528, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7, !8, !11, !34, !28, !29}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint16", file: !9, line: 40, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssipkey_s", file: !13, line: 91, size: 448, align: 64, elements: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/ssi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !{!15, !18, !19, !32, !33}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !12, file: !13, line: 92, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "fnum", scope: !12, file: !13, line: 93, baseType: !8, size: 16, align: 16, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "r_off", scope: !12, file: !13, line: 94, baseType: !20, size: 128, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIOFFSET", file: !13, line: 42, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssioffset_s", file: !13, line: 35, size: 128, align: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !21, file: !13, line: 36, baseType: !17, size: 8, align: 8)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !21, file: !13, line: 40, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !13, line: 37, size: 64, align: 64, elements: !26)
!26 = !{!27, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !25, file: !13, line: 38, baseType: !28, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint32", file: !9, line: 41, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !25, file: !13, line: 39, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqd_uint64", file: !9, line: 42, baseType: !7)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !12, file: !13, line: 95, baseType: !20, size: 128, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !13, line: 96, baseType: !28, size: 32, align: 32, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssiskey_s", file: !13, line: 98, size: 128, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !35, file: !13, line: 99, baseType: !16, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !35, file: !13, line: 100, baseType: !16, size: 64, align: 64, offset: 64)
!39 = !{!40, !136, !154, !164, !181, !187, !195, !200, !264, !294, !301, !310, !318, !329, !337, !374, !380, !385, !388, !396, !400, !410, !416, !424, !430, !437, !443, !449, !456, !464, !468, !478, !487, !503, !513, !522}
!40 = !DISubprogram(name: "SSIOpen", scope: !1, file: !1, line: 60, type: !41, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.ssifile_s**)* @SSIOpen, variables: !131)
!41 = !DISubroutineType(types: !42)
!42 = !{!5, !16, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIFILE", file: !13, line: 76, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssifile_s", file: !13, line: 49, size: 1152, align: 64, elements: !47)
!47 = !{!48, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !126, !128, !129, !130}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !46, file: !13, line: 50, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !51, line: 153, baseType: !52)
!51 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !51, line: 122, size: 1216, align: 64, elements: !53)
!53 = !{!54, !57, !58, !59, !61, !62, !67, !68, !69, !73, !77, !87, !93, !94, !97, !98, !102, !106, !107, !108}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !52, file: !51, line: 123, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !52, file: !51, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !52, file: !51, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !51, line: 126, baseType: !60, size: 16, align: 16, offset: 128)
!60 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !52, file: !51, line: 127, baseType: !60, size: 16, align: 16, offset: 144)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !52, file: !51, line: 128, baseType: !63, size: 128, align: 64, offset: 192)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !51, line: 88, size: 128, align: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !63, file: !51, line: 89, baseType: !55, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !63, file: !51, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !52, file: !51, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !52, file: !51, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !52, file: !51, line: 133, baseType: !70, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!5, !4}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !52, file: !51, line: 134, baseType: !74, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!5, !4, !16, !5}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !52, file: !51, line: 135, baseType: !78, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !4, !81, !5}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !51, line: 77, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !83, line: 71, baseType: !84)
!83 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !52, file: !51, line: 136, baseType: !88, size: 64, align: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!5, !4, !91, !5}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !52, file: !51, line: 139, baseType: !63, size: 128, align: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !52, file: !51, line: 140, baseType: !95, size: 64, align: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !51, line: 94, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !52, file: !51, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !52, file: !51, line: 144, baseType: !99, size: 24, align: 8, offset: 928)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 24, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 3)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !52, file: !51, line: 145, baseType: !103, size: 8, align: 8, offset: 952)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, align: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !52, file: !51, line: 148, baseType: !63, size: 128, align: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !52, file: !51, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !51, line: 152, baseType: !81, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !13, line: 51, baseType: !28, size: 32, align: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !46, file: !13, line: 52, baseType: !8, size: 16, align: 16, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !46, file: !13, line: 53, baseType: !28, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !46, file: !13, line: 54, baseType: !28, size: 32, align: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !46, file: !13, line: 55, baseType: !28, size: 32, align: 32, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !46, file: !13, line: 56, baseType: !28, size: 32, align: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !46, file: !13, line: 57, baseType: !28, size: 32, align: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "frecsize", scope: !46, file: !13, line: 58, baseType: !28, size: 32, align: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "precsize", scope: !46, file: !13, line: 59, baseType: !28, size: 32, align: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "srecsize", scope: !46, file: !13, line: 60, baseType: !28, size: 32, align: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "foffset", scope: !46, file: !13, line: 61, baseType: !20, size: 128, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "poffset", scope: !46, file: !13, line: 62, baseType: !20, size: 128, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "soffset", scope: !46, file: !13, line: 63, baseType: !20, size: 128, align: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !46, file: !13, line: 65, baseType: !17, size: 8, align: 8, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !46, file: !13, line: 66, baseType: !17, size: 8, align: 8, offset: 776)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !46, file: !13, line: 70, baseType: !125, size: 64, align: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !46, file: !13, line: 71, baseType: !127, size: 64, align: 64, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !46, file: !13, line: 72, baseType: !127, size: 64, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !46, file: !13, line: 73, baseType: !127, size: 64, align: 64, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !46, file: !13, line: 74, baseType: !127, size: 64, align: 64, offset: 1088)
!131 = !{!132, !133, !134, !135}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !40, file: !1, line: 60, type: !16)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_sfp", arg: 2, scope: !40, file: !1, line: 60, type: !43)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sfp", scope: !40, file: !1, line: 62, type: !44)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !40, file: !1, line: 63, type: !5)
!136 = !DISubprogram(name: "SSIGetOffsetByName", scope: !1, file: !1, line: 184, type: !137, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ssifile_s*, i8*, i32*, %struct.ssioffset_s*)* @SSIGetOffsetByName, variables: !141)
!137 = !DISubroutineType(types: !138)
!138 = !{!5, !44, !16, !139, !140}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!141 = !{!142, !143, !144, !145, !146, !147, !148}
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sfp", arg: 1, scope: !136, file: !1, line: 184, type: !44)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !136, file: !1, line: 184, type: !16)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_fh", arg: 3, scope: !136, file: !1, line: 184, type: !139)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_offset", arg: 4, scope: !136, file: !1, line: 185, type: !140)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !136, file: !1, line: 187, type: !5)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnum", scope: !136, file: !1, line: 188, type: !8)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pkey", scope: !149, file: !1, line: 206, type: !16)
!149 = distinct !DILexicalBlock(scope: !150, file: !1, line: 205, column: 30)
!150 = distinct !DILexicalBlock(scope: !151, file: !1, line: 205, column: 9)
!151 = distinct !DILexicalBlock(scope: !152, file: !1, line: 202, column: 45)
!152 = distinct !DILexicalBlock(scope: !153, file: !1, line: 202, column: 14)
!153 = distinct !DILexicalBlock(scope: !136, file: !1, line: 194, column: 7)
!154 = !DISubprogram(name: "SSIGetOffsetByNumber", scope: !1, file: !1, line: 242, type: !155, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ssifile_s*, i32, i32*, %struct.ssioffset_s*)* @SSIGetOffsetByNumber, variables: !157)
!155 = !DISubroutineType(types: !156)
!156 = !{!5, !44, !5, !139, !140}
!157 = !{!158, !159, !160, !161, !162, !163}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sfp", arg: 1, scope: !154, file: !1, line: 242, type: !44)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !154, file: !1, line: 242, type: !5)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_fh", arg: 3, scope: !154, file: !1, line: 242, type: !139)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_offset", arg: 4, scope: !154, file: !1, line: 242, type: !140)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnum", scope: !154, file: !1, line: 244, type: !8)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pkey", scope: !154, file: !1, line: 245, type: !16)
!164 = !DISubprogram(name: "SSIGetSubseqOffset", scope: !1, file: !1, line: 293, type: !165, isLocal: false, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ssifile_s*, i8*, i32, i32*, %struct.ssioffset_s*, %struct.ssioffset_s*, i32*)* @SSIGetSubseqOffset, variables: !167)
!165 = !DISubroutineType(types: !166)
!166 = !{!5, !44, !16, !5, !139, !140, !140, !139}
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sfp", arg: 1, scope: !164, file: !1, line: 293, type: !44)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !164, file: !1, line: 293, type: !16)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "requested_start", arg: 3, scope: !164, file: !1, line: 293, type: !5)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_fh", arg: 4, scope: !164, file: !1, line: 294, type: !139)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "record_offset", arg: 5, scope: !164, file: !1, line: 294, type: !140)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_offset", arg: 6, scope: !164, file: !1, line: 295, type: !140)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_actual_start", arg: 7, scope: !164, file: !1, line: 295, type: !139)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !164, file: !1, line: 297, type: !5)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !164, file: !1, line: 298, type: !28)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !164, file: !1, line: 299, type: !5)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !164, file: !1, line: 299, type: !5)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !164, file: !1, line: 299, type: !5)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !164, file: !1, line: 299, type: !5)
!181 = !DISubprogram(name: "SSISetFilePosition", scope: !1, file: !1, line: 379, type: !182, isLocal: false, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.ssioffset_s*)* @SSISetFilePosition, variables: !184)
!182 = !DISubroutineType(types: !183)
!183 = !{!5, !49, !140}
!184 = !{!185, !186}
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !181, file: !1, line: 379, type: !49)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 2, scope: !181, file: !1, line: 379, type: !140)
!187 = !DISubprogram(name: "SSIFileInfo", scope: !1, file: !1, line: 418, type: !188, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ssifile_s*, i32, i8**, i32*)* @SSIFileInfo, variables: !190)
!188 = !DISubroutineType(types: !189)
!189 = !{!5, !44, !5, !125, !139}
!190 = !{!191, !192, !193, !194}
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sfp", arg: 1, scope: !187, file: !1, line: 418, type: !44)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fh", arg: 2, scope: !187, file: !1, line: 418, type: !5)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_filename", arg: 3, scope: !187, file: !1, line: 418, type: !125)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_format", arg: 4, scope: !187, file: !1, line: 418, type: !139)
!195 = !DISubprogram(name: "SSIClose", scope: !1, file: !1, line: 436, type: !196, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ssifile_s*)* @SSIClose, variables: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !44}
!198 = !{!199}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sfp", arg: 1, scope: !195, file: !1, line: 436, type: !44)
!200 = !DISubprogram(name: "SSIRecommendMode", scope: !1, file: !1, line: 479, type: !201, isLocal: false, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @SSIRecommendMode, variables: !203)
!201 = !DISubroutineType(types: !202)
!202 = !{!5, !16}
!203 = !{!204, !205}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !200, file: !1, line: 479, type: !16)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !200, file: !1, line: 491, type: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !207, line: 182, size: 1152, align: 64, elements: !208)
!207 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!208 = !{!209, !214, !219, !222, !225, !230, !234, !235, !243, !244, !245, !246, !249, !253, !257, !258, !259, !260}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !206, file: !207, line: 182, baseType: !210, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !211, line: 30, baseType: !212)
!211 = !DIFile(filename: "/usr/include/sys/_types/_dev_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !83, line: 57, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !85, line: 44, baseType: !5)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !206, file: !207, line: 182, baseType: !215, size: 16, align: 16, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !216, line: 30, baseType: !217)
!216 = !DIFile(filename: "/usr/include/sys/_types/_mode_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !83, line: 70, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !85, line: 43, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !206, file: !207, line: 182, baseType: !220, size: 16, align: 16, offset: 48)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !221, line: 30, baseType: !218)
!221 = !DIFile(filename: "/usr/include/sys/_types/_nlink_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !206, file: !207, line: 182, baseType: !223, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !83, line: 62, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !85, line: 47, baseType: !7)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !206, file: !207, line: 182, baseType: !226, size: 32, align: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !227, line: 30, baseType: !228)
!227 = !DIFile(filename: "/usr/include/sys/_types/_uid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !83, line: 75, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !85, line: 45, baseType: !29)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !206, file: !207, line: 182, baseType: !231, size: 32, align: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !232, line: 30, baseType: !233)
!232 = !DIFile(filename: "/usr/include/sys/_types/_gid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !83, line: 60, baseType: !229)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !206, file: !207, line: 182, baseType: !210, size: 32, align: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !206, file: !207, line: 182, baseType: !236, size: 128, align: 64, offset: 256)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !237, line: 30, size: 128, align: 64, elements: !238)
!237 = !DIFile(filename: "/usr/include/sys/_types/_timespec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!238 = !{!239, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !236, file: !237, line: 32, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !85, line: 120, baseType: !241)
!241 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !236, file: !237, line: 33, baseType: !241, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !206, file: !207, line: 182, baseType: !236, size: 128, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !206, file: !207, line: 182, baseType: !236, size: 128, align: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !206, file: !207, line: 182, baseType: !236, size: 128, align: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !206, file: !207, line: 182, baseType: !247, size: 64, align: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !248, line: 30, baseType: !82)
!248 = !DIFile(filename: "/usr/include/sys/_types/_off_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !206, file: !207, line: 182, baseType: !250, size: 64, align: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !251, line: 30, baseType: !252)
!251 = !DIFile(filename: "/usr/include/sys/_types/_blkcnt_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !83, line: 55, baseType: !84)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !206, file: !207, line: 182, baseType: !254, size: 32, align: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !255, line: 30, baseType: !256)
!255 = !DIFile(filename: "/usr/include/sys/_types/_blksize_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !83, line: 56, baseType: !213)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !206, file: !207, line: 182, baseType: !229, size: 32, align: 32, offset: 928)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !206, file: !207, line: 182, baseType: !229, size: 32, align: 32, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !206, file: !207, line: 182, baseType: !213, size: 32, align: 32, offset: 992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !206, file: !207, line: 182, baseType: !261, size: 128, align: 64, offset: 1024)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, align: 64, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 2)
!264 = !DISubprogram(name: "SSICreateIndex", scope: !1, file: !1, line: 515, type: !265, isLocal: false, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, function: %struct.ssiindex_s* (i32)* @SSICreateIndex, variables: !291)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !5}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSIINDEX", file: !13, line: 127, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssiindex_s", file: !13, line: 102, size: 960, align: 64, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "smode", scope: !269, file: !13, line: 103, baseType: !5, size: 32, align: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "imode", scope: !269, file: !13, line: 104, baseType: !5, size: 32, align: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !269, file: !13, line: 105, baseType: !5, size: 32, align: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "max_ram", scope: !269, file: !13, line: 106, baseType: !5, size: 32, align: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "filenames", scope: !269, file: !13, line: 108, baseType: !125, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fileformat", scope: !269, file: !13, line: 109, baseType: !127, size: 64, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bpl", scope: !269, file: !13, line: 110, baseType: !127, size: 64, align: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rpl", scope: !269, file: !13, line: 111, baseType: !127, size: 64, align: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flen", scope: !269, file: !13, line: 112, baseType: !28, size: 32, align: 32, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nfiles", scope: !269, file: !13, line: 113, baseType: !8, size: 16, align: 16, offset: 416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pkeys", scope: !269, file: !13, line: 115, baseType: !11, size: 64, align: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !269, file: !13, line: 116, baseType: !28, size: 32, align: 32, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nprimary", scope: !269, file: !13, line: 117, baseType: !28, size: 32, align: 32, offset: 544)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ptmpfile", scope: !269, file: !13, line: 118, baseType: !16, size: 64, align: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ptmp", scope: !269, file: !13, line: 119, baseType: !49, size: 64, align: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "skeys", scope: !269, file: !13, line: 121, baseType: !34, size: 64, align: 64, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !269, file: !13, line: 122, baseType: !28, size: 32, align: 32, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nsecondary", scope: !269, file: !13, line: 123, baseType: !28, size: 32, align: 32, offset: 800)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "stmpfile", scope: !269, file: !13, line: 124, baseType: !16, size: 64, align: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "stmp", scope: !269, file: !13, line: 125, baseType: !49, size: 64, align: 64, offset: 896)
!291 = !{!292, !293}
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !264, file: !1, line: 515, type: !5)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !264, file: !1, line: 517, type: !267)
!294 = !DISubprogram(name: "SSIGetFilePosition", scope: !1, file: !1, line: 587, type: !295, isLocal: false, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32, %struct.ssioffset_s*)* @SSIGetFilePosition, variables: !297)
!295 = !DISubroutineType(types: !296)
!296 = !{!5, !49, !5, !140}
!297 = !{!298, !299, !300}
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !294, file: !1, line: 587, type: !49)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !294, file: !1, line: 587, type: !5)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_offset", arg: 3, scope: !294, file: !1, line: 587, type: !140)
!301 = !DISubprogram(name: "SSIAddFileToIndex", scope: !1, file: !1, line: 629, type: !302, isLocal: false, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ssiindex_s*, i8*, i32, i32*)* @SSIAddFileToIndex, variables: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!5, !267, !16, !5, !139}
!304 = !{!305, !306, !307, !308, !309}
!305 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !301, file: !1, line: 629, type: !267)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !301, file: !1, line: 629, type: !16)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 3, scope: !301, file: !1, line: 629, type: !5)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_fh", arg: 4, scope: !301, file: !1, line: 629, type: !139)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !301, file: !1, line: 631, type: !5)
!310 = !DISubprogram(name: "SSISetFileForSubseq", scope: !1, file: !1, line: 682, type: !311, isLocal: false, isDefinition: true, scopeLine: 683, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ssiindex_s*, i32, i32, i32)* @SSISetFileForSubseq, variables: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{!5, !267, !5, !5, !5}
!313 = !{!314, !315, !316, !317}
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !310, file: !1, line: 682, type: !267)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fh", arg: 2, scope: !310, file: !1, line: 682, type: !5)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bpl", arg: 3, scope: !310, file: !1, line: 682, type: !5)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rpl", arg: 4, scope: !310, file: !1, line: 682, type: !5)
!318 = !DISubprogram(name: "SSIAddPrimaryKeyToIndex", scope: !1, file: !1, line: 726, type: !319, isLocal: false, isDefinition: true, scopeLine: 728, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ssiindex_s*, i8*, i32, %struct.ssioffset_s*, %struct.ssioffset_s*, i32)* @SSIAddPrimaryKeyToIndex, variables: !321)
!319 = !DISubroutineType(types: !320)
!320 = !{!5, !267, !16, !5, !140, !140, !5}
!321 = !{!322, !323, !324, !325, !326, !327, !328}
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !318, file: !1, line: 726, type: !267)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !318, file: !1, line: 726, type: !16)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fh", arg: 3, scope: !318, file: !1, line: 726, type: !5)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r_off", arg: 4, scope: !318, file: !1, line: 727, type: !140)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d_off", arg: 5, scope: !318, file: !1, line: 727, type: !140)
