; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/tophits.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.tophit_s = type { %struct.hit_s**, %struct.hit_s*, i32, i32, i32 }
%struct.hit_s = type { double, float, double, float, double, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, %struct.fancyali_s* }
%struct.fancyali_s = type { i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/tophits.c\00", align 1
@.str2 = private unnamed_addr constant [31 x i8] c"     Total hits:           %d\0A\00", align 1
@.str3 = private unnamed_addr constant [31 x i8] c"     Satisfying E cutoff:  %d\0A\00", align 1
@.str4 = private unnamed_addr constant [32 x i8] c"     Total memory:         %dK\0A\00", align 1
@str = private unnamed_addr constant [18 x i8] c"tophits_s report:\00"

; Function Attrs: nounwind optsize ssp uwtable
define %struct.tophit_s* @AllocTophits(i32 %lumpsize) #0 {
  tail call void @llvm.dbg.value(metadata i32 %lumpsize, i64 0, metadata !58, metadata !165), !dbg !166
  %1 = tail call i8* @sre_malloc(i8* getelementptr inbounds ([65 x i8]* @.str, i64 0, i64 0), i32 82, i64 32) #7, !dbg !167
  %2 = bitcast i8* %1 to %struct.tophit_s*, !dbg !167
  tail call void @llvm.dbg.value(metadata %struct.tophit_s* %2, i64 0, metadata !59, metadata !165), !dbg !168

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !45, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/tophits.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "hit_s", file: !8, line: 470, size: 832, align: 64, elements: !9)
!8 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !{!10, !12, !14, !15, !16, !17, !20, !21, !22, !24, !25, !26, !27, !28, !29, !30, !31}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "sortkey", scope: !7, file: !8, line: 471, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !7, file: !8, line: 472, baseType: !13, size: 32, align: 32, offset: 64)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "pvalue", scope: !7, file: !8, line: 473, baseType: !11, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "mothersc", scope: !7, file: !8, line: 474, baseType: !13, size: 32, align: 32, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "motherp", scope: !7, file: !8, line: 475, baseType: !11, size: 64, align: 64, offset: 256)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !7, file: !8, line: 476, baseType: !18, size: 64, align: 64, offset: 320)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !7, file: !8, line: 477, baseType: !18, size: 64, align: 64, offset: 384)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !7, file: !8, line: 478, baseType: !18, size: 64, align: 64, offset: 448)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sqfrom", scope: !7, file: !8, line: 479, baseType: !23, size: 32, align: 32, offset: 512)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sqto", scope: !7, file: !8, line: 480, baseType: !23, size: 32, align: 32, offset: 544)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !7, file: !8, line: 481, baseType: !23, size: 32, align: 32, offset: 576)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hmmfrom", scope: !7, file: !8, line: 482, baseType: !23, size: 32, align: 32, offset: 608)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hmmto", scope: !7, file: !8, line: 483, baseType: !23, size: 32, align: 32, offset: 640)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hmmlen", scope: !7, file: !8, line: 484, baseType: !23, size: 32, align: 32, offset: 672)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "domidx", scope: !7, file: !8, line: 485, baseType: !23, size: 32, align: 32, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ndom", scope: !7, file: !8, line: 486, baseType: !23, size: 32, align: 32, offset: 736)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ali", scope: !7, file: !8, line: 487, baseType: !32, size: 64, align: 64, offset: 768)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "fancyali_s", file: !8, line: 447, size: 576, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rfline", scope: !33, file: !8, line: 448, baseType: !18, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "csline", scope: !33, file: !8, line: 449, baseType: !18, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !33, file: !8, line: 450, baseType: !18, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mline", scope: !33, file: !8, line: 451, baseType: !18, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !33, file: !8, line: 452, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !33, file: !8, line: 453, baseType: !23, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !33, file: !8, line: 454, baseType: !18, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !33, file: !8, line: 455, baseType: !18, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "sqfrom", scope: !33, file: !8, line: 456, baseType: !23, size: 32, align: 32, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sqto", scope: !33, file: !8, line: 457, baseType: !23, size: 32, align: 32, offset: 544)
!45 = !{!46, !60, !65, !69, !74, !79, !101, !128, !136, !146, !150}
!46 = !DISubprogram(name: "AllocTophits", scope: !1, file: !1, line: 78, type: !47, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: %struct.tophit_s* (i32)* @AllocTophits, variables: !57)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !23}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "tophit_s", file: !8, line: 497, size: 256, align: 64, elements: !51)
!51 = !{!52, !53, !54, !55, !56}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !50, file: !8, line: 498, baseType: !5, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "unsrt", scope: !50, file: !8, line: 499, baseType: !6, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !50, file: !8, line: 500, baseType: !23, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !50, file: !8, line: 501, baseType: !23, size: 32, align: 32, offset: 160)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "lump", scope: !50, file: !8, line: 502, baseType: !23, size: 32, align: 32, offset: 192)
!57 = !{!58, !59}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lumpsize", arg: 1, scope: !46, file: !1, line: 78, type: !23)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hitlist", scope: !46, file: !1, line: 80, type: !49)
!60 = !DISubprogram(name: "GrowTophits", scope: !1, file: !1, line: 91, type: !61, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.tophit_s*)* @GrowTophits, variables: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !49}
!63 = !{!64}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !60, file: !1, line: 91, type: !49)
!65 = !DISubprogram(name: "FreeTophits", scope: !1, file: !1, line: 97, type: !61, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.tophit_s*)* @FreeTophits, variables: !66)
!66 = !{!67, !68}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !65, file: !1, line: 97, type: !49)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !65, file: !1, line: 99, type: !23)
!69 = !DISubprogram(name: "AllocFancyAli", scope: !1, file: !1, line: 113, type: !70, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: %struct.fancyali_s* ()* @AllocFancyAli, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{!32}
!72 = !{!73}
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ali", scope: !69, file: !1, line: 115, type: !32)
!74 = !DISubprogram(name: "FreeFancyAli", scope: !1, file: !1, line: 124, type: !75, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.fancyali_s*)* @FreeFancyAli, variables: !77)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !32}
!77 = !{!78}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ali", arg: 1, scope: !74, file: !1, line: 124, type: !32)
!79 = !DISubprogram(name: "RegisterHit", scope: !1, file: !1, line: 176, type: !80, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.tophit_s*, double, double, float, double, float, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, %struct.fancyali_s*)* @RegisterHit, variables: !82)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !49, !11, !11, !13, !11, !13, !18, !18, !18, !23, !23, !23, !23, !23, !23, !23, !23, !32}
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !79, file: !1, line: 176, type: !49)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !79, file: !1, line: 176, type: !11)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pvalue", arg: 3, scope: !79, file: !1, line: 177, type: !11)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "score", arg: 4, scope: !79, file: !1, line: 177, type: !13)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "motherp", arg: 5, scope: !79, file: !1, line: 177, type: !11)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mothersc", arg: 6, scope: !79, file: !1, line: 177, type: !13)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 7, scope: !79, file: !1, line: 178, type: !18)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "acc", arg: 8, scope: !79, file: !1, line: 178, type: !18)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 9, scope: !79, file: !1, line: 178, type: !18)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqfrom", arg: 10, scope: !79, file: !1, line: 179, type: !23)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqto", arg: 11, scope: !79, file: !1, line: 179, type: !23)
