; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/trace.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }
%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.msa_struct = type { i8**, i8**, float*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8**, i8**, [6 x float], [6 x i32], i8**, i32, i32, i8**, i8**, i32, i32, i8**, i8***, %struct.GKI*, i32, i8**, i8**, %struct.GKI*, i32, i8**, i8***, %struct.GKI*, i32, %struct.GKI*, i32, i32, i32*, i32*, i32*, i32 }
%struct.GKI = type { %struct.gki_elem**, i32, i32, i32 }
%struct.gki_elem = type { i8*, i32, %struct.gki_elem* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !18, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/trace.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7, !8, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !12, line: 374, size: 256, align: 64, elements: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/structs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !{!14, !15, !16, !17}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !11, file: !12, line: 375, baseType: !5, size: 32, align: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !11, file: !12, line: 376, baseType: !8, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !11, file: !12, line: 377, baseType: !6, size: 64, align: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !11, file: !12, line: 378, baseType: !6, size: 64, align: 64, offset: 192)
!18 = !{!19, !26, !32, !37, !46, !56, !64, !137, !147, !265, !274, !299, !373, !386, !393, !407, !418, !431, !437, !440, !448, !451}
!19 = !DISubprogram(name: "P7AllocTrace", scope: !1, file: !1, line: 36, type: !20, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.p7trace_s**)* @P7AllocTrace, variables: !22)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !5, !9}
!22 = !{!23, !24, !25}
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tlen", arg: 1, scope: !19, file: !1, line: 36, type: !5)
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 2, scope: !19, file: !1, line: 36, type: !9)
!25 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !19, file: !1, line: 38, type: !10)
!26 = !DISubprogram(name: "P7ReallocTrace", scope: !1, file: !1, line: 47, type: !27, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.p7trace_s*, i32)* @P7ReallocTrace, variables: !29)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !10, !5}
!29 = !{!30, !31}
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !26, file: !1, line: 47, type: !10)
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tlen", arg: 2, scope: !26, file: !1, line: 47, type: !5)
!32 = !DISubprogram(name: "P7FreeTrace", scope: !1, file: !1, line: 54, type: !33, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.p7trace_s*)* @P7FreeTrace, variables: !35)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !10}
!35 = !{!36}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !32, file: !1, line: 54, type: !10)
!37 = !DISubprogram(name: "TraceSet", scope: !1, file: !1, line: 79, type: !38, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.p7trace_s*, i32, i8, i32, i32)* @TraceSet, variables: !40)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !10, !5, !7, !5, !5}
!40 = !{!41, !42, !43, !44, !45}
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !37, file: !1, line: 79, type: !10)
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tpos", arg: 2, scope: !37, file: !1, line: 79, type: !5)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !37, file: !1, line: 79, type: !7)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 4, scope: !37, file: !1, line: 79, type: !5)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 5, scope: !37, file: !1, line: 79, type: !5)
!46 = !DISubprogram(name: "MergeTraceArrays", scope: !1, file: !1, line: 105, type: !47, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: %struct.p7trace_s** (%struct.p7trace_s**, i32, %struct.p7trace_s**, i32)* @MergeTraceArrays, variables: !49)
!47 = !DISubroutineType(types: !48)
!48 = !{!9, !9, !5, !9, !5}
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t1", arg: 1, scope: !46, file: !1, line: 105, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n1", arg: 2, scope: !46, file: !1, line: 105, type: !5)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t2", arg: 3, scope: !46, file: !1, line: 105, type: !9)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n2", arg: 4, scope: !46, file: !1, line: 105, type: !5)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !46, file: !1, line: 107, type: !9)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !46, file: !1, line: 108, type: !5)
!56 = !DISubprogram(name: "P7ReverseTrace", scope: !1, file: !1, line: 140, type: !33, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.p7trace_s*)* @P7ReverseTrace, variables: !57)
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !56, file: !1, line: 140, type: !10)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statetype", scope: !56, file: !1, line: 142, type: !8)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodeidx", scope: !56, file: !1, line: 143, type: !6)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !56, file: !1, line: 144, type: !6)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opos", scope: !56, file: !1, line: 145, type: !5)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npos", scope: !56, file: !1, line: 145, type: !5)
!64 = !DISubprogram(name: "P7TraceCount", scope: !1, file: !1, line: 187, type: !65, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.plan7_s*, i8*, float, %struct.p7trace_s*)* @P7TraceCount, variables: !130)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !8, !85, !10}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !12, line: 101, size: 3712, align: 64, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !86, !87, !88, !89, !90, !91, !92, !95, !96, !97, !98, !103, !104, !105, !109, !110, !112, !113, !114, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !12, line: 113, baseType: !8, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !68, file: !12, line: 114, baseType: !8, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !68, file: !12, line: 115, baseType: !8, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !68, file: !12, line: 116, baseType: !8, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !68, file: !12, line: 117, baseType: !8, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !68, file: !12, line: 118, baseType: !8, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !68, file: !12, line: 119, baseType: !8, size: 64, align: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !68, file: !12, line: 120, baseType: !5, size: 32, align: 32, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !68, file: !12, line: 121, baseType: !8, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !68, file: !12, line: 122, baseType: !6, size: 64, align: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !68, file: !12, line: 123, baseType: !5, size: 32, align: 32, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !68, file: !12, line: 134, baseType: !6, size: 64, align: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !68, file: !12, line: 135, baseType: !6, size: 64, align: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !68, file: !12, line: 136, baseType: !6, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !68, file: !12, line: 144, baseType: !85, size: 32, align: 32, offset: 896)
!85 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !68, file: !12, line: 144, baseType: !85, size: 32, align: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !68, file: !12, line: 145, baseType: !85, size: 32, align: 32, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !68, file: !12, line: 145, baseType: !85, size: 32, align: 32, offset: 992)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !68, file: !12, line: 146, baseType: !85, size: 32, align: 32, offset: 1024)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !68, file: !12, line: 146, baseType: !85, size: 32, align: 32, offset: 1056)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !68, file: !12, line: 155, baseType: !5, size: 32, align: 32, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !68, file: !12, line: 156, baseType: !93, size: 64, align: 64, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !68, file: !12, line: 157, baseType: !93, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !68, file: !12, line: 158, baseType: !93, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !68, file: !12, line: 159, baseType: !85, size: 32, align: 32, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !68, file: !12, line: 168, baseType: !99, size: 256, align: 32, offset: 1376)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 256, align: 32, elements: !100)
!100 = !{!101, !102}
!101 = !DISubrange(count: 4)
!102 = !DISubrange(count: 2)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !68, file: !12, line: 169, baseType: !94, size: 64, align: 64, offset: 1664)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !68, file: !12, line: 170, baseType: !94, size: 64, align: 64, offset: 1728)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !68, file: !12, line: 174, baseType: !106, size: 640, align: 32, offset: 1792)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 640, align: 32, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !68, file: !12, line: 175, baseType: !85, size: 32, align: 32, offset: 2432)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !68, file: !12, line: 197, baseType: !111, size: 64, align: 64, offset: 2496)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !68, file: !12, line: 198, baseType: !111, size: 64, align: 64, offset: 2560)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !68, file: !12, line: 199, baseType: !111, size: 64, align: 64, offset: 2624)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !68, file: !12, line: 200, baseType: !115, size: 256, align: 32, offset: 2688)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, align: 32, elements: !100)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !68, file: !12, line: 201, baseType: !6, size: 64, align: 64, offset: 2944)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !68, file: !12, line: 202, baseType: !6, size: 64, align: 64, offset: 3008)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !68, file: !12, line: 203, baseType: !6, size: 64, align: 64, offset: 3072)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !68, file: !12, line: 203, baseType: !6, size: 64, align: 64, offset: 3136)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !68, file: !12, line: 203, baseType: !6, size: 64, align: 64, offset: 3200)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !68, file: !12, line: 203, baseType: !6, size: 64, align: 64, offset: 3264)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !68, file: !12, line: 203, baseType: !6, size: 64, align: 64, offset: 3328)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !68, file: !12, line: 214, baseType: !111, size: 64, align: 64, offset: 3392)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !68, file: !12, line: 215, baseType: !111, size: 64, align: 64, offset: 3456)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !68, file: !12, line: 216, baseType: !5, size: 32, align: 32, offset: 3520)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !68, file: !12, line: 217, baseType: !5, size: 32, align: 32, offset: 3552)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !68, file: !12, line: 222, baseType: !85, size: 32, align: 32, offset: 3584)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !68, file: !12, line: 223, baseType: !85, size: 32, align: 32, offset: 3616)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !12, line: 225, baseType: !5, size: 32, align: 32, offset: 3648)
!130 = !{!131, !132, !133, !134, !135, !136}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !64, file: !1, line: 187, type: !67)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 2, scope: !64, file: !1, line: 187, type: !8)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wt", arg: 3, scope: !64, file: !1, line: 187, type: !85)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 4, scope: !64, file: !1, line: 187, type: !10)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !64, file: !1, line: 189, type: !5)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !64, file: !1, line: 190, type: !5)
!137 = !DISubprogram(name: "P7TraceScore", scope: !1, file: !1, line: 313, type: !138, isLocal: false, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.plan7_s*, i8*, %struct.p7trace_s*)* @P7TraceScore, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{!85, !67, !8, !10}
!140 = !{!141, !142, !143, !144, !145, !146}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !137, file: !1, line: 313, type: !67)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 2, scope: !137, file: !1, line: 313, type: !8)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 3, scope: !137, file: !1, line: 313, type: !10)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !137, file: !1, line: 315, type: !5)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !137, file: !1, line: 316, type: !5)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !137, file: !1, line: 317, type: !5)
!147 = !DISubprogram(name: "P7Traces2Alignment", scope: !1, file: !1, line: 379, type: !148, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, function: %struct.msa_struct* (i8**, %struct.seqinfo_s*, float*, i32, i32, %struct.p7trace_s**, i32)* @P7Traces2Alignment, variables: !246)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !156, !223, !94, !5, !5, !9, !5}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !152, line: 177, baseType: !153)
!152 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !152, line: 112, size: 2880, align: 64, elements: !154)
!154 = !{!155, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !190, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !153, file: !152, line: 115, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !153, file: !152, line: 116, baseType: !156, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !153, file: !152, line: 117, baseType: !94, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !153, file: !152, line: 118, baseType: !5, size: 32, align: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !153, file: !152, line: 119, baseType: !5, size: 32, align: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !152, line: 123, baseType: !5, size: 32, align: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !152, line: 124, baseType: !5, size: 32, align: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !152, line: 125, baseType: !8, size: 64, align: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !153, file: !152, line: 126, baseType: !8, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !153, file: !152, line: 127, baseType: !8, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !153, file: !152, line: 128, baseType: !8, size: 64, align: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !153, file: !152, line: 129, baseType: !8, size: 64, align: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !153, file: !152, line: 130, baseType: !8, size: 64, align: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !153, file: !152, line: 131, baseType: !8, size: 64, align: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !153, file: !152, line: 132, baseType: !156, size: 64, align: 64, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !153, file: !152, line: 133, baseType: !156, size: 64, align: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !153, file: !152, line: 134, baseType: !156, size: 64, align: 64, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !153, file: !152, line: 135, baseType: !156, size: 64, align: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !153, file: !152, line: 136, baseType: !175, size: 192, align: 32, offset: 1024)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 192, align: 32, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 6)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !153, file: !152, line: 137, baseType: !179, size: 192, align: 32, offset: 1216)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, align: 32, elements: !176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !153, file: !152, line: 144, baseType: !156, size: 64, align: 64, offset: 1408)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !153, file: !152, line: 145, baseType: !5, size: 32, align: 32, offset: 1472)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !153, file: !152, line: 146, baseType: !5, size: 32, align: 32, offset: 1504)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !153, file: !152, line: 148, baseType: !156, size: 64, align: 64, offset: 1536)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !153, file: !152, line: 149, baseType: !156, size: 64, align: 64, offset: 1600)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !153, file: !152, line: 150, baseType: !5, size: 32, align: 32, offset: 1664)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !153, file: !152, line: 151, baseType: !5, size: 32, align: 32, offset: 1696)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !153, file: !152, line: 153, baseType: !156, size: 64, align: 64, offset: 1728)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !153, file: !152, line: 154, baseType: !189, size: 64, align: 64, offset: 1792)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !153, file: !152, line: 155, baseType: !191, size: 64, align: 64, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !193, line: 42, baseType: !194)
!193 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !193, line: 36, size: 192, align: 64, elements: !195)
!195 = !{!196, !204, !205, !206}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !194, file: !193, line: 37, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !193, line: 26, size: 192, align: 64, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !199, file: !193, line: 27, baseType: !8, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !199, file: !193, line: 28, baseType: !5, size: 32, align: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !199, file: !193, line: 29, baseType: !198, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !194, file: !193, line: 39, baseType: !5, size: 32, align: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !194, file: !193, line: 40, baseType: !5, size: 32, align: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !194, file: !193, line: 41, baseType: !5, size: 32, align: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !153, file: !152, line: 156, baseType: !5, size: 32, align: 32, offset: 1920)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !153, file: !152, line: 158, baseType: !156, size: 64, align: 64, offset: 1984)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !153, file: !152, line: 159, baseType: !156, size: 64, align: 64, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !153, file: !152, line: 160, baseType: !191, size: 64, align: 64, offset: 2112)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !153, file: !152, line: 161, baseType: !5, size: 32, align: 32, offset: 2176)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !153, file: !152, line: 163, baseType: !156, size: 64, align: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !153, file: !152, line: 164, baseType: !189, size: 64, align: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !153, file: !152, line: 165, baseType: !191, size: 64, align: 64, offset: 2368)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !153, file: !152, line: 166, baseType: !5, size: 32, align: 32, offset: 2432)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !153, file: !152, line: 170, baseType: !191, size: 64, align: 64, offset: 2496)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !153, file: !152, line: 171, baseType: !5, size: 32, align: 32, offset: 2560)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !153, file: !152, line: 172, baseType: !5, size: 32, align: 32, offset: 2592)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !153, file: !152, line: 173, baseType: !6, size: 64, align: 64, offset: 2624)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !153, file: !152, line: 174, baseType: !6, size: 64, align: 64, offset: 2688)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !153, file: !152, line: 175, baseType: !6, size: 64, align: 64, offset: 2752)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !153, file: !152, line: 176, baseType: !5, size: 32, align: 32, offset: 2816)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "SQINFO", file: !225, line: 98, baseType: !226)
!225 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "seqinfo_s", file: !225, line: 84, size: 2880, align: 64, elements: !227)
!227 = !{!228, !229, !233, !234, !235, !239, !240, !241, !242, !243, !244, !245}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !226, file: !225, line: 85, baseType: !5, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !225, line: 86, baseType: !230, size: 512, align: 8, offset: 32)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, align: 8, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !226, file: !225, line: 87, baseType: !230, size: 512, align: 8, offset: 544)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !226, file: !225, line: 88, baseType: !230, size: 512, align: 8, offset: 1056)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !226, file: !225, line: 89, baseType: !236, size: 1024, align: 8, offset: 1568)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, align: 8, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !226, file: !225, line: 90, baseType: !5, size: 32, align: 32, offset: 2592)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !226, file: !225, line: 91, baseType: !5, size: 32, align: 32, offset: 2624)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !226, file: !225, line: 92, baseType: !5, size: 32, align: 32, offset: 2656)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "olen", scope: !226, file: !225, line: 93, baseType: !5, size: 32, align: 32, offset: 2688)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !225, line: 94, baseType: !5, size: 32, align: 32, offset: 2720)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !226, file: !225, line: 95, baseType: !8, size: 64, align: 64, offset: 2752)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !226, file: !225, line: 96, baseType: !8, size: 64, align: 64, offset: 2816)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 1, scope: !147, file: !1, line: 379, type: !156)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sqinfo", arg: 2, scope: !147, file: !1, line: 379, type: !223)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wgt", arg: 3, scope: !147, file: !1, line: 379, type: !94)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 4, scope: !147, file: !1, line: 379, type: !5)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mlen", arg: 5, scope: !147, file: !1, line: 379, type: !5)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 6, scope: !147, file: !1, line: 380, type: !9)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "matchonly", arg: 7, scope: !147, file: !1, line: 380, type: !5)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msa", scope: !147, file: !1, line: 382, type: !150)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !147, file: !1, line: 383, type: !5)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alen", scope: !147, file: !1, line: 384, type: !5)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inserts", scope: !147, file: !1, line: 385, type: !6)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "matmap", scope: !147, file: !1, line: 386, type: !6)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nins", scope: !147, file: !1, line: 387, type: !5)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apos", scope: !147, file: !1, line: 388, type: !5)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rpos", scope: !147, file: !1, line: 389, type: !5)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !147, file: !1, line: 390, type: !5)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statetype", scope: !147, file: !1, line: 391, type: !5)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !147, file: !1, line: 392, type: !5)
!265 = !DISubprogram(name: "TransitionScoreLookup", scope: !1, file: !1, line: 578, type: !266, isLocal: false, isDefinition: true, scopeLine: 580, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.plan7_s*, i8, i32, i8, i32)* @TransitionScoreLookup, variables: !268)
!266 = !DISubroutineType(types: !267)
!267 = !{!5, !67, !7, !5, !7, !5}
!268 = !{!269, !270, !271, !272, !273}
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 1, scope: !265, file: !1, line: 578, type: !67)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st1", arg: 2, scope: !265, file: !1, line: 578, type: !7)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k1", arg: 3, scope: !265, file: !1, line: 578, type: !5)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st2", arg: 4, scope: !265, file: !1, line: 579, type: !7)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k2", arg: 5, scope: !265, file: !1, line: 579, type: !5)
!274 = !DISubprogram(name: "CreateFancyAli", scope: !1, file: !1, line: 667, type: !275, isLocal: false, isDefinition: true, scopeLine: 669, flags: DIFlagPrototyped, isOptimized: true, function: %struct.fancyali_s* (%struct.p7trace_s*, %struct.plan7_s*, i8*, i8*)* @CreateFancyAli, variables: !290)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !10, !67, !8, !8}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "fancyali_s", file: !12, line: 447, size: 576, align: 64, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rfline", scope: !278, file: !12, line: 448, baseType: !8, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "csline", scope: !278, file: !12, line: 449, baseType: !8, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !278, file: !12, line: 450, baseType: !8, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mline", scope: !278, file: !12, line: 451, baseType: !8, size: 64, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !278, file: !12, line: 452, baseType: !8, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !278, file: !12, line: 453, baseType: !5, size: 32, align: 32, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !278, file: !12, line: 454, baseType: !8, size: 64, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !278, file: !12, line: 455, baseType: !8, size: 64, align: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sqfrom", scope: !278, file: !12, line: 456, baseType: !5, size: 32, align: 32, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sqto", scope: !278, file: !12, line: 457, baseType: !5, size: 32, align: 32, offset: 544)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298}
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !274, file: !1, line: 667, type: !10)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hmm", arg: 2, scope: !274, file: !1, line: 667, type: !67)
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsq", arg: 3, scope: !274, file: !1, line: 668, type: !8)
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 4, scope: !274, file: !1, line: 668, type: !8)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ali", scope: !274, file: !1, line: 670, type: !277)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpos", scope: !274, file: !1, line: 671, type: !5)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bestsym", scope: !274, file: !1, line: 672, type: !5)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mthresh", scope: !274, file: !1, line: 673, type: !85)
!299 = !DISubprogram(name: "PrintFancyAli", scope: !1, file: !1, line: 809, type: !300, isLocal: false, isDefinition: true, scopeLine: 810, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.fancyali_s*)* @PrintFancyAli, variables: !362)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !302, !277}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !304, line: 153, baseType: !305)
!304 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !304, line: 122, size: 1216, align: 64, elements: !306)
!306 = !{!307, !310, !311, !312, !314, !315, !320, !321, !322, !326, !330, !340, !346, !347, !350, !351, !355, !359, !360, !361}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !305, file: !304, line: 123, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !305, file: !304, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !305, file: !304, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !305, file: !304, line: 126, baseType: !313, size: 16, align: 16, offset: 128)
!313 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !305, file: !304, line: 127, baseType: !313, size: 16, align: 16, offset: 144)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !305, file: !304, line: 128, baseType: !316, size: 128, align: 64, offset: 192)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !304, line: 88, size: 128, align: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !316, file: !304, line: 89, baseType: !308, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !316, file: !304, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !305, file: !304, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !305, file: !304, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !305, file: !304, line: 133, baseType: !323, size: 64, align: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!5, !4}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !305, file: !304, line: 134, baseType: !327, size: 64, align: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !4, !8, !5}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !305, file: !304, line: 135, baseType: !331, size: 64, align: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !4, !334, !5}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !304, line: 77, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !336, line: 71, baseType: !337)
!336 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !338, line: 46, baseType: !339)
!338 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!339 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !305, file: !304, line: 136, baseType: !341, size: 64, align: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!5, !4, !344, !5}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !305, file: !304, line: 139, baseType: !316, size: 128, align: 64, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !305, file: !304, line: 140, baseType: !348, size: 64, align: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !304, line: 94, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !305, file: !304, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !305, file: !304, line: 144, baseType: !352, size: 24, align: 8, offset: 928)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 24, align: 8, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 3)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !305, file: !304, line: 145, baseType: !356, size: 8, align: 8, offset: 952)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 8, align: 8, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 1)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !305, file: !304, line: 148, baseType: !316, size: 128, align: 64, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !305, file: !304, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !305, file: !304, line: 152, baseType: !334, size: 64, align: 64, offset: 1152)
!362 = !{!363, !364, !365, !369, !370, !371, !372}
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !299, file: !1, line: 809, type: !302)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ali", arg: 2, scope: !299, file: !1, line: 809, type: !277)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !299, file: !1, line: 811, type: !366)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 408, align: 8, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 51)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "starti", scope: !299, file: !1, line: 812, type: !5)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endi", scope: !299, file: !1, line: 812, type: !5)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !299, file: !1, line: 813, type: !5)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !299, file: !1, line: 814, type: !5)
!373 = !DISubprogram(name: "TraceDecompose", scope: !1, file: !1, line: 874, type: !374, isLocal: false, isDefinition: true, scopeLine: 875, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.p7trace_s*, %struct.p7trace_s***, i32*)* @TraceDecompose, variables: !377)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !10, !376, !6}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385}
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "otr", arg: 1, scope: !373, file: !1, line: 874, type: !10)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_tr", arg: 2, scope: !373, file: !1, line: 874, type: !376)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_ntr", arg: 3, scope: !373, file: !1, line: 874, type: !6)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tr", scope: !373, file: !1, line: 876, type: !9)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntr", scope: !373, file: !1, line: 877, type: !5)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !373, file: !1, line: 878, type: !5)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !373, file: !1, line: 878, type: !5)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !373, file: !1, line: 879, type: !5)
!386 = !DISubprogram(name: "TraceDomainNumber", scope: !1, file: !1, line: 947, type: !387, isLocal: false, isDefinition: true, scopeLine: 948, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.p7trace_s*)* @TraceDomainNumber, variables: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!5, !10}
!389 = !{!390, !391, !392}
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !386, file: !1, line: 947, type: !10)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !386, file: !1, line: 949, type: !5)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndom", scope: !386, file: !1, line: 950, type: !5)
!393 = !DISubprogram(name: "TraceSimpleBounds", scope: !1, file: !1, line: 974, type: !394, isLocal: false, isDefinition: true, scopeLine: 976, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.p7trace_s*, i32*, i32*, i32*, i32*)* @TraceSimpleBounds, variables: !396)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !10, !6, !6, !6, !6}
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tr", arg: 1, scope: !393, file: !1, line: 974, type: !10)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_i1", arg: 2, scope: !393, file: !1, line: 974, type: !6)
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_i2", arg: 3, scope: !393, file: !1, line: 974, type: !6)
