; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/weight.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.phylo_s = type { i32, i32, i32, float, float, float, i8*, i32 }
%struct.msa_struct = type { i8**, i8**, float*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8**, i8**, [6 x float], [6 x i32], i8**, i32, i32, i8**, i8**, i32, i32, i8**, i8***, %struct.GKI*, i32, i8**, i8**, %struct.GKI*, i32, i8**, i8***, %struct.GKI*, i32, %struct.GKI*, i32, i32, i32*, i32*, i32*, i32 }
%struct.GKI = type { %struct.gki_elem**, i32, i32, i32 }
%struct.gki_elem = type { i8*, i32, %struct.gki_elem* }

@.str = private unnamed_addr constant [17 x i8] c"Cluster() failed\00", align 1
@.str1 = private unnamed_addr constant [64 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/weight.c\00", align 1
@.str3 = private unnamed_addr constant [49 x i8] c"removing %12s -- fractional identity %.2f to %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !17, globals: !287, imports: !287)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/weight.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clust_strategy", file: !4, line: 273, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/squid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "CLUSTER_MEAN", value: 0)
!7 = !DIEnumerator(name: "CLUSTER_MAX", value: 1)
!8 = !DIEnumerator(name: "CLUSTER_MIN", value: 2)
!9 = !{!10, !12, !13, !14, !15, !11, !16}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!17 = !{!18, !46, !72, !85, !100, !187, !199, !219, !230, !244, !250, !259, !262, !270, !281, !284}
!18 = !DISubprogram(name: "GSCWeights", scope: !1, file: !1, line: 46, type: !19, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32, float*)* @GSCWeights, variables: !24)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21, !12, !12, !16}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!24 = !{!25, !26, !27, !28, !29, !30, !42, !43, !44, !45}
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !18, file: !1, line: 46, type: !21)
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !18, file: !1, line: 46, type: !12)
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 3, scope: !18, file: !1, line: 46, type: !12)
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wgt", arg: 4, scope: !18, file: !1, line: 46, type: !16)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !18, file: !1, line: 48, type: !15)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !18, file: !1, line: 49, type: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "phylo_s", file: !4, line: 258, size: 320, align: 64, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !32, file: !4, line: 259, baseType: !12, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !32, file: !4, line: 260, baseType: !12, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !32, file: !4, line: 261, baseType: !12, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "diff", scope: !32, file: !4, line: 262, baseType: !13, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "lblen", scope: !32, file: !4, line: 263, baseType: !13, size: 32, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "rblen", scope: !32, file: !4, line: 264, baseType: !13, size: 32, align: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "is_in", scope: !32, file: !4, line: 265, baseType: !22, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "incnum", scope: !32, file: !4, line: 266, baseType: !12, size: 32, align: 32, offset: 256)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lwt", scope: !18, file: !1, line: 50, type: !16)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rwt", scope: !18, file: !1, line: 50, type: !16)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fwt", scope: !18, file: !1, line: 51, type: !16)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !18, file: !1, line: 52, type: !12)
!46 = !DISubprogram(name: "VoronoiWeights", scope: !1, file: !1, line: 154, type: !19, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32, float*)* @VoronoiWeights, variables: !47)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !46, file: !1, line: 154, type: !21)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !46, file: !1, line: 154, type: !12)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 3, scope: !46, file: !1, line: 154, type: !12)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wgt", arg: 4, scope: !46, file: !1, line: 154, type: !16)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dmx", scope: !46, file: !1, line: 156, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfmin", scope: !46, file: !1, line: 157, type: !16)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "psym", scope: !46, file: !1, line: 158, type: !21)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsym", scope: !46, file: !1, line: 159, type: !14)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symseen", scope: !46, file: !1, line: 160, type: !57)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 864, align: 32, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 27)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "randseq", scope: !46, file: !1, line: 161, type: !22)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "acol", scope: !46, file: !1, line: 162, type: !12)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !46, file: !1, line: 163, type: !12)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symidx", scope: !46, file: !1, line: 164, type: !12)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !46, file: !1, line: 165, type: !12)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !46, file: !1, line: 166, type: !13)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dist", scope: !46, file: !1, line: 167, type: !13)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "challenge", scope: !46, file: !1, line: 168, type: !13)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "champion", scope: !46, file: !1, line: 168, type: !13)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itscale", scope: !46, file: !1, line: 169, type: !12)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iteration", scope: !46, file: !1, line: 170, type: !12)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best", scope: !46, file: !1, line: 171, type: !12)
!72 = !DISubprogram(name: "BlosumWeights", scope: !1, file: !1, line: 394, type: !73, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32, float, float*)* @BlosumWeights, variables: !75)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !21, !12, !12, !13, !16}
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseqs", arg: 1, scope: !72, file: !1, line: 394, type: !21)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !72, file: !1, line: 394, type: !12)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 3, scope: !72, file: !1, line: 394, type: !12)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxid", arg: 4, scope: !72, file: !1, line: 394, type: !13)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wgt", arg: 5, scope: !72, file: !1, line: 394, type: !16)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !72, file: !1, line: 396, type: !14)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nc", scope: !72, file: !1, line: 396, type: !12)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmem", scope: !72, file: !1, line: 397, type: !14)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !72, file: !1, line: 398, type: !12)
!85 = !DISubprogram(name: "PositionBasedWeights", scope: !1, file: !1, line: 463, type: !19, isLocal: false, isDefinition: true, scopeLine: 464, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32, float*)* @PositionBasedWeights, variables: !86)
!86 = !{!87, !88, !89, !90, !91, !95, !96, !97, !98, !99}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !85, file: !1, line: 463, type: !21)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !85, file: !1, line: 463, type: !12)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 3, scope: !85, file: !1, line: 463, type: !12)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wgt", arg: 4, scope: !85, file: !1, line: 463, type: !16)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rescount", scope: !85, file: !1, line: 465, type: !92)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 832, align: 32, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 26)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nres", scope: !85, file: !1, line: 466, type: !12)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !85, file: !1, line: 467, type: !12)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !85, file: !1, line: 467, type: !12)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !85, file: !1, line: 468, type: !12)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norm", scope: !85, file: !1, line: 469, type: !13)
!100 = !DISubprogram(name: "FilterAlignment", scope: !1, file: !1, line: 521, type: !101, isLocal: false, isDefinition: true, scopeLine: 522, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, float, %struct.msa_struct**)* @FilterAlignment, variables: !176)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103, !13, !175}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MSA", file: !105, line: 177, baseType: !106)
!105 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/msa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "msa_struct", file: !105, line: 112, size: 2880, align: 64, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !142, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "aseq", scope: !106, file: !105, line: 115, baseType: !21, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sqname", scope: !106, file: !105, line: 116, baseType: !21, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "wgt", scope: !106, file: !105, line: 117, baseType: !16, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "alen", scope: !106, file: !105, line: 118, baseType: !12, size: 32, align: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !106, file: !105, line: 119, baseType: !12, size: 32, align: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !106, file: !105, line: 123, baseType: !12, size: 32, align: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !105, line: 124, baseType: !12, size: 32, align: 32, offset: 288)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !105, line: 125, baseType: !22, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !106, file: !105, line: 126, baseType: !22, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !106, file: !105, line: 127, baseType: !22, size: 64, align: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "au", scope: !106, file: !105, line: 128, baseType: !22, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ss_cons", scope: !106, file: !105, line: 129, baseType: !22, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sa_cons", scope: !106, file: !105, line: 130, baseType: !22, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !106, file: !105, line: 131, baseType: !22, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sqacc", scope: !106, file: !105, line: 132, baseType: !21, size: 64, align: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sqdesc", scope: !106, file: !105, line: 133, baseType: !21, size: 64, align: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !106, file: !105, line: 134, baseType: !21, size: 64, align: 64, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !106, file: !105, line: 135, baseType: !21, size: 64, align: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !106, file: !105, line: 136, baseType: !127, size: 192, align: 32, offset: 1024)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, align: 32, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 6)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_is_set", scope: !106, file: !105, line: 137, baseType: !131, size: 192, align: 32, offset: 1216)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, align: 32, elements: !128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !106, file: !105, line: 144, baseType: !21, size: 64, align: 64, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ncomment", scope: !106, file: !105, line: 145, baseType: !12, size: 32, align: 32, offset: 1472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ncomment", scope: !106, file: !105, line: 146, baseType: !12, size: 32, align: 32, offset: 1504)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "gf_tag", scope: !106, file: !105, line: 148, baseType: !21, size: 64, align: 64, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !106, file: !105, line: 149, baseType: !21, size: 64, align: 64, offset: 1600)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ngf", scope: !106, file: !105, line: 150, baseType: !12, size: 32, align: 32, offset: 1664)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_ngf", scope: !106, file: !105, line: 151, baseType: !12, size: 32, align: 32, offset: 1696)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "gs_tag", scope: !106, file: !105, line: 153, baseType: !21, size: 64, align: 64, offset: 1728)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !106, file: !105, line: 154, baseType: !141, size: 64, align: 64, offset: 1792)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "gs_idx", scope: !106, file: !105, line: 155, baseType: !143, size: 64, align: 64, offset: 1856)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKI", file: !145, line: 42, baseType: !146)
!145 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/456.hmmer/src/gki.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 36, size: 192, align: 64, elements: !147)
!147 = !{!148, !156, !157, !158}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !146, file: !145, line: 37, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "gki_elem", file: !145, line: 26, size: 192, align: 64, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !151, file: !145, line: 27, baseType: !22, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !151, file: !145, line: 28, baseType: !12, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nxt", scope: !151, file: !145, line: 29, baseType: !150, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "primelevel", scope: !146, file: !145, line: 39, baseType: !12, size: 32, align: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nhash", scope: !146, file: !145, line: 40, baseType: !12, size: 32, align: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nkeys", scope: !146, file: !145, line: 41, baseType: !12, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ngs", scope: !106, file: !105, line: 156, baseType: !12, size: 32, align: 32, offset: 1920)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "gc_tag", scope: !106, file: !105, line: 158, baseType: !21, size: 64, align: 64, offset: 1984)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !106, file: !105, line: 159, baseType: !21, size: 64, align: 64, offset: 2048)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "gc_idx", scope: !106, file: !105, line: 160, baseType: !143, size: 64, align: 64, offset: 2112)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ngc", scope: !106, file: !105, line: 161, baseType: !12, size: 32, align: 32, offset: 2176)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "gr_tag", scope: !106, file: !105, line: 163, baseType: !21, size: 64, align: 64, offset: 2240)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gr", scope: !106, file: !105, line: 164, baseType: !141, size: 64, align: 64, offset: 2304)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "gr_idx", scope: !106, file: !105, line: 165, baseType: !143, size: 64, align: 64, offset: 2368)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ngr", scope: !106, file: !105, line: 166, baseType: !12, size: 32, align: 32, offset: 2432)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !106, file: !105, line: 170, baseType: !143, size: 64, align: 64, offset: 2496)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nseqalloc", scope: !106, file: !105, line: 171, baseType: !12, size: 32, align: 32, offset: 2560)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nseqlump", scope: !106, file: !105, line: 172, baseType: !12, size: 32, align: 32, offset: 2592)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sqlen", scope: !106, file: !105, line: 173, baseType: !14, size: 64, align: 64, offset: 2624)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sslen", scope: !106, file: !105, line: 174, baseType: !14, size: 64, align: 64, offset: 2688)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "salen", scope: !106, file: !105, line: 175, baseType: !14, size: 64, align: 64, offset: 2752)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "lastidx", scope: !106, file: !105, line: 176, baseType: !12, size: 32, align: 32, offset: 2816)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !100, file: !1, line: 521, type: !103)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cutoff", arg: 2, scope: !100, file: !1, line: 521, type: !13)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_new", arg: 3, scope: !100, file: !1, line: 521, type: !175)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nnew", scope: !100, file: !1, line: 523, type: !12)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !100, file: !1, line: 524, type: !14)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "useme", scope: !100, file: !1, line: 525, type: !14)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ident", scope: !100, file: !1, line: 526, type: !13)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !100, file: !1, line: 527, type: !12)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !100, file: !1, line: 527, type: !12)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "remove", scope: !100, file: !1, line: 528, type: !12)
!187 = !DISubprogram(name: "SampleAlignment", scope: !1, file: !1, line: 587, type: !188, isLocal: false, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.msa_struct*, i32, %struct.msa_struct**)* @SampleAlignment, variables: !190)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !103, !12, !175}
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198}
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msa", arg: 1, scope: !187, file: !1, line: 587, type: !103)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sample", arg: 2, scope: !187, file: !1, line: 587, type: !12)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_new", arg: 3, scope: !187, file: !1, line: 587, type: !175)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !187, file: !1, line: 589, type: !14)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "useme", scope: !187, file: !1, line: 590, type: !14)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !187, file: !1, line: 591, type: !12)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !187, file: !1, line: 591, type: !12)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !187, file: !1, line: 592, type: !12)
!199 = !DISubprogram(name: "SingleLinkCluster", scope: !1, file: !1, line: 704, type: !200, isLocal: false, isDefinition: true, scopeLine: 706, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32, float, i32**, i32*)* @SingleLinkCluster, variables: !203)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !21, !12, !12, !13, !202, !14}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aseq", arg: 1, scope: !199, file: !1, line: 704, type: !21)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nseq", arg: 2, scope: !199, file: !1, line: 704, type: !12)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alen", arg: 3, scope: !199, file: !1, line: 704, type: !12)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxid", arg: 4, scope: !199, file: !1, line: 704, type: !13)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_c", arg: 5, scope: !199, file: !1, line: 705, type: !202)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ret_nc", arg: 6, scope: !199, file: !1, line: 705, type: !14)
