; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/470.lbm/src/lbm.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [49 x i8] c"LBM_allocateGrid: could not allocate %.1f MByte\0A\00", align 1
@.str1 = private unnamed_addr constant [40 x i8] c"LBM_allocateGrid: allocated %.1f MByte\0A\00", align 1
@.str2 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str3 = private unnamed_addr constant [138 x i8] c"LBM_showGridStatistics:\0A\09nObstacleCells: %7i nAccelCells: %7i nFluidCells: %7i\0A\09minRho: %8.4f maxRho: %8.4f mass: %e\0A\09minU: %e maxU: %e\0A\0A\00", align 1
@.str4 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str5 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str6 = private unnamed_addr constant [10 x i8] c"%e %e %e\0A\00", align 1
@.str7 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str8 = private unnamed_addr constant [10 x i8] c"%f %f %f\0A\00", align 1
@.str9 = private unnamed_addr constant [50 x i8] c"LBM_compareVelocityField: maxDiff = %e  ==>  %s\0A\0A\00", align 1

!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!47 = !{!48, !49, !56}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !41, file: !1, line: 25, type: !44)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "margin", scope: !41, file: !1, line: 26, type: !50)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 30, baseType: !53)
!52 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !54, line: 92, baseType: !55)
!54 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !41, file: !1, line: 27, type: !50)
!57 = !DISubprogram(name: "LBM_freeGrid", scope: !1, file: !1, line: 44, type: !42, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: void (double**)* @LBM_freeGrid, variables: !58)
!58 = !{!59, !60}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !57, file: !1, line: 44, type: !44)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "margin", scope: !57, file: !1, line: 45, type: !50)
!61 = !DISubprogram(name: "LBM_initializeGrid", scope: !1, file: !1, line: 53, type: !62, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: void (double*)* @LBM_initializeGrid, variables: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !45}
!64 = !{!65, !66, !68}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !61, file: !1, line: 53, type: !45)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !61, file: !1, line: 54, type: !67)
!67 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_aux_", scope: !69, file: !1, line: 83, type: !73)
!69 = distinct !DILexicalBlock(scope: !70, file: !1, line: 83, column: 3)
!70 = distinct !DILexicalBlock(scope: !71, file: !1, line: 62, column: 2)
!71 = distinct !DILexicalBlock(scope: !72, file: !1, line: 62, column: 2)
!72 = distinct !DILexicalBlock(scope: !61, file: !1, line: 62, column: 2)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!74 = !DISubprogram(name: "LBM_swapGrids", scope: !1, file: !1, line: 89, type: !75, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: void ([26000000 x double]**, [26000000 x double]**)* @LBM_swapGrids, variables: !85)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_GridPtr", file: !79, line: 9, baseType: !80)
!79 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/470.lbm/src/lbm_1d_array.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_Grid", file: !79, line: 8, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1664000000, align: 64, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 26000000)
!85 = !{!86, !87, !88}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid1", arg: 1, scope: !74, file: !1, line: 89, type: !77)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid2", arg: 2, scope: !74, file: !1, line: 89, type: !77)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aux", scope: !74, file: !1, line: 90, type: !78)
!89 = !DISubprogram(name: "LBM_loadObstacleFile", scope: !1, file: !1, line: 97, type: !90, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: void (double*, i8*)* @LBM_loadObstacleFile, variables: !94)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !45, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!94 = !{!95, !96, !97, !98, !99, !100, !156}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !89, file: !1, line: 97, type: !45)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !89, file: !1, line: 97, type: !92)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !89, file: !1, line: 98, type: !67)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !89, file: !1, line: 98, type: !67)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !89, file: !1, line: 98, type: !67)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !89, file: !1, line: 100, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !103, line: 153, baseType: !104)
!103 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !103, line: 122, size: 1216, align: 64, elements: !105)
!105 = !{!106, !107, !108, !109, !111, !112, !117, !118, !119, !123, !127, !136, !140, !141, !144, !145, !149, !153, !154, !155}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !104, file: !103, line: 123, baseType: !36, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !104, file: !103, line: 124, baseType: !67, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !104, file: !103, line: 125, baseType: !67, size: 32, align: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !104, file: !103, line: 126, baseType: !110, size: 16, align: 16, offset: 128)
!110 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !104, file: !103, line: 127, baseType: !110, size: 16, align: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !104, file: !103, line: 128, baseType: !113, size: 128, align: 64, offset: 192)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !103, line: 88, size: 128, align: 64, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !113, file: !103, line: 89, baseType: !36, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !113, file: !103, line: 90, baseType: !67, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !104, file: !103, line: 129, baseType: !67, size: 32, align: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !104, file: !103, line: 132, baseType: !35, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !104, file: !103, line: 133, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!67, !35}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !104, file: !103, line: 134, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!67, !35, !38, !67}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !104, file: !103, line: 135, baseType: !128, size: 64, align: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !35, !131, !67}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !103, line: 77, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !133, line: 71, baseType: !134)
!133 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !54, line: 46, baseType: !135)
!135 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !104, file: !103, line: 136, baseType: !137, size: 64, align: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!67, !35, !92, !67}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !104, file: !103, line: 139, baseType: !113, size: 128, align: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !104, file: !103, line: 140, baseType: !142, size: 64, align: 64, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !103, line: 94, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !104, file: !103, line: 141, baseType: !67, size: 32, align: 32, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !104, file: !103, line: 144, baseType: !146, size: 24, align: 8, offset: 928)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, align: 8, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 3)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !104, file: !103, line: 145, baseType: !150, size: 8, align: 8, offset: 952)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !104, file: !103, line: 148, baseType: !113, size: 128, align: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !104, file: !103, line: 151, baseType: !67, size: 32, align: 32, offset: 1088)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !104, file: !103, line: 152, baseType: !131, size: 64, align: 64, offset: 1152)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_aux_", scope: !157, file: !1, line: 105, type: !73)
!157 = distinct !DILexicalBlock(scope: !158, file: !1, line: 105, column: 32)
!158 = distinct !DILexicalBlock(scope: !159, file: !1, line: 105, column: 9)
!159 = distinct !DILexicalBlock(scope: !160, file: !1, line: 104, column: 34)
!160 = distinct !DILexicalBlock(scope: !161, file: !1, line: 104, column: 4)
!161 = distinct !DILexicalBlock(scope: !162, file: !1, line: 104, column: 4)
!162 = distinct !DILexicalBlock(scope: !163, file: !1, line: 103, column: 33)
!163 = distinct !DILexicalBlock(scope: !164, file: !1, line: 103, column: 3)
!164 = distinct !DILexicalBlock(scope: !165, file: !1, line: 103, column: 3)
!165 = distinct !DILexicalBlock(scope: !166, file: !1, line: 102, column: 32)
!166 = distinct !DILexicalBlock(scope: !167, file: !1, line: 102, column: 2)
!167 = distinct !DILexicalBlock(scope: !89, file: !1, line: 102, column: 2)
!168 = !DISubprogram(name: "LBM_initializeSpecialCellsForLDC", scope: !1, file: !1, line: 117, type: !62, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: void (double*)* @LBM_initializeSpecialCellsForLDC, variables: !169)
!169 = !{!170, !171, !172, !173, !174, !187}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !168, file: !1, line: 117, type: !45)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !168, file: !1, line: 118, type: !67)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !168, file: !1, line: 118, type: !67)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !168, file: !1, line: 118, type: !67)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_aux_", scope: !175, file: !1, line: 132, type: !73)
!175 = distinct !DILexicalBlock(scope: !176, file: !1, line: 132, column: 6)
!176 = distinct !DILexicalBlock(scope: !177, file: !1, line: 131, column: 35)
!177 = distinct !DILexicalBlock(scope: !178, file: !1, line: 129, column: 9)
!178 = distinct !DILexicalBlock(scope: !179, file: !1, line: 128, column: 34)
!179 = distinct !DILexicalBlock(scope: !180, file: !1, line: 128, column: 4)
!180 = distinct !DILexicalBlock(scope: !181, file: !1, line: 128, column: 4)
!181 = distinct !DILexicalBlock(scope: !182, file: !1, line: 127, column: 33)
!182 = distinct !DILexicalBlock(scope: !183, file: !1, line: 127, column: 3)
!183 = distinct !DILexicalBlock(scope: !184, file: !1, line: 127, column: 3)
!184 = distinct !DILexicalBlock(scope: !185, file: !1, line: 126, column: 35)
!185 = distinct !DILexicalBlock(scope: !186, file: !1, line: 126, column: 2)
!186 = distinct !DILexicalBlock(scope: !168, file: !1, line: 126, column: 2)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_aux_", scope: !188, file: !1, line: 138, type: !73)
!188 = distinct !DILexicalBlock(scope: !189, file: !1, line: 138, column: 7)
!189 = distinct !DILexicalBlock(scope: !190, file: !1, line: 137, column: 35)
!190 = distinct !DILexicalBlock(scope: !191, file: !1, line: 135, column: 10)
!191 = distinct !DILexicalBlock(scope: !177, file: !1, line: 134, column: 10)
!192 = !DISubprogram(name: "LBM_initializeSpecialCellsForChannel", scope: !1, file: !1, line: 148, type: !62, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, function: void (double*)* @LBM_initializeSpecialCellsForChannel, variables: !193)
!193 = !{!194, !195, !196, !197, !198, !211}
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !192, file: !1, line: 148, type: !45)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !192, file: !1, line: 149, type: !67)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !192, file: !1, line: 149, type: !67)
