; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/470.lbm/src/main.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.MAIN_Param = type { i32, i8*, i32, i32, i8* }
%struct.MAIN_Time = type { double, i64, i64, %struct.tms, %struct.tms }
%struct.tms = type { i64, i64, i64, i64 }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }

@srcGrid = internal global [26000000 x double]* null, align 8
@dstGrid = internal global [26000000 x double]* null, align 8
@.str = private unnamed_addr constant [14 x i8] c"timestep: %i\0A\00", align 1
@.str2 = private unnamed_addr constant [55 x i8] c"MAIN_parseCommandLine: cannot stat obstacle file '%s'\0A\00", align 1
@.str3 = private unnamed_addr constant [82 x i8] c"MAIN_parseCommandLine:\0A\09size of file '%s' is %i bytes\0A\09expected size is %i bytes\0A\00", align 1
@.str4 = private unnamed_addr constant [53 x i8] c"MAIN_parseCommandLine: cannot stat result file '%s'\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !13, subprograms: !21, globals: !161, imports: !178)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/470.lbm/src/main.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 27, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/470.lbm/src/main.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "NOTHING", value: 0)
!7 = !DIEnumerator(name: "COMPARE", value: 1)
!8 = !DIEnumerator(name: "STORE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 28, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "LDC", value: 0)
!12 = !DIEnumerator(name: "CHANNEL", value: 1)
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_Action", file: !4, line: 27, baseType: !3)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_SimType", file: !4, line: 28, baseType: !9)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!21 = !{!22, !62, !136, !143, !146, !149, !155}
!22 = !DISubprogram(name: "main", scope: !1, file: !1, line: 25, type: !23, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**)* @main, variables: !28)
!23 = !DISubroutineType(types: !24)
!24 = !{!16, !16, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !{!29, !30, !31, !40, !61}
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nArgs", arg: 1, scope: !22, file: !1, line: 25, type: !16)
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !22, file: !1, line: 25, type: !25)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !22, file: !1, line: 26, type: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_Param", file: !4, line: 36, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 30, size: 256, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nTimeSteps", scope: !33, file: !4, line: 31, baseType: !16, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "resultFilename", scope: !33, file: !4, line: 32, baseType: !26, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !33, file: !4, line: 33, baseType: !14, size: 32, align: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "simType", scope: !33, file: !4, line: 34, baseType: !15, size: 32, align: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleFilename", scope: !33, file: !4, line: 35, baseType: !26, size: 64, align: 64, offset: 192)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !22, file: !1, line: 28, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_Time", file: !4, line: 24, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 19, size: 704, align: 64, elements: !43)
!43 = !{!44, !45, !51, !52, !60}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "timeScale", scope: !42, file: !4, line: 20, baseType: !20, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tickStart", scope: !42, file: !4, line: 21, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !47, line: 30, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/_types/_clock_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_clock_t", file: !49, line: 117, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tickStop", scope: !42, file: !4, line: 21, baseType: !46, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "timeStart", scope: !42, file: !4, line: 22, baseType: !53, size: 256, align: 64, offset: 192)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "tms", file: !54, line: 82, size: 256, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/sys/times.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !53, file: !54, line: 83, baseType: !46, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !53, file: !54, line: 84, baseType: !46, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !53, file: !54, line: 85, baseType: !46, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !53, file: !54, line: 86, baseType: !46, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "timeStop", scope: !42, file: !4, line: 22, baseType: !53, size: 256, align: 64, offset: 448)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !22, file: !1, line: 30, type: !16)
!62 = !DISubprogram(name: "MAIN_parseCommandLine", scope: !1, file: !1, line: 63, type: !63, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8**, %struct.MAIN_Param*)* @MAIN_parseCommandLine, variables: !66)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !16, !25, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!66 = !{!67, !68, !69, !70}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nArgs", arg: 1, scope: !62, file: !1, line: 63, type: !16)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !62, file: !1, line: 63, type: !25)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param", arg: 3, scope: !62, file: !1, line: 63, type: !65)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileStat", scope: !62, file: !1, line: 64, type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !72, line: 182, size: 1152, align: 64, elements: !73)
!72 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!73 = !{!74, !80, !86, !89, !93, !99, !103, !104, !112, !113, !114, !115, !121, !125, !129, !130, !131, !132}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !71, file: !72, line: 182, baseType: !75, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !76, line: 30, baseType: !77)
!76 = !DIFile(filename: "/usr/include/sys/_types/_dev_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !78, line: 57, baseType: !79)
!78 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !49, line: 44, baseType: !16)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !71, file: !72, line: 182, baseType: !81, size: 16, align: 16, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !82, line: 30, baseType: !83)
!82 = !DIFile(filename: "/usr/include/sys/_types/_mode_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !78, line: 70, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !49, line: 43, baseType: !85)
!85 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !71, file: !72, line: 182, baseType: !87, size: 16, align: 16, offset: 48)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !88, line: 30, baseType: !84)
!88 = !DIFile(filename: "/usr/include/sys/_types/_nlink_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !71, file: !72, line: 182, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !78, line: 62, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 47, baseType: !92)
!92 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !71, file: !72, line: 182, baseType: !94, size: 32, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !95, line: 30, baseType: !96)
!95 = !DIFile(filename: "/usr/include/sys/_types/_uid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !78, line: 75, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 45, baseType: !98)
!98 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !71, file: !72, line: 182, baseType: !100, size: 32, align: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !101, line: 30, baseType: !102)
!101 = !DIFile(filename: "/usr/include/sys/_types/_gid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !78, line: 60, baseType: !97)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !71, file: !72, line: 182, baseType: !75, size: 32, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !71, file: !72, line: 182, baseType: !105, size: 128, align: 64, offset: 256)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !106, line: 30, size: 128, align: 64, elements: !107)
!106 = !DIFile(filename: "/usr/include/sys/_types/_timespec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!107 = !{!108, !111}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !105, file: !106, line: 32, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !49, line: 120, baseType: !110)
!110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !105, file: !106, line: 33, baseType: !110, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !71, file: !72, line: 182, baseType: !105, size: 128, align: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !71, file: !72, line: 182, baseType: !105, size: 128, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !71, file: !72, line: 182, baseType: !105, size: 128, align: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !71, file: !72, line: 182, baseType: !116, size: 64, align: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !117, line: 30, baseType: !118)
!117 = !DIFile(filename: "/usr/include/sys/_types/_off_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !78, line: 71, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !120)
!120 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !71, file: !72, line: 182, baseType: !122, size: 64, align: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !123, line: 30, baseType: !124)
!123 = !DIFile(filename: "/usr/include/sys/_types/_blkcnt_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !78, line: 55, baseType: !119)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !71, file: !72, line: 182, baseType: !126, size: 32, align: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !127, line: 30, baseType: !128)
!127 = !DIFile(filename: "/usr/include/sys/_types/_blksize_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !78, line: 56, baseType: !79)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !71, file: !72, line: 182, baseType: !97, size: 32, align: 32, offset: 928)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !71, file: !72, line: 182, baseType: !97, size: 32, align: 32, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !71, file: !72, line: 182, baseType: !79, size: 32, align: 32, offset: 992)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !71, file: !72, line: 182, baseType: !133, size: 128, align: 64, offset: 1024)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 128, align: 64, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 2)
!136 = !DISubprogram(name: "MAIN_printInfo", scope: !1, file: !1, line: 105, type: !137, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MAIN_Param*)* @MAIN_printInfo, variables: !141)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!141 = !{!142}
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param", arg: 1, scope: !136, file: !1, line: 105, type: !139)
!143 = !DISubprogram(name: "MAIN_initialize", scope: !1, file: !1, line: 124, type: !137, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MAIN_Param*)* @MAIN_initialize, variables: !144)
!144 = !{!145}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param", arg: 1, scope: !143, file: !1, line: 124, type: !139)
!146 = !DISubprogram(name: "MAIN_finalize", scope: !1, file: !1, line: 150, type: !137, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MAIN_Param*)* @MAIN_finalize, variables: !147)
!147 = !{!148}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param", arg: 1, scope: !146, file: !1, line: 150, type: !139)
!149 = !DISubprogram(name: "MAIN_startClock", scope: !1, file: !1, line: 165, type: !150, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MAIN_Time*)* @MAIN_startClock, variables: !153)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!153 = !{!154}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 1, scope: !149, file: !1, line: 165, type: !152)
!155 = !DISubprogram(name: "MAIN_stopClock", scope: !1, file: !1, line: 173, type: !156, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MAIN_Time*, %struct.MAIN_Param*)* @MAIN_stopClock, variables: !158)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !152, !139}
!158 = !{!159, !160}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 1, scope: !155, file: !1, line: 173, type: !152)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param", arg: 2, scope: !155, file: !1, line: 173, type: !139)
!161 = !{!162, !168, !169, !177}
!162 = !DIGlobalVariable(name: "actionString", scope: !136, file: !1, line: 106, type: !163, isLocal: true, isDefinition: true, variable: [3 x [32 x i8]]* @MAIN_printInfo.actionString)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 768, align: 8, elements: !165)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!165 = !{!166, !167}
!166 = !DISubrange(count: 3)
!167 = !DISubrange(count: 32)
!168 = !DIGlobalVariable(name: "simTypeString", scope: !136, file: !1, line: 107, type: !163, isLocal: true, isDefinition: true, variable: [3 x [32 x i8]]* @MAIN_printInfo.simTypeString)
!169 = !DIGlobalVariable(name: "srcGrid", scope: !0, file: !1, line: 21, type: !170, isLocal: true, isDefinition: true, variable: [26000000 x double]** @srcGrid)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_GridPtr", file: !171, line: 9, baseType: !172)
!171 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/470.lbm/src/lbm_1d_array.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
